{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Data shows 1.4 million Canadian adults report prolonged Covid-19 symptoms - Business Standard", "description": "Nearly 14 million Canadian adults indicated they had symptoms at least three months after a positive Covid19 test or suspected infection Statistics Canada said", "url": "https://www.business-standard.com/article/international/data-shows-1-4-million-canadian-adults-report-prolonged-covid-19-symptoms-122101800096_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-01/01/full/1609515008-3649.jpg", "publishedAt": "2022-10-18T03:27:00Z", "content": "Nearly 1.4 million Canadian adults indicated they had symptoms at least three months after a positive Covid-19 test or suspected infection, Statistics Canada said.\r\nOf those who indicated a previous … [+1132 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Asian News International", "title": "Study finds timely treatment of depression can lower risk of dementia - The Siasat Daily", "description": "Professor Yu and Professor Cheng used data collected by the UK Biobank, a population-based cohort of over 500,000 participants.", "url": "https://www.siasat.com/study-finds-timely-treatment-of-depression-can-lower-risk-of-dementia-2436445/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/03/1200-900-Depression.jpg", "publishedAt": "2022-10-18T03:27:00Z", "content": "Philadelphia: An increased risk of dementia has long been linked to depression, and now a new study offers proof that, in some patient populations, prompt treatment of depression may reduce dementia … [+3790 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists discover structure of adult brain – previously thought to be fixed - is changed by treatment - EurekAlert", "description": "Scientists believe that the structure of the adult brain is generally rigid and incapable of rapid changes; now new work has shown that this is not true. German researchers have shown that in-patient treatment for depression can lead to an increase in brain c…", "url": "https://www.eurekalert.org/news-releases/967808", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/157f01e3-8eb6-47c6-be70-e2ff0eb479dd/Rendition/thumbnail/Content/Public", "publishedAt": "2022-10-18T02:02:12Z", "content": "image: Representative map of the affected connections in the brain. The number of these connections increased after treatment.view more \r\nCredit: Jonathan Repple\r\nScientists believe that the structur… [+4763 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Taking pictures of slides helps students in remembering the presentation: Study - ANI News", "description": "Washington [US], October 18 (ANI): During an instructor's presentation, students often prefer to take camera-phone photos of slides but it raises the question that whether this practice helps students remember the information.", "url": "https://www.aninews.in/news/lifestyle/education/taking-pictures-of-slides-helps-students-in-remembering-the-presentation-study20221018065258", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221018012248.jpg", "publishedAt": "2022-10-18T01:25:46Z", "content": "Washington [US], October 18 (ANI): During an instructor's presentation, students often prefer to take camera-phone photos of slides but it raises the question that whether this practice helps student… [+4654 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Lucy Hicks", "title": "CDC Reports Five Cases of Ocular Monkeypox - Medscape", "description": "Four individuals were hospitalized and one experienced notable vision impairment.", "url": "https://www.medscape.com/viewarticle/982594", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_221017_conjunctivitis_800x450.jpg", "publishedAt": "2022-10-18T00:36:23Z", "content": "Although ocular monkeypox is rare, it can be a condition that threatens a person's sight, a Centers for Disease Control and Prevention (CDC) report says. The report details five people with monkeypox… [+2189 chars]"}, {"source": {"id": null, "name": "Mims.com"}, "author": "N/A", "title": "Pitavastatin–ezetimibe combo affords large LDL-C reductions in dyslipidaemia | Latest news for Doctors, Nurses and Pharmacists | Pharmacy - MIMS", "description": "Treatment with the combination of pitavastatin plus ezetimibe effectively lowers low-density lipoprotein cholesterol (LDL-C) levels by more than 50 pe...", "url": "https://specialty.mims.com/topic/pitavastatin-ezetimibe-combo-affords-large-ldl-c-reductions-in-dyslipidaemia", "urlToImage": "https://pubmiddleware.mims.com/resource/image/0B5469E3-216C-41D3-989D-AE2801113463/OriginalThumbnail/THUMBNAIL_shutterstock_1922703911.jpg", "publishedAt": "2022-10-18T00:00:18Z", "content": "Treatment with the combination of pitavastatin plus ezetimibe effectively lowers low-density lipoprotein cholesterol (LDL-C) levels by more than 50 percent, with a safety profile comparable to that o… [+1453 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Liam Davenport", "title": "'U-Shaped' Relationship Between Bipolar Risk and Parental Age - Medscape", "description": "Offspring of both older and younger parents have an increased risk of developing bipolar disorder, a new meta-analysis suggests -- with different factors potentially coming into play at different ages.", "url": "https://www.medscape.com/viewarticle/982575", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_221017_bipolar_disorder_800x450.jpg", "publishedAt": "2022-10-17T22:08:42Z", "content": "VIENNA Individuals born to younger or older parents are at increased risk of developing bipolar disorder, new research suggests.\r\nResults from a meta-analysis of more than 210,000 patients with bipol… [+6092 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Dr Jose Paul", "title": "Tests to ensure your baby is hale and hearty - The New Indian Express", "description": "Your baby may look healthy but might have a serious condition that cannot be detected during initial screening. They can be treated if diagnosed early", "url": "https://www.newindianexpress.com/cities/kochi/2022/oct/18/tests-to-ensure-your-baby-is-hale-andhearty-2509155.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/10/18/w600X390/Tests_to_ensure.jpg", "publishedAt": "2022-10-17T21:48:00Z", "content": "KOCHI: There is a possibility that your baby is born with a metabolic condition but shows no signs of it initially. Some of the conditions might often go undetected during initial screening, making t… [+6431 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study links chemical composition of fine particulate air pollution to worse lung disease outcomes - News-Medical.Net", "description": "People with a disease characterized by lung scarring that has no obvious cause are more likely to die if they live in areas with higher levels of air pollution composed of chemicals associated with industrial sources and vehicular traffic, according to new re…", "url": "https://www.news-medical.net/news/20221017/Study-links-chemical-composition-of-fine-particulate-air-pollution-to-worse-lung-disease-outcomes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/Air_pollution%2c_closeup_of_one_big_smoking_pipe_-_Anastasiia_Tymoshenko_A1_8bf7a1a99f724b6ebc4bed3c25c9868c-620x480.jpg", "publishedAt": "2022-10-17T20:17:00Z", "content": "People with a disease characterized by lung scarring that has no obvious cause are more likely to die if they live in areas with higher levels of air pollution composed of chemicals associated with i… [+4870 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Alexa Mikhail", "title": "Will the bivalent booster work against the new BQ.1 and BQ.1.1 variants? Experts say it can protect against new COVID strains - Yahoo Finance", "description": "New Omicron descendants are emerging in the U.S.", "url": "https://finance.yahoo.com/news/bivalent-booster-against-bq-1-193000861.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/2aJwn85Jf0KXrxYk_OsH9g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/fortune_175/bdfabcb5094c5ffe0438a43d35e8ca3e", "publishedAt": "2022-10-17T19:30:00Z", "content": "Its hard to keep up with the evolving COVID-19 variant scene, but two new spinoffs from OmicronBQ.1 and BQ.1.1are gaining traction in the U.S.\r\nThe most recent bivalent COVID-19 booster, approved jus… [+2877 chars]"}, {"source": {"id": null, "name": "Newswaali.com"}, "author": null, "title": "In Gwalior, 12 people fell ill due to dengue larvae growing in the pink chill.News WAALI - News Waali", "description": "", "url": "https://newswaali.com/in-gwalior-12-people-fell-ill-due-to-dengue-larvae-growing-in-the-pink-chill-news-waali/", "urlToImage": "https://img.naidunia.com/naidunia/ndnimg/18102022/18_10_2022-dengue_og.jpg", "publishedAt": "2022-10-17T19:09:32Z", "content": "Gwalior. Representative of the New World. The rosy chill melted into the atmosphere. The sun is burning during the day and the night is getting colder. This environment is becoming beneficial for mos… [+3291 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "3 Foods Secretly Raising Your Cholesterol Over Time - Eat This, Not That", "description": "High cholesterol can lead to serious health problems, and if you're not careful, these foods and drinks may secretly raise your levels.", "url": "https://www.eatthis.com/foods-secretly-raising-your-cholesterol/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/eating-fried-food.jpg?quality=82&strip=all", "publishedAt": "2022-10-17T19:00:40Z", "content": "If you've been told by a doctor that you have high cholesterol or you know you are predisposed to possibly developing high cholesterol in the future, knowing how to best monitor your body's cholester… [+5371 chars]"}, {"source": {"id": null, "name": "News84media.com"}, "author": "Writer Smith", "title": "COVID-19 News: New Omicron variant does not kill antibodies, new Lancet study reveals - News84Media.com", "description": "Strong points Antibodies do not affect the new form of Omicron. The revelation was made in the journal Lancet Infectious Disease. The SARS-CoV-2 virus enters human cells through a spike protein. London: According to a recent study, the BA.2.75.2 form of Omicr…", "url": "https://news84media.com/world/covid-19-news-new-omicron-variant-does-not-kill-antibodies-new-lancet-study-reveals/", "urlToImage": "https://news84media.com/wp-content/uploads/2022/10/COVID-19-News-New-Omicron-variant-does-not-kill-antibodies-new-1000x600.jpg", "publishedAt": "2022-10-17T18:45:00Z", "content": "Strong points\r\nAntibodies do not affect the new form of Omicron. \r\nThe revelation was made in the journal Lancet Infectious Disease. \r\nThe SARS-CoV-2 virus enters human cells through a spike protein.… [+1536 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "IANS", "title": "Livers Are Resilient Organs, Have The Potential To Survive For More Than 100 Years: Study - ABP Live", "description": "There is a small, but growing, subset of livers that have been transplanted and have a cumulative age of more than 100 years, researchers said.", "url": "https://news.abplive.com/science/livers-are-resilient-organs-have-the-potential-to-survive-for-more-than-100-years-study-1558647", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/10/17/aac920bf3b4021233c103fb76c6183611666031051239324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-10-17T18:25:26Z", "content": "New York, Oct 17 (IANS) There is a small, but growing, subset of livers that have been transplanted and have a cumulative age of more than 100 years, researchers said.\r\nThe researchers said they stud… [+2006 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers discover molecule in brain that boost body’s ability to fight Alzheimer’s, multiple sclerosis - ThePrint", "description": "Washington [US], October 17 (ANI): Researchers at UVA Health have identified a brain chemical that coordinates the immune system’s reactions to multiple sclerosis (MS) and Alzheimer’s disease, potentially enabling medical professionals to boost the body’s cap…", "url": "https://theprint.in/health/researchers-discover-molecule-in-brain-that-boost-bodys-ability-to-fight-alzheimers-multiple-sclerosis/1172145/", "urlToImage": null, "publishedAt": "2022-10-17T18:15:49Z", "content": "Washington [US], October 17 (ANI): Researchers at UVA Health have identified a brain chemical that coordinates the immune system’s reactions to multiple sclerosis (MS) and Alzheimer’s disease, potent… [+5032 chars]"}, {"source": {"id": null, "name": "Diagnostic Imaging"}, "author": "Jeff Hall", "title": "Can Increased Post-Op Surveillance Chest CT Have an Impact for Colorectal Cancer Patients? - Diagnostic Imaging", "description": "Out of 1,600 patients who had surgery for colorectal cancer, nearly 15 percent had pulmonary metastases within 15.4 months and higher-risk patients experienced lung metastases within three months, according to new research presented at the Scientific Forum of…", "url": "https://www.diagnosticimaging.com/view/can-increased-post-op-surveillance-chest-ct-have-an-impact-for-colorectal-cancer-patients-", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/diag_imaging/afd82879a28e062703a63f59c2e133c063d0b053-8917x6518.png?fit=crop&auto=format", "publishedAt": "2022-10-17T17:49:54Z", "content": "Emerging research suggests that more frequent chest imaging surveillance via computed tomography (CT) or positron emission tomography (PET) may be advantageous for high-risk patients who have undergo… [+2176 chars]"}, {"source": {"id": null, "name": "Urbanmatter.com"}, "author": "Brian Lendino", "title": "ManPlus Reviews (UK): Is ManPlus Legit & Safe To Use? - UrbanMatter", "description": "No matter how one approaches the subject, sex and sexuality are always going to be weird topics. On the one hand, open conversations regarding these topics have traditionally", "url": "https://urbanmatter.com/manplus-reviews-uk-is-manplus-legit-safe-to-use/", "urlToImage": "https://urbanmatter.com/wp-content/uploads/2022/10/ManPlusFeat.jpeg", "publishedAt": "2022-10-17T16:57:35Z", "content": "No matter how one approaches the subject, sex and sexuality are always going to be weird topics. On the one hand, open conversations regarding these topics have traditionally been avoided in human co… [+13355 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Propofol-Related Infusion Syndrome: A Clinical Review - Cureus", "description": "Propofol-related infusion syndrome (PRIS) is a lethal condition characterized by multiple organ system failures. It can occur due to prolonged administration of propofol (an anesthetic) in mechanically intubated patients. The main presenting features of this …", "url": "https://www.cureus.com/articles/117253-propofol-related-infusion-syndrome-a-clinical-review", "urlToImage": "https://assets.cureus.com/uploads/figure/file/468462/article_river_9cc700a0417511ed8ae67399d7bdf0d2-Pre-synaptic-neuron.png", "publishedAt": "2022-10-17T16:55:16Z", "content": "Propofol\r\nPropofol (commonly sold under the brand name Diprivan®) is the most frequently used hypnotic intravenous anaesthetic drug that aids in maintaining procedural sedation and hypnosis in genera… [+22734 chars]"}, {"source": {"id": null, "name": "Contemporarypediatrics.com"}, "author": "Tina Q Tan, MD, FAAP, FIDSA, FPIDS", "title": "What is the latest news in COVID-19 vaccines? - Contemporary Pediatrics", "description": "As COVID-19 continues to spread, vaccinations remain available to protect children from severe disease, hospitalization, and death.", "url": "https://www.contemporarypediatrics.com/view/what-is-the-latest-news-in-covid-19-vaccines", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contpeds/39d52789ae8944dabc7ef7e2ee775f24bdf629ee-5800x3500.jpg?fit=crop&auto=format", "publishedAt": "2022-10-17T16:49:15Z", "content": "Vaccines against the SARS-CoV-2 virus are the best tools for providing protection against serious disease, hospitalization, and death resulting from COVID-19 infection. COVID-19 vaccines now are appr… [+3119 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Do phthalates in face masks pose health hazards with increased usage during the COVID-19 pandemic? - News-Medical.Net", "description": "In a new study, researchers investigated the presence of phthalic acid esters (PAEs) or phthalates in commercially available face masks to assess the health risks associated with the increased use of face masks during the coronavirus disease 2019 (COVID-19) p…", "url": "https://www.news-medical.net/news/20221017/Do-phthalates-in-face-masks-pose-health-hazards-with-increased-usage-during-the-COVID-19-pandemic.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_728188_16660249689655457.jpg", "publishedAt": "2022-10-17T16:46:00Z", "content": "In a recent study published in the Journal of Hazardous Materials, researchers investigated the presence of phthalic acid esters (PAEs) or phthalates in commercially available face masks to assess th… [+5106 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Top in cardiology: Esports and arrhythmia risk; sleep apnea in patients with heart failure - Healio", "description": "In a recent study, video games were found to be a trigger for arrhythmic conditions in children with a proarrhythmic cardiac diagnosis. According to researchers, gaming &ldquo;can pose a significant arrhythmic risk; it can be lethal in children with predispos…", "url": "https://www.healio.com/news/primary-care/20221017/top-in-cardiology-esports-and-arrhythmia-risk-sleep-apnea-in-patients-with-heart-failure", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/fm_im/v/video-game-player-holding-control_adobe.jpg", "publishedAt": "2022-10-17T16:38:00Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nIn a recent study, video games were foun… [+2204 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "An Update on SARS-CoV-2 - EurekAlert", "description": "Throughout history, the world has been afflicted by countless epidemics and pandemics that have worsened thousands to millions of human lives. No matter how advanced we are in our areas of research and medical, we are still confronted with newer pathogenic mi…", "url": "https://www.eurekalert.org/news-releases/968058", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-10-17T16:35:28Z", "content": "Considering the present COVID-19 scenario, the motive in writing the book “An Update on SARS-CoV-2“  is to provide it as a single manual guide for doctors, medical professionals, and researchers. The… [+8802 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "Easy Sprouts Dishes For Healthy Cravings - Slurrp", "description": "Curb your anytime hunger with these healthy sprout dishes.", "url": "https://www.slurrp.com/web-stories/easy-sprouts-dishes-for-healthy-cravings/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2022/10/17161305/cropped-WhatsApp-Image-2022-10-17-at-9.11.36-PM.jpeg", "publishedAt": "2022-10-17T16:20:03Z", "content": "Combining moong sprouts along with aromatic spices, herbs and chutneys, this heathy chaat makes for an excellent snack."}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Jessica Norris", "title": "Skin and brain cancers: New discovery may help improve treatment - Medical News Today", "description": "", "url": "https://www.medicalnewstoday.com/articles/skin-and-brain-cancers-new-discovery-may-help-improve-treatment", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/10/researcher-drug-resistant-tumors-thumb.jpg", "publishedAt": "2022-10-17T16:05:42Z", "content": "<ul><li>Cancer encompasses a wide variety of types. Treatment options vary, and some forms of cancer can be fatal. </li><li>Understanding the underlying mechanisms of cancer growth can be vital to de… [+5843 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Pam Harrison", "title": "Yoga and Other Mind-Body Work Good for Diabetes Control - Medscape", "description": "Mind-body practices, especially yoga, control fasting blood glucose and A1c to a clinically significant extent, thus offering an effective complementary intervention for type 2 diabetes.", "url": "https://www.medscape.com/viewarticle/982535", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_221017_woman_doing_yoga_800x450.jpg", "publishedAt": "2022-10-17T15:42:12Z", "content": "Mind and body practices, especially yoga, improve glycemic control in type 2 diabetes to a similar extent as medications such as metformin, new research shows.\r\n\"To our knowledge, this is the first s… [+4358 chars]"}, {"source": {"id": null, "name": "Neurologyadvisor.com"}, "author": "Emily Estrada", "title": "Acupuncture Reduces Anxiety Levels in Patients with Parkinson Disease - Neurology Advisor", "description": "In a randomized, double-blinded clinical trial, researchers assessed the effects of acupuncture compared with sham acupuncture to treat anxiety in patients with PD.", "url": "https://www.neurologyadvisor.com/topics/movement-disorders/acupuncture-reduces-anxiety-levels-patients-parkinson-disease/", "urlToImage": null, "publishedAt": "2022-10-17T15:01:00Z", "content": "Acupuncture effectively reduces anxiety levels in patients with Parkinson disease (PD), according to a Chinese randomized controlled study published in JAMA Network Open.\r\nAnxiety symptoms are presen… [+3631 chars]"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "FOGSI Calls For HPV Vaccination To Be Included In National Programs - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-FOGSI organizes Expert Group Meeting at AIIMS for ‘Cervical Cancer Mukt Bharat’", "url": "http://bwhealthcareworld.businessworld.in/article/FOGSI-Calls-For-HPV-Vaccination-To-Be-Included-In-National-Programs/18-10-2022-450847", "urlToImage": "http://static.businessworld.in/article/article_large_image/1581054067_nEQLGb_HPV_causing_cervical_cancer.jpg", "publishedAt": "2022-10-17T14:24:13Z", "content": "The Federation of Obstetric and Gynaecological Societies of India (FOGSI) has asked the government of India of India to include the HPV vaccine in the National Program to reduce the burden of cervica… [+2730 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "Leukaemia in children: Know all about the disease which took Chhello Show actor’s life at 10 - Health shots", "description": "Leukaemia is one of the most common types of cancer that affect children in India. Here's what you need to know about the disease.", "url": "https://www.healthshots.com/fitness/leukaemia-in-children-know-all-about-the-disease-which-took-chhello-show-actors-life-at-10/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/10/17155035/Chhello-actor-Rahul.jpg", "publishedAt": "2022-10-17T13:30:58Z", "content": "Artistes live with us through their work even when they leave the world. As the Oscar-nominated “Chhello Show” hit theatres on October 14, we remember 10-year-old actor Rahul Koli who recently lost h… [+3511 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Obesity-related biomarkers underlie a shared genetic architecture between childhood body mass index and childhood asthma | Communications Biology - Nature.com", "description": "A comprehensive genetic analysis of the relationship between childhood obesity and childhood asthma identifies shared mechanisms and potential mediators linking the two pediatric disorders.", "url": "https://www.nature.com/articles/s42003-022-04070-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs42003-022-04070-9/MediaObjects/42003_2022_4070_Fig1_HTML.png", "publishedAt": "2022-10-17T12:44:31Z", "content": "<li>Wenzel, S. E. Asthma phenotypes: the evolution from clinical to molecular approaches. Nat. Med.18, 716725 (2012).\r\nCAS \r\n PubMed \r\n Article \r\nGoogle Scholar \r\n</li><li>Holgate, S. T. et al. Asthm… [+12378 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Kerassentials For Toenail Fungus [Medically Investigation] - Deccan Herald", "description": "kerassentials for toenail fungus: amazing supplement to guard against all kinds of foot issues", "url": "https://www.deccanherald.com/brandspot/pr-spot/kerassentials-for-toenail-fungus-medically-investigation-1154409.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1154409-1666010458.png", "publishedAt": "2022-10-17T12:40:58Z", "content": "kerassentials for toenail fungus: amazing supplement to guard against all kinds of foot issues\r\nHaving a fungal infection in your foot may be an issue you deal with, and it may be quite upsetting. An… [+18424 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exploring molecular docking and molecular dynamics simulations as advanced tools for novel antiviral drug discovery - News-Medical.Net", "description": "Researchers presented an overview of factors influencing emerging infectious diseases. They also highlighted the importance of molecular dynamic (MD) simulations and molecular docking (MDO) analysis for combating these diseases.", "url": "https://www.news-medical.net/news/20221017/Exploring-molecular-docking-and-molecular-dynamics-simulations-as-advanced-tools-for-novel-antiviral-drug-discovery.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_728116_16660099190305400.jpg", "publishedAt": "2022-10-17T12:38:00Z", "content": "In a systematic review published in Progress in Biophysics and Molecular Biology, researchers presented an overview of factors influencing emerging infectious diseases (EIDs), particularly human immu… [+6505 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Pain sensing neurons protect gut against inflammation and tissue damage: Study - News9 LIVE", "description": "The report found in the preclinical model that pain-sensing neurons in the gut secrete a molecule called substance P.", "url": "https://www.news9live.com/health/pain-sensing-neurons-protect-gut-against-inflammation-and-tissue-damage-study-202552", "urlToImage": "https://media.news9live.com/h-upload/2022/10/17/571744-neuron1.jpg", "publishedAt": "2022-10-17T12:32:47Z", "content": "A new study published said, that neurons that can sense pain are helpful to protect the gut from inflammation and associated tissue damage by regulating the microbial community living in the intestin… [+2930 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Bill & Melinda Gates Foundation donates $1.2 billion for polio eradication - Economic Times", "description": "Bill & Melinda Gates Foundation has donated $1.2 billion for the global eradication of polio, which is still cropping up in Pakistan and Afghanistan.", "url": "https://economictimes.indiatimes.com/news/international/us/bill-melinda-gates-foundation-donates-1-2-billion-for-polio-eradication/articleshow/94920673.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94920667,width-1070,height-580,imgsize-9502,overlay-economictimes/photo.jpg", "publishedAt": "2022-10-17T12:30:00Z", "content": "Millions of people have suffered from polio, mainly in Asia and Africa, for centuries. But the virus has mutated plenty of times. The polio virus has been contained mainly by choking the endemic tran… [+1715 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Prima Tablets Reviews [Medically Investigation] - Deccan Herald", "description": "Prima Tablets: A healthy way of weight loss.", "url": "https://www.deccanherald.com/brandspot/pr-spot/prima-tablets-reviews-medically-investigation-1154405.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/dfhfxgb-1154405-1666008659.png", "publishedAt": "2022-10-17T12:10:59Z", "content": "Prima Tablets: A healthy way of weight loss.Some people can lose weight through diet and exercise, while others struggle to maintain their progress or regain the weight theyve worked so hard to shed.… [+17582 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Need to revise Covid vaccination strategy in India, states IJPM - ETHealthWorld", "description": "The medical journal also mentioned that the current Covid-19 vaccines are not very effective in the prevention of infection from SARS CoV, \"All the vaccine efficacy and effectiveness studies have shown that the vaccine significantly reduces the severity of il…", "url": "https://health.economictimes.indiatimes.com/news/industry/need-to-revise-covid-vaccination-strategy-in-india-states-ijpm/94919202", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94919202,imgsize-130182,width-1200,height-628,overlay-ethealthworld/need-to-revise-covid-vaccination-strategy-in-india-states-ijpm.jpg", "publishedAt": "2022-10-17T12:00:00Z", "content": "New Delhi: The latest peer-reviewed journal based on published studies in the Indian Journal of Preventive Medicine (IJPM) suggests that a revised Covid-19 vaccine policy is the need of the hour to s… [+4360 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Glucofort Tablets [Medically Investigation] - Deccan Herald", "description": "Blood sugar levels can worsen if not treated at the appropriate time. If we don't take good care of our health, various other bodily problems develop and interfere with how well our bodies work. Unhealthy lifestyle choices and frequent consumption of junk foo…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucofort-tablets-medically-investigation-1154399.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/ghnmghmgnb%20cb-1154399-1666008733.png", "publishedAt": "2022-10-17T11:47:22Z", "content": "Blood sugar levels can worsen if not treated at the appropriate time. If we don't take good care of our health, various other bodily problems develop and interfere with how well our bodies work. Unhe… [+17157 chars]"}, {"source": {"id": null, "name": "Financial Express"}, "author": null, "title": "Nutrition support required by women in Fitness - msnNOW", "description": "Calcium helps in healthy bone formation, regulates heart beat, and helps contract muscles. A deficiency of calcium can de-mineralise bones, weakening them and making them brittle- especially after 50.", "url": "https://www.financialexpress.com/lifestyle/nutrition-support-required-by-women-in-fitness/2717199/?utm_source=msn&amp;utm_medium=Referral", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1335J3.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-10-17T11:16:48Z", "content": "© Provided by The Financial Express\r\n Vitamin E safeguards the body cells against free radicals produced in the body by everyday metabolism, environmental pollution, and other factors. (Image - Unspl… [+3339 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[HOAX EXPOSED] Ultimate Keto Gummies Reviews CONSUMER FEEDBACK Shark Tank SCAM - Deccan Herald", "description": "Introduction-", "url": "https://www.deccanherald.com/brandspot/pr-spot/hoax-exposed-ultimate-keto-gummies-reviews-consumer-feedback-shark-tank-scam-1154373.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/fgngfnf-1154373-1666004781.jpg", "publishedAt": "2022-10-17T10:48:40Z", "content": "Introduction-When it comes to trusting a supplement that promises to burn all your extra fats without harming your body, counting the genuine product is very important. Various products claim the sam… [+16352 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "New colon cancer-causing gene discovered - Tech Explorist", "description": "Inflammation and tumor microenvironment also fuel and sustain it.", "url": "https://www.techexplorist.com/new-colon-cancer-causing-gene-discovered/54327/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/10/colon-cancer-1.jpg", "publishedAt": "2022-10-17T10:35:47Z", "content": "Colon cancer is the second most deadly and third most common cancer in the US. The only effective treatment for this cancer is surgery. The immunotherapies that have transformed how advanced cancer i… [+3195 chars]"}, {"source": {"id": null, "name": "Virginianreview.com"}, "author": "Virginian Review Staff", "title": "Seven Ways To Reduce Breast Cancer Risk - Virginian Review", "description": "Many women are concerned about the potential for developing breast cancer in their lifetimes. Breast cancer is the second-most common cancer among women in the United States and Canada. Despite that prevalence, there are ways for women to reduce their risk fo…", "url": "https://virginianreview.com/229026/", "urlToImage": "https://virginianreview.com/wp-content/uploads/2022/10/13839_original", "publishedAt": "2022-10-17T10:35:46Z", "content": "Many women are concerned about the potential for developing breast cancer in their lifetimes. Breast cancer is the second-most common cancer among women in the United States and Canada. Despite that … [+2301 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Worried about weight gain? Middle-aged women must blame long-term exposure to air pollution - The Economic Times", "description": "A new study found that air pollution can increase the weight, body fat & BMI in women.", "url": "https://economictimes.indiatimes.com/magazines/panache/worried-about-weight-gain-middle-aged-women-must-blame-long-term-exposure-to-air-pollution/articleshow/94913145.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94916856,width-1070,height-580,imgsize-36634,overlay-etpanache/photo.jpg", "publishedAt": "2022-10-17T10:30:00Z", "content": "Did you know India is the second-most polluted country in the world?\r\nMore than 63 per cent of India's 1.3 billion population is living in areas that exceed the World Health Organization's recommende… [+3010 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Some screen time better than none when children recover from concussions: Study - Hindustan Times", "description": "More than 700 children aged 8 to 16 who self-reported their screen use during the first 7 to 10 days after an injury were studied to see if there were any associations with the symptoms that children and their caregivers reported throughout the subsequent six…", "url": "https://www.hindustantimes.com/lifestyle/health/some-screen-time-better-than-none-when-children-recover-from-concussions-study-101666000987980.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/17/1600x900/c_1_1666001089968_1666001090197_1666001090197.jpg", "publishedAt": "2022-10-17T10:08:11Z", "content": "Too much screen time can slow children's recovery from concussions, but new research from UBC and the University of Calgary suggests that banning screen time is not the answer.\r\nMore than 700 childre… [+3854 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "What is Java Burn? [Medically Reviewed] - Deccan Herald", "description": "Java Burn: A pure weight loss formula that works for other bodily issues as well.  An Overview", "url": "https://www.deccanherald.com/brandspot/pr-spot/what-is-java-burn-medically-reviewed-1154350.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1154350-1666000713.png", "publishedAt": "2022-10-17T09:58:33Z", "content": "Java Burn: A pure weight loss formula that works for other bodily issues as well. \r\nAn Overview\r\nAre you fighting with issues related to being overweight? Being overweight is very bad as it attracts … [+16256 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Dengue Fever: Causes, Symptoms And Treatment All You Need to Know - India.com", "description": "The Denuge season is back. To be more aware about this illness, Here are its causes, symptoms, treatment and how long does this fever last.", "url": "https://www.india.com/health/dengue-fever-causes-symptoms-and-treatment-all-you-need-to-know-5690557/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/08/dengue-report-1.png", "publishedAt": "2022-10-17T09:39:09Z", "content": "Dengue fever is a mosquito-transmitted disease and viral infection spread by mosquitoes in tropical and subtropical regions. Flu-like symptoms and a high temperature are signs of mild dengue fever. T… [+4374 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI", "title": "Nicotine in 1 cigarette stops womens brains from producing estrogen: Study - Business Standard", "description": "This may explain a variety of behavioural differences in smokers including the reason why women have a higher resistance to quitting than males", "url": "https://www.business-standard.com/article/current-affairs/nicotine-in-1-cigarette-stops-women-s-brains-from-producing-estrogen-study-122101700294_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-09/28/full/1632832227-9661.jpg", "publishedAt": "2022-10-17T08:17:00Z", "content": "The amount of nicotine in one cigarette inhibits women's brains from producing estrogen. This may explain a variety of behavioural differences in smokers, including the reason why women have a higher… [+3756 chars]"}, {"source": {"id": null, "name": "Newsdayexpress.com"}, "author": "Bhagyashree", "title": "Ginger will uproot the dirty cholesterol deposited in the blood, scientists told easy formula - News Day Express", "description": "Cholesterol The problem of growth is increasing rapidly. An increase in the amount of this waste material in the blood can lead to serious and", "url": "https://www.newsdayexpress.com/lifestyle/health/ginger-will-uproot-the-dirty-cholesterol-deposited-in-the-blood-scientists-told-easy-formula/", "urlToImage": "https://static.langimg.com/thumb/msid-94913317,width-680,resizemode-3/94913317.jpg", "publishedAt": "2022-10-17T08:06:48Z", "content": "Cholesterol The problem of growth is increasing rapidly. An increase in the amount of this waste material in the blood can lead to serious and life-threatening diseases like heart diseases, heart att… [+2828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "These signs indicate that lack of sleep is affecting your immunity - The Indian Express", "description": "\"Sleep and the circadian system exert a strong regulatory influence on immune functions\"", "url": "https://indianexpress.com/article/lifestyle/health/lack-of-sleep-harms-immunity-immune-function-sleep-deprivation-illnesses-8208601/", "urlToImage": "https://images.indianexpress.com/2022/10/immunity_1200_getty.jpg", "publishedAt": "2022-10-17T07:50:02Z", "content": "Various experts and studies have repeatedly noted that sleep deprivation makes an individual more prone to diseases such as diabetes, heart disorders, hypertension, and eye-related disorders, among o… [+4770 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[BEWARE SCAM] ViaKeto Gummies Ireland United Kingdom Dragons Den Don't Buy Before Read Official Reviews! - Deccan Herald", "description": "ViaKeto Gummies UK, Ireland Review Weight Loss There are many ways to lose weight, including exercise, healthy eating habits and weight loss supplements. However, most people fail because they don't know how to lose weight and keep it off. Luckily, there are …", "url": "https://www.deccanherald.com/brandspot/pr-spot/beware-scam-viaketo-gummies-ireland-united-kingdom-dragons-den-dont-buy-before-read-official-reviews-1154300.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/ghmvhjbmvbm%20vhbn-1154300-1665992345.png", "publishedAt": "2022-10-17T07:39:05Z", "content": "ViaKeto Gummies UK, Ireland Review Weight LossThere are many ways to lose weight, including exercise, healthy eating habits and weight loss supplements. However, most people fail because they don't k… [+9024 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Scientists Envision Possible Cure for Untreatable ALS Disease that Affected Stephen Hawking Using Gold Nanoparticles - The Weather Channel", "description": "Amyotrophic lateral sclerosis (ALS) is a rare and debilitating neurodegenerative disorder that affects the voluntary movement of the muscles and can even lead to paralysis or death.", "url": "https://weather.com/en-IN/india/health/news/2022-10-17-possible-cure-for-als-disease-using-gold-nanoparticles", "urlToImage": "https://s.w-x.co/in-brain_5.jpg", "publishedAt": "2022-10-17T07:17:21Z", "content": "There has been a significant headway in the treatment of amyotrophic lateral sclerosis (ALS), also known as Lou Gehrig's disease.\r\nALS is associated with the death of motor nerve cells, or neurons, a… [+2993 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "How do Increase Testosterone Levels Quickly? Do Test Boosters Work? - Deccan Herald", "description": "Our way of living is a contributing factor to health issues. People today deal with a variety of health issues because they are living in the 20th century. Male erotic health issues like early ejaculation, erectile dysfunction, and poor libido are common toda…", "url": "https://www.deccanherald.com/brandspot/pr-spot/how-do-increase-testosterone-levels-quickly-do-test-boosters-work-1154283.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1154283-1665990369.png", "publishedAt": "2022-10-17T07:06:09Z", "content": "Our way of living is a contributing factor to health issues. People today deal with a variety of health issues because they are living in the 20th century. Male erotic health issues like early ejacul… [+17003 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "VigRx Nitric Oxide Reviews: Nitric Oxide Supplements For ED - Deccan Herald", "description": "We all experience various mental health conditions, such as headaches, sadness, stress, and anxiety, which can result in an unhealthy way of living. There is a direct correlation between a person's mental health and erotic life. He or she has decreased libido…", "url": "https://www.deccanherald.com/brandspot/pr-spot/vigrx-nitric-oxide-reviews-nitric-oxide-supplements-for-ed-1154272.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1154272-1665988971.png", "publishedAt": "2022-10-17T06:42:51Z", "content": "We all experience various mental health conditions, such as headaches, sadness, stress, and anxiety, which can result in an unhealthy way of living. There is a direct correlation between a person's m… [+18115 chars]"}, {"source": {"id": null, "name": "Diabetes.co.uk"}, "author": "Conor Seery", "title": "Late night snacking increases obesity risk, research shows - Diabetes.co.uk", "description": "Eating late at night makes a “significant difference” to our hunger levels, the way we burn calories after we eat, and the way we store fat, a new study explains. Researchers from Brigham and Women’s Hospital have detected a link between midnight snacking and…", "url": "https://www.diabetes.co.uk/news/2022/oct/late-night-snacking-increases-obesity-risk-research-shows.html", "urlToImage": "https://www.diabetes.co.uk/wp-content/uploads/2022/10/fridge-open-1000x600.jpg", "publishedAt": "2022-10-17T05:49:58Z", "content": "Eating late at night makes a significant difference to our hunger levels, the way we burn calories after we eat, and the way we store fat, a new study explains.\r\nResearchers from Brigham and Women’s … [+2127 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Healthy Living: 5 Effective Drinks to Boost Your Heart Health - News18", "description": "Heart health is extremely important and thus it is necessary that one takes good care of it, read on to know about a few drinks that you can include in your daily diet for the same-", "url": "https://www.news18.com/news/lifestyle/healthy-living-5-effective-drinks-to-boost-your-heart-health-6174211.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/untitled-design-2-35-165003053216x9.png", "publishedAt": "2022-10-17T05:25:04Z", "content": "Heart health is crucial, yet often ignored aspect of our general well-being. Neglecting the care of this organ is likely to put one at risk of multiple cardiovascular complications. A poor heart coul… [+2362 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diet For A Healthy Liver: 5 Superfoods That Can Help Repair Your Liver - NDTV", "description": "In this article, we list foods you should add to your diet that will help repair and improve the health of your liver.", "url": "https://www.ndtv.com/health/liver-these-5-foods-that-will-help-repair-your-liver-3428894", "urlToImage": "https://c.ndtvimg.com/2020-04/mu528ovg_grapes-_625x300_08_April_20.jpg", "publishedAt": "2022-10-17T05:23:53Z", "content": "Liver: Grapes can reduce inflammation, stop damage, and boost antioxidant levels\r\nAll the protein, carbs, and fats that we consume are managed by the liver. Numerous additional fats and proteins nece… [+3400 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "When is dietary fiber harmful? - Medical Dialogues", "description": "People who suffer from inflammatory bowel disease may soon have access to personalized dietary...", "url": "https://medicaldialogues.in/mdtv/gastroenterology/videos/when-is-dietary-fiber-harmful-100779", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/15/188025-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-3.jpg", "publishedAt": "2022-10-17T04:15:03Z", "content": "Isra Zaman\r\nB.Sc Life Sciences, M.Sc Biotechnology, B.Ed"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Dieters and emotional eaters are the feeders in a relationship, finds study - EurekAlert", "description": "Dieters and emotional eaters are often the people encouraging their partners to overeat in a relationship, according to new research from the University of Surrey.", "url": "https://www.eurekalert.org/news-releases/968109", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-10-17T03:56:15Z", "content": "Dieters and emotional eaters are often the people encouraging their partners to overeat in a relationship, according to new research from the University of Surrey.  \r\nThe new study focuses on the eat… [+2053 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Erica Sloan", "title": "What It Actually Means When Your Eyes Are ‘Tired,’ According to an Ophthalmologist and Optician - Well+Good", "description": "An ophthalmologist and optician share the symptoms, causes, and treatments for tired eyes, plus how to prevent the condition from the jump.", "url": "https://www.wellandgood.com/tired-eyes/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/10/Su-Arslanoglu.jpg", "publishedAt": "2022-10-16T19:21:01Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Women have lower 'normal' blood pressure range than men: Research - ANI News", "description": "Washington [US], October 16 (ANI): According to a new study, women have a lower 'normal' blood pressure range than men. \"This may be harmful to a woman's health,\" said Susan Cheng, MD, MPH, MMSc, associate professor of Cardiology and director of the Institute…", "url": "https://www.aninews.in/news/health/women-have-lower-normal-blood-pressure-range-than-men-research20221016215407", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221016162316.jpg", "publishedAt": "2022-10-16T16:24:00Z", "content": "Washington [US], October 16 (ANI): According to a new study, women have a lower 'normal' blood pressure range than men. \"This may be harmful to a woman's health,\" said Susan Cheng, MD, MPH, MMSc, ass… [+2852 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds inhibiting enzyme boosts the innate immune response - ANI News", "description": "Washington [US], October 16 (ANI): Researchers have identified a promising strategy for the development of broad-spectrum antiviral therapies that center around promoting a strong immune response capable of stopping a number of viruses in their infectious tra…", "url": "https://www.aninews.in/news/health/study-finds-inhibiting-enzyme-boosts-the-innate-immune-response20221016215212", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221016150854.jpg", "publishedAt": "2022-10-16T16:22:00Z", "content": "Washington [US], October 16 (ANI): Researchers have identified a promising strategy for the development of broad-spectrum antiviral therapies that center around promoting a strong immune response cap… [+5241 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Best healthy breakfast habits for sustainable weight loss - Hindustan Times", "description": "Breakfast can be the most important meal of the day when it comes to weight loss for it helps set the tone for the day. Here are some healthy breakfast habits that will aid weight loss.", "url": "https://www.hindustantimes.com/photos/lifestyle/best-healthy-breakfast-habits-for-sustainable-weight-loss-101665929960859.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/16/1600x900/must_have_nutrients_1663151660349_1665930023821_1665930023821.jpg", "publishedAt": "2022-10-16T14:29:03Z", "content": null}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by India TV Lifestyle Desk", "title": "Is diabetes and heart disease co-related? Know the facts here - India TV News", "description": "Studies have shown that people who have diabetes are twice as likely to have heart disease or a stroke. High blood sugar, also known as diabetes mellitus. Know how to avoid the risk.", "url": "https://www.indiatvnews.com/health/is-diabetes-and-heart-disease-co-related-know-the-facts-here-2022-10-16-816712", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/10/ngddaqc-1665928125.jpg", "publishedAt": "2022-10-16T13:55:50Z", "content": "Heart disease is one of the most common and serious health conditions that affect millions of people across the world. It is the leading cause of death for both men and women in several countries. Th… [+2639 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Age-old remedy with ghee that can fix digestion or constipation | DH Latest News, DH NEWS, Ingredients, Latest News, Health & Fitness, NEWS, Life Style, Food , home remedy for constipation, remedy for constipation using ghee, batasha mixed with ghe - East Coast Daily (English)", "description": "Add this to ghee and fix digestion/constipation Every Indian household cannot exist without ghee. Ghee is naturally rich in nutrients, making it the greatest treatment to improve general health. This", "url": "https://www.eastcoastdaily.in/2022/10/16/age-old-remedy-with-ghee-that-can-fix-digestion-or-constipation.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/10/img-20221016-wa0014.jpg", "publishedAt": "2022-10-16T10:39:00Z", "content": "Add this to ghee and fix digestion/constipation\r\nEvery Indian household cannot exist without ghee. Ghee is naturally rich in nutrients, making it the greatest treatment to improve general health. Thi… [+1524 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Adult brain may partially recover from genetic blindness: Study - ETHealthWorld", "description": "Administering chemical compounds that target the retina, called synthetic retinoids, can restore a notable amount of vision in children with LCA. The UCI team wanted to find out if the treatment could make a difference for adults who have the condition. The f…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/adult-brain-may-partially-recover-from-genetic-blindness-study/94892062", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94892062,imgsize-38752,width-1200,height-628,overlay-ethealthworld/adult-brain-may-partially-recover-from-genetic-blindness-study.jpg", "publishedAt": "2022-10-16T07:00:00Z", "content": "California: A new understanding of how some visually impaired people may come to see provides a new perspective on the brain's potential. Researchers from the University of California, Irvine School … [+3362 chars]"}]}