{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Do glucose-lowering medications have different effects on kidney outcomes? - News-Medical.Net", "description": "Researchers evaluated the kidney outcomes in individuals with type 2 diabetes.", "url": "https://www.news-medical.net/news/20230526/Do-glucose-lowering-medications-have-different-effects-on-kidney-outcomes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749365_16851025549026475.jpg", "publishedAt": "2023-05-26T12:04:00Z", "content": "In a recent study published in the JAMA Internal Medicine Journal, researchers evaluated the kidney outcomes in individuals with type 2 diabetes by comparing four classes of medications added to metf… [+4832 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prabhat Prakash, ET HealthWorld", "title": "HPV vaccination can significantly reduce cervical cancer cases in India - ETHealthWorld", "description": "HPV vaccine awareness and acceptability can be a complex challenge that requires a multi-faceted approach. Some things that can be attempted are engaging with local community leaders, healthcare providers, and other stakeholders to build trust and support for…", "url": "https://health.economictimes.indiatimes.com/news/pharma/hpv-vaccination-can-significantly-reduce-cervical-cancer-cases-in-india/100529563", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100529563,imgsize-153358,width-1200,height=765,overlay-ethealth/pharma/hpv-vaccination-can-significantly-reduce-cervical-cancer-cases-in-india.jpg", "publishedAt": "2023-05-26T11:41:05Z", "content": "Mumbai: Dr Rohit Ghatule, Director, Medical Affairs, MSD India in an interaction with ETHealthworld’s Prabhat Prakash emphasised the need for ramping up HPV vaccination as HPV infections are responsi… [+4078 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Dr. Azhar Perwaiz", "title": "Explained: 5 Daily Habits That Increase The Risk Of Oesophageal Cancer - Indiatimes.com", "description": "Oesophageal cancer is a malignant tumour that arises in the lining of the cells of the oesophagus also known as food pipe, the tube which is responsible for carrying food from the throat to the stomach. It is a serious condition and is one of the leading caus…", "url": "https://www.indiatimes.com/explainers/news/explained-5-daily-habits-that-increase-the-risk-of-oesophageal-cancer-603877.html", "urlToImage": "https://im.indiatimes.in/content/2023/May/cancer_64706a05875da.jpg", "publishedAt": "2023-05-26T11:04:56Z", "content": "Oesophageal cancer is a malignant tumour that arises in the lining of the cells of the oesophagus also known as food pipe, the tube which is responsible for carrying food from the throat to the stoma… [+3691 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "Watermelon To Papaya; 5 Summer Fruits That Boost Immunity And Promote Healthy Body - Jagran English", "description": "Fruits are a great source of essential nutrients needed for overall health and well-being Scroll down to know more", "url": "https://english.jagran.com/lifestyle/watermelon-to-papaya-summer-fruits-that-boost-immunity-and-promote-healthy-body-10079754", "urlToImage": "https://imgeng.jagran.com/images/2023/may/summer-fruits-for-immunity1685095596169.jpg", "publishedAt": "2023-05-26T10:03:00Z", "content": "Summer is an ideal season that lets us binge on various foods that not only savour our taste buds but also promote a healthy body. Every fruit brings its own unique set of nutrients and benefits to t… [+2464 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's Why You Should Consume Sufficient Vitamin K & Its Sources - NDTV", "description": "By incorporating a variety of foods rich in vitamin K individuals can ensure they are getting enough vitamin K to support their health.", "url": "https://www.ndtv.com/health/heres-why-you-should-consume-sufficient-vitamin-k-its-sources-4068418", "urlToImage": "https://c.ndtvimg.com/2022-07/9hvgrs88_vitamin-k-rich-foods_625x300_13_July_22.jpg", "publishedAt": "2023-05-26T09:31:36Z", "content": "Vitamin K is an essential nutrient that helps facilitate many functions in the body\r\nVitamin K is a fat-soluble vitamin that plays a crucial role in blood clotting, bone health, and heart health. It … [+3509 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "AI finds rare antibiotic that could combat drug-resistant infections - India Today", "description": "The new drug has been identified from a catalogue of 7,000 potential drug compounds using AI by researchers from the Massachusetts Institute of Technology (MIT) and McMaster University.", "url": "https://www.indiatoday.in/science/story/ai-finds-rare-antibiotic-that-could-combat-drug-resistant-infections-2384759-2023-05-26", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202305/bacteria-sixteen_nine.jpg?VersionId=mybNQ7khV5cTOTFRsfqlvCY65wpHfVJF", "publishedAt": "2023-05-26T08:57:39Z", "content": "By India Today Science Desk: Researchers at the Massachusetts Institute of Technology (MIT) and McMaster University have used machine learning, a branch of Artificial Intelligence (AI), to identify a… [+2910 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers target stem cells in human stomach to treat diabetes - ETHealthWorld", "description": "Biomedical researchers aim to replace beta-cell function in a more natural way, with transplants of human cells that work as beta cells do: automatically sensing blood sugar levels and secreting insulin as needed. Ideally, such transplants would use patients'…", "url": "https://health.economictimes.indiatimes.com/news/industry/researchers-target-stem-cells-in-human-stomach-to-treat-diabetes/100524614", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100524614,imgsize-70056,width-1200,height=765,overlay-ethealth/industry/researchers-target-stem-cells-in-human-stomach-to-treat-diabetes.jpg", "publishedAt": "2023-05-26T08:43:11Z", "content": "New York: A potential strategy for treating diabetes uses stem cells from the human stomach to create cells that release insulin in response to rising blood sugar levels.According to a preliminary st… [+4265 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Running through middle age found to delay aging-related memory problems - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/running-through-middle-age-found-to-delay-aging-related-memory-problems/577634.html", "urlToImage": "", "publishedAt": "2023-05-26T08:18:41Z", "content": "New Delhi, May 26 (PTI) Researchers have found that long-term running as part of exercise in middle age helps in wiring 'old' new neurons born in early adulthood, or adult-born neurons, into a networ… [+624 chars]"}, {"source": {"id": null, "name": "Raillynews.com"}, "author": "leventelmastas", "title": "Beware of Foods Harmful to Bone Health! - RaillyNews", "description": "Beware of Foods Harmful to Bone Health! - Orthopedics and Traumatology Specialist Op.Dr.Alperen Korucu gave important information about the subject. A healthy diet is important for general body health as well as", "url": "https://raillynews.com/2023/05/Beware-of-foods-that-are-harmful-to-bone-health/", "urlToImage": "https://rayhaber.com/wp-content/uploads/2023/05/Kemik-Sagligina-Zararli-Besinlere-Dikkat.jpg", "publishedAt": "2023-05-26T08:02:39Z", "content": "Beware of Foods Harmful to Bone Health!\r\nOrthopedics and Traumatology Specialist Op.Dr.Alperen Korucu gave important information about the subject. A healthy diet is important for general body health… [+1005 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Shafalika", "title": "Can women with PCOS conceive naturally? Yes, just lose weight and modify your lifestyle - The Indian Express", "description": "Even a five per cent reduction in weight can reduce hormonal imbalance. Then the chances of egg release or spontaneous ovulation automatically go up and there is a better chance of natural conception. Otherwise, there are assisted reproductive treatments, say…", "url": "https://indianexpress.com/article/health-wellness/women-pcos-conceive-naturally-weight-loss-lifestyle-modifications-8630205/", "urlToImage": "https://images.indianexpress.com/2023/05/pcos-fertility.jpg", "publishedAt": "2023-05-26T07:51:31Z", "content": "Mrs A was married for almost eight years, obese (she had a BMI of almost 28) and suffering from Polycystic Ovarian Syndrome (PCOS), with regular complaints of irregular cycles, acne and hirsutism. Sh… [+4118 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "First death from Powassan virus infection in US: All about the tick-borne disease - India Today", "description": "Health officials have alerted people about the deadly viral disease after the US resident died.", "url": "https://www.indiatoday.in/health/story/first-death-from-powassan-virus-infection-in-us-all-about-the-tick-borne-disease-2384680-2023-05-26", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202305/powassan_virus_disease-sixteen_nine.png?VersionId=db.CiNqxADQBE4nh1pPMKKsv7L1sE3fA", "publishedAt": "2023-05-26T07:34:59Z", "content": "By Daphne Clarance: A person in the US has died from the rare Powassan virus, marking the first fatal case in the country this year, according to the Maine Center for Disease Control and Prevention.\r… [+2592 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Type 2 Diabetes Medicines May Help Treat Autoimmune Disorders: Study - Zee News", "description": "Heart Health: Lifestyle Changes To Prevent Cardiac Arrest In Teens - Expert Explains Dr Nick Jones, a senior author who led the study said: Our findings are significant as they provide the foundation for the clinical development of canagliflozin for the treat…", "url": "https://zeenews.india.com/health/type-2-diabetes-medicines-may-help-treat-autoimmune-disorders-study-2613759", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/05/26/1207802-diabetes-2.jpg", "publishedAt": "2023-05-26T07:29:09Z", "content": "Researchers at Swansea University discovered that a medicine frequently used to treat type 2 diabetes might possibly be used to treat autoimmune illnesses. Academics at the University's Faculty of Me… [+2061 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "ANI", "title": "Exercise helps to protect against major brain hemorrhage - The Statesman", "description": "Physically active was defined as engaging in at least light physical activity, such as walking, cycling, swimming, gardening, or dancing, for at least four hours weekly.", "url": "https://www.thestatesman.com/lifestyle/exercise-helps-to-protect-against-major-brain-hemorrhage-1503184853.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/11/run.jpg", "publishedAt": "2023-05-26T06:52:00Z", "content": "Regular physical activity and exercise may lower bleeding in people with intracerebral haemorrhage, according to research from the University of Gothenburg. The researchers stress the relevance of ph… [+2792 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by India TV Lifestyle Desk", "title": "Foods to avoid after consuming papaya to prevent digestive discomfort - India TV News", "description": "It is crucial to know what should not be consumed after eating papaya; otherwise, papaya might cause harm rather than benefit.", "url": "https://www.indiatvnews.com/lifestyle/food/foods-to-avoid-after-consuming-papaya-to-prevent-digestive-discomfort-2023-05-26-872656", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/05/befunky-collagesfddddfddddfdddddsffssdddssddfcfdsddsssssddddfddffffffd-1-1685079489.jpg", "publishedAt": "2023-05-26T05:52:40Z", "content": "What should not be eaten after eating papaya? Papaya is such a fruit that eating it is considered very beneficial for the stomach. Actually, this fruit contains a compound called papain, which can ke… [+2007 chars]"}, {"source": {"id": null, "name": "Newstodaynet.com"}, "author": "NT Bureau", "title": "Learn to combat hypertension - News Today", "description": "Diabetes is a health condition where the body struggles to regulate blood sugar levels effectively. This can lead to several complications over time, such as nerve damage, kidney disease, and cardiovascular disease. However, one of the less well-known complic…", "url": "https://newstodaynet.com/2023/05/26/learn-to-combat-hypertension/", "urlToImage": "https://newstodaynet.com/wp-content/uploads/2023/05/download-2023-05-26T111604.412.jpg", "publishedAt": "2023-05-26T05:46:31Z", "content": "Chennai: Diabetes is a health condition where the body struggles to regulate bloodsugar levels effectively. This can lead to several complications over time, such as nervedamage, kidney disease, and … [+1179 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Jigyasa Kakwani", "title": "Symptoms of micronutrient deficiencies in Indian women and top 4 health problems they experience - Indiatimes.com", "description": "Many Indian women have micronutrient deficiencies, such as in vitamin D, vitamin B12, calcium etc. These can lead to several health issues and pregnan", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/symptoms-of-micronutrient-deficiencies-in-indian-women-and-top-4-health-problems-they-experience/articleshow/100505942.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100506190,width-1070,height-580,imgsize-1077375,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-26T05:30:00Z", "content": "But doctor, beer isnt alcohol? Why alcoholic fatty liver is tough to diagnose and treatMany doctors have raised concern over the diagnosis of alcoholic fatty liver or alcohol related liver diseases. … [+140 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals type 2 diabetes diagnosis spurs cholesterol shifts, alters Ccardiovascular risk - News-Medical.Net", "description": "A recent study published in the journal Scientific Reports assessed the associations between the change in total cholesterol (TC) levels after type 2 diabetes (T2D) diagnosis (relative to pre-diagnosis levels) and the risk of cardiovascular disease (CVD).", "url": "https://www.news-medical.net/news/20230526/Study-reveals-type-2-diabetes-diagnosis-spurs-cholesterol-shifts-alters-Ccardiovascular-risk.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749340_16850770666575112.jpg", "publishedAt": "2023-05-26T05:03:00Z", "content": "A recent study published in the journal Scientific Reports assessed the associations between the change in total cholesterol (TC) levels after type 2 diabetes (T2D) diagnosis (relative to pre-diagnos… [+4942 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Beth Bradford", "title": "The Difference Between Hodgkin And Non-Hodgkin Lymphoma, According To A Doctor - Health Digest", "description": "Lymphoma, or cancer of the lymph nodes, can be either Hodgkin or non-Hodgkin, but what distinguishes these types? Read on to learn more.", "url": "https://www.healthdigest.com/1296916/difference-between-hodgkin-nonhodgkin-lymphoma/", "urlToImage": "https://www.healthdigest.com/img/gallery/whats-the-difference-between-hodgkin-and-non-hodgkin-lymphoma/l-intro-1685042297.jpg", "publishedAt": "2023-05-26T03:57:14Z", "content": "Beloved YouTube star and science writer Hank Green told his followers on May 19 that he has Hodgkin lymphoma. As he explained, he noticed his lymph nodes had become swollen, and that his doctor rushe… [+1225 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals how cancers in distant organs change liver function - ANI News", "description": "Researchers at Weill Cornell Medicine found that cancer often releases molecules into the bloodstream that pathologically modify the liver, sending it into an inflammatory state, causing fat accumulation, and disrupting its typical detoxification processes. T…", "url": "https://www.aninews.in/news/health/study-reveals-how-cancers-in-distant-organs-change-liver-function20230526090622", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230526031036.jpg", "publishedAt": "2023-05-26T03:36:00Z", "content": "New York [US], May 26 (ANI): Researchers at Weill Cornell Medicine found that cancer often releases molecules into the bloodstream that pathologically modify the liver, sending it into an inflammator… [+5318 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Riddhima Kanetkar", "title": "Weight loss tips: Eat bhindi to lose extra kilos - DNA India", "description": "Weight loss tips: Eat bhindi to lose extra kilos", "url": "https://www.dnaindia.com/web-stories/lifestyle/weight-loss-tips-eat-bhindi-to-lose-extra-kilos-1685068920691", "urlToImage": null, "publishedAt": "2023-05-26T03:29:05Z", "content": "May 26, 2023, 08:59AM IST"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Turmeric: Here's how it actually measures up to health claims - EastMojo", "description": "Turmeric has also been suggested to have anti-cancer properties due to its anti-oxidant effect. In the lab, curcumin has been shown to reverse DNA changes in cells which cause breast cancer. But it’s less clear whether turmeric reduces the risk of cancer or s…", "url": "http://www.eastmojo.com/health/2023/05/26/turmeric-heres-how-it-actually-measures-up-to-health-claims/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/09/turmeric-2344157_1280.jpg?fit=1280%2C853&ssl=1", "publishedAt": "2023-05-26T02:50:00Z", "content": "Turmeric has been used by humans for more than 4,000 years. As well as cooking and cosmetics, its been a staple of the traditional medicine practice of Ayurveda, used to treat a variety of conditions… [+7753 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Experimental drug inhibits or prevents diabetic eye disease in Wilmer Eye Institute study - EurekAlert", "description": "Researchers at Wilmer Eye Institute, Johns Hopkins Medicine say they have evidence that an experimental drug may prevent or slow vision loss in people with diabetes. The results are from a study that used mouse as well as human retinal organoids and eye cell …", "url": "https://www.eurekalert.org/news-releases/990509", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/d225b936-afab-4717-b4d8-91cad69e9af7/Rendition/thumbnail/Content/Public", "publishedAt": "2023-05-26T02:02:42Z", "content": "image: Artistic rendition of diabetic eye disease highlighting vascular changes (i.e., retinal neovascularization) observed in patients with proliferative diabetic retinopathy.view more \r\nCredit: Isa… [+5831 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Pasta: 5 tricks to make the healthiest, weight-loss friendly pasta at home - Times of India", "description": "Want to eat your pasta and make it healthy too? Here are 5 easy tricks to make this happen!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/pasta-5-tricks-to-make-the-healthiest-weight-loss-friendly-pasta-at-home/photostory/100499407.cms", "urlToImage": "https://static.toiimg.com/photo/100499471.cms", "publishedAt": "2023-05-26T01:30:00Z", "content": "Eating simple pasta without any veggies would mean loading up on carbs. Instead, add lots of sautéed veggies to your pasta, such as corn, broccoli, zucchini, bell peppers, onions, olives and jalapeño… [+102 chars]"}, {"source": {"id": null, "name": "Knowablemagazine.org"}, "author": null, "title": "After Covid-19, can mRNA vaccines help with cancer as well? - Knowable Magazine", "description": "", "url": "https://knowablemagazine.org/article/technology/2023/after-covid19-mrna-vaccines-for-cancer-too", "urlToImage": "https://knowablemagazine.org/pb-assets/knowable-assets/article-assets/twitter/10.1146/knowable-052523-2-1200x630-1685051342503.jpg", "publishedAt": "2023-05-25T21:58:06Z", "content": null}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Clarissa Brincat", "title": "Kidney disease: How urine, blood tests may help predict progression - Medical News Today", "description": "Researchers say biomarkers in blood and urine samples can be used to predict the progression of acute kidney injury to chronic kidney disease", "url": "https://www.medicalnewstoday.com/articles/kidney-disease-how-urine-blood-tests-may-help-predict-progression", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/05/urine-blood-sample-kidney-disease-732x549-thumbnail.png", "publishedAt": "2023-05-25T21:11:08Z", "content": "<ul><li>Acute kidney injury affects 10-15% of hospitalized individuals and increases the risk of developing chronic kidney disease.</li><li>Researchers at John Hopkins Medicine examined changes in 7 … [+8679 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel vaccine offers hope for defeating epidemic meningitis by 2030 - News-Medical.Net", "description": "A trial of a new vaccine against meningococcal disease, a cause of meningitis and blood poisoning, has found that it is safe and induces a strong immune response across five strains of meningococcal bacteria: A, C, W, Y and X.", "url": "https://www.news-medical.net/news/20230525/Novel-vaccine-offers-hope-for-defeating-epidemic-meningitis-by-2030.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/A_doctor_makes_a_vaccination_to_a_child-Yuganov_Konstantin_cdbf1b05417f45e89b8268af4858e1c9-620x480.jpg", "publishedAt": "2023-05-25T20:24:00Z", "content": "A trial of a new vaccine against meningococcal disease, a cause of meningitis and blood poisoning, has found that it is safe and induces a strong immune response across five strains of meningococcal … [+3929 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Awareness campaign highlights 'growing epidemic' of myopia in children - Healio", "description": "The &ldquo;growing epidemic&rdquo; of nearsightedness in children worldwide is the focus of Myopia Awareness Week, May 22 to 26, according to a press release.", "url": "https://www.healio.com/news/optometry/20230525/awareness-campaign-highlights-growing-epidemic-of-myopia-in-children", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/ophthalmology_optometry/g/glasses1208262_640.jpg", "publishedAt": "2023-05-25T19:33:54Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nThe “growing epidemic” of nearsightednes… [+1426 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Elizabeth Short", "title": "Lung Cancer Screening Results Influence Follow-Up Adherence - Medpage Today", "description": "Study suggests groups to target for enhanced outreach to encourage regular screening", "url": "https://www.medpagetoday.com/radiology/diagnosticradiology/104702", "urlToImage": "https://assets.medpagetoday.net/media/images/104xxx/104702.jpg", "publishedAt": "2023-05-25T19:00:38Z", "content": "A patient's Lung Computed Tomography Screening Reporting &amp; Data System (Lung-RADS) score was the factor most strongly associated with adherence to recommended screening follow-up, a single-center… [+5641 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Delayed ejaculation: Underlying causes and symptoms of this sexual health problem - Indiatimes.com", "description": "These factors can help prevent delayed ejaculation.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/delayed-ejaculation-underlying-causes-and-symptoms-of-this-sexual-health-problem/photostory/100499906.cms", "urlToImage": "https://static.toiimg.com/photo/100499938.cms", "publishedAt": "2023-05-25T18:30:00Z", "content": "• Psychological factors: Anxiety, depression, stress, performance anxiety, and relationship issues can contribute to delayed ejaculation.• Medical conditions: Dr. Chirag Bhandari, Founder of Institut… [+440 chars]"}, {"source": {"id": null, "name": "Polioeradication.org"}, "author": null, "title": "Stakeholders Commit to A Renewed Strategic Framework on Polio Transition – GPEI - Global Polio Eradication Initiative", "description": "Country experiences show that success on polio transition is context specific.", "url": "https://polioeradication.org/news-post/stakeholders-commit-to-a-renewed-strategic-framework-on-polio-transition/", "urlToImage": "https://polioeradication.org/wp-content/uploads/2023/02/Someone-has-to-do-this-feature.jpg", "publishedAt": "2023-05-25T18:26:02Z", "content": "Broader benefits of the polio programme, Eradication, Transition planning\r\nCountry experiences show that success on polio transition is context specific.\r\nRepresentatives from regions and countries s… [+4658 chars]"}, {"source": {"id": null, "name": "Organiser.org"}, "author": "WEB DESK", "title": "Human T cells play key role in controlling respiratory syncytial virus infection: Research - Organiser", "description": "A new study has shown that human T cells have an important role to play in controlling Respiratory Syncytial Virus (RSV) infection, a highly contagious", "url": "https://organiser.org/2023/05/25/175613/world/human-t-cells-play-key-role-in-controlling-respiratory-syncytial-virus-infection-research/", "urlToImage": "https://organiser.org/wp-content/uploads/2023/05/whatsapp-image-2023-05-25-at-4.37.57-pm.jpeg", "publishedAt": "2023-05-25T17:31:14Z", "content": "A new study has shown that human T cells have an important role to play in controlling Respiratory Syncytial Virus (RSV) infection, a highly contagious and seasonal respiratory virus that mainly caus… [+3627 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Adrianna Rodriguez", "title": "Diabetes symptoms and early signs of prediabetes: What to know - USA TODAY", "description": "The CDC estimates more than 1 in 3 Americans have prediabetes, and more than 80% don't know they have it. Here are signs and symptoms of diabetes.", "url": "https://www.usatoday.com/story/news/health/2023/05/25/diabetes-symptoms-early-signs/70175149007/", "urlToImage": "https://www.usatoday.com/gcdn/presto/2023/05/25/USAT/cfed6822-3314-4dbd-8fc6-3467cbeb4c17-AdobeStock_94084210.jpeg?crop=5615,3159,x0,y287&width=3200&height=1801&format=pjpg&auto=webp", "publishedAt": "2023-05-25T16:58:56Z", "content": "Diabetes is the eight-leading cause of death in the United States, according to the Centers for Disease Control and Prevention and that figure may be underreported.\r\nExperts say diabetes symptoms ran… [+6590 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Aayushi", "title": "Diabetes: 5 green morning-juices to manage blood sugar level - DNA India", "description": "Here are five green juices that can help diabetic patients manage their blood sugar level.", "url": "https://www.dnaindia.com/web-stories/lifestyle/diabetes-5-green-morning-juices-to-manage-blood-sugar-level-1685032046534", "urlToImage": null, "publishedAt": "2023-05-25T16:54:11Z", "content": "One of the juices that is probably most frequently suggested to diabetics is karela juice. Natural diabetes treatment has been demonstrated to work with polypeptide-p, an insulin-like substance found… [+117 chars]"}, {"source": {"id": null, "name": "Ufl.edu"}, "author": null, "title": "Mental Health Awareness Month: How exercise goes the extra mile - University of Florida", "description": "<p>A University of Florida doctor is highlighting the benefits of exercise for mental health. Dr. Jay Clugston, who specializes in concussion research, has found that athletes with previous mental health conditions recover differently than those without, and …", "url": "https://news.ufl.edu/2023/05/exercise-benefits-mental-health/", "urlToImage": "https://news.ufl.edu/media/newsufledu/images/2023/05/2015-09-22_Campus_Life_Stadium-3598.jpg", "publishedAt": "2023-05-25T16:36:05Z", "content": "The health benefits of exercise are well-known, but one UF project aims to support health care providers in relaying the information to patients who suffer from physical or psychological ailments.\r\nD… [+2541 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Tanisha Salwan", "title": "5 Indian Spices To Prevent High Blood Pressure - Slurrp", "description": "High blood pressure is a common phenomenon these days. But did you know you don’t need anything fancy but some basic Indian spices to get rid of it? Yes, from coriander to black pepper, here are 5 spices that can prevent high blood pressure.", "url": "https://www.slurrp.com/article/5-indian-spices-to-prevent-high-blood-pressure-1685027740669", "urlToImage": "https://images.slurrp.com/prodarticles/zbh411dsmsj.webp", "publishedAt": "2023-05-25T15:24:28Z", "content": "Among the rising factors that put a lot of lives on stake is high blood pressure. Earlier, this phenomenon was common among elderly people but now, people even in their 30s and 40s have started facin… [+1631 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": null, "title": "Aapki Khabar Aapka Fayda: World Thyroid Awareness Day - Know Its Symptoms, Causes, Risk Factors And Prevent... - Zee Business", "description": "World Thyroid Awareness Day is observed on May 25 every year. This day is celebrated with the aim of spreading awareness about the prevention of thyroid disease. What is the cause of thyroid, its symptoms, risk factors and preventive measures? Know in this sp…", "url": "https://www.zeebiz.com/india/video-gallery-aapki-khabar-aapka-fayda-world-thyroid-awareness-day-know-its-symptoms-causes-risk-factors-and-preventive-measures-237065", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2023/05/25/244224", "publishedAt": "2023-05-25T14:42:01Z", "content": "Zee Business Video Team |\r\n Updated: May 25, 2023 23:17 pm \r\nWorld Thyroid Awareness Day is observed on May 25 every year. This day is celebrated with the aim of spreading awareness about the prevent… [+165 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Over 800 million people likely to suffer from back pain by 2050 worldwide: Study - WION", "description": "More than 800 million people worldwide are likely to suffer from lower back pain by 2050, which is a 36 per cent increase from the year 2020, as per the 'Ana...", "url": "https://www.youtube.com/watch?v=RxkXpDS-WX4", "urlToImage": "https://i.ytimg.com/vi/RxkXpDS-WX4/maxresdefault.jpg", "publishedAt": "2023-05-25T14:39:08Z", "content": null}, {"source": {"id": null, "name": "Indiashorts.com"}, "author": "PR Newswire", "title": "Tianlong Helps Hospitals in Thailand Detect Hepatitis Early with Molecular Diagnostic Solution - India Shorts", "description": "XI'AN, China, May 25, 2023 /PRNewswire/ -- Tianlong, an innovative high-tech company specializing in molecular diagnostic products in China, has partnered with public hospitals in northern Thailand to build up detection measures for hepatitis C (HCV)", "url": "https://indiashorts.com/tianlong-helps-hospitals-in-thailand-detect-hepatitis-early-with-molecular-diagnostic-solution/123425/", "urlToImage": "https://indiashorts.com/wp-content/uploads/2023/05/tianlong-helps-hospitals-in-thailand-detect-hepatitis-early-with-molecular-diagnostic-solution-1.jpg", "publishedAt": "2023-05-25T14:26:02Z", "content": "XI’AN, China, May 25, 2023 /PRNewswire/ — Tianlong, an innovative high-tech company specializing in molecular diagnostic products in China, has partnered with public hospitals in northern Thailand to… [+2821 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "Death Risk From Liver Disease More Than Twice In Lower-Income Countries: Lancet Study - Zee News", "description": "Researchers Suggest Diet May Improve Blood Pressure, Sugar Levels: Study A working liver is so important for our health since the organ is connected to so many aspects of bodily function, said Jasmohan Bajaj, a professor at the Virginia Commonwealth Universit…", "url": "https://zeenews.india.com/health/death-risk-from-liver-disease-more-than-twice-in-lower-income-countries-lancet-study-2613481", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/05/25/1207450-liver-disease.jpg", "publishedAt": "2023-05-25T13:50:58Z", "content": "The risk of death for hospitalised liver disease patients is more than twice as high in lower-or lower-middle-income countries compared to high-income nations, according to a study that analysed data… [+3514 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Nina Cosdon", "title": "Booster vaccines for children: A key strategy to mitigate COVID-19 impact on schools and health - Contemporary Pediatrics", "description": "Accelerating bivalent booster vaccine campaigns for children could reduce pediatric hospitalizations and school absenteeism.", "url": "https://www.contagionlive.com/view/booster-vaccines-for-children-a-key-strategy-to-mitigate-covid-19-impact-on-schools-and-health", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contpeds/54e6fe9ca007b7c68e39428f4df11bcb0f2c1eed-7192x4800.jpg?fit=crop&auto=format", "publishedAt": "2023-05-25T13:33:45Z", "content": "Childrens adverse outcomes of COVID-19, such as severe disease and hospitalization, can disrupt school attendance. As of March 2023, more than 185000 hospitalizations and 1700 deaths in the pediatric… [+3430 chars]"}, {"source": {"id": null, "name": "Imaging Technology News"}, "author": null, "title": "Computer Aided Diagnosis Improves Breast Ultrasound Expertise in Multicenter Study - Imaging Technology News", "description": "May 25, 2023 — According to an accepted manuscript published in ARRS’ own American Journal of Roentgenology (AJR), deep learning–based computer-aided diagnosis", "url": "https://www.itnonline.com/content/computer-aided-diagnosis-improves-breast-ultrasound-expertise-multicenter-study", "urlToImage": "http://www.itnonline.com/sites/default/files/52-year-old%20woman%20who%20underwent%20prior%20breast%20ultrasound%20due%20to%20MRI%20abnormality%2C%20top.jpg", "publishedAt": "2023-05-25T13:21:30Z", "content": "May 25, 2023  According to an accepted manuscript published in ARRS own American Journal of Roentgenology (AJR), deep learningbased computer-aided diagnosis (CAD) for breast lesion classification on … [+2657 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Sara L. Tolliday, PharmD, RPh", "title": "Targeting a Newly Identified Gene in the Brain May Reduce Anxiety - Pharmacy Times", "description": "Anxiety disorders create social and economic burdens as the availability of effective anxiolytic treatments are low.", "url": "https://www.pharmacytimes.com/view/targeting-a-newly-identified-gene-in-the-brain-may-reduce-anxiety", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/a221ea53bc41bfd74b5dc7f3364cf824c2c8d3c1-7360x4912.jpg?fit=crop&auto=format", "publishedAt": "2023-05-25T12:16:44Z", "content": "Anxiety disordersincluding generalized anxiety disorder, panic attacks, phobias, obsessive-compulsive disorder, and post-traumatic stress disorderare the most diagnosed psychiatric conditions, affect… [+3233 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Rachel Ann Tee-Melegrito", "title": "Constipation: Risks and more - Medical News Today", "description": "Severe constipation can lead to serious complications. Learn more about the risks of untreated constipation here.", "url": "https://www.medicalnewstoday.com/articles/death-by-constipation", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/04/risks_constipation_GettyImages82255192_Thumb.jpg", "publishedAt": "2023-05-25T12:13:51Z", "content": "Without treatment, long-standing constipation can lead to bowel problems such as anal fissures. Some can lead to serious problems, such as fecal impaction, which could lead to hospitalization, surger… [+5264 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Indian Researchers Create Drugs that Could Stop COVID-19 and Influenza! - The Weather Channel", "description": "These drug candidates have been shown to completely block the concerning Wuhan, Delta and Omicron (among other) strains, as well as the H1N1 and H3N2 influenza strains.", "url": "https://weather.com/en-IN/india/health/news/2023-05-25-indians-create-drugs-that-could-stop-covid-19-and-influenza", "urlToImage": "https://s.w-x.co/in-medicine_2.jpg", "publishedAt": "2023-05-25T11:23:25Z", "content": "While there might be rallies against vaccines for the supposed (and thoroughly scientifically disproven) belief that they \"cause autism\", the real problem with them is something else entirely: they h… [+3389 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Tobacco triggers genetic mutations that cause bladder cancer: Expert - News9 LIVE", "description": "Tobacco releases number of toxins that can wreaking havoc on the delicate tissues of the bladder", "url": "https://www.news9live.com/health/health-conditions/tobacco-triggers-genetic-mutations-that-cause-bladder-cancer-expert-2154914", "urlToImage": "https://images.news9live.com/h-upload/2023/01/05/599839-smoking-1026556960720.jpg", "publishedAt": "2023-05-25T11:20:06Z", "content": "Tobacco releases number of toxins that can wreaking havoc on the delicate tissues of the bladder\r\nTobacco has been a risk factor for various severe diseases including various kind of cancers. Usually… [+2028 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Empowering personal health: The role of wearable devices in preventive medicine - Indiatimes.com", "description": "In its most basic version, wearable health equipment is a spectacle.", "url": "https://timesofindia.indiatimes.com/life-style/spotlight/empowering-personal-health-the-role-of-wearable-devices-in-preventive-medicine/articleshow/100498830.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100503052,width-1070,height-580,imgsize-12318,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-25T11:09:00Z", "content": "Diana Penty's final look from Cannes 2023 calls for spring love"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Risha Ganguly", "title": "Chia vs. Flax vs. Hemp Seeds: Boost Your Diet with Super Seeds - Slurrp", "description": "Are you confused between choosing chia, flax, or hemp seeds? Read on to gain a clear understanding of the unique attributes of chia, flax, and hemp seeds, enabling you to choose the seed that aligns best with your dietary goals and preferences.", "url": "https://www.slurrp.com/article/chia-vs-flax-vs-hemp-seeds-boost-your-diet-with-super-seeds-1685010679662", "urlToImage": "https://images.slurrp.com/prodarticles/95q81257uy.webp", "publishedAt": "2023-05-25T11:05:21Z", "content": "Chia seeds\r\nHemp seeds are packed with protein | Unsplash\r\nDigestible and Allergy-Friendly: Hemp seeds are highly digestible and well-tolerated by most people, making them suitable for individuals wi… [+185 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Do I have cancer? 10 common pre-cancer signs to know - Times of India", "description": "​Cancer is a treatable condition and for this you have to notice the signs of the disease when it is in the early stage. ​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/do-i-have-cancer-10-common-pre-cancer-signs-to-know/photostory/100501802.cms", "urlToImage": "https://static.toiimg.com/photo/100501992.cms", "publishedAt": "2023-05-25T10:34:25Z", "content": "\"Pay attention to changes in your body functions. These changes can be caused by many different factors (some serious, though many not),\" says Johns Hopkins gastroenterologist Anne Marie Lennon, M.D.… [+280 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Urinary infections, a general overview - Emergency Live International", "description": "Urinary infections are known by the acronym UTI. This term is used to define all infections caused by pathogens multiplying in the urinary...", "url": "https://www.emergency-live.com/health-and-safety/urinary-infections-a-general-overview/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2023/05/Infezioni-urinarie-reni-rene-vescica-1.jpg", "publishedAt": "2023-05-25T10:14:00Z", "content": "This part of the body transports urine from the bladder to the outside and is essential for proper functioning of the urinary tract.\r\nSymptoms of urinary infections can occur in the kidneys, bladder,… [+12193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Why weight loss is sustainable and obesity manageable with a little help from a mental health expert - The Indian Express", "description": "Often the pressure of societal disdain for the overweight and even the sneers they get for not meeting their goals soon enough push patients over the edge. Treatment outcomes are, therefore, poor. That’s why obesity treatment has to be multi-disciplinary with…", "url": "https://indianexpress.com/article/health-wellness/weight-loss-sustainable-obesity-manageable-mental-health-expert-help-8628637/", "urlToImage": "https://images.indianexpress.com/2023/05/GettyImages-belly-fat-1200.jpg", "publishedAt": "2023-05-25T10:11:39Z", "content": "You want to shed that weight, knowing it is harming you, but somehow dont have the will to overcome your faulty lifestyle patterns and slip back deeper into them because they are comforting. Besides,… [+5586 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "The diagnosis of heart failure is often missed, especially for women - Tech Explorist", "description": "Greater Glasgow & Clyde Population Analysis presented at Heart Failure 2023.", "url": "https://www.techexplorist.com/diagnosis-heart-failure-often-missed-especially-women/60599/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/heart-failure-2.jpg", "publishedAt": "2023-05-25T10:03:21Z", "content": "Heart failure is frequently misdiagnosed, depriving patients of therapies that could improve their health and reduce their death. According to a late-breaking scientific presentation today at Heart F… [+3522 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "This animal's milk contains high amount of alcohol and can get humans drunk - Indiatimes.com", "description": "Today we’ll be talking about an animal’s milk that contains more alcohol than any whiskey, beer or wine. Surprising, isn’t it? Well, it contains a large amount of alcohol which can make you feel intoxicated just like any of these drinks.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/this-animals-milk-contains-high-amount-of-alcohol-and-can-get-humans-drunk/photostory/100500528.cms", "urlToImage": "https://static.toiimg.com/photo/100500551.cms", "publishedAt": "2023-05-25T09:45:33Z", "content": "Milk is important for human consumption due to its nutritional value and benefits. It is a rich source of proteins, essential amino acids, calcium, vitamins, minerals, and fats. Milk promotes strong … [+578 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Wilson’s disease: Causes, symptoms, diagnosis, treatment and prevention - Hindustan Times", "description": "Wilson's Disease could be present at birth but not show signs until copper levels start to rise. Here are its causes, symptoms, diagnosis, treatment, prevention | Health", "url": "https://www.hindustantimes.com/lifestyle/health/wilsons-disease-causes-symptoms-diagnosis-treatment-and-prevention-101685003038786.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/25/1600x900/FSZERi1agAAsqNW_1685003429967_1685003465014.jfif", "publishedAt": "2023-05-25T08:48:06Z", "content": "Wilson's Disease is a rare genetic disorder that causes copper to accumulate in various organs, including the liver, brain and eyes and the excess copper can cause significant damage to these organs,… [+8204 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Life pressures may lead to multiple sclerosis flares, disability: Study - ETHealthWorld", "description": "Using survey data from more than 700 people with MS, researchers discovered that stressful events occurring both in childhood and adulthood contributed significantly to participants' level of disability. The results are published in Brain and Behavior.", "url": "https://health.economictimes.indiatimes.com/news/industry/life-pressures-may-lead-to-multiple-sclerosis-flares-disability-study/100497733", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100497733,imgsize-139716,width-1200,height=765,overlay-ethealth/industry/life-pressures-may-lead-to-multiple-sclerosis-flares-disability-study.jpg", "publishedAt": "2023-05-25T08:07:14Z", "content": "Washington: A study headed by Michigan Medicine indicates that stresses across the lifespan, such as poverty, abuse, and divorce, are linked to deteriorating health and functional outcomes in patient… [+2524 chars]"}, {"source": {"id": null, "name": "Indulgexpress.com"}, "author": "Sakshi Kaithwas", "title": "Five healthy snacks for guilt-free munching - indulgexpress", "description": "These healthy delights&nbsp;not only satiate your rumbling tummies but also provide your body with various health benefits.", "url": "https://www.indulgexpress.com/food/trends/2023/may/25/5-healthy-snacks-for-guilt-free-munching-49306.html", "urlToImage": "https://images.indulgexpress.com/uploads/user/imagelibrary/2023/5/25/original/Healthysnacksfvgfg.jpg", "publishedAt": "2023-05-25T06:06:00Z", "content": "Many people love snacking. Well, its natural to get hunger pangs if theres a long gap between meals. During such times, people end up turning to unhealthy options like a bag of chips or other deep-fr… [+2828 chars]"}, {"source": {"id": null, "name": "Vigyanprasar.gov.in"}, "author": "", "title": "Novel method to produce activated carbon from coconut shell - Vigyan Prasar", "description": "http://vigyanprasar.gov.in/isw/images/Novel-method-to-produce-activated-carbon-from-coconut-shell.jpg", "url": "https://vigyanprasar.gov.in/isw/Novel-method-to-produce-activated-carbon-from-coconut-shell.html", "urlToImage": "http://vigyanprasar.gov.in/isw/images/Novel-method-to-produce-activated-carbon-from-coconut-shell.jpg", "publishedAt": "2023-05-25T05:59:44Z", "content": "A group of researchers from the Department of Environmental Sciences, Tamil Nadu Agricultural University, Coimbatore, has studied the conversion of coconut shells to Activated Carbon (AC) using calci… [+2950 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Neha Yadav", "title": "5 Ways To Increase Your Appetite - Hindustan Times", "description": "Here are some ways you can increase your appetite", "url": "https://www.hindustantimes.com/web-stories/lifestyle/5-ways-to-increase-your-appetite-101684951979001.html", "urlToImage": null, "publishedAt": "2023-05-25T05:32:36Z", "content": "By Neha YadavPublished May 25, 2023\r\nHindustan TimesLifestylePhoto Credits: Pexels"}, {"source": {"id": null, "name": "Zee Business"}, "author": "Charushree Chundawat", "title": "10 fruits to include in diabetes diet - Zee Business", "description": "Here are the fruits which can be consumed in diabetes.", "url": "https://www.zeebiz.com/web-stories/trending/visuals-of-eid-prayers-in-saudi-arabia-1684986989162", "urlToImage": "https://images1.wionews.com/images/ZB-EN/900x1600/2023/5/25/1684987078780_Screenshot20230525092733.png", "publishedAt": "2023-05-25T04:42:07Z", "content": "Papaya is a summer fruit that can be a great addition to your diabetes diet. The low-calorie fruit is good for weight loss and is loaded with Vitamin B, folate, and minerals such as potassium, magnes… [+14 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Diets low in carbohydrate improve blood pressure, blood sugar levels and weight control compared to diets ... - Medical Dialogues", "description": "Adults with hypertension, prediabetes, or type 2 diabetes, and who are overweight or obese, are at an increased risk of serious health complications. However, experts disagree about which dietary...", "url": "https://medicaldialogues.in/mdtv/diabetes-endocrinology/videos/diets-low-in-carbohydrate-improve-blood-pressure-blood-sugar-levels-and-weight-control-compared-to-diets-that-only-target-hypertension-111960", "urlToImage": "https://medicaldialogues.in/h-upload/2023/05/25/210427-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-2023-05-25t095508887.jpg", "publishedAt": "2023-05-25T04:00:38Z", "content": "Adults with hypertension, prediabetes, or type 2 diabetes, and who are overweight or obese, are at an increased risk of serious health complications. However, experts disagree about which dietary pat… [+1452 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Fareha Naaz", "title": "Overeating - Mint", "description": "Under-eating can lead to cravings for calorie-dense food, which can ultimately result in overeating", "url": "https://www.livemint.com/web-stories/overeating-11684982410108.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/05/25/960x540/b14_1685001380515_1685001408169.jpeg", "publishedAt": "2023-05-25T03:24:30Z", "content": "THE ULTIMATE TRICK TO STOP OVEREATING \r\nPublished By Fareha Naaz \r\n | 25 May, 2023\r\nOvereating \r\n Often Overeating is blamed by most of us, as \"the root cause\" of weight gain, however it isn't. \r\nCal… [+1396 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study unravels links between obesity, mental health, and self-esteem in adolescents: Early intervention key to prevention - News-Medical.Net", "description": "How happiness with appearance, dieting, bullying, and self-esteem mediates the relationship between mental health and BMI in adolescents.", "url": "https://www.news-medical.net/news/20230524/Study-unravels-links-between-obesity-mental-health-and-self-esteem-in-adolescents-Early-intervention-key-to-prevention.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749132_16849452068975246.jpg", "publishedAt": "2023-05-25T01:32:00Z", "content": "Two of the main challenges faced by public health authorities throughout the world are obesity and mental health issues. A better understanding of the psychosocial factors that influence mental healt… [+5759 chars]"}, {"source": {"id": null, "name": "Theheartysoul.com"}, "author": null, "title": "Should You Drink Water On An Empty Stomach When You Wake Up In The Morning? - msnNOW", "description": "We’re all heard claims about “drinking water first thing in the morning” or “drinking it on an empty stomach,” but are there any truth to the claims surrounding these? While we could go on and on about the benefits of hydration—and we will—we want to focus on…", "url": "https://theheartysoul.com/drinking-water-in-the-morning/?utm_source=simplefeed", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1bDUqW.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-24T18:13:29Z", "content": "Were all heard claims about drinking water first thing in the morning or drinking it on an empty stomach, but are there any truth to the claims surrounding these? While we could go on and on about th… [+7245 chars]"}, {"source": {"id": null, "name": "Llu.edu"}, "author": null, "title": "Protect your heart health amidst anxiety, stress | News - Loma Linda University", "description": "Cardiologist breaks down mental health’s physical impacts, steps to safeguard heart health", "url": "https://news.llu.edu/health-wellness/protect-your-heart-health-amidst-anxiety-stress", "urlToImage": "https://news.llu.edu/sites/news.llu.edu/files/styles/og_image/public/IMG_7831.jpg?itok=ldDTHHW8", "publishedAt": "2023-05-24T14:18:57Z", "content": "Nearly one in three U.S. adults experience some anxiety disorder at some time in their lives, according to the National Institute of Mental Health panic disorder, generalized anxiety, agoraphobia, sp… [+3940 chars]"}]}