{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Tavishi Dogra", "title": "Gut Health Issues And Mental Health Issues Are Coexisting; Here's Why | TheHealthSite.com - TheHealthSite", "description": "How to nurture your gut to improve your mental Health? Explains Megha Terse-Mandke\r\nRegistered Dietitian LEC-IDA Mumbai Chapter. TheHealthSite.com", "url": "https://www.thehealthsite.com/gut-health/gut-health-issues-and-mental-health-issues-are-coexisting-heres-why-987689/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/04/Untitled-17.jpg", "publishedAt": "2023-06-24T06:13:00Z", "content": "Stress is a rising health concern that triggers mental and physical complications in life. \r\nHow to nurture your gut to improve your mental Health?\r\nIn the initial stages of medical and pharmaceutica… [+4776 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Eating yellow, orange and green fruits, vegetables help boost heart health: Study - mid-day.com", "description": "High level of carotenes in the blood is linked with a lower degree of fat build-up in the arteries and thus a lower risk of cardiovascular diseases", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/eating-yellow-orange-and-green-fruits-vegetables-help-boost-heart-health-study-23294077", "urlToImage": "https://images.mid-day.com/images/images/2023/jun/balanceddietmidday_d.jpg", "publishedAt": "2023-06-24T05:46:00Z", "content": "High level of carotenes in the blood is linked with a lower degree of fat build-up in the arteries and thus a lower risk of cardiovascular diseases\r\nA diet rich in fruit and vegetables lowers the ris… [+2310 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Cases of fatty liver diseases, mostly NAFLD, increasing finds study; let's understand what is fueling this surge in fatty liver cases - Indiatimes.com", "description": "​A new study found that the rate of fatty liver diseases has increased over the past three decades. The study presented at ENDO 2023, the Endocrine Society’s annual meeting in Chicago, Ill has highlighted the burden of fatty liver in the US. It talks about th…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/cases-of-fatty-liver-diseases-mostly-nafld-increasing-finds-study-lets-understand-what-is-fueling-this-surge-in-fatty-liver-cases/photostory/101232882.cms", "urlToImage": "https://static.toiimg.com/photo/101232890.cms", "publishedAt": "2023-06-24T05:30:00Z", "content": "For the study, the researchers analyzed data of 32,726 participants from the National Health and Nutrition Examination Survey (NHANES) from 1988 to 2018. “We found that overall, both MAFLD and obesit… [+266 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Number of mosquitos that can carry West Nile has gone up in last decade - FOX31 Denver", "description": "The population of the type of mosquito that carries the West Nile virus has increased, alarming some experts. FOX31's Evan Kruegel spoke to a professor who s...", "url": "https://www.youtube.com/watch?v=uY1HJNIcv38", "urlToImage": "https://i.ytimg.com/vi/uY1HJNIcv38/maxresdefault.jpg", "publishedAt": "2023-06-24T05:21:37Z", "content": null}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Corrie Pelc", "title": "A probiotic may help treat dry eye disease, according to a study in mice - Medical News Today", "description": "Research in mice has revealed that a probiotic bacterial strain may help treat dry eye disease, a common condition in which the eyes are unable to self-lubricate sufficiently.", "url": "https://www.medicalnewstoday.com/articles/a-probiotic-may-help-treat-dry-eye-disease-according-to-a-study-in-mice", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/06/dry_eye_GettyImages1320218178_Thumb.jpg", "publishedAt": "2023-06-24T05:11:48Z", "content": "<ul><li>About 12% of the global population has dry eye, a condition in which the eyes are unable to self-lubricate sufficiently.</li><li>There is currently no cure for dry eye disease.</li><li>Resear… [+5756 chars]"}, {"source": {"id": null, "name": "Journalreview.com"}, "author": null, "title": "Promoting prostate health during Men’s Health Month - Journal Review", "description": "One area of grave concern for the lack of preventive measures with men’s health is prostate health. Prostate health? Oh no. Just reading this might elicit a shuttering response from some men.  …", "url": "https://www.journalreview.com/stories/promoting-prostate-health-during-mens-health-month,259156?", "urlToImage": "https://beta.creativecirclecdn.com/crawfordsville/medium/20230612-145724-shutterstock_337380032.jpeg", "publishedAt": "2023-06-24T05:00:00Z", "content": "One area of grave concern for the lack of preventive measures with men’s health is prostate health. Prostate health? Oh no. Just reading this might elicit a shuttering response from some men. When we… [+3254 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Yearly re-scanning not needed for common brain tumor detected in 1 in 10 people - EurekAlert", "description": "People with a common type of benign brain tumor detected in around 1 in 10 don’t require annual scans, a new national study published in the European Journal of Endocrinology has found.", "url": "https://www.eurekalert.org/news-releases/993442", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-06-24T02:01:01Z", "content": "People with a common type of benign brain tumour detected in around 1 in 10 don’t require annual scans, a new national study has found.\r\nThe largest study of its kind has been published in the Europe… [+2631 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study reveals how popular steroids might mess up some cancer treatments - ETHealthWorld", "description": "The scientists found that patients who were more likely to produce CyC in response to GCs had a worse overall survival rate. These patients were also less likely to benefit from treatment. This suggests CyC production within a tumor may contribute to the fail…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-reveals-how-popular-steroids-might-mess-up-some-cancer-treatments/101229610", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-101229610,imgsize-41298,width-1200,height=765,overlay-ethealth/diagnostics/study-reveals-how-popular-steroids-might-mess-up-some-cancer-treatments.jpg", "publishedAt": "2023-06-24T01:36:06Z", "content": "Washington: Immunotherapy is one of the most recent and effective cancer treatments. It causes the immune system to identify tumours as intruders in the body and attack them. However, not all patient… [+2595 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "Globally, 1.3 billion projected to be living with diabetes by 2050 - Daily Excelsior", "description": "NEW DELHI, June 23: Population living with diabetes worldwide, currently half a billion, is projected to more than double to 1.3 billion in the next 30 years with every country expected to see an increase, according to a new analysis published in The Lancet. …", "url": "https://www.dailyexcelsior.com/globally-1-3-billion-projected-to-be-living-with-diabetes-by-2050/", "urlToImage": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2023/06/idabities.jpg", "publishedAt": "2023-06-23T21:28:40Z", "content": "NEW DELHI, June 23:Population living with diabetes worldwide, currently half a billion, is projected to more than double to 1.3 billion in the next 30 years with every country expected to see an incr… [+2822 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5 science based reasons why laughter is the best medicine - Indiatimes.com", "description": "They say 'a good laugh is a mighty good thing' for many reasons. You health can be one of them.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/5-science-based-reasons-why-laughter-is-the-best-medicine/articleshow/101216981.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101217091,width-1070,height-580,imgsize-964432,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-23T18:30:00Z", "content": "The role of meditation: How does regular meditation practice impact our spiritual journey?Consciousness, enlightenment or mindfulness, whatever you're seeking lies within yourself. Here's how meditat… [+12 chars]"}, {"source": {"id": null, "name": "Alzheimersnewstoday.com"}, "author": "Marisa Wexler, MS", "title": "Study: Altered gut bacteria could point to easier diagnostic tool... - Alzheimer's News Today", "description": "Changes in the makeup of gut bacteria are present in the earliest stages of Alzheimer's, which could point to an easy-to-use diagnostic tool.", "url": "https://alzheimersnewstoday.com/?p=77178&preview=true&preview_id=77178", "urlToImage": "https://alzheimersnewstoday.com/wp-content/uploads/2023/06/DigestiveSystem.png", "publishedAt": "2023-06-23T17:15:12Z", "content": "In the earliest stages of Alzheimer’s disease, even before cognitive symptoms have become apparent, there are detectable changes in the makeup of bacteria in the gut, a study shows.\r\nThe finding sugg… [+5669 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Casey McGrath", "title": "Study reveals genetic signatures of chickpea's cultural crossroads - Phys.org", "description": "With its nutty flavor and dense nutrient profile, the humble chickpea has captivated palates and nourished civilizations for millennia. From its ancient origins to its widespread use in modern kitchens and restaurants around the world, this legume demonstrate…", "url": "https://phys.org/news/2023-06-reveals-genetic-signatures-chickpea-cultural.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/study-reveals-genetic-1.jpg", "publishedAt": "2023-06-23T17:14:07Z", "content": "by Casey McGrath, SMBE Journals (Molecular Biology and Evolution and Genome Biology and Evolution)With its nutty flavor and dense nutrient profile, the humble chickpea has captivated palates and nour… [+5676 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Experts Develop Antibiotics to Fight Resistant Bacteria - India Education Diary", "description": "Each year, more than five million people worldwide die as a result of bacteria that are resistant to most common antibiotics. New antibiotics are urgently needed to ensure that bacterial infections in patients can still be treated successfully. “Unfo", "url": "https://indiaeducationdiary.in/experts-develop-antibiotics-to-fight-resistant-bacteria/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/Artikelbild_iStock-1131003688_Manjurul-1024x576.jpg", "publishedAt": "2023-06-23T17:09:06Z", "content": "Each year, more than five million people worldwide die as a result of bacteria that are resistant to most common antibiotics. New antibiotics are urgently needed to ensure that bacterial infections i… [+3218 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "10 Healthy Indian snacks for effective weight loss - Recipes", "description": "​Indian snacks are often considered heavy and oily. Let us break the myth and you can always swear by these 10 Indian healthy snacks that are packed with nutrition, use less or zero oil, and keep you full for a longer duration, and thus contribute to effectiv…", "url": "https://recipes.timesofindia.com/web-stories/10-healthy-indian-snacks-for-effective-weight-loss/photostory/101220948.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101220960,imgsize-95470,width-900,height-1200,resizemode-6/101220960.jpg", "publishedAt": "2023-06-23T16:30:00Z", "content": "Pressure cook 1 cup broccoli, 1 cup cabbage, 1 cup cauliflower, 1 carrot, 1 capsicum, 1 cup beans, 1 cup peas, and 1 cup beetroot with some salt. Let them cool and blend into a puree. Heat 1 tsp oil … [+162 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals treatment for opioid use disorder varies widely among states - ThePrint", "description": "Washington [US], June 23 (ANI): Despite a national opioid overdose epidemic supercharged by an increase in illegal fentanyl, new research from Oregon Health & Science University indicates significant disparities in properly treating opioid use disorder among …", "url": "https://theprint.in/health/study-reveals-treatment-for-opioid-use-disorder-varies-widely-among-states/1640063/", "urlToImage": null, "publishedAt": "2023-06-23T16:16:22Z", "content": "Washington [US], June 23 (ANI): Despite a national opioid overdose epidemic supercharged by an increase in illegal fentanyl, new research from Oregon Health &amp; Science University indicates signifi… [+2327 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New Study Images Adaptive Immune Systems At Work In Fish - India Education Diary", "description": "A new study from researchers at the University of Wisconsin–Madison offers a first-of-its-kind visual of a non-mammal species’ adaptive immune system in action. The advance holds potential implications for a range of scientific aims, from improving w", "url": "https://indiaeducationdiary.in/new-study-images-adaptive-immune-systems-at-work-in-fish/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/Peduncle-with-scale-775x615-1.jpg", "publishedAt": "2023-06-23T16:08:54Z", "content": "A new study from researchers at the University of WisconsinMadison offers a first-of-its-kind visual of a non-mammal species adaptive immune system in action. The advance holds potential implications… [+4904 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Tanisha Salwan", "title": "6 Healthy Keto Snacks To Try: Dark Chocolate, Hummus And More - Slurrp", "description": "Keto diet is the most convenient and great way to lose weight. This diet can give significant results for weight loss, but many people go through a hard time dealing with their sugar cravings. So, what to do? Instead of eating sugar, why don’t you try these h…", "url": "https://www.slurrp.com/article/6-healthy-keto-snacks-to-try-dark-chocolate-hummus-and-more-1687535916558", "urlToImage": "https://images.slurrp.com/prodarticles/a35ayucvr9m.webp", "publishedAt": "2023-06-23T16:06:42Z", "content": "Here are 6 healthy snacks that you can have to satisfy your sugar cravings during your keto diet. Have a look: \r\nIf you are on a keto diet, give these snacks a try and let us know about your experien… [+2 chars]"}, {"source": {"id": null, "name": "GlobeNewswire"}, "author": "Idorsia Pharmaceuticals Ltd", "title": "New Phase 3 data with aprocitentan to be presented at the European Society of Hypertension Annual Meeting 2023 - GlobeNewswire", "description": "Allschwil, Switzerland – June 23, 2023  Idorsia Ltd (SIX: IDIA) today announced that further data for aprocitentan, Idorsia’s investigational dual......", "url": "https://www.globenewswire.com/news-release/2023/06/23/2693806/0/en/New-Phase-3-data-with-aprocitentan-to-be-presented-at-the-European-Society-of-Hypertension-Annual-Meeting-2023.html", "urlToImage": "https://ml-eu.globenewswire.com/Resource/Download/bb724119-468d-4b1d-8206-3c2175d07f2b", "publishedAt": "2023-06-23T15:45:00Z", "content": "Allschwil, Switzerland June 23, 2023\r\nIdorsia Ltd (SIX: IDIA) today announced that further data for aprocitentan, Idorsias investigational dual endothelin receptor antagonist evaluating the treatment… [+5527 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Akira kyan, Minoru Takakura", "title": "Study examines COVID-19's impact on socioeconomic inequality in health behaviors among Japanese adolescents - Medical Xpress", "description": "A study, led by Assistant Professor Kyan Akira (Kyoto University and Kobe University) and Professor Takakura Minoru (University of the Ryukyus), found for the first time that the socioeconomic inequality in achieving recommended physical activity levels among…", "url": "https://medicalxpress.com/news/2023-06-covid-impact-socioeconomic-inequality-health.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/covid-19s-impact-on-so.jpg", "publishedAt": "2023-06-23T15:40:55Z", "content": "A study, led by Assistant Professor Kyan Akira (Kyoto University and Kobe University) and Professor Takakura Minoru (University of the Ryukyus), found for the first time that the socioeconomic inequa… [+5395 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Optical Illusion: Can you spot the camouflaged turtle in this image before we reveal the answer? - Indiatimes.com", "description": "This image features a turtle that is challenging to spot, hidden in a sink full of sand. It has effective camouflage as its shell blends in with the s", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/can-you-spot-the-camouflaged-turtle-in-this-image-before-we-reveal-the-answer/articleshow/101162985.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101162985,width-1070,height-580,imgsize-45834,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-23T15:30:00Z", "content": "Optical Illusion: Find the odd letter in this image in 10 secondsThe optical illusion is a challenging puzzle that requires excellent visual perception and pattern recognition skills. Experts in patt… [+165 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "News Track", "title": "These are the reasons why your belly fat is increasing - News Track English", "description": "The majority of people today are becoming obese as a result of their constantly declining lifestyles. A number of serious diseases can be brought on by obesity. It is crucial to quickly take control of such a situation. However, some of our habits are the pri…", "url": "https://english.newstracklive.com/news/reasons-for-belly-fat-these-habits-increase-your-belly-fat-improve-them-today-sc25-nu228-ta292-1281611-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/travel-news/Jun/23/big_thumb/belly_6495844fe6a4f.png", "publishedAt": "2023-06-23T15:12:31Z", "content": "The majority of people today are becoming obese as a result of their constantly declining lifestyles. A number of serious diseases can be brought on by obesity. It is crucial to quickly take control … [+2071 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Study Shows Anticoagulant Does Not Increase Live Birth Rate In Patients With Inherited Blood Clotting And Recurrent Miscarriage - India Education Diary", "description": "A medication commonly prescribed pregnant patients with an inheritable blood clotting condition and a history of recurrent miscarriage does not help to reduce their miscarriage risk, a new international study led by UK researchers and funded by the N", "url": "https://indiaeducationdiary.in/study-shows-anticoagulant-does-not-increase-live-birth-rate-in-patients-with-inherited-blood-clotting-and-recurrent-miscarriage/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/University-of-Warwick-new-007-1.jpg", "publishedAt": "2023-06-23T14:58:49Z", "content": "A medication commonly prescribed pregnant patients with an inheritable blood clotting condition and a history of recurrent miscarriage does not help to reduce their miscarriage risk, a new internatio… [+3628 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Indian experts vouch for benefits of low-calorie sweeteners in moderation - Daijiworld.com", "description": "New Delhi, Jun 23 (IANS): Intake of low-calorie sweeteners or no-calorie alternatives to sugars, known as non-sugar sweeteners (NSS), in moderation, may not cause harm in people with diabetes, according to health experts.\r\nNSS are generally marketed as aiding…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1093307", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-06-23T14:58:06Z", "content": "New Delhi, Jun 23 (IANS): Intake of low-calorie sweeteners or no-calorie alternatives to sugars, known as non-sugar sweeteners (NSS), in moderation, may not cause harm in people with diabetes, accord… [+3205 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Magdeburg researchers discover a new mechanism of cancer immune defense - EurekAlert", "description": "An interdisciplinary team of researchers at the Otto-von-Guericke University in Magdeburg has gained new insights into how inflammatory mediators of pathogen defense can remotely drive cancer cells into death - an important contribution to improving cancer im…", "url": "https://www.eurekalert.org/news-releases/992955", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/7fff2c5c-8e1e-4909-8156-a1e6aa6bc109/Rendition/thumbnail/Content/Public", "publishedAt": "2023-06-23T13:00:09Z", "content": "image: Magdeburg researchers discover a new mechanism of cancer immune defense. The photo shows the authors at microscope. Front left: Bastian Kruse; front right: Dr. Anthony Buzzai; Back left: Prof.… [+4013 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Is Makhana Good For Diabetics? Here's What You Should Know - NDTV Food", "description": "Diabetes Diet: Makhana comes with several health benefits, but what about blood sugar control? Find out more below.", "url": "https://food.ndtv.com/diabetes/is-makhana-good-for-diabetics-heres-what-you-should-know-4147064", "urlToImage": "https://c.ndtvimg.com/2023-06/9b07qcfg_makhana_625x300_23_June_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-06-23T12:46:57Z", "content": "People suffering from diabetes face a lot of restrictions in terms of food, right? Following such a strict diet is never easy. It feels like you have to give up on everything yummy and satisfying. Bu… [+3680 chars]"}, {"source": {"id": null, "name": "Theeverygirl.com"}, "author": "Christina Herbst", "title": "5 Ways To Maintain Your Health Goals This Summer - The Everygirl", "description": "healthy girl summer has arrived", "url": "http://theeverygirl.com/maintain-health-goals-during-summer/", "urlToImage": "https://media.theeverygirl.com/wp-content/uploads/2023/06/Health-Goals-The-Everygirl-1-1.png", "publishedAt": "2023-06-23T12:30:08Z", "content": "The Everygirls product selections are curated by the editorial team. If you buy something through our links, we may earn an affiliate commission, at no cost to you. We only recommend products we genu… [+4822 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5 health tests to take after turning 50 - Indiatimes.com", "description": "These medical tests should not be avoided if you have turned 50 or above.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/5-health-tests-to-take-after-turning-50/photostory/101216654.cms", "urlToImage": "https://static.toiimg.com/photo/101216660.cms", "publishedAt": "2023-06-23T12:30:00Z", "content": "A complete cholesterol test measures four types of lipids, or fats, in your blood. The test is used to determine the total amount of cholesterol in the blood, low-density lipoprotein (LDL) cholestero… [+188 chars]"}, {"source": {"id": null, "name": "Cochrane.org"}, "author": null, "title": "Birth control pills with drospirenone for treating premenstrual syndrome - Cochrane", "description": null, "url": "https://www.cochrane.org/CD006586/MENSTR_birth-control-pills-drospirenone-treating-premenstrual-syndrome", "urlToImage": "https://www.cochrane.org/sites/all/themes/zen_cochrane/images/cochrane_logo_400.jpg", "publishedAt": "2023-06-23T12:27:13Z", "content": "We included five RCTs (858 women analysed, most diagnosed with PMDD). The evidence was very low to moderate quality; the main limitations were serious risk of bias due to poor reporting of study meth… [+2296 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Picking the right sunscreen this season - CBS New York", "description": "It's officially the first weekend of summer and while our weather forecast may look gloomy, it's still a good time to talk about summer sun safety. Dr. Ellen...", "url": "https://www.youtube.com/watch?v=9Aj7hgPKy_k", "urlToImage": "https://i.ytimg.com/vi/9Aj7hgPKy_k/maxresdefault.jpg", "publishedAt": "2023-06-23T12:12:05Z", "content": null}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Skin Diseases: Treatment Options For Vitiligo Or Leucoderma | TheHealthSite.com - TheHealthSite", "description": "In recent years numerous treatments have come up for the treatment of vitiligo which involve topical prescriptions surgical and laser procedures as well as home remedies. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/what-are-the-treatment-options-for-vitiligo-987449/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/Vitiligo.jpg", "publishedAt": "2023-06-23T11:42:00Z", "content": "Vitiligo can be treated effectively in the primary stage. If you ever notice a white patch or skin discoloration, immediately consult a skin specialist.\r\nVitiligo, commonly referred to as Leucoderma,… [+4839 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Manya Singh", "title": "Women Are At A Higher Risk Of Bone Density Loss Due To Menopause; Follow These Tips To Lower Risk - NDTV Doctor", "description": "By taking these steps, women can maintain strong bones and reduce their risk of osteoporosis and fractures.", "url": "https://doctor.ndtv.com/womens-health/women-are-at-a-higher-risk-of-bone-density-loss-due-to-menopause-follow-these-tips-to-lower-risk-4146775", "urlToImage": "https://c.ndtvimg.com/2022-11/jngoe4j8_foods-for-joint-pain_625x300_01_November_22.jpg", "publishedAt": "2023-06-23T11:37:17Z", "content": "Women are at a higher risk of bone density loss due to menopause. This is because oestrogen, a hormone that helps to protect bones, decreases significantly during menopause. Oestrogen helps to regula… [+3739 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "DC Correspondent", "title": "Boost Your Monsoon Health: Essential Diet Changes for a Vibrant Season - Deccan Chronicle", "description": "Boost Your Monsoon Health: Essential Diet Changes for a Vibrant Season", "url": "https://www.deccanchronicle.com/lifestyle/health-and-wellbeing/230623/boost-your-monsoon-health-essential-diet-changes-for-a-vibrant-season.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-m9vjec4i27mbd8t92rr1fvhcm5-20230327124602.Medi.jpeg", "publishedAt": "2023-06-23T11:08:15Z", "content": null}, {"source": {"id": null, "name": "Mirchi.in"}, "author": "Palak Agarwal", "title": "7 Diet mistakes that are preventing you from losing weight - Mirchi Plus", "description": "Diet plays a major role in weight loss and when on a weight loss journey, here are 7 mistakes that you might be making related to your diet that are preventing you from getting results.", "url": "https://mirchi.in/stories/lifestyle/7-diet-mistakes-that-are-preventing-you-from-losing-weight/101218165", "urlToImage": "https://static.mirchi.in/thumb/imgsize-30366,msid-101218165,width-800,height-450,resizemode-1/101218165.jpg", "publishedAt": "2023-06-23T11:06:49Z", "content": "Weight loss\r\n is no joke. It is a challenging journey that requires a lot of focus and discipline. While many factors contribute to weight loss, one of the major factors is your diet\r\n. After all, yo… [+3419 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Should we worry about the foamy substance released while cooking dals - Indiatimes.com", "description": "While cooking lentils in an open pot, it often happens that when they boil they leave soap-like foam residue on top and if experts are to be believed, they should be removed as they are not healthy.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/should-we-worry-about-the-foamy-substance-released-while-cooking-dals/photostory/101218118.cms", "urlToImage": "https://static.toiimg.com/photo/101218151.cms", "publishedAt": "2023-06-23T11:00:34Z", "content": "The soapy foam found while boiling chicken is known as scum. It is an impurity and consists of coagulated proteins coming from any residual meat on the bones. And as per experts, it is in no way harm… [+189 chars]"}, {"source": {"id": null, "name": "Newsdrum.in"}, "author": "NewsDrum Desk", "title": "Y chromosome loss in men with age linked with worse cancer outcomes - NewsDrum", "description": "Loss of Y chromosome in cells, which happens as men age, enables cancer cells evade their immune system, hampering their ability to fight cancer, new research ...", "url": "https://www.newsdrum.in/national/y-chromosome-loss-in-men-with-age-linked-with-worse-cancer-outcomes", "urlToImage": "https://img-cdn.thepublive.com/fit-in/1200x627/newsdrum-in/media/media_files/EwraRcLNcBa6fCcdTZh1.jpg", "publishedAt": "2023-06-23T10:45:46Z", "content": "New Delhi: Loss of Y chromosome in cells, which happens as men age, enables cancer cells evade their immune system, hampering their ability to fight cancer, new research published in the journal Natu… [+3265 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Hallucinations, delusions, and suicidal thoughts: Hidden signs of schizophrenia - Indiatimes.com", "description": "Here are some signs and symptoms of schizophrenia that you must recognize in the early stage", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/hallucinations-delusions-and-suicidal-thoughts-hidden-signs-of-schizophrenia/photostory/101216252.cms", "urlToImage": "https://static.toiimg.com/photo/101216276.cms", "publishedAt": "2023-06-23T10:30:00Z", "content": "Schizophrenia is one of the severe mental disorders, which is often ‘labelled’ in the society. It is one among the most disabling and economically burdening diseases as it mostly affects young adults… [+1271 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Women with common cardiac rhythm disorders have quicker cognitive deterioration than males: Study - Devdiscourse", "description": "The Journal of the Alzheimer's Association, women with atrial fibrillation progress more quickly to cognitive impairment and dementia than men with the heart rhythm condition.", "url": "https://www.devdiscourse.com/article/health/2498772-women-with-common-cardiac-rhythm-disorders-have-quicker-cognitive-deterioration-than-males-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/23_06_2023_09_50_24_5685146.jpg?width=920&format=jpeg", "publishedAt": "2023-06-23T09:50:26Z", "content": "According to research presented at ACNAP 2023, a scientific congress of the European Society of Cardiology (ESC)1 and published in Alzheimer's and Dementia: The Journal of the Alzheimer's Association… [+4708 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Six steps to radiant skin - Ahmedabad Mirror", "description": "Six steps to radiant skin", "url": "https://www.ahmedabadmirror.com/six-steps-to-radiant-skin/81858706.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1687460368352.jpg-org", "publishedAt": "2023-06-23T09:40:41Z", "content": "The constantly changing weather – intense heat, high humidity levels and sudden downpours – make most of us want to protect and nourish our skin. When it gets hot and humid, our skin can get super pa… [+2399 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Signs and symptoms of sun-related eye damage - Daijiworld.com", "description": "By IANSlife\r\nNew Delhi, Jun 23 (IANSlife): When basking in the warm glow of the sun, it's easy to forget that our eyes are susceptible to damage from its powerful rays. Prolonged exposure to sunlight (UV rays) without proper protection can lead to a range of …", "url": "https://www.daijiworld.com/index.php/news/newsDisplay?newsID=1093194", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/sharmila_230623_eyes.jpg", "publishedAt": "2023-06-23T09:31:15Z", "content": "By IANSlife\r\nNew Delhi, Jun 23 (IANSlife): When basking in the warm glow of the sun, it's easy to forget that our eyes are susceptible to damage from its powerful rays. Prolonged exposure to sunlight… [+4211 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Tricky signs of a heart attack: Know what are the early symptoms and when it is a medical emergency - Indiatimes.com", "description": "​Heart diseases claim close to 18 million lives every year, the World Health Organisation (WHO) says. Of these alarming numbers of deaths due to heart diseases, 85% are due to heart attack and stroke. Close to 40% of premature deaths, which means the deaths t…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/tricky-signs-of-a-heart-attack-know-what-are-the-early-symptoms-and-when-it-is-a-medical-emergency/photostory/101212555.cms", "urlToImage": "https://static.toiimg.com/photo/101212612.cms", "publishedAt": "2023-06-23T08:30:00Z", "content": "Heart diseases claim close to 18 million lives every year, the World Health Organisation (WHO) says. Of these alarming numbers of deaths due to heart diseases, 85% are due to heart attack and stroke.… [+133 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Long COVID can affect quality of life worse than advanced cancer, stroke and Parkinson’s disease, study suggests - Times of India", "description": "A study suggests that the quality of life for individuals with long COVID may be worse than that of patients with advanced cancer, stroke, or Parkinson's disease. Fatigue was identified as the most significant symptom affecting daily life. The study highlight…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-long-covid-can-affect-quality-of-life-worse-than-advanced-cancer-stroke-and-parkinsons-disease-study-suggests/photostory/101211406.cms", "urlToImage": "https://static.toiimg.com/photo/101211450.cms", "publishedAt": "2023-06-23T07:30:00Z", "content": "The study co-author Prof William Henley, of Exeter University medical school, said, “Long COVID is an invisible condition, and many people are left trying to manage significant changes to how they ca… [+374 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Tavishi Dogra", "title": "PCOS And Pregnancy: Understanding The Link And How To Manage It | TheHealthSite.com - TheHealthSite", "description": "Women with PCOS must work closely with their healthcare providers to treat their disease and monitor potential problems. TheHealthSite.com", "url": "https://www.thehealthsite.com/pregnancy/pcos-and-pregnancy-understanding-the-link-and-how-to-manage-it-987424/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2018/01/Pregnancy-PCOS-THS-1.jpg", "publishedAt": "2023-06-23T07:26:00Z", "content": "Women with PCOS must work closely with their healthcare providers to treat their disease and monitor potential problems.\r\nPCOS (Polycystic Ovarian Syndrome) is a hot-button issue, making headlines, a… [+3763 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Perioperative Management of Emergency Craniotomes in Children With Cyanotic Congenital Heart Disease: A Case Series - Cureus", "description": "While congenital heart disease is not uncommon, cyanotic congenital heart disease (CCHD) accounts for a minor fraction of them. However, when cyanosis is present, it usually indicates a severe or critical illness. Tetralogy of Fallot (TOF) is one of the commo…", "url": "https://www.cureus.com/articles/164769-perioperative-management-of-emergency-craniotomes-in-children-with-cyanotic-congenital-heart-disease-a-case-series?score_article=true", "urlToImage": "https://assets.cureus.com/uploads/figure/file/656263/article_river_e6053180091411ee84a891393b38483d-Figure-1.png", "publishedAt": "2023-06-23T07:12:28Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "Sanskritiias.com"}, "author": "Sanskriti IAS", "title": "Tackling the diabetes burden - Sanskriti IAS", "description": "The long-term (2008-2020) study on metabolic factors in the Indian subcontinent as part of the ICMR-InDiab study estimated the country’s NCD (chronic non-communicable diseases) burden.", "url": "https://www.sanskritiias.com/current-affairs/tackling-the-diabetes-burden", "urlToImage": "https://www.sanskritiias.com/frontview/assets/images/sanskriti-logo.png", "publishedAt": "2023-06-23T06:19:59Z", "content": "(MainsGS3:Welfare schemes for vulnerable sections of the population by the Centre and States and the performance of these schemes)\r\nContext:\r\n<ul><li>The long-term (2008-2020) study on metabolic fact… [+2523 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN", "title": "Climate change leads to growing risk of mosquito-borne viral diseases, EU agency says - CGTN", "description": "European Union officials warned Thursday there is a growing risk of mosquito-borne viral diseases such as dengue and chikungunya in Europe due to climate change.", "url": "https://news.cgtn.com/news/2023-06-23/Climate-change-leads-to-growing-risk-of-mosquito-borne-viral-diseases-1kRNAAUlf3O/index.html", "urlToImage": "https://news.cgtn.com/news/2023-06-23/Climate-change-leads-to-growing-risk-of-mosquito-borne-viral-diseases-1kRNAAUlf3O/img/4326d572634b4662b8f249981b964c9d/4326d572634b4662b8f249981b964c9d-750.png", "publishedAt": "2023-06-23T06:06:02Z", "content": "European Union officials warned Thursday there is a growing risk of mosquito-borne viral diseases such as dengue and Chikungunya in Europe due to climate change.\r\nThe European Center for Disease Prev… [+3131 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "WHO Prepares for Surge in Mosquito-Borne Diseases Amid El Niño | Weather.com - The Weather Channel", "description": "El Niño could lead to new temperature records, particularly in areas that already experience above-average temperatures during El Niño.", "url": "https://weather.com/en-IN/india/health/news/2023-06-23-who-prepares-for-surge-in-mosquito-borne-diseases-amid-arrival-of-el", "urlToImage": "https://s.w-x.co/in-mosquito_breeding_0.jpg", "publishedAt": "2023-06-23T05:46:47Z", "content": "With the ocean-warming phenomenon of El Niño officially here, the World Health Organization (WHO) has said that it is preparing for an increased spread of viral diseases like dengue, Zika and chikung… [+1208 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Vitamin B12 deficiency: Uncommon symptoms that indicate low levels of vitamin B12 - Indiatimes.com", "description": "​Our body needs 2.4 micrograms of vitamin B12 on a daily basis to perform important functions like the synthesis of nerves, DNA, and red blood cells. Our body can't produce vitamin B12 of its own for performing these functions hence the requirements needs to …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/vitamin-b12-deficiency-uncommon-symptoms-that-indicate-low-levels-of-vitamin-b12/photostory/101207847.cms", "urlToImage": "https://static.toiimg.com/photo/101207899.cms", "publishedAt": "2023-06-23T05:30:00Z", "content": "Our body needs 2.4 micrograms of vitamin B12 on a daily basis to perform important functions like the synthesis of nerves, DNA, and red blood cells. Our body can't produce vitamin B12 of its own for … [+263 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Effect of Dietary Modification and Physical Activity on Obese Young Adults Going to Gym for Weight Loss in Central India: A Before and After Study - Cureus", "description": "Background: An adequate diet is a prerequisite for appropriate growth and development so as to remain active. Balanced nutrition coupled with physical activity forms a healthy lifestyle which eventually leads to multiple health benefits such as positive menta…", "url": "https://www.cureus.com/articles/146065-effect-of-dietary-modification-and-physical-activity-on-obese-young-adults-going-to-gym-for-weight-loss-in-central-india-a-before-and-after-study", "urlToImage": "https://assets.cureus.com/uploads/figure/file/583600/article_river_e8eb7f50116911eea4478dcbb2d0ddc9-Fig-1.png", "publishedAt": "2023-06-23T04:52:14Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Jyoti", "title": "Foods To Eat Before And After Yoga: 5 Things To Stay Healthy - HerZindagi", "description": "Yoga plays an important role in healthy living and so does healthy food. It is necessary to eat healthy before and after yoga, one must keep a gap of 30-40 mins between yoga and eating.", "url": "https://www.herzindagi.com/web-stories/fitness/foods-to-eat-before-and-after-yoga-ws-13265", "urlToImage": "https://images.herzindagi.info/webstories/13265/social-media-image---3--1687496655.jpeg", "publishedAt": "2023-06-23T04:21:20Z", "content": "<ul>Yoga plays an important role in healthy living and so does healthy food. It is necessary to eat healthy before and after yoga, one must keep a gap of 30-40 mins between yoga and eating.</ul>\r\nHan… [+1196 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Trying to lose weight? 5 dry fruits that can help you with weight loss - Indiatimes.com", "description": "These dry fruits when included in your diet can help you lose weight and get fit soon.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/trying-to-lose-weight-5-dry-fruits-that-can-help-you-with-weight-loss/photostory/101187916.cms", "urlToImage": "https://static.toiimg.com/photo/101187959.cms", "publishedAt": "2023-06-23T01:30:00Z", "content": "In the present era, the world is recognizing the need for healthy eating like never before. Study has shown remarkable results can be achieved in weight management by incorporating dry fruits into th… [+1113 chars]"}, {"source": {"id": null, "name": "Optometrytimes.com"}, "author": "Mark W. Roark, OD, FAAO, Lynda Charters", "title": "AOA 2023: Nutritional strategies in dry eye disease: The importance of omaga-3s - Optometry Times", "description": "This 3-pronged approach for nutritional intervention to help maintain dry eye disease is in addition to a recommended dietary intake of daily oily fish.", "url": "https://www.optometrytimes.com/view/aoa-2023-nutritional-strategies-in-dry-eye-disease-the-importance-of-omaga-3s", "urlToImage": "https://cdn.sanity.io/images/undefined/undefined/2cd740f3d107d979b63ab73303ec7a44160a1b66-1200x800.jpg?fit=crop&auto=format", "publishedAt": "2023-06-23T00:11:54Z", "content": "Reviewed by Mark W. Roark, OD, FAAO\r\nMark Roark, OD, FAAO, presented multiple lines of evidence for use of omega-3s to treat dry eye disease (DED) at the 2023 Optometrys Meeting, hosted by the Americ… [+6593 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Lisa O’Mary", "title": "Hairy Moles May Contain the Cure for Baldness: Study - WebMD", "description": "Researchers may have discovered the elusive cure to baldness in an unlikely place: those unsightly hairs that sometimes grow out of skin moles.", "url": "https://www.webmd.com/skin-problems-and-treatments/hair-loss/news/20230622/hairy-moles-may-contain-cure-baldness-study", "urlToImage": "https://img.wbmdstatic.com/vim/live/webmd/consumer_assets/site_images/logos/webmd/web/webmd-logo-fb.jpg", "publishedAt": "2023-06-22T17:03:51Z", "content": "June 22, 2023 Researchers may have discovered the elusive cure to baldness in an unlikely place: those unsightly hairs that sometimes grow out of skin moles.\r\nResearchers found that a specific molecu… [+1928 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Genetic mutations direct immune defences in leukaemia linked rare bone marrow disorder: Study - TheNewsMill", "description": "A discovery that may result in novel medicines to halt or reverse the disease could be beneficial to patients with a rare genetic bone marrow problem who are at an elevated risk of blood malignancies. Researchers from the Universities of Birmingham and Warwic…", "url": "https://thenewsmill.com/2023/06/genetic-mutations-direct-immune-defences-in-leukaemia-linked-rare-bone-marrow-disorder-study/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=107788&object_id=107788&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F06%252Fgenetic-mutations-direct-immune-defences-in-leukaemia-linked-rare-bone-marrow-disorder-study.jpg", "publishedAt": "2023-06-22T15:36:37Z", "content": null}, {"source": {"id": null, "name": "Thoracic.org"}, "author": null, "title": "ATS Quick Hits - American Thoracic Society", "description": "American Thoracic Society", "url": "https://www.thoracic.org/professionals/clinical-resources/quick-hits/nodules-nodules-more-to-it-than-meets-the-eye.php", "urlToImage": "/_files/images/logo/ats_lockup_horz_full_rgb.png", "publishedAt": "2023-06-22T14:59:30Z", "content": "Srikant Kashinath Malegaonkar, MDPost Graduate Institute of Medical Education and Research, ChandigarhA 60-year-old gentleman with well controlled type 2 diabetes mellitus presented to the clinic wit… [+4315 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nibedita Roy", "title": "Should you eat eggs in the summer? - Indiatimes.com", "description": "Fond of eggs? Should you eat or avoid eggs in summers? Here's all you need to know about it!", "url": "https://timesofindia.indiatimes.com/life-style/food-news/should-you-eat-eggs-in-the-summer/photostory/101194970.cms", "urlToImage": "https://static.toiimg.com/photo/101195068.cms", "publishedAt": "2023-06-22T14:44:00Z", "content": "Eggs have a warm potency, but are also loaded with nutrients such as \r\nIron, which helps in the formation of red blood cells and improves resistance and immunity. Apart from that, eggs are also rich … [+229 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Bacterial mediators of endometriosis - Nature.com", "description": "Endometriosis has long been understudied; now, research suggests that Fusobacterium infection may cause the condition — and that antibiotics could be used to treat it.", "url": "https://www.nature.com/articles/d41591-023-00057-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41591-023-00057-z/d41591-023-00057-z_25524012.jpg", "publishedAt": "2023-06-22T13:39:35Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study reveals how DNA test broaden access to cervical cancer screening - Devdiscourse", "description": "In low- and middle-income nations where the disease kills more than 3,00,000 women annually, Rice University bioengineers have demonstrated a low-cost, point-of-care DNA test for HPV infections that may make cervical cancer screening more accessible.", "url": "https://www.devdiscourse.com/article/science-environment/2497855-study-reveals-how-dna-test-broaden-access-to-cervical-cancer-screening", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_06_2023_13_34_56_1705363.jpg?width=920&format=jpeg", "publishedAt": "2023-06-22T13:34:59Z", "content": "In low- and middle-income nations where the disease kills more than 3,00,000 women annually, Rice University bioengineers have demonstrated a low-cost, point-of-care DNA test for HPV infections that … [+4537 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "'Low chance of controlling blood sugar levels' - DTNEXT", "description": "Researchers found people who develop diabetes after pregnancy were significantly less likely to be able to control it if they had gestational diabetes, especially if they were Black or Hispanic.", "url": "https://www.dtnext.in/lifestyle/wellbeing/low-chance-of-controlling-blood-sugar-levels-719851", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/22/742538-untitleddesign25.jpg", "publishedAt": "2023-06-22T13:01:50Z", "content": "WASHINGTON: Researchers found people who develop diabetes after pregnancy were significantly less likely to be able to control it if they had gestational diabetes, especially if they were Black or Hi… [+4435 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "studio18", "title": "Best Legal Steroids - Top Two Legal Steroids that really work - Firstpost", "description": "In addition to the difficulties posed by busy lifestyles, many find it difficult to build muscles.", "url": "https://www.firstpost.com/health-supplement/best-legal-steroids-top-two-legal-steroids-that-really-work-12774182.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/06/640x320-14.jpg", "publishedAt": "2023-06-22T12:40:56Z", "content": "Maintaining good health and building muscles can be challenging for many people. In today’s fast-paced and sedentary lifestyle, many often struggle to find the time and energy to prioritize their hea… [+29501 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": null, "title": "The sweet danger: Why sugar should be avoided - Khaleej Times", "description": "It’s in our favourite desserts, snacks, and even hidden in everyday foods like cereals and sauces. But here’s the problem: it's not just empty calories", "url": "https://www.khaleejtimes.com/lifestyle/wellness/the-sweet-danger-why-sugar-should-be-avoided", "urlToImage": "https://image.khaleejtimes.com?uuid=36e4e5bd-8a94-52d2-838b-f84c3d53127b&function=cropresize&type=preview&source=false&q=75&crop_w=0.99999&crop_h=0.85294&x=0&y=0&width=1200&height=675", "publishedAt": "2023-06-22T12:22:36Z", "content": "Its in our favourite desserts, snacks, and even hidden in everyday foods like cereals and sauces. But heres the problem: it's not just empty calories\r\nPublished: Thu 22 Jun 2023, 4:22 PM\r\nSugar, oh s… [+3445 chars]"}, {"source": {"id": null, "name": "Gizbot"}, "author": "Gizbot Bureau", "title": "Miracle Root Gummies Reviews [SCAM OR LEGIT?] Where to Buy G6 Keto Gummies & Must You Need to Know - Gizbot", "description": "Experience a positive transformation in your physical and mental wellbeing with regular use of Miracle Root Gummies. Read our full review to know all the details.", "url": "https://www.gizbot.com/partner-content/miracle-root-gummies-reviews-scam-or-legit-where-to-buy-g6-keto-gummies-must-you-need-to-know-086010.html", "urlToImage": "https://www.gizbot.com/img/1200x60x675/img/2023/06/miraclerootgummiesreviews1-1687429737.jpg", "publishedAt": "2023-06-22T10:59:45Z", "content": "Just like you, the vast majority of people have made a commitment to improve their health and shed excess weight. Despite their best efforts, the overwhelming majority of individuals struggling with … [+12433 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "varun keval", "title": "Hyderabad: Software professional goes natural way to control diabetes - Telangana Today", "description": "Mottamarri Sandeep adopted a natural approach, transforming his terrace into a flourishing garden of health.", "url": "https://telanganatoday.com/hyderabad-software-professional-goes-natural-way-to-control-diabetes", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2023/06/Software-professional-goes-natural-way-to-control-diabetes.jpg", "publishedAt": "2023-06-22T10:46:34Z", "content": null}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Tavishi Dogra", "title": "Prenatal Yoga: Secret Of A Healthy Pregnancy | TheHealthSite.com - TheHealthSite", "description": "A positive affirmation throughout pregnancy and labour is essential and yoga helps teach this as a lifestyle. TheHealthSite.com", "url": "https://www.thehealthsite.com/pregnancy/prenatal-yoga-secret-of-a-healthy-pregnancy-987105/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/12/prenatal-yoga.jpeg", "publishedAt": "2023-06-22T10:12:00Z", "content": "Prenatal yoga is good for pregnant mothers to keep their overall health in check. But they should keep some dos and donts before incorporating it in their daily regime. \r\nA positive affirmation throu… [+4429 chars]"}, {"source": {"id": null, "name": "Punjabnewsexpress.com"}, "author": null, "title": "This smartphone works as a thermometer that accurately detect fevers - Punjab News Express", "description": "<p><strong>NEW YORK</strong>: Scientists including an Indian-origin professor have turned a smartphone into a thermometer that uses the phone's touchscreen and repurposes the existing battery temperature sensors to gather data that a machine learning model us…", "url": "https://www.punjabnewsexpress.com/technology/news/this-smartphone-works-as-a-thermometer-that-accurately-detect-fevers-213732", "urlToImage": "https://www.punjabnewsexpress.com/images/article/article213732.jpg", "publishedAt": "2023-06-22T08:52:06Z", "content": "NEW YORK: Scientists including an Indian-origin professor have turned a smartphone into a thermometer that uses the phone's touchscreen and repurposes the existing battery temperature sensors to gath… [+2553 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Compound Identified as a Promising Weapon Against HIV - Technology Networks", "description": "A research team has identified a molecular compound that activates latent HIV-1 in cells, showing promise for HIV treatments.", "url": "https://www.technologynetworks.com/drug-discovery/news/compound-identified-as-a-promising-weapon-against-hiv-375128", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/375128/compound-identified-as-a-promising-weapon-against-hiv-375128-640x360.jpg?cb=20230622", "publishedAt": "2023-06-22T08:37:35Z", "content": "Subscribe to Technology Networks daily newsletter, delivering breaking science news straight to your inbox every day.\r\nSubscribe for FREE"}, {"source": {"id": null, "name": "Zoomtventertainment.com"}, "author": "Kanakanjali Roy", "title": "8 Fruits That Are Good For Weight Loss - Zoom TV", "description": "Best Fruit For Weight Loss: From apples to kiwis, here are some of the best fruits for weight loss.", "url": "https://www.zoomtventertainment.com/web-stories/health/fruits-that-are-good-for-weight-loss/photostory/101186129.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101186154,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-06-22T08:12:12Z", "content": null}, {"source": {"id": null, "name": "Mims.com"}, "author": "Pank Jit Sin", "title": "Kidney cancer in children | Latest news for Doctors, Nurses and Pharmacists | Multidisciplinary - MIMS", "description": "Kidney cancer is a rare illness among children as it only makes up 7 percent of all childhood cancers. Among the subtypes of kidney cancer in children...", "url": "https://specialty.mims.com/topic/kidney-cancer-in-children-", "urlToImage": "https://pubmiddleware.mims.com/resource/image/F5A6987B-5690-4003-B0C8-B02900BDEB28/OriginalThumbnail/THUMBNAIL_Dr%20Eni%20Juraida%20Abdul%20Rahman.jpg", "publishedAt": "2023-06-22T01:11:48Z", "content": "Kidney cancer is a rare illness among children as it only makes up 7 percent of all childhood cancers. Among the subtypes of kidney cancer in children, Wilms tumour is the most prevalent form. These … [+5208 chars]"}]}