{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "TRT World"}, "author": "TRTWorld", "title": "Smartphone app could screen for neurological diseases through your eyes - TRT World", "description": "Neurological screening possibilities open up via smartphone app developed to measure pupil size to detect diseases.", "url": "https://www.trtworld.com/life/smartphone-app-could-screen-for-neurological-diseases-through-your-eyes-56846", "urlToImage": "https://cdni0.trtworld.com/w480/h270/q75/131197_LowRes_video_opening_frame_1651579447632.png", "publishedAt": "2022-05-03T12:20:26Z", "content": "Neurological screening possibilities open up via smartphone app developed to measure pupil size to detect diseases.\r\nHow would you like to screen yourself for Alzheimer’s disease, attention deficit h… [+4861 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Mystery liver disease kills three children in Indonesia - Medical Xpress", "description": "Three children in Indonesia have died from a mysterious liver disease, the country's health ministry said, raising to at least four the global death toll of a fatal ailment puzzling doctors from the US to Asia.", "url": "https://medicalxpress.com/news/2022-05-mystery-liver-disease-children-indonesia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/liver.jpg", "publishedAt": "2022-05-03T12:06:03Z", "content": "Three children in Indonesia have died from a mysterious liver disease, the country's health ministry said, raising to at least four the global death toll of a fatal ailment puzzling doctors from the … [+2555 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "228 probable unexplained cases of child hepatitis: WHO - Economic Times", "description": "As of May 1, at least 228 probable cases were reported to WHO from 20 countries, with over 50 additional cases under investigation,  WHO spokesman Tarik Jasarevic told reporters in Geneva.", "url": "https://economictimes.indiatimes.com/news/international/world-news/228-probable-unexplained-cases-of-child-hepatitis-who/articleshow/91286524.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91286522,width-1070,height-580,imgsize-112726,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-03T10:50:00Z", "content": "At least 228 probable cases of hepatitis of unknown origin in children have now been reported to the World Health Organization from 20 countries, the UN health agency said Tuesday.\r\n\"As of May 1, at … [+1380 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Covid: How To Know If You Are An Asymptomatic Coronavirus Carrier? Check 3 Facts | Mint - Mint", "description": "The severity level of Covid infection may depend on one's age, vaccination status and immunity acquired from previous infections.", "url": "https://www.livemint.com/news/india/covid-how-to-know-if-you-are-an-asymptomatic-coronavirus-carrier-check-3-facts-11651569736847.html", "urlToImage": "https://images.livemint.com/img/2022/05/03/600x338/Covid-testing_1651549355911_1651572705536.jpg", "publishedAt": "2022-05-03T10:13:30Z", "content": "Coronavirus can affect different individuals differently. For example, some may contract severe infections from the virus, for most the symptoms are mild to moderate, and others may be completely asy… [+2045 chars]"}, {"source": {"id": null, "name": "Sakshi.com"}, "author": "Sakshi Post", "title": "Studies Show Covid-Infected Pregnant Women Likely To Be At Risk Of Premature Birth - Sakshi Post", "description": "According to a new study, pregnant women who are infected with COVID may have a higher chance of giving birth...", "url": "https://english.sakshi.com/news/health-fitness/studies-show-covid-infected-pregnant-women-likely-be-risk-premature-birth-154511", "urlToImage": "https://english.sakshi.com/sites/default/files/article_images/2022/05/3/pregnantwoman-1651572310.jpg", "publishedAt": "2022-05-03T10:05:10Z", "content": "Health News: With concerns about COVID-19 resurfacing, several experts have pointed out that pregnant women are more likely to be hospitalised and admitted to the critical care unit (ICU) if they bec… [+2092 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Cognitive impairment from severe COVID-19 equivalent to 20 years of ageing, study finds - India Education Diary", "description": "Cognitive impairment as a result of severe COVID-19 is similar to that sustained between 50 and 70 years of age and is the equivalent to losing 10 IQ points, say a team of scientists from the University of Cambridge and Imperial College London.Cognit", "url": "https://indiaeducationdiary.in/university-of-cambridge-cognitive-impairment-from-severe-covid-19-equivalent-to-20-years-of-ageing-study-finds/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg", "publishedAt": "2022-05-03T10:03:56Z", "content": "Cognitive impairment as a result of severe COVID-19 is similar to that sustained between 50 and 70 years of age and is the equivalent to losing 10 IQ points, say a team of scientists from the Univers… [+5871 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Does a Vegetarian Diet Adversely Affect Children's Growth and Nutrition? - Technology Networks", "description": "A study of nearly 9,000 children found those who eat a vegetarian diet had similar measures of growth and nutrition compared to children who eat meat.", "url": "https://www.technologynetworks.com/applied-sciences/news/does-a-vegetarian-diet-adversely-affect-childrens-growth-and-nutrition-361154", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/361154/does-a-vegetarian-diet-adversely-affect-childrens-growth-and-nutrition-361154-640x360.jpg?cb=20220503", "publishedAt": "2022-05-03T09:10:01Z", "content": "A study of nearly 9,000 children found those who eat a vegetarian diet had similar measures of growth and nutrition compared to children who eat meat. The study, published in Pediatrics and led by re… [+3961 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Jessica Knibbs", "title": "High cholesterol: ‘Dietary pulse intake significantly reduces LDL levels’ – what to eat - Express", "description": "HIGH cholesterol symptoms are not often obvious and therefore requires careful monitoring and regular blood tests to stay on top of the matter. A diet rich in dietary pulses and beans has been shown to significantly lower your levels and keep the heart health…", "url": "https://www.express.co.uk/life-style/health/1604488/high-cholesterol-symptoms-diet-pulses-legumes-chickpeas-lower-levels", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/1604488_1.jpg", "publishedAt": "2022-05-03T08:49:47Z", "content": "In a study published in the Canadian Medical Association Journal, the effect of dietary pulse intake on established therapeutic lipid targets for cardiovascular risk reduction was investigated.\r\nThe … [+560 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Texas at Dallas: Sweat Sensor Makes Big Strides in Detecting Infection Indicators - India Education Diary", "description": "University of Texas at Dallas bioengineers in collaboration with EnLiSense LLC have designed a wearable sensor that can detect two key biomarkers of infection in human sweat, a significant step toward making it possible for users to receive early war", "url": "https://indiaeducationdiary.in/university-of-texas-at-dallas-sweat-sensor-makes-big-strides-in-detecting-infection-indicators/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-Texas-at-Dallas.jpg", "publishedAt": "2022-05-03T08:48:02Z", "content": "University of Texas at Dallas bioengineers in collaboration with EnLiSense LLC have designed a wearable sensor that can detect two key biomarkers of infection in human sweat, a significant step towar… [+2692 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": null, "title": "Here's how coronavirus may actually be getting more like flu - STAT - STAT", "description": "There are signs that the coronavirus — and our relationship to it — is shifting in subtle ways that make it more like seasonal flu than it was at the start of the pandemic.", "url": "https://www.statnews.com/2022/05/03/more-uniformly-infectious-more-treatable-more-genetically-predictable-how-coronavirus-is-getting-closer-to-flu/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2020/03/49534370233_a8f379728e_3k-1024x576.jpg", "publishedAt": "2022-05-03T08:40:35Z", "content": "Hours after a federal judge struck down the federal mask mandate covering air travel and other public transportation last month, Delta Airlines celebrated the move in a statement saying that Covid-19… [+11502 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Government compensates for farmers' loss as France faces its worst bird flu outbreak | WION - WION", "description": "France is facing its worst bird flu outbreak. About 1,400 sites in France have reported cases. The Government is compensating for farmers' loss.#France #Bird...", "url": "https://www.youtube.com/watch?v=LRWtn8gjqzo", "urlToImage": "https://i.ytimg.com/vi/LRWtn8gjqzo/maxresdefault.jpg", "publishedAt": "2022-05-03T08:21:57Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Scientists discovered the ideal amount of sleep in middle and old age - Tech Explorist", "description": "Too little or too much sleep is associated with poorer cognitive performance and mental health.", "url": "https://www.techexplorist.com/scientists-discovered-ideal-amount-sleep-middle-old-age/47081/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/sleep-emoji.jpg", "publishedAt": "2022-05-03T07:17:31Z", "content": "Sleep duration, mental problems, and dementia are all linked in older persons. However, the underlying genetic mechanisms and structural changes in the brain are unknown. It is thought that these sle… [+3216 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "COVID worsens asthma in children; booster after infection not as beneficial vs Omicron - ETHealthWorld", "description": "Asthma in children may worsen after an infection with the coronavirus, doctors warn.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-worsens-asthma-in-children-booster-after-infection-not-as-beneficial-vs-omicron/91280078", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91280078,imgsize-51908,width-1200,height-628,overlay-ethealthworld/covid-worsens-asthma-in-children-booster-after-infection-not-as-beneficial-vs-omicron.jpg", "publishedAt": "2022-05-03T07:15:00Z", "content": "The following is a summary of some recent studies on COVID-19. They include research that warrants further study to corroborate the findings and that has yet to be certified by peer review.COVID-19 w… [+3018 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Autism, ADHD and school absence are risk factors for self-harm: Study - The Week", "description": "Self-harm physically hurting yourself is common in young people, affecting about one in five teens by the age of 18. Only about one in eight self-harm episodes in teenagers are seen at hospital emergency departments. However, attending hospital for self-harm …", "url": "https://www.theweek.in/news/health/2022/05/03/autism--adhd-and-school-absence-are-risk-factors-for-self-harm--.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/2/10/Autism-ADHD-self-harm-child-shut.jpg", "publishedAt": "2022-05-03T06:24:31Z", "content": "Self-harm physically hurting yourself is common in young people, affecting about one in five teens by the age of 18.\r\nOnly about one in eight self-harm episodes in teenagers are seen at hospital emer… [+4856 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Climate change might fuel future zoonotic events, pandemics - News-Medical.Net", "description": "Researchers from Georgetown University have published research in the journal Nature, stimulating future zoonotic hotspots and projecting how climate change could affect these events.", "url": "https://www.news-medical.net/news/20220503/Climate-change-might-fuel-future-zoonotic-events-pandemics.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_712457_16515570509714074.jpg", "publishedAt": "2022-05-03T05:54:00Z", "content": "Coronavirus disease 2019 (COVID-19) is a zoonotic disease that spread from animals to humans. A great deal of media attention was paid when the pandemic was officially declared early in 2020, pointin… [+4490 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "PTI", "title": "Nanotechnology to use smartphone cameras to detect diseases instantly: How will it work - Latest News - Gadgets Now", "description": "Infectious diseases such as malaria remain a leading cause of death in many regions. This is partly because people there don't have access to medical diagnostic tools that can detect these diseases (along with a range of non-infectious diseases) at an early s…", "url": "https://www.gadgetsnow.com/tech-news/nanotechnology-to-use-smartphone-cameras-to-detect-diseases-instantly-how-will-it-work/articleshow/91279987.cms", "urlToImage": "https://static.toiimg.com/photo/91262712.cms", "publishedAt": "2022-05-03T05:38:00Z", "content": "Infectious diseases such as malaria remain a leading cause of death in many regions. This is partly because people there don't have access to medical diagnostic tools that can detect these diseases (… [+5105 chars]"}, {"source": {"id": null, "name": "Umassmed.edu"}, "author": null, "title": "Communicating science: Andrei Korostelev using structural biology to tackle antibiotic resistance - UMass Medical School", "description": "A recent survey of health care professionals showed nearly 60 percent of participants encountered patients whose infections didn’t respond to any antibiotic. Andrei Korostelev, PhD, says by studying the biology of bacterial cells, effective new antibiotics ca…", "url": "https://www.umassmed.edu/news/news-archives/2022/05/communicating-science-andrei-korostelev-using-structural-biology-to-tackle-antibiotic-resistance/", "urlToImage": "https://www.umassmed.edu/globalassets/umass-chan-news/top-story/korostelev-andre-660.jpg", "publishedAt": "2022-05-03T04:07:23Z", "content": "Andrei Korostelev, PhD, professor of RNA therapeutics, studies how bacteria can develop resistance to antibiotics, which has become a problem in treating infection.\r\n“Antibiotic resistance may cause … [+2238 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Magnetic therapy pioneered by NUS researchers enhances chemotherapy treatment of breast cancer - India Education Diary", "description": "Breast cancer is the leading cause of cancer-associated death for women worldwide. While chemotherapy is the mainstream treatment for breast cancer, more than 50% of women undergoing chemotherapy will experience at least one chemotherapy-related adve", "url": "https://indiaeducationdiary.in/magnetic-therapy-pioneered-by-nus-researchers-enhances-chemotherapy-treatment-of-breast-cancer/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2022-05-03T03:32:10Z", "content": "TRPC1 expression as a screening marker\r\nIn their recent study, the NUS team discovered that cancer cells that express high levels of TRPC1 a cancer-causing gene associated with various types of cance… [+1974 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Online misinformation negatively impacts COVID-19 vaccination campaign, study shows - News-Medical.Net", "description": "Online misinformation has negatively impacted the US COVID-19 vaccination campaign. This emerges from a study by Francesco Pierri, researcher at the Politecnico di Milano, in collaboration with Indiana University as part of the H2020 Periscope project, publis…", "url": "https://www.news-medical.net/news/20220502/Online-misinformation-negatively-impacts-COVID-19-vaccination-campaign-study-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2022-05-03T02:32:00Z", "content": "Online misinformation has negatively impacted the US COVID-19 vaccination campaign. This emerges from a study by Francesco Pierri, researcher at the Politecnico di Milano, in collaboration with India… [+2946 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A “less is more” method may prevent antibiotic overuse in pediatric intensive care unit patients - News-Medical.Net", "description": "When a patient in the pediatric intensive care unit (PICU) develops a fever, physicians often routinely order a blood culture to identify the cause, particularly if they have reason to worry about sepsis, a life-threatening condition that occurs when chemical…", "url": "https://www.news-medical.net/news/20220502/A-e2809cless-is-moree2809d-method-may-prevent-antibiotic-overuse-in-pediatric-intensive-care-unit-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/pill_antibiotics-620x480.jpg", "publishedAt": "2022-05-03T02:21:00Z", "content": "When a patient in the pediatric intensive care unit (PICU) develops a fever, physicians often routinely order a blood culture to identify the cause, particularly if they have reason to worry about se… [+7446 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New highly infectious COVID-19 subvariant recorded in Victoria | Coronavirus | 9 News Australia - 9 News Australia", "description": "Infectious diseases expert Professor Sanjaya Senanayake says a new COVID-19 Omicron subvariant known as BA.2.12.1, which was recently recorded in Victoria, i...", "url": "https://www.youtube.com/watch?v=3oMjNfH1oAs", "urlToImage": "https://i.ytimg.com/vi/3oMjNfH1oAs/maxresdefault.jpg", "publishedAt": "2022-05-03T00:54:05Z", "content": null}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "David Hamilton", "title": "A leading cause of blindness that you probably didn't know about - Global Circulate", "description": "“Damaged blood vessels may become blocked, meaning that parts of the retina become starved of oxygen and nutrients,” explains Associate Professor Peter van Wijngaarden, deputy director of the Centre for Eye Research Australia.This can spark the retin", "url": "https://globalcirculate.com/a-leading-cause-of-blindness-that-you-probably-didnt-know-about/", "urlToImage": null, "publishedAt": "2022-05-02T23:25:08Z", "content": "“Damaged blood vessels may become blocked, meaning that parts of the retina become starved of oxygen and nutrients,” explains Associate Professor Peter van Wijngaarden, deputy director of the Centre … [+3292 chars]"}, {"source": {"id": null, "name": "Chiang Rai Times"}, "author": "CTN News", "title": "Frequently Asked Questions About Type 1 Diabetes - CTN NEWS ", "description": "Type 1 diabetes is a health condition wherein the insulin-making cells present in the pancreas are destroyed by your immune system.", "url": "https://www.chiangraitimes.com/health/frequently-asked-questions-about-type-1-diabetes/", "urlToImage": "https://www.chiangraitimes.com/wp-content/uploads/2022/05/type-1-landing-page-SM.jpg", "publishedAt": "2022-05-02T23:06:44Z", "content": "Type 1 Diabetes: Maintaining blood sugar or glucose within an acknowledged healthy range will help boost your energy levels and prevent future health issues. However, according to Web MD, your sugar … [+5031 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Physician’s Briefing Staff", "title": "Survival Similar in Late, Early Diagnosed Neuroendocrine Neoplasms - HealthDay News", "description": "Patients diagnosed with neuroendocrine neoplasms during later periods did not appear to experience better overall survival compared with patients diagnosed at an earlier time. In a study of 3,431 patients, older age at diagnosis, male sex, and stage 4 disease…", "url": "https://consumer.healthday.com/survival-outcomes-assessed-for-patients-with-neuroendocrine-neoplasms-2657202346.html", "urlToImage": "https://consumer.healthday.com/res/avatars/default", "publishedAt": "2022-05-02T23:02:43Z", "content": "Patients diagnosed with neuroendocrine neoplasms during later periods did not appear to experience better overall survival compared with patients diagnosed at an earlier time. In a study of 3,431 pat… [+163 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Chaitanya Deshpande", "title": "Exhale myths, breathe easy with asthma - Times of India", "description": "It is a chronic (long-term) condition of the lungs, in which the airways become swollen, inflamed and clogged with mucus and fluid. Muscles surroundin", "url": "https://timesofindia.indiatimes.com/city/nagpur/exhale-myths-breathe-easy-with-asthma/articleshow/91271260.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91276106,width-1070,height-580,imgsize-31288,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-02T22:41:00Z", "content": "Exhale myths, breathe easy with asthma"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "An Observatory of young PLHIV - OI Canadian", "description": "In 2021, the UN Political Declaration on HIV explained that the goal was to: “End inequalities and take action to end AIDS by 2030”; on occasion, she reaffirmed the importance of youth leadership in t", "url": "https://oicanadian.com/an-observatory-of-young-plhiv/", "urlToImage": "https://seronet.info/sites/default/files/images/breve/onu_7.jpg", "publishedAt": "2022-05-02T22:37:54Z", "content": "In 2021, the UN Political Declaration on HIV explained that the goal was to: End inequalities and take action to end AIDS by 2030; on occasion, she reaffirmed the importance of youth leadership in th… [+2145 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study Shows British Patient Had COVID-19 for 505 Days - VOA Learning English", "description": "British researchers identified what they believe is the longest-known infection of COVID-19 on record.", "url": "https://learningenglish.voanews.com/a/study-shows-british-patient-had-covid-19-for-505-days/6546221.html", "urlToImage": "https://gdb.voanews.com/02210000-0aff-0242-549b-08da296505d5_cx0_cy3_cw0_w1200_r1.jpg", "publishedAt": "2022-05-02T21:55:13Z", "content": "British researchers say they have documented a case of a patient who had COVID-19 for 505 days. Experts say they think the case represents the longest infection of COVID-19 on record.\r\nThe research w… [+3001 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Shawn Radcliffe", "title": "First Case of Current H5 Strain of Bird Flu Detected in US: What to Know - Healthline", "description": "For the first time a person in the U.S. has developed the H5 strain of bird flu. The disease does not easily spread from person to person.", "url": "https://www.healthline.com/health-news/first-case-of-current-h5-strain-of-bird-flu-detected-in-us-what-to-know", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/05/ducks-in-the-wild-1200x628-facebook-1200x628.jpg", "publishedAt": "2022-05-02T21:50:55Z", "content": "<ul><li>A Colorado man working on a poultry farm tested positive for H5N1 avian influenza virus, but the risk to general public remains low.</li><li>The mans only symptom is fatigue, according to off… [+5526 chars]"}, {"source": {"id": null, "name": "Acpjournals.org"}, "author": null, "title": "Moderna COVID-19 vaccine was linked to myocarditis or myopericarditis at 28 d (4.2 events/100 000 persons) | Annals of Internal Medicine - Annals of Internal Medicine", "description": "Source Citation Husby A, Hansen JV, Fosbøl E, et al. SARS-CoV-2 vaccination and myocarditis or myopericarditis: population based cohort study. BMJ. 2021;375:e068665. 34916207", "url": "https://www.acpjournals.org/doi/10.7326/J22-0021", "urlToImage": "https://www.acpjournals.org/na101/home/literatum/publisher/acp/journals/covergifs/aim/cover.png", "publishedAt": "2022-05-02T21:50:09Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Newly identified drug can be used as oral treatment for diabetes: IIT Mandi study - The Indian Express", "description": "Researchers at IIT Mandi have identified a drug molecule that can be used to treat diabetes. A look at the current treatment, and the alternative.", "url": "https://indianexpress.com/article/explained/newly-identified-drug-can-be-used-as-oral-treatment-for-diabetes-iit-mandi-study-7898499/", "urlToImage": "https://images.indianexpress.com/2022/05/diabetes.jpg", "publishedAt": "2022-05-02T19:09:30Z", "content": "Researchers at IIT Mandi have identified a drug molecule that can be used to treat diabetes. The molecule, called PK2, is able to trigger the release of insulin by the pancreas, and can potentially b… [+3471 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "“The evolution towards less virulence is a persistent myth in virology” - OI Canadian", "description": "OLIVIER BALEZ Peter Markov is a medical epidemiologist and doctor of virology. He has studied the evolution of the hepatitis C virus, including the influence of colonial history and transatlantic slav", "url": "https://oicanadian.com/the-evolution-towards-less-virulence-is-a-persistent-myth-in-virology/", "urlToImage": "https://img.lemde.fr/2022/01/19/57/0/2400/1200/1440/720/60/0/147b60f_610485335-pns-6480710.jpg", "publishedAt": "2022-05-02T18:00:52Z", "content": "OLIVIER BALEZ\r\nPeter Markov is a medical epidemiologist and doctor of virology. He has studied the evolution of the hepatitis C virus, including the influence of colonial history and transatlantic sl… [+2980 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "WHO issues rapid communication on updated guidance for the treatment of drug-resistant tuberculosis - World Health Organization", "description": "<p><p><span style=\"text-decoration:underline;\"><a target=\"_blank\" href=\"https://www.who.int/publications-detail-redirect/WHO-UCN-TB-2022-2\">A rapid communication</a></span> released by the World Health Organization (WHO) Global Tuberculosis Programme has anno…", "url": "https://www.who.int/news/item/02-05-2022-who-issues-rapid-communication-on-updated-guidance-for-the-treatment-of-drug-resistant-tuberculosis", "urlToImage": null, "publishedAt": "2022-05-02T17:52:24Z", "content": "A rapid communication released by the World Health Organization (WHO) Global Tuberculosis Programme has announced upcoming updates to the guidance on the treatment of drug-resistant tuberculosis (DR-… [+2265 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "Long Covid: Two thirds of patients develop dysautonomia – symptoms to spot - Express", "description": "LONG Covid is the sustained experiencing of symptoms of the COVID-19 virus. Since the development of this condition in 2020, scientists have been finding out more about how it affects the human body. A new study has found two thirds of patients develop a spec…", "url": "https://www.express.co.uk/life-style/health/1604290/long-covid-dysautonomia-symptoms-chest-pain-dizziness-brain-fog", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/1604290_1.jpg", "publishedAt": "2022-05-02T17:37:55Z", "content": "Stanford University’s Dr Mitchell Miglis said of the study: “Identifying dysautonomia is long Covid is important because the autonomic nervous system plays a critical role in regulating immune functi… [+687 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "From warning signs to risks, 4 common myths about heart failure - DNA India", "description": "From warning signs to risks, 4 common myths about heart failure - Lack of knowledge about the condition have resulted in the creation of various myths.", "url": "https://www.dnaindia.com/health/photo-gallery-from-warning-signs-to-risks-4-common-myths-about-heart-failure-2950111", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/05/02/1679339-thu.jpg", "publishedAt": "2022-05-02T17:08:00Z", "content": "Fact: There are various signs of heart failure that one should be aware of, in addition to knowing risk factors such as family history and coexisting diseases that can make you more inclined to heart… [+349 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Cranberry Supplement, D-Mannose, and other OTC modalities | IJWH - Dove Medical Press", "description": "Assessing patient reliance on various over-the-counter modalities used for prevention of recurrent urinary tract infection after electrofulguration", "url": "https://www.dovepress.com/cranberry-supplement-d-mannose-and-other-otc-modalities-for-prevention-peer-reviewed-fulltext-article-IJWH", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-05-02T16:43:45Z", "content": "Introduction\r\nAn estimated 40% to 50% of women will experience at least one urinary tract infection (UTI) requiring antibiotic treatment in their lifetime, with an estimated annual cost to health car… [+25923 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Ask a Specialist: Stroke basics - KHON2 News", "description": "Did you know that every 40 seconds someone in the U.S. has a stroke? With May being National Stroke Awareness Month, it's a time to highlight the importance ...", "url": "https://www.youtube.com/watch?v=jIDeNr2qRmE", "urlToImage": "https://i.ytimg.com/vi/jIDeNr2qRmE/hqdefault.jpg", "publishedAt": "2022-05-02T16:37:12Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Sanjana Chawla", "title": "Why your head hurts and how to deal with it - Deccan Herald", "description": "Headaches can be a real nuisance, especially when you have a busy day ahead of you. They cause discomfort and distract the sufferer and disrupt their routine.", "url": "https://www.deccanherald.com/specials/why-your-head-hurts-and-how-to-deal-with-it-1105891.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/02/istock-956554528720-1-1105891-1651509633.jpg", "publishedAt": "2022-05-02T16:27:58Z", "content": "Headaches can be a real nuisance, especially when you have a busy day ahead of you. They cause discomfort and distract the sufferer and disrupt their routine.\r\nAccording to the World Health Organizat… [+3802 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 cases on the rise across the U.S. as hospitalizations remain low - Yahoo Finance", "description": "#COVID #COVID19 #coronavirus #YahooFinanceYahoo Finance reporter Anjalee Khemlani reports on the rise in COVID-19 cases across the U.S.Don't Miss: Valley of ...", "url": "https://www.youtube.com/watch?v=U8v7B2O5-9E", "urlToImage": "https://i.ytimg.com/vi/U8v7B2O5-9E/maxresdefault.jpg", "publishedAt": "2022-05-02T15:48:54Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "William A. Haseltine", "title": "Asthma Medication Points The Way To Drugs To Prevent And Treat Covid-19: Nsp1, A Novel Target - Forbes", "description": "Montelukast, an asthma drug, can bind to and block a crucial SARS-CoV-2 protein. This discovery sets the stage for a new class of antiviral drugs, designed to target and interfere with the virus' immunosuppressive tactics.", "url": "https://www.forbes.com/sites/williamhaseltine/2022/05/02/asthma-medication-points-the-way-to-drugs-to-prevent-and-treat-covid-19-nsp1-a-novel-target/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/626ff6a4b3a221695c47072a/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-05-02T15:42:33Z", "content": "Targeting Nsp1 with montelukast blocks a critical early step in SARS-CoV-2 replication.\r\nCREDIT: Mohammad Afsar \r\nTo survive and replicate inside our cells, a virus has to be able to adapt them to it… [+6760 chars]"}, {"source": {"id": null, "name": "Krishi Jagran"}, "author": "Shruti Kandwal", "title": "Get Amazing Skincare and Other Benefits By Adding Lychee to Your Diet - Krishi Jagran ", "description": "Litchi's vitamins and antioxidants can help protect your skin from free radical damage. It's the key to glowing, young skin.", "url": "https://krishijagran.com/health-lifestyle/get-amazing-skincare-and-other-benefits-by-adding-lychee-to-your-diet/", "urlToImage": "https://img.krishijagran.com/media/69033/ezgifcom-gif-maker-2.jpg", "publishedAt": "2022-05-02T15:32:43Z", "content": "Litchi's vitamins and antioxidants can help protect your skin from free radical damage.\r\nLychee or litchi was utilized as an edible form as well as an ingredient in ancient times for restoring damage… [+2420 chars]"}, {"source": {"id": null, "name": "EL PAÍS"}, "author": "Vittoria D’Alessio", "title": "Can we stay young and healthy longer by ‘cleaning’ our cells? - EL PAÍS in English", "description": "A group of researchers wants to find out if boosting this natural process, known as autophagy, can curb the debilitating diseases of old age", "url": "https://english.elpais.com/science-tech/2022-05-02/can-we-stay-young-and-healthy-longer-by-cleaning-our-cells.html", "urlToImage": "https://images.english.elpais.com/resizer/6bhKjZRUtWeJggvAhIyM8oREsa4=/1200x0/filters:focal(490x237:500x247)/cloudfront-eu-central-1.images.arcpublishing.com/prisa/LU6CHR2U3ZD5LH56JTJBOB466U.jpg", "publishedAt": "2022-05-02T15:27:00Z", "content": null}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Congenital Anomalies in Infant With Congenital Hypothyroidism: A Review of Pathogenesis, Diagnostic Options, and Management Protocols - Cureus", "description": "Thyroid hormones (TH) regulate growth, nervous system myelination, metabolism, and physiologic functions in nearly every organ system. Congenital hypothyroidism (CH) is one of the most common endocrinopathies in children and has potentially devastating neurol…", "url": "https://www.cureus.com/articles/93177-congenital-anomalies-in-infant-with-congenital-hypothyroidism-a-review-of-pathogenesis-diagnostic-options-and-management-protocols", "urlToImage": "https://assets.cureus.com/uploads/figure/file/363056/article_river_a29a7fe0bf3c11ec8f2ecba999d8a91f-Screen-Shot-2022-04-18-at-1.25.46-PM.png", "publishedAt": "2022-05-02T15:25:03Z", "content": "Thyroid hormones (TH) are necessary for energy metabolism, body temperature regulation, growth, bone production, and central nervous system maturation and are essential for proper growth and brain de… [+27211 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Researchers discover new function performed by nearly half of the cells in the brain - ThePrint", "description": "Massachusetts [US], May 2 (ANI): According to a new study at Tufts University, researchers have discovered a previously unknown function performed by a cell type that contains almost half of all cells in the brain. The findings of the research were published …", "url": "https://theprint.in/science/researchers-discover-new-function-performed-by-nearly-half-of-the-cells-in-the-brain/940151/", "urlToImage": null, "publishedAt": "2022-05-02T15:00:48Z", "content": "Massachusetts [US], May 2 (ANI): According to a new study at Tufts University, researchers have discovered a previously unknown function performed by a cell type that contains almost half of all cell… [+3881 chars]"}, {"source": {"id": null, "name": "Oprahdaily.com"}, "author": "Marielle Marlys", "title": "Gua Sha Facial Tools - How to Use, The Best Ones, And More - Oprah Mag", "description": "From a gua sha tool set to professional and authentic tools, these are the 12 best gua sha facial tools to smoothe and massage your skin.", "url": "https://www.oprahdaily.com/beauty/skin-makeup/g39850669/gua-sha-facial-tools/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/gua-sha-1651265327.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2022-05-02T14:34:21Z", "content": "If you have yet to see the trending gua sha tools on Instagram, allow us to properly introduce this beloved beauty technique. Despite its recent spike in popularity, gua sha is a centuries-old practi… [+3295 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "Covid: these people who could be the cause of the appearance of variants of the coronavirus - OI Canadian", "description": "How does SARS-CoV-2 evolve into various, increasingly contagious variants? A British study, which recently revealed that the longest infection lasted 505 days, suggests the role of immunocompromised p", "url": "https://oicanadian.com/covid-these-people-who-could-be-the-cause-of-the-appearance-of-variants-of-the-coronavirus-2/", "urlToImage": "https://images.midilibre.fr/api/v1/images/view/626fd381709c47329b26a2ef/large/image.jpg?v=1", "publishedAt": "2022-05-02T14:32:14Z", "content": "How does SARS-CoV-2 evolve into various, increasingly contagious variants? A British study, which recently revealed that the longest infection lasted 505 days, suggests the role of immunocompromised … [+1833 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Becky McCall", "title": "Neonatal Sepsis Morbidity, Mortality, High Worldwide - Medscape", "description": "Eighteen percent of newborns worldwide die of neonatal sepsis, and this is accompanied by high use of last-line antibiotics to overcome resistant infections.", "url": "https://www.medscape.com/viewarticle/973236", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220502_escherichia_coli_800x450.jpg", "publishedAt": "2022-05-02T14:30:51Z", "content": "LISBON, Portugal A shift toward broader-spectrum antibiotics and increasing antibiotic resistance has led to high levels of mortality and neurodevelopmental impacts in surviving babies, according to … [+9709 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Amid outbreak, 10-month-old baby is diagnosed with acute hepatitis - Play Crazy Game", "description": "Singapore health authorities have confirmed that a 10-month-old baby has contracted acute hepatitis. The symptoms are being investigated and compared with those already reported by other children who have had the disease in different parts of the world. The l…", "url": "https://playcrazygame.com/2022/05/02/amid-outbreak-10-month-old-baby-is-diagnosed-with-acute-hepatitis/", "urlToImage": "https://catracalivre.com.br/wp-content/uploads/2022/05/bebe-10-meses-hepatite.jpg", "publishedAt": "2022-05-02T14:28:20Z", "content": "Singapore health authorities have confirmed that a 10-month-old baby has contracted acute hepatitis. The symptoms are being investigated and compared with those already reported by other children who… [+1404 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Case Western Reserve University", "title": "New Research Supports Combining Two Clinical Cancer Drugs to Treat Specific Type of Colorectal Cancers - Newswise", "description": "Researchers at the Case Western Reserve University School Medicine have found that combining two cancer drugs can be effective in treating a specific type of co", "url": "https://www.newswise.com/articles/new-research-supports-combining-two-clinical-cancer-drugs-to-treat-specific-type-of-colorectal-cancers", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/05/02/626fef6e06670_CWRUWang-Zhenghe-.jpg&width=600&height=600", "publishedAt": "2022-05-02T14:05:00Z", "content": "Newswise — CLEVELAND–Researchers at the Case Western Reserve University School Medicine have found that combining two cancer drugs can be effective in treating a specific type of colorectal cancer, a… [+3785 chars]"}, {"source": {"id": null, "name": "Belmarrahealth.com"}, "author": "Sarah Cownley", "title": "Sleep Deprivation Comes With An Increased Risk For Eye Disease - Bel Marra Health", "description": "New research has found a link between sleep deprivation and an increased risk for eye disease. Continue on to learn more about these important findings in eye health.", "url": "https://www.belmarrahealth.com/sleep-deprivation-comes-with-an-increased-risk-for-eye-disease/", "urlToImage": "https://www.belmarrahealth.com/wp-content/uploads/2022/05/Short-Editorial-Topic-for-2nd-May-2022-1024x683.jpg", "publishedAt": "2022-05-02T14:00:25Z", "content": "Doctor Formulated Supplements\r\nHome » Health News » Sleep Deprivation Comes With An Increased Risk For Eye Disease\r\nNew research has found evidence of sleep deprivation causing an increased risk for … [+2850 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Better Vaccines Are In Sight — For The Next Pandemic | Mint - Mint", "description": "But data from a large clinical trial suggest the technology should be explored for the next one — and it may have many other uses, too", "url": "https://www.livemint.com/news/world/better-vaccines-are-in-sight-for-the-next-pandemic-11651497466697.html", "urlToImage": "https://images.livemint.com/img/2022/05/02/600x338/vaccine_1651497588754_1651497589128.JPG", "publishedAt": "2022-05-02T13:28:14Z", "content": "Arcturus Therapeutics, a San Diego biotech company, may have just laid out a template for how to make vaccines for the next pandemic. Its new vaccine, which uses self-copying mRNA, appears to work we… [+5859 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Mother's anxiety during pregnancy may hamper infant's cognitive development - mid-day.com", "description": "The findings in the study further suggest that persistent psychological distress after the baby is born may influence the parent-child interaction and infant self-regulation", "url": "https://www.mid-day.com/lifestyle/health-&-fitness/article/mothers-increased-anxiety-depression-during-pregnancy-may-hamper-infants-cognitive-development-23225480", "urlToImage": "https://images.mid-day.com/images/images/2022/may/Pregnancyistock_d.jpg", "publishedAt": "2022-05-02T13:26:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "How Much Water Should You Drink Everyday? Know the Importance of Monitoring Your Daily Drinking Water Consump - India.com", "description": "Aditya Patnaik, CEO and Founder, of Lustral Water mentions are reasons stating the importance of monitoring your day-to-day drinking water consumption", "url": "https://www.india.com/health/how-much-water-should-you-drink-everyday-know-the-importance-of-monitoring-your-daily-drinking-water-consumption-5370686/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/05/pjimage-1.jpg", "publishedAt": "2022-05-02T13:00:15Z", "content": "Even though 70 per cent of the earth consists of water doesn’t mean that all 70 per cent will be safe for drinking. In India, where digital spaces are gaining momentum rapidly, more than 50 per cent … [+3703 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Return to the operating room after repair of rhegmatogenous | OPTH - Dove Medical Press", "description": "Reporting the rate of all-cause returns to the operating room after surgery for rhegmatogenous retinal detachment", "url": "https://www.dovepress.com/return-to-the-operating-room-after-repair-of-rhegmatogenous-retinal-de-peer-reviewed-fulltext-article-OPTH", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-05-02T12:18:04Z", "content": "Introduction\r\nRhegmatogenous retinal detachment (RRD) is an emergent condition occurring in approximately 6.3 to 17.9 per 100,000 population.1 Incidence is higher in patients in their 7th to 8th deca… [+21840 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "8 things that happen in the body of those who eat papaya every day - Play Crazy Game", "description": "Papaya is one of the most present fruits in the daily life of Brazilians, because, in addition to being delicious, it is practical and accessible. Discover eight benefits that papaya can provide for your entire body if you commit to including it in your daily…", "url": "https://playcrazygame.com/2022/05/02/8-things-that-happen-in-the-body-of-those-who-eat-papaya-every-day/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/04/MAMAO.jpg", "publishedAt": "2022-05-02T11:25:09Z", "content": "Papaya is one of the most present fruits in the daily life of Brazilians, because, in addition to being delicious, it is practical and accessible. Discover eight benefits that papaya can provide for … [+2169 chars]"}, {"source": {"id": null, "name": "Camillestyles.com"}, "author": null, "title": "The 10 Best Foods That Help With Period Cramps - Camille Styles", "description": "Hack your way to a better flow.", "url": "https://camillestyles.com/wellness/foods-that-help-with-period-cramps/", "urlToImage": "https://camillestyles.com/wp-content/uploads/2022/02/9e9a135f-michelle-nash-photography-5603-2-768x512.jpg", "publishedAt": "2022-05-02T10:30:00Z", "content": "Like clockwork, day one of your cycle begins. Before you can drag yourself out of bed, you anticipate the worst: period cramps. The thought of a pain-free period seems impossible, right? Not so fast.… [+10158 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Body Mass Index: Why using BMI to measure your health is nonsense - EastMojo", "description": "We’re a society obsessed with numbers, and no more so than when managing our health. We use smartwatches to count steps and track our daily activity,", "url": "http://www.eastmojo.com/health/2022/05/02/body-mass-index-why-using-bmi-to-measure-your-health-is-nonsense/", "urlToImage": "https://www.eastmojo.com/wp-content/uploads/2022/05/1618px-Girl_stands_and_weighs_himself_on_white_modern_electronic_smart_scale_-_51258015258.jpg", "publishedAt": "2022-05-02T09:30:21Z", "content": "Were a society obsessed with numbers, and no more so than when managing our health.\r\nWe use smartwatches to count steps and track our daily activity, creating scores for our fitness, and monitor our … [+6788 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Higher vaccination coverage associated with lower rates of population-level COVID-19 mortality and incidence in the US - News-Medical.Net", "description": "By using data representing 80% of the US population, researchers have found that increased vaccination coverage against COVID-19 can be linked to a reduced incidence of cases and deaths.", "url": "https://www.news-medical.net/news/20220502/Higher-vaccination-coverage-associated-with-lower-rates-of-population-level-COVID-19-mortality-and-incidence-in-the-US.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_712336_16514795426265899.jpg", "publishedAt": "2022-05-02T08:24:00Z", "content": "By using data representing 80% of the US population, researchers have found that increased vaccination coverage against coronavirus disease 2019 (COVID-19) can be linked to a reduced incidence of cas… [+4593 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Man Gets Violent Dysentery after Drinking Poop Bacteria Smoothie at Clinical Trial - News18", "description": "26-year-old Jake Eberts was paid more than Rs 5 lakh to take part in the clinical trial.", "url": "https://www.news18.com/news/buzz/man-gets-violent-dysentery-after-drinking-poop-bacteria-smoothie-at-clinical-trial-5094403.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-82-165147795816x9.png", "publishedAt": "2022-05-02T07:52:50Z", "content": "Would you risk your life for money? Well, twenty-six-year-old Jake Eberts risked his life all in the name of science, and he received a whooping sum in exchange. Participating in the research held by… [+2110 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Learn These Easy Yoga Poses To Fight High Blood Pressure - NDTV", "description": "You can try incorporating these yoga positions to help stabilise your blood pressure.", "url": "https://www.ndtv.com/health/learn-these-easy-yoga-poses-to-fight-high-blood-pressure-2938576", "urlToImage": "https://c.ndtvimg.com/2022-04/o3324mno_yogasan_625x300_27_April_22.jpg", "publishedAt": "2022-05-02T07:23:05Z", "content": "Yoga can help lower high blood pressure\r\nHypertension (high blood pressure) is a common disorder wherein the blood's long-term pressure against the arteries is strong enough to induce complications s… [+4299 chars]"}, {"source": {"id": null, "name": "Martha Stewart"}, "author": "Nashia Baker", "title": "Exercising and taking Vitamin D and Omega-3 supplements may reduce your cancer risk by 61%, study says - Lifestyle Asia India", "description": "This study is the first of its kind to explore utilizing three separate preventative health tactics to minimize the risk of developing invasive cancers.", "url": "https://www.marthastewart.com/8259161/cut-cancer-risks-exercise-vitamin-d-omega-3-supplements-study-april-2022", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F34%2F2021%2F03%2F10%2Fvitamins-geltabs-hand-getty-0321-2000.jpg", "publishedAt": "2022-05-02T06:55:16Z", "content": "You already know that exercising regularly can improve your health in many ways, and the health benefits of taking vitamin D and omega-3 supplements have been widely reported. Now, there's more good … [+2012 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: End Childhood Death From Vaccine Preventable Diseases, SCI Tasks Nigerian Govt - AllAfrica - Top Africa News", "description": "IN commemoration of the 2022 World Immunisation Week, Save the Children International in Nigeria has called on the Federal and State governments and stakeholders at all levels to keep immunisation high on their sustainable development agenda as part of effort…", "url": "https://allafrica.com/stories/202205020045.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-05-02T06:51:25Z", "content": "IN commemoration of the 2022 World Immunisation Week, Save the Children International in Nigeria has called on the Federal and State governments and stakeholders at all levels to keep immunisation hi… [+4259 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Epigenetic abnormalities in hematopoietic cells during fetal development cause idiopathic autism - News-Medical.Net", "description": "An international research group led by Professor Toru Takumi (Senior Visiting Scientist, RIKEN Center for Biosystems Dynamics Research) and Researcher Chia-wen Lin at Kobe University Graduate School of Medicine has shown that idiopathic autism is caused by ep…", "url": "https://www.news-medical.net/news/20220502/Epigenetic-abnormalities-in-hematopoietic-cells-during-fetal-development-cause-idiopathic-autism.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Autism-620x480.jpg", "publishedAt": "2022-05-02T04:59:00Z", "content": "An international research group led by Professor Toru Takumi (Senior Visiting Scientist, RIKEN Center for Biosystems Dynamics Research) and Researcher Chia-wen Lin at Kobe University Graduate School … [+4887 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Do these three things to lose weight and not regain it - The Indian Express", "description": "People need to develop healthy habits to continue to be in their ideal weight, and it includes eating clean most of the time and exercising every day", "url": "https://indianexpress.com/article/lifestyle/fitness/three-things-lose-weight-not-regain-weight-loss-healthy-eating-clean-diet-exercise-junk-food-7893022/", "urlToImage": "https://images.indianexpress.com/2022/05/weight_Getty1200_May2.jpg", "publishedAt": "2022-05-02T03:40:54Z", "content": "Many people undertake weight loss journeys and successfully manage to lose weight, too. But, they are not able to sustain this lost weight for long, gradually putting on some. So, what can be done to… [+1293 chars]"}, {"source": {"id": null, "name": "Texas Public Radio"}, "author": "https://www.tpr.org/people/david-martin-davies, https://www.tpr.org/people/yvette-benavides", "title": "Diagnosis diabetes: A serious issue that needs to be taken more seriously - Texas Public Radio", "description": "The Centers for Disease Control and Prevention reports that 37 million people in the U.S. have Type 2 diabetes. And it’s on the rise.However, many people don’t realize that they are at risk for a diabetes diagnosis. As part of the reporting series “Diagnosis …", "url": "https://www.tpr.org/public-health/2022-05-01/diagnosis-diabetes-a-serious-issue-that-needs-to-be-taken-more-seriously", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/8cdb025/2147483647/strip/true/crop/8256x4334+0+585/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4c%2F7a%2F6ff161bb46c3a7599e212dee7d7e%2Fistock-1135959162.jpg", "publishedAt": "2022-05-02T02:47:00Z", "content": "The Centers for Disease Control and Prevention reports that 37 million people in the U.S. have Type 2 diabetes. And its on the rise.\r\nHowever, many people dont realize that they are at risk for a dia… [+4645 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Business Standard", "title": "When is World Hypertension Day? -May 17 - Business Standard", "description": "Every year, World Hypertension Day is observed on May 17 to raise awareness about the condition of hypertension in patients. Know more about World Hypertension Day with latest news and updates with business-standard.com", "url": "https://www.business-standard.com/about/when-is-world-hypertension-day", "urlToImage": "https://bsmedia.business-standard.com/include/_mod/site/images/no_preview.jpg", "publishedAt": "2022-05-01T17:28:48Z", "content": "No article available in this category."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Diabetes: 5 fruits you must include in your diet to manage your blood sugar level - Times of India", "description": "One of the confusion most diabetic patients have is the type of fruit they should include in their diet.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/diabetes-5-fruits-you-must-include-in-your-diet-to-manage-your-blood-sugar-level/photostory/91214646.cms", "urlToImage": "https://static.toiimg.com/photo/91214694.cms", "publishedAt": "2022-05-01T15:30:00Z", "content": "For any diabetes patient, the greatest challenge is to manage their blood sugar level. Once diagnosed with the condition, their diet becomes a little restrictive, and any food items (particularly sug… [+560 chars]"}]}