{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Explained: What Is Coronary Artery Disease? Know Its Causes, Symptoms And Treatment - ABP Live", "description": "Coronary artery disease is a disease which affects the larger coronary arteries on the surface of the heart, as a result of which the arteries cannot deliver enough oxygen-rich blood to the heart.", "url": "https://news.abplive.com/science/ischemic-heart-disease-coronary-artery-disease-causes-symptoms-risk-factors-diagnosis-treatment-1573723", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/04/a36b8b69363af11de7da5ce41c35416d1672854235248324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-01-04T18:08:31Z", "content": "Coronary artery disease, also known as ischemic heart disease or coronary heart disease, affects more than 10 million people in India and around 126 million individuals worldwide per year. This is a … [+5495 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Tim Noakes Keto Gummies South Africa Dischem ZA Tim Noakes Weight Loss SCAM OR LEGIT Breathtaking! Western Cape Gauteng Reviews - The Tribune India", "description": "Dischem let&rsquo;s Keto Gummies Tim Noakes Weight Loss South Africa ZA Tim Noakes SCAM OR LEGIT Breathtaking! Western Cape Gauteng Reviews AT Clicks TOP SELLING LET&rsquo;S KETO GUMMIES &nbsp;IN SOUTH AFRICA", "url": "https://www.tribuneindia.com/news/brand-connect/tim-noakes-keto-gummies-south-africa-dischem-za-tim-noakes-weight-loss-scam-or-legit-breathtaking-western-cape-gauteng-reviews-467372", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1643413955.png", "publishedAt": "2023-01-04T17:29:00Z", "content": "Dischem let’s Keto Gummies Tim Noakes Weight Loss South Africa ZA Tim Noakes SCAM OR LEGIT Breathtaking! Western Cape Gauteng Reviews AT Clicks TOP SELLING LET’S KETO GUMMIES  IN SOUTH AFRICA\r\nTim No… [+17871 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How do parents respond to messages that discourage soda, encourage water or both? - News-Medical.Net", "description": "A recent study found that messaging campaigns discouraging the consumption of unhealthy beverages were more promising than those promoting healthy drinks among parents in the United States.", "url": "https://www.news-medical.net/news/20230104/How-do-parents-respond-to-messages-that-discourage-soda-encourage-water-or-both.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_734877_16728498324098262.jpg", "publishedAt": "2023-01-04T16:34:00Z", "content": "A recent study published in Preventive Medicine found that messaging campaigns discouraging the consumption of unhealthy beverages were more promising than those promoting healthy drinks among parent… [+4842 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Gut bacteria may play a role in diabetes: Research - ANI News", "description": "One type of bacteria found in the gut may contribute to the development of Type 2 diabetes, while another may protect from the disease, according to early results from an ongoing, prospective study led by investigators at Cedars-Sinai.", "url": "https://www.aninews.in/news/health/gut-bacteria-may-play-a-role-in-diabetes-research20230104215020", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230104162008.jpg", "publishedAt": "2023-01-04T16:20:00Z", "content": "Los Angeles [US], January 4 (ANI): Early findings from an ongoing prospective trial led by researchers at Cedars-Sinai suggest that one type of gut bacteria may aid in the development of Type 2 diabe… [+4132 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Nasal swab can provide early warning of emerging viruses: Research - ThePrint", "description": "New York [US], January 4 (ANI): As the Covid-19 pandemic demonstrated, potentially harmful novel viruses can spread across the population long before the system for monitoring global public health is able to catch them. However, Yale researchers have discover…", "url": "https://theprint.in/health/nasal-swab-can-provide-early-warning-of-emerging-viruses-research/1298285/", "urlToImage": null, "publishedAt": "2023-01-04T16:15:17Z", "content": "New York [US], January 4 (ANI): As the Covid-19 pandemic demonstrated, potentially harmful novel viruses can spread across the population long before the system for monitoring global public health is… [+3464 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Common fatty acid contributes to temperature, pain sensitivity in psoriasis plaques: Study - ThePrint", "description": "Washington [US], January 4 (ANI): Fatty acids have been extensively studied for their implication in health and disease. As per a recent study published in JID Innovations, a common fatty acid found in the western diet breaks down into compounds that contribu…", "url": "https://theprint.in/science/common-fatty-acid-contributes-to-temperature-pain-sensitivity-in-psoriasis-plaques-study/1298278/", "urlToImage": null, "publishedAt": "2023-01-04T16:14:55Z", "content": "Washington [US], January 4 (ANI): Fatty acids have been extensively studied for their implication in health and disease.\r\nAs per a recent study published in JID Innovations, a common fatty acid found… [+2981 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Patrick Campbell", "title": "Optimal Glycemic Control Could Slow Biological Aging in Adults with Type 2 Diabetes - MD Magazine", "description": "Exploratory analyses of data from the Look AHEAD trial suggest maintaining an HbA1c level of 7% or less was associated with smaller increases in frailty index over the 8-year study period when compared to their counterparts with an HbA1c level of 8% or greate…", "url": "https://www.hcplive.com/view/glycemic-control-slow-biological-aging-in-adults-with-type-2-diabetes", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/347e1b3c4c38910defd4b5745593da76611ded07-1000x667.jpg?fit=crop&auto=format", "publishedAt": "2023-01-04T16:06:46Z", "content": "An analysis of data from the landmark Look AHEAD study suggests greater glycemic control could slow biological aging among adults with type 2 diabetes.\r\nResults of the exploratory analyses, which inc… [+3388 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Exercise reduces insulin production: Study - ANI News", "description": "Insulin is a hormone that is required by humans and many other living things. Its most well-known function is to control sugar metabolism. Much less is known about how insulin-producing cells, and thus insulin secretion, are controlled.", "url": "https://www.aninews.in/news/health/exercise-reduces-insulin-production-study20230104210624", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230104153612.jpg", "publishedAt": "2023-01-04T15:36:00Z", "content": "Bavaria [Germany], January 4 (ANI): Insulin is a hormone that is required by humans and many other living things. Its most well-known function is to control sugar metabolism. Much less is known about… [+3861 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Indiscriminate use of steroids key factor behind black fungus cases, says infectious disease expert | Mint - Mint", "description": "'One of the factors was our environment where the fungal spore count is high due to decaying garbage, tropical climate and humidity'", "url": "https://www.livemint.com/news/indiscriminate-use-of-steroids-key-factor-behind-black-fungus-cases-says-expert-11672843963299.html", "urlToImage": "https://images.livemint.com/img/2023/01/04/600x338/PTI05_20_2021_000153A_1621571621061_1672844221616_1672844221616.jpg", "publishedAt": "2023-01-04T14:58:40Z", "content": "An infectious disease expert said on Wednesday that one of the key factors behind a spurt in black fungus or mucormycosis cases among the coronavirus survivors was the indiscriminate use of steroids.… [+2018 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Digital biomarker derived from machine learning has potential to diagnose CAD: Lancet - Medical Dialogues", "description": "USA: \"Digital biomarker\" derived from new machine learning (ML) holds the potential to diagnose coronary artery disease (CAD) from EHR (electronic health record) data and characterize its features...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/digital-biomarker-derived-from-machine-learning-has-potential-to-diagnose-cad-lancet-104984", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/28/195299-machine-learning-and-coronary-artery-disease.jpg", "publishedAt": "2023-01-04T14:30:29Z", "content": "USA: \"Digital biomarker\" derived from new machine learning (ML) holds the potential to diagnose coronary artery disease (CAD) from EHR (electronic health record) data and characterize its features an… [+3093 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Molbio Diagnostics launches Truenat HSV 1/2 test for herpes - ETHealthWorld", "description": "Truenat HSV 1/2 is a chip-based RT-PCR test for diagnosing herpes and has been approved by CDSCO. The test is compatible with the existing Truelab infrastructure which doesn’t require additional setup and equipment.", "url": "https://health.economictimes.indiatimes.com/news/industry/molbio-diagnostics-launches-truenat-hsv-1/2-test-for-herpes/96738991", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96738991,imgsize-636403,width-1200,height-628,overlay-ethealthworld/molbio-diagnostics-launches-truenat-hsv-1-2-test-for-herpes.jpg", "publishedAt": "2023-01-04T13:59:00Z", "content": "Verna: Molbio Diagnostics has launched the Truenat HSV 1/2 for testing the herpes simplex virus. The test is approved by CDSCO and can provide sample-to-test results in an hour. The real-time PCR tes… [+2244 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Study Finds How Common Nonexcitatory Amino Acids Worsen Stroke, TBI Damage | LatestLY - LatestLY", "description": "Get latest articles and stories on Health at LatestLY.  Scientists report that in the aftermath of a stroke or TBI, a group of amino acids that normally support brain function contribute significantly to the brain destruction that can result from both of thes…", "url": "https://www.latestly.com/agency-news/health-news-study-finds-how-common-nonexcitatory-amino-acids-worsen-stroke-tbi-damage-4671469.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-Health-News-784x441.jpg", "publishedAt": "2023-01-04T13:48:18Z", "content": "Augusta (Georgia) [US], January 4 (ANI): According to scientists, in the aftermath of a stroke or TBI, a group of amino acids that normally support brain function contribute significantly to the brai… [+6664 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sayantani Biswas", "title": "Not loss of taste, smell. Know ‘classic’ symptom difference between common cold, flu, RSV, and Covid-19 | Mint - Mint", "description": "The Union Health ministry in India had alerted in December 2022 that the coming 40 days would be crucial for the residents of India", "url": "https://www.livemint.com/science/health/not-loss-of-taste-smell-know-classic-symptom-difference-between-common-cold-flu-rsv-and-covid19-11672837147076.html", "urlToImage": "https://images.livemint.com/img/2023/01/04/600x338/PTI06_10_2021_000164A_1624610217448_1672837647046_1672837647046.jpg", "publishedAt": "2023-01-04T13:43:10Z", "content": "World Health Organisation (WHO) has recently notified that over 500 Omicron variants are currently circulating worldwide and owing to that, India is likely to see a Covid wave in the coming days.  Th… [+2993 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers finds how time restricted eating affects gene expression in areas of body, brain - ANI News", "description": "Scientists have demonstrated how time-restricted eating influences gene expression in more than 22 different areas of the body and brain. Gene expression is the process by which genes are activated and respond to their surroundings by producing proteins.", "url": "https://www.aninews.in/news/lifestyle/food/researchers-finds-how-time-restricted-eating-affects-gene-expression-in-areas-of-body-brain20230104184934", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230104131919.jpg", "publishedAt": "2023-01-04T13:23:00Z", "content": "Washington [US], January 4 (ANI): Studies have shown the health benefits of time-restricted eating, including an increase in life span, making practises like intermittent fasting a hot topic in the w… [+3201 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers discover new cellular component with importance for the sense of smell - News-Medical.Net", "description": "Researchers at Umeå University have discovered a previously unknown cellular component, an organelle, inside neurons that we use to perceive smell.", "url": "https://www.news-medical.net/news/20230104/Researchers-discover-new-cellular-component-with-importance-for-the-sense-of-smell.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Molecular_Biology-620x480.jpg", "publishedAt": "2023-01-04T13:21:00Z", "content": "Researchers at Umeå University have discovered a previously unknown cellular component, an organelle, inside neurons that we use to perceive smell. The discovery may have implications for further res… [+2888 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study reveals how brain game can predict risk of infection - Devdiscourse", "description": "According to a study, you may be more susceptible to a viral illness if your alertness and reaction time fluctuate more than usual.", "url": "https://www.devdiscourse.com/article/science-environment/2308124-study-reveals-how-brain-game-can-predict-risk-of-infection", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/04_01_2023_13_14_45_9526.jpg?width=920&format=jpeg", "publishedAt": "2023-01-04T13:14:48Z", "content": "You may be more susceptible to a viral illness if your alertness and reaction time fluctuate more than usual. The study was led by University of Michigan researchers working in close collaboration wi… [+3865 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Mihai Andrei", "title": "Healthy habits for a healthy brain: five simple tips for keeping your brain in tip top shape - ZME Science", "description": "Just like any other body part, the brain needs regular exercise to stay healthy and function properly -- and it's never too late to start taking care of", "url": "https://www.zmescience.com/science/healthy-habits-for-a-healthy-brain-five-simple-tips-for-keeping-your-brain-in-tip-top-shape/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/01/pexels-photo-724994-scaled.jpeg", "publishedAt": "2023-01-04T13:11:46Z", "content": "Just like any other body part, the brain needs regular exercise to stay healthy and function properly — and it’s never too late to start taking care of your brain health. A healthy brain means that y… [+6616 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 Biotin-Rich Foods To Add To Your Diet For Healthy Skin And Hair - NDTV", "description": "Biotin is extremely beneficial to your hair as well as skin. Many often add biotin supplements to their diet. Here are some food sources.", "url": "https://www.ndtv.com/health/7-biotin-rich-foods-to-add-to-your-diet-for-healthy-skin-and-hair-3663538", "urlToImage": "https://c.ndtvimg.com/2022-09/586hfdt8_pulses-for-healthy-stomach_625x300_15_September_22.jpg", "publishedAt": "2023-01-04T13:03:12Z", "content": "Almonds are a good source of biotin\r\nOne of the vitamins in the B complex family is biotin, often known as vitamin B7. It is a crucial micronutrient for our body's healthy operation. When you consume… [+3754 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "Physical activity may help reduce depression in youngsters, finds studys - Business Standard", "description": "Early childhood depression is associated with severe adverse outcomes including difficulties with social functioning poor mental and physical health and suicide", "url": "https://www.business-standard.com/article/lifestyle/physical-activity-may-help-reduce-depression-in-youngsters-finds-study-123010400667_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2017-10/28/full/1509146120-3349.jpg", "publishedAt": "2023-01-04T11:46:00Z", "content": "Scientists have found that physical activity interventions were associated with significant reductions in depressive symptoms in children and adolescents.\r\nThe available evidence supported physical a… [+4436 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Covid jab safe in children, adolescents with MIS-C: Study - Deccan Herald", "description": "Scientists demonstrated that it is safe for children and adolescents to get a Covid-19 vaccine after having multisystem inflammatory syndrome (MIS-C). The researchers found that there were no reports of serious complications including myocarditis or MIS-C reo…", "url": "https://www.deccanherald.com/science-and-environment/covid-jab-safe-in-children-adolescents-with-mis-c-study-1177841.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/01/04/vaccine-reuters-1177841-1672834190.jpg", "publishedAt": "2023-01-04T11:40:29Z", "content": "Scientists demonstrated that it is safe for children and adolescents to get a Covid-19 vaccine after having multisystem inflammatory syndrome (MIS-C).\r\nThe researchers found that there were no report… [+4154 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Rabies is likely to spread in Sri Lanka in 2023 due to vaccine shortagess - Business Standard", "description": "According to WHO data Sri Lanka has achieved a successful reduction of human rabies deaths from 377 in the mid1970s to 31 in 2021 due to its successful vaccination drive", "url": "https://www.business-standard.com/article/international/rabies-is-likely-to-spread-in-sri-lanka-in-2023-due-to-vaccine-shortages-123010400640_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-08/26/full/1661489133-3568.jpg", "publishedAt": "2023-01-04T10:42:00Z", "content": "Rabies might spread rapidly in Sri Lanka in 2023 due to shortages in vaccines, a health official said here on Wednesday.\r\nDirector of Public Health Veterinary Services L.D. Kithsiri told journalists … [+1020 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Dianabol Cycle | Dianabol Supplements | Dianabol 10mg - Deccan Herald", "description": "Dbol pills are a sought-after performance-enhancing drug that many in the bodybuilding work want to use. It's easy to understand the reason! Imagine how much simpler it would be to unlock your full potential and achieve your peak fitness. Many weightlifters a…", "url": "https://www.deccanherald.com/brandspot/pr-spot/dianabol-cycle-dianabol-supplements-dianabol-10mg-1177808.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%20321-1177808-1672827456.png", "publishedAt": "2023-01-04T10:16:49Z", "content": "Dbol pills are a sought-after performance-enhancing drug that many in the bodybuilding work want to use. It's easy to understand the reason! Imagine how much simpler it would be to unlock your full p… [+23770 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "What is Mediterranean diet that has been named healthiest way to eat for 6th consecutive year? - India Today", "description": "The Mediterranean diet has been named the healthiest diet in 2023 for the sixth time in a row by the US News & World Report.", "url": "https://www.indiatoday.in/health/story/what-is-mediterranean-diet-that-has-been-named-healthiest-way-to-eat-for-6th-consecutive-year-2317183-2023-01-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202301/untitled_design_-_2023-01-04t151815.258-sixteen_nine.png?VersionId=YV9XWZV4kfAuTTPBbl56koMRxjqFheIX", "publishedAt": "2023-01-04T10:13:55Z", "content": "By Daphne Clarance: There are few diets that often promote a healthy lifestyle and focus on food quality rather than quantity. The Mediterranean diet is one such diet that has been named the healthie… [+4804 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "Cambodia reported sharp rise in dengue cases last yr - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/cambodia-reported-sharp-rise-in-dengue-cases-last-yr-3472319", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/f4bba73d76fa55e4b150ed3ed1419071_w_800_h_450.jpg", "publishedAt": "2023-01-04T09:58:19Z", "content": "Phnom Penh, Jan 4 (IANS) Cambodia reported 12,500 dengue fever cases in 2022, a significant increase from 1,811 in 2021, a health official said on Wednesday.\r\nLeang Rithea, deputy director of the Nat… [+1016 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "GK Web Desk", "title": "DAK urges people to take precautions to reduce risk of high blood pressure in winter - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/kashmir/dak-urges-people-to-take-precautions-to-reduce-risk-of-high-blood-pressure-in-winter", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-02%2Fda2a4467-b8a4-445c-8e5d-d056d82e3f94%2Fheartbeat_g0f9f06ec9_1920.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-01-04T09:52:58Z", "content": "Hormones, like adrenaline and nor-adrenaline increase in response to cold and they cause spike in blood pressure, he said adding lack of sunlight during winter reduces vitamin D levels which increase… [+789 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "H3N2 virus is nothing but a type of Influenza A, says Dr Arjun Dang - Times of India", "description": "The H3N2 virus is behind the sudden spike in cases of viral infection and respiratory infection across Delhi-NCR. However, there’s no need to worry, said Dr Arjun Dang, CEO of Dr Dangs Lab.Speaking to ANI, Dr Dang said, “H3N2 virus is nothing but a type of in…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/h3n2-virus-is-nothing-but-a-type-of-influenza-a-says-dr-arjun-dang/videoshow/96735136.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/96735136/size-32060/96735136.jpg", "publishedAt": "2023-01-04T09:41:56Z", "content": "The H3N2 virus\r\n is behind the sudden spike in cases of viral infection and respiratory infection across Delhi-NCR. However, theres no need to worry, said Dr Arjun Dang\r\n, CEO of Dr Dangs Lab\r\n.Speak… [+678 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Metabolism Pills: Metabolism Booster Pills - Deccan Herald", "description": "If you've been searching on the internet for the top diet pills that you can take, you've probably encountered a well-known metabolism booster pills called Metabolism Pills. With the abundance of Metabolism Pills reviews available on the internet it's an over…", "url": "https://www.deccanherald.com/brandspot/pr-spot/metabolism-pills-metabolism-booster-pills-1177792.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%20319-1177792-1672827538.jpg", "publishedAt": "2023-01-04T09:38:07Z", "content": "If you've been searching on the internet for the top diet pills that you can take, you've probably encountered a well-known metabolism booster pills called Metabolism Pills. With the abundance of Met… [+27871 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Fitterfly launches ‘Reimagining Diabetes Care Report 2022’ - Express Healthcare", "description": "Based on a sample size of over 3000 people who enrolled into Fitterfly’s Diabetes Management programs, the report underscores the need to reimagine, rethink, and reassess diabetes before it reaches pandemic proportions", "url": "https://www.expresshealthcare.in/news/fitterfly-launches-reimagining-diabetes-care-report-2022/437565/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/01/12122222/admin-ajax-1.jpg", "publishedAt": "2023-01-04T09:26:55Z", "content": "Based on a sample size of over 3000 people who enrolled into Fitterflys Diabetes Management programs, the report underscores the need to reimagine, rethink, and reassess diabetes before it reaches pa… [+2259 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Hemant Tongaonkar", "title": "Cervical cancer awareness: Why young women need vaccination against this common disease - Health shots", "description": "Cervical Cancer Awareness Month: Here's why it is important for young women to get vaccinated against cervical cancer, one of the most common diseases among women.", "url": "https://www.healthshots.com/preventive-care/self-care/cervical-cancer-awareness-know-the-importance-of-vaccination-for-girls/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/04133836/hpv-vaccine.jpg", "publishedAt": "2023-01-04T08:10:04Z", "content": "The Cervical Cancer Awareness Month is observed in January every year. It is important to know about the second most common cancer among Indian women. However, it is also one of the most preventable … [+4220 chars]"}, {"source": {"id": null, "name": "Pkbnews.in"}, "author": "pkbnews", "title": "Healthy Diet: Keep these things in your diet this year, you will be safe from diseases - PKBnews.in", "description": "Eating healthy food not only keeps our body away from health problems but also keeps us energized throughout the day. Through this article, we will tell you which healthy things can be included in the", "url": "https://pkbnews.in/healthy-diet-keep-these-things-in-your-diet-this-year-you-will-be-safe-from-diseases/", "urlToImage": "https://images.tv9hindi.com/wp-content/uploads/2023/01/Healthy-Diet.jpg", "publishedAt": "2023-01-04T08:00:01Z", "content": "Modern nutrition research can be difficult to understand and interpret. Indians often eat a diet that does not contain the right amount of nutritious fruits and vegetables. Besides, there are about e… [+1657 chars]"}, {"source": {"id": null, "name": "Newsmeter.in"}, "author": "Sunanda Naik", "title": "Can consuming rice lead to weakening of bones? - NewsMeter", "description": "An Instagram post claiming that consuming rice at night may lead to the weakening of bones has gone viral on social media.", "url": "https://newsmeter.in/fact-check-health/can-consuming-rice-lead-to-weakening-of-bones-706073", "urlToImage": "https://newsmeter.in/h-upload/2023/01/04/336307-whatsapp-image-2023-01-04-at-121327.jpg", "publishedAt": "2023-01-04T07:01:08Z", "content": "An Instagram post claiming that consuming rice at night may lead to the weakening of bones has gone viral on social media.\r\nThe post reads: \"Don't eat rice daily at night. It can weaken bones because… [+2045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can liver damage be reversed? - The Indian Express", "description": "Nausea, loss of appetite, and blood in the stool are all symptoms of liver damage", "url": "https://indianexpress.com/article/lifestyle/health/reverse-liver-damage-symptoms-transplant-factors-alcohol-obesity-8349057/", "urlToImage": "https://images.indianexpress.com/2022/12/liver_200_getty-1.jpg", "publishedAt": "2023-01-04T06:00:34Z", "content": "Excessive alcohol intake is commonly believed to be the main cause of liver damage, but it must be known that there are many other factors, too. The organ, which is the size of a football, can be dam… [+3874 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "An early Covid-19 symptom may occur in legs and shoulders; know what myalgia with the dreaded infection feels - Times Now", "description": "While many common symptoms of covid-19 are well-known and have been evolving with new strains cropping up ever since the pandemic, there are a few others that need to be noticed. A discomforting and painful symptom, according to studies, is myalgia in which p…", "url": "https://www.timesnownews.com/health/an-early-covid-19-symptom-may-occur-in-legs-and-shoulders-know-what-myalgia-with-the-dreaded-infection-feels-like-article-96728430", "urlToImage": "https://static.tnn.in/thumb/msid-96728430,imgsize-100,updatedat-1672810421726,width-1280,height-720,resizemode-75/96728430.jpg", "publishedAt": "2023-01-04T05:33:41Z", "content": "Suffering from chronic back pain? Know the causes, symptoms, and natural ways to treat without undergoing surgery"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Digital Support", "title": "Best flea spray for dogs - Hindustan Times", "description": "If you are looking for the Best Flea Spray For Dogs, you have come to the right place.", "url": "https://www.hindustantimes.com/shop-now/pet-supplies/best-flea-spray-for-dogs-101672809009566.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/04/400x225/pexels-johann-1254140_1672810183818_1672810194201_1672810194201.jpg", "publishedAt": "2023-01-04T05:31:00Z", "content": null}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Dry eye disease alters how the eye’s cornea heals itself after injury - Medical Dialogues", "description": "Dry eye disease occurs when the eye can't provide adequate lubrication with natural tears. People with the common disorder use various types of drops to replace missing natural tears and keep the...", "url": "https://medicaldialogues.in/mdtv/ophthalmology/videos/dry-eye-disease-alters-how-the-eyes-cornea-heals-itself-after-injury-105083", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/03/196196-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-20.jpg", "publishedAt": "2023-01-04T04:15:45Z", "content": "Dry eye disease occurs when the eye can't provide adequate lubrication with natural tears. People with the common disorder use various types of drops to replace missing natural tears and keep the eye… [+2441 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID booster shots cut Omicron transmission in closed environments - News-Medical.Net", "description": "In a recent paper published in the journal Nature Medicine, researchers in the United States investigated the infectiousness of incarcerated individuals with severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) Omicron infections in prisons, high-risk…", "url": "https://www.news-medical.net/news/20230103/COVID-booster-shots-cut-Omicron-transmission-in-closed-environments.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_734809_16728021051464801.jpg", "publishedAt": "2023-01-04T03:15:00Z", "content": "In a recent paper published in the journal Nature Medicine, researchers in the United States investigated the infectiousness of incarcerated individuals with severe acute respiratory syndrome coronav… [+5901 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Does a person’s blood group play a role when it comes to weight loss? - The Indian Express", "description": "According to WebMD, there exists something called 'Blood Type Diet', created by naturopath Peter J. D'Adamo. According to it, eating a diet based on your blood type -- either O, A, B, or AB -- can help you \"trim down and get healthier\".", "url": "https://indianexpress.com/article/lifestyle/health/blood-group-role-weight-loss-diet-obesity-8356834/", "urlToImage": "https://images.indianexpress.com/2023/01/GettyImages-weight-loss-blood-group-1200.jpg", "publishedAt": "2023-01-04T02:50:26Z", "content": "There are many factors that determine how much weight a person manages to lose, if at all. Weight loss is a cumulative effort and there are many things that have to be considered, such as the kind of… [+3784 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study compares effectiveness of Pfizer vs. Moderna booster COVID vaccines after third dose - News-Medical.Net", "description": "In a recent scientific paper published in the journal Nature Microbiology, researchers reproduced two target trials using electronic health records (EHRs) of the Department of Veterans Affairs (VA) to compare the effectiveness of the third dose of BNT162b2 or…", "url": "https://www.news-medical.net/news/20230103/Study-compares-effectiveness-of-Pfizer-vs-Moderna-booster-COVID-vaccines-after-third-dose.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_734808_16727996558983113.jpg", "publishedAt": "2023-01-04T02:35:00Z", "content": "In a recent scientific paper published in the journal Nature Microbiology, researchers reproduced two target trials using electronic health records (EHRs) of the Department of Veterans Affairs (VA) t… [+5380 chars]"}, {"source": {"id": null, "name": "NEWS HEADS"}, "author": "Ankit Pal", "title": "Role of a diabetologist in diabetes management - NEWS HEADS", "description": "A diabetologist is a medical doctor who specializes in the diagnosis and treatment of diabetes. Diabetes is a chronic condition that affects the way the body processes glucose, a type of sugar that is the main source of energy for the body's cells. People wit…", "url": "https://www.newsheads.in/lifestyle/health/role-of-a-diabetologist-in-diabetes-management-article-68540", "urlToImage": "https://static.newsheads.in/media/thumbs/2023/01/04/210682993-diabetes_1200x675.jpg", "publishedAt": "2023-01-04T00:44:12Z", "content": "New Delhi : What is a diabetologist?\r\nA diabetologist is a medical doctor who specializes in the diagnosis and treatment of diabetes. Diabetes is a chronic condition that affects the way the body pro… [+5903 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": "Keith Cowing", "title": "Self-Assembling Proteins Can Store Cellular “Memories” - Astrobiology - Astrobiology News", "description": "As cells perform their everyday functions, they turn on a variety of genes and cellular pathways.", "url": "https://astrobiology.com/2023/01/self-assembling-proteins-can-store-cellular-memories.html", "urlToImage": "https://astrobiology.com/wp-content/uploads/2023/01/Screen-Shot-2023-01-03-at-6.26.09-PM.png", "publishedAt": "2023-01-03T23:37:30Z", "content": "a, Schematic of intracellular linear protein self-assembly. b, Bidirectional elongating intracellular linear protein self-assembly for encoding, storing and reading out biological information. Blue s… [+8834 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": null, "title": "Know Some Myths About Diabetes - Diario Primisia - Nation World News", "description": "Nation World News is the fastest emerging news website covering all the latest news, world’s top stories, science news entertainment sports cricket’s latest discoveries, new technology gadgets, politics news, and more.", "url": "https://nationworldnews.com/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/07/Nation.jpg", "publishedAt": "2023-01-03T21:50:28Z", "content": "Nation World News is the fastest emerging news website covering all the latest news, worlds top stories, science news entertainment sports crickets latest discoveries, new technology gadgets, politic… [+16 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Foods That Contain 'invisible' Sugar And How They Can Affect Health - Nation World News", "description": "As is well known, excessive sugar consumption can have a serious impact on health and therefore the possibility of replacing or reducing its intake is", "url": "https://nationworldnews.com/foods-that-contain-invisible-sugar-and-how-they-can-affect-health/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/Foods-that-contain-invisible-sugar-and-how-they-can-affect.jpg", "publishedAt": "2023-01-03T21:40:37Z", "content": "As is well known, excessive sugar consumption can have a serious impact on health and therefore the possibility of replacing or reducing its intake is increasingly analyzed by consumers who want to a… [+3406 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Robby Berman", "title": "Cardiovascular health: How many steps should older adults walk daily? - Medical News Today", "description": "A recent study finds that walking between 6,000 and 9,000 steps daily is linked to a dramatically lower risk of cardiovascular disease for older adults.", "url": "https://www.medicalnewstoday.com/articles/cardiovascular-disease-heart-health-2023-walk-6000-steps", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/01/walk_towards_healthier_heart_732x549_thumb.jpg", "publishedAt": "2023-01-03T21:08:04Z", "content": "<ul><li>A recent study finds that walking between 6,000 and 9,000 steps daily is linked to a dramatically lower risk of cardiovascular disease for older adults.</li><li>Each additional 1,000 steps ta… [+4686 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Women With Diabetes Are At Higher Risk Of Venous Thromboembolism - Nation World News", "description": "A group of scientists has found evidence that women are at a higher risk of venous thromboembolism than men.", "url": "https://nationworldnews.com/women-with-diabetes-are-at-higher-risk-of-venous-thromboembolism/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/Women-with-diabetes-are-at-higher-risk-of-venous-thromboembolism.jpg", "publishedAt": "2023-01-03T19:55:14Z", "content": "A group of scientists has found evidence that women are at a higher risk of venous thromboembolism than men. A research team from the Complexity Science Hub and the Medical University of Vienna (Aust… [+2735 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "WebMD", "title": "Flu Activity Falls for the Fourth Straight Week - WebMD", "description": "December brought a drop in infections, but outpatient visits and hospitalizations for influenza remain higher than expected.", "url": "https://www.webmd.com/cold-and-flu/news/20230103/flu-activity-falls-for-the-fourth-straight-week", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/other/sick_woman_lying_on_sofa_other/1800x1200_sick_woman_lying_on_sofa_other.jpg", "publishedAt": "2023-01-03T19:21:32Z", "content": "Editor's note: See cold and flu activity in your location with the WebMD tracker.\r\nJan. 3, 2023 The 2022-23 influenza season got off to a fast and rather nasty start in October and November, but Dece… [+1427 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "William A. Haseltine", "title": "Respiratory Viruses Sensitive To Mild Acidification Of Ambient Air - Forbes", "description": "A new Swiss study has discovered that certain levels of acidity can inactivate different viruses, providing a new tool to control airborne transmission.", "url": "https://www.forbes.com/sites/williamhaseltine/2023/01/03/respiratory-viruses-sensitive-to-mild-acidification-of-ambient-air/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63b479b787fede226136e6b5/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-01-03T18:55:30Z", "content": "The best way to reduce the risk of transmission is to reduce the concentration of airborne virus ... [+] that is available to be inhaled and can therefore cause infection.\r\nGetty Images/iStockphoto\r\n… [+4776 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "This New Wristwatch Can Help PTSD Patients Adapt To Trauma-Related Memories: Study - ABP Live", "description": "Researchers have developed a wristwatch device that can enhance therapy for PTSD patients by helping them adapt to stressful and trauma-related memories.", "url": "https://news.abplive.com/science/this-new-wristwatch-can-help-ptsd-patients-adapt-to-trauma-related-memories-study-1573501", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/03/7b4a4af6822bfca4d45a2fd972e66d0e1672769114976324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-01-03T18:29:36Z", "content": "People with post-traumatic stress disorder (PTSD) may feel triggered by certain sights, smells and sounds of everyday life because these may take them back to the traumatic memories they are trying t… [+2556 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Lower influenza prevalence linked with Covid public health measures: Study - The Tribune India", "description": "Decreased influenza prevalence may be associated with long-term public health measures against COVID-19 in China, according to a study.", "url": "https://www.tribuneindia.com/news/health/lower-influenza-prevalence-linked-with-covid-public-health-measures-study-467067", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1658233343.jpg", "publishedAt": "2023-01-03T18:06:00Z", "content": "PTI\r\nBeijing, January 3\r\nDecreased influenza prevalence may be associated with long-term public health measures against COVID-19 in China, according to a study.\r\nThe research, published in the journa… [+2839 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "S.Venkateshwari", "title": "Three Covid vaccines have been approved for Kids!!! - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "kids : Three Covid vaccines have been approved for Kids   \nSo far, three Covid Vaccines have been approved for children between 5 years to 12 years in", "url": "https://www.indiaherald.com/Kids/Read/994564088/Three-Covid-vaccines-have-been-approved-for-Kids", "urlToImage": "https://www.indiaherald.com/imagestore/images/kids/107/three-covid-vaccines-have-been-approved-for-kids0f6b6031-0aef-482f-b8ba-4381370a7749-415x250-IndiaHerald.jpg", "publishedAt": "2023-01-03T15:35:27Z", "content": "Three Covid vaccines have been approved for Kids!!!\r\nSo far, three Covid Vaccines have been approved for children between 5 years to 12 years in the country. The government has given emergency use ap… [+1252 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Mediterranean diet can improve conception chances in infertile couples - Medical Dialogues", "description": "Australia: A new research published in Nutrients showed that adherence to anti-inflammatory diets such as the Mediterranean diet might help overcome infertility, making it an affordable and...", "url": "https://medicaldialogues.in/diet-nutrition/news/mediterranean-diet-can-improve-conception-chances-in-infertile-couples-104880", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/14/193756-untitled-design-2022-12-14t114856618.jpg", "publishedAt": "2023-01-03T14:30:42Z", "content": "Australia: A new research published in Nutrients showed that adherence to anti-inflammatory diets such as the Mediterranean diet might help overcome infertility, making it an affordable and non-intru… [+2820 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Whole-body PET/CT reduces total scan time in patients with melanoma: Study - Medical Dialogues", "description": "Germany: A recent study has found that in melanoma patients, low-dose long axial field-of-view (LAFOV) PET/CT imaging is feasible and could reduce radiation dose and imaging time significantly.", "url": "https://medicaldialogues.in/radiology/news/whole-body-petct-reduces-total-scan-time-in-patients-with-melanoma-study-104874", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/16/193908-pet-ct-for-melanoma.jpg", "publishedAt": "2023-01-03T14:30:19Z", "content": "Germany: A recent study has found that in melanoma patients, low-dose long axial field-of-view (LAFOV) PET/CT imaging is feasible and could reduce radiation dose and imaging time significantly. The f… [+3366 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Tau-PET superior to phospho-tau for predicting cognitive decline in patients with Alzheimer's disease:... - Medical Dialogues", "description": "The study found that baseline tau PET (Positron emission tomography) is the strongest independent predictor of cognitive decline.Sweden: In patients with Alzheimer's disease having a mild", "url": "https://medicaldialogues.in/radiology/news/tau-pet-superior-to-phospho-tau-for-predicting-cognitive-decline-in-patients-with-alzheimers-disease-study-104990", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/29/195443-cognitive-decline.jpg", "publishedAt": "2023-01-03T14:30:07Z", "content": "The study found that baseline tau PET (Positron emission tomography) is the strongest independent predictor of cognitive decline.Sweden: In patients with Alzheimer's disease having a mild cognitive i… [+3002 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Anastasia Gorelova-Pittsburgh", "title": "Blood test detects marker of Alzheimer's neurodegeneration - Futurity: Research News", "description": "A new test needs only a blood sample to detect a novel marker of Alzheimer's disease neurodegeneration, researchers report.", "url": "https://www.futurity.org/blood-test-alzheimers-neurodegeneration-2849852/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2023/01/blood_test_marker_Alzheimers_1600.jpg", "publishedAt": "2023-01-03T14:26:15Z", "content": "A new test detects a novel marker of Alzheimer’s disease neurodegeneration in a blood sample, researchers report.\r\nThe biomarker, called “brain-derived tau,” or BD-tau, outperforms current blood diag… [+5256 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study reveals genetic change in esophageal mucous membrane lead to esophageal cancer | Science-Environment - Devdiscourse", "description": "Barrett oesophagus is a genetic mutation in the esophageal mucous membrane that can lead to esophageal cancer. If certain biomarkers, known as miDNA, which are extremely short DNA strands, are found in these tissue alterations, it could be an indication that …", "url": "https://www.devdiscourse.com/article/science-environment/2306807-study-reveals-genetic-change-in-esophageal-mucous-membrane-lead-to-esophageal-cancer", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_01_2023_12_17_33_8195213.jpg?width=920&format=jpeg", "publishedAt": "2023-01-03T12:17:35Z", "content": "Scientists discovered that Barrett oesophagus is a genetic change in the esophageal mucous membrane that can lead to esophageal cancer. If certain biomarkers, known as miDNA, which are extremely shor… [+2888 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "THESE winter foods can spike up your cholesterol; foods to avoid and to eat - Zee News", "description": "Your cholesterol level may fluctuate during winter. This is because you want to eat more since your body needs calories to warm up. It comes as no surprise that research has shown that the colder months can cause your cholesterol levels to rise drastically.", "url": "https://zeenews.india.com/health/these-winter-foods-can-spike-up-your-cholesterol-foods-to-avoid-and-to-eat-2557299", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/03/1137102-processed-foods.jpg", "publishedAt": "2023-01-03T12:09:03Z", "content": "Bad cholesterol foods: Your cholesterol level may fluctuate during winter. This is because you want to eat more since your body needs calories to warm up. It comes as no surprise that research has sh… [+2916 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Glucoredi Reviews: Get Answers To How to reverse type 2 diabetes - Deccan Herald", "description": "To prevent or reverse Type 2 diabetes, it is essential to monitor blood glucose levels regularly. If the blood glucose levels are consistently high, a person is more likely to suffer from diabetes. Diabetes is a chronic condition, and it is difficult to manag…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucoredi-reviews-get-answers-to-how-to-reverse-type-2-diabetes-1177506.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1177506-1672741280.png", "publishedAt": "2023-01-03T10:19:43Z", "content": "To prevent or reverse Type 2 diabetes, it is essential to monitor blood glucose levels regularly. If the blood glucose levels are consistently high, a person is more likely to suffer from diabetes.\r\n… [+16222 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "BDR Pharmaceutical launches generic drug for treating prostate cancer in India - Economic Times", "description": "BDR Group Director Business Development Raheel Shah said that the launch of APATIDE is  testimony towards our commitment in providing access to affordable medicines without compromising patients' safety as well as qualitative standards .", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/bdr-pharmaceutical-launches-generic-drug-for-treating-prostate-cancer-in-india/articleshow/96708591.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96708636,width-1070,height-580,imgsize-22078,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-03T10:01:00Z", "content": "‘No Govt Stake Deal in Vi Until Promoters Infuse Enough Cash’The promoters of Vodafone Idea are unwilling to infuse adequate capital into the telco, making it unviable for the government to convert t… [+616 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Human Organoids Implanted Into the Mouse Brain Respond to Sensory Signals - Technology Networks", "description": "For the first time, researchers have demonstrated that human brain organoids implanted into mice are able to establish functional connectivity and respond to sensory stimuli.", "url": "https://www.technologynetworks.com/neuroscience/news/human-organoids-implanted-into-the-mouse-brain-respond-to-sensory-signals-368725", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/368725/human-organoids-implanted-into-the-mouse-brain-respond-to-sensory-signals-368725-640x360.jpg?cb=20230103", "publishedAt": "2023-01-03T09:58:12Z", "content": "A team of engineers and neuroscientists has demonstrated for the first time that human brain organoids implanted in mice have established functional connectivity to the animals cortex and responded t… [+5509 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "4.74 lakh children to get additional dose of measles vaccine in Maha - Inshorts", "description": "Maharashtra government has identified 4.74 lakh children under the age of five for an additional dose of measles vaccine. At least 2.47 lakh of these children have already been immunised. The first phase of the immunisation drive was completed on December 25 …", "url": "https://inshorts.com/en/news/474-lakh-children-to-get-additional-dose-of-measles-vaccine-in-maha-1672732865260", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2023/01_jan/3_tue/img_1672729311990_187.jpg?", "publishedAt": "2023-01-03T08:15:00Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Your Blood Type May Predict Your Risk Of Having A Stroke Before 60, Says Study - NDTV", "description": "Blood types refer to the wide range of chemicals found on the surface of our red blood cells.", "url": "https://www.ndtv.com/science/your-blood-type-may-predict-your-risk-of-having-a-stroke-before-60-says-study-3659190", "urlToImage": "https://c.ndtvimg.com/2023-01/fecp0eno_the-ages-of-all-participants-ranged-from-18-to-59-picture-credit-unsplash-_625x300_03_January_23.jpg", "publishedAt": "2023-01-03T05:27:43Z", "content": "The ages of all participants ranged from 18 to 59. (Picture credit: Unsplash)\r\nAccording to new research, a person's blood type may be linked to their risk of having an early stroke. The findings cou… [+1971 chars]"}, {"source": {"id": null, "name": "Omnia-health.com"}, "author": null, "title": "Much-awaited breakthrough for treatment of Alzheimer's - Omnia Health Insights", "description": "Early-stage detection and new drug approval could slow down progression of the disease in patients.", "url": "https://insights.omnia-health.com/clinical/much-awaited-breakthrough-treatment-alzheimers", "urlToImage": "https://insights.omnia-health.com/sites/omnia-health.com/files/alzheimers%20breakthrough.png", "publishedAt": "2023-01-03T05:17:24Z", "content": "The discovery of a molecule in urine that can identify early-stage Alzheimers disease and a simultaneous approval of a drug that can slow down its progression are tipped off to be the much-awaited br… [+4060 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Deep learning tool identifies mosaic mutations that cause disease - News-Medical.Net", "description": "Genetic mutations cause hundreds of unsolved and untreatable disorders. Among them, DNA mutations in a small percentage of cells, called mosaic mutations, are extremely difficult to detect because they exist in a tiny percentage of the cells.", "url": "https://www.news-medical.net/news/20230102/Deep-learning-tool-identifies-mosaic-mutations-that-cause-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_734722_16727187721093579.jpg", "publishedAt": "2023-01-03T04:09:00Z", "content": "Genetic mutations cause hundreds of unsolved and untreatable disorders. Among them, DNA mutations in a small percentage of cells, called mosaic mutations, are extremely difficult to detect because th… [+4736 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Duping antibodies with a decoy, researchers aim to prevent rejection of transplanted cells - Medical Dialogues", "description": "Researchers at UCSF have developed a novel, potentially life-saving approach that may prevent antibodies from triggering immune rejection of engineered therapeutic and transplant cells.   The new...", "url": "https://medicaldialogues.in/mdtv/medicine/videos/duping-antibodies-with-a-decoy-researchers-aim-to-prevent-rejection-of-transplanted-cells-105045", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/03/196073-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-1.jpg", "publishedAt": "2023-01-03T04:00:00Z", "content": "Researchers at UCSF have developed a novel, potentially life-saving approach that may prevent antibodies from triggering immune rejection of engineered therapeutic and transplant cells. \r\nThe new str… [+1667 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "Weight Loss: 5 Things You Must AVOID If You're Trying To Shed Those Extra Kilos - Jagran English", "description": "", "url": "https://english.jagran.com/lifestyle/weight-loss-things-you-must-avoid-if-youre-trying-to-shed-those-extra-kilos-10059664", "urlToImage": "https://imgeng.jagran.com/images/2023/jan/weightlossmistakestoavoid1672717256746.jpg", "publishedAt": "2023-01-03T03:33:36Z", "content": "LOSING WEIGHT is one of the practices that most people follow. But we all also struggle with one major question which is how to lose weight in the right way. With numerous articles and expert advices… [+3120 chars]"}, {"source": {"id": null, "name": "Orissadiary.com"}, "author": "OdAdmin", "title": "Alpine Ice Hack Reviews (Fake or Legit) Exposing Alpilean Pills Recipe - Odisha Diary", "description": "The Alpine Ice Hack Recipe, Alpilean, is a revolutionary weight loss supplement that helps your body shed excess weight in a completely natural way. This popular fat burner is a portal to an entirely new you, a route to transforming from an unhealthy", "url": "https://orissadiary.com/alpine-ice-hack-reviews-fake-or-legit-exposing-alpilean-pills-recipe/", "urlToImage": "https://i0.wp.com/orissadiary.com/wp-content/uploads/2022/05/od-default-image-1.jpg?fit=800%2C800&ssl=1", "publishedAt": "2023-01-03T03:30:12Z", "content": "The Alpine Ice Hack Recipe, Alpilean, is a revolutionary weight loss supplement that helps your body shed excess weight in a completely natural way. This popular fat burner is a portal to an entirely… [+19201 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Judith Keeling", "title": "Inspiring new study that proves you CAN conquer Type 2 diabetes - Daily Mail", "description": "After living with type 2 diabetes for a decade, Ann Geoghegan was used to feeling exhausted all the time, struggling with her weight and failing to control her blood sugar levels.", "url": "https://www.dailymail.co.uk/health/article-11592925/Inspiring-new-study-proves-conquer-Type-2-diabetes.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/02/22/66131629-0-image-a-30_1672696819337.jpg", "publishedAt": "2023-01-02T22:29:31Z", "content": "After living with type 2 diabetes for a decade, Ann Geoghegan was used to feeling exhausted all the time, struggling with her weight and failing to control her blood sugar levels.\r\nMy vision was also… [+14532 chars]"}]}