{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: Outsmarting brain cancer, nanoparticle and inhibitor trigger the immune system - ANI News", "description": "Washington [US], May 29 (ANI): A small molecule has been identified that blocks a key pathway in brain tumours, according to the scientists at the University of Michigan Rogel Cancer Center.", "url": "https://www.aninews.in/news/science/study-outsmarting-brain-cancer-nanoparticle-and-inhibitor-trigger-the-immune-system20220529234432", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/canccerzzz20220228122010202203051114482022031022381820220529180758.jpg", "publishedAt": "2022-05-29T18:14:00Z", "content": "ANI | Updated: May 29, 2022 23:44 IST\r\nWashington [US], May 29 (ANI): A small molecule has been identified that blocks a key pathway in brain tumours, according to the scientists at the University of… [+4691 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Shipra Singh", "title": "Travelling Abroad? Get Yourself Insured Against Monkeypox | Mint - Mint", "description": "Most health insurance policies cover virus-borne infections, and so will get you coverage against hospitalization expenses arising from contracting Monkeypox", "url": "https://www.livemint.com/money/personal-finance/travelling-abroad-get-yourself-insured-against-monkeypox-11653839857574.html", "urlToImage": "https://images.livemint.com/img/2022/05/29/600x338/mp_1653840204599_1653840232813.jpg", "publishedAt": "2022-05-29T16:08:59Z", "content": "Beware. Monkeypox is on the prowl and this new viral outbreak could dampen holiday spirits for those travelling to Europe and the US. So, get insured if youre travelling to countries that have regist… [+2226 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Dementia: Know about various risk factors linked to dementia | The Times of India - Times of India", "description": "Dementia is not a single disease; it's an umbrella term that encompasses a wide range of medical conditions, including Alzheimer's disease, similar to heart disease. Abnormal brain changes cause the disorders grouped under the umbrella term dementia.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/dementia-know-about-various-risk-factors-linked-to-dementia/photostory/91865623.cms", "urlToImage": "https://static.toiimg.com/photo/91865711.cms", "publishedAt": "2022-05-29T15:30:00Z", "content": "Dementia is not a single disease; it's an umbrella term that encompasses a wide range of medical conditions, including Alzheimer's disease, similar to heart disease. Abnormal brain changes cause the … [+621 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "High cholesterol? These 6 foods can’t be missed on your shopping list - Play Crazy Game", "description": "O cholesterol It is a disease that affects different groups of people in different parts of the world. As much as doctors prescribe medications in order to control or treat the condition, there is no better and more practical way to control cholesterol than m…", "url": "https://playcrazygame.com/2022/05/29/high-cholesterol-these-6-foods-cant-be-missed-on-your-shopping-list/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/05/colessterol-2.jpg", "publishedAt": "2022-05-29T14:36:07Z", "content": "O cholesterol It is a disease that affects different groups of people in different parts of the world. As much as doctors prescribe medications in order to control or treat the condition, there is no… [+3159 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: What is the West Nile Virus, how does it spread? - The Indian Express", "description": "The West Nile Virus is a mosquito-borne, single-stranded RNA virus. According to the WHO, it is “a member of the flavivirus genus and belongs to the Japanese Encephalitis antigenic complex of the family Flaviviridae”.", "url": "https://indianexpress.com/article/explained/explained-what-is-the-west-nile-virus-how-does-it-spread-7942629/", "urlToImage": "https://images.indianexpress.com/2022/05/Virus.jpg", "publishedAt": "2022-05-29T14:33:45Z", "content": "The Kerala health department is on alert after the death of a 47-year-old from Thrissur due to the West Nile Virus. Earlier in 2019, a six-year-old boy in Malappuram district had died of the same inf… [+3593 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "H pylori infection may diminish immunotherapy response in Acute gastric cancer patients - Medical Dialogues", "description": "Patients with advanced gastric cancer and active  Helicobacter pylori (H pylori) infection may have...", "url": "https://medicaldialogues.in/oncology/news/h-pylori-infection-may-diminish-immunotherapy-response-in-acute-gastric-cancer-patients-93644", "urlToImage": "https://medicaldialogues.in/h-upload/2022/05/26/177212-download.jpg", "publishedAt": "2022-05-29T14:30:48Z", "content": "Patients with advanced gastric cancer and active Helicobacter pylori (H pylori) infection may have a diminished response to anti-programmed cell death-1 (anti-PD-1) antibody therapy and shorter progr… [+2258 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Iraq seeing outbreak of nose-bleed fever. Here’s what we know about the deadly disease - WION", "description": "The disease called the Crimean-Congo haemorrhagic fever has claimed 19 deaths among 111 cases this year, according to the World Health Organization", "url": "https://www.wionews.com/world/iraq-seeing-outbreak-of-nose-bleed-fever-heres-what-we-know-about-the-deadly-disease-483282", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/29/266232-siawaw.jpg", "publishedAt": "2022-05-29T14:28:47Z", "content": "Iraq is in the midst of an outbreak of a fever that causes people to bleed to death, according to local media reports.\r\nThe disease called the Crimean-Congo haemorrhagic fever has claimed 19 deaths a… [+2790 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Michael Martin", "title": "Already Had COVID? 55% of Patients Still Have These Symptoms After — Eat This Not That - Eat This, Not That", "description": "Estimates of how many people suffer from \"long COVID\" vary. One study found it may be larger than previously thought.", "url": "http://www.eatthis.com/news-patients-still-have-these-symptoms-covid/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2020/12/woman-sick-breathing-prblem-covid-face-mask-ill.jpg?quality=82&strip=all", "publishedAt": "2022-05-29T12:48:05Z", "content": "COVID-19 has left an enduring mark on American life. Several months into the pandemic, it was clear that it wasn't going away anytime soon. More than two years later, COVID is something we have to le… [+4034 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sounak Mukhopadhyay", "title": "Fertility Problems In Obese Women: Study Suggests Doing This | Mint - Mint", "description": "According to the findings of a new study, this can partially restore reproductive hormone levels in obese women, leading to enhanced fertility.", "url": "https://www.livemint.com/news/india/fertility-problems-in-obese-women-study-suggests-doing-this-11653827274090.html", "urlToImage": "https://images.livemint.com/img/2022/05/29/600x338/myriam-zilles-tEJm9fvlju8-unsplash_1653828146357_1653828171366.jpg", "publishedAt": "2022-05-29T12:47:21Z", "content": "According to the findings of a new study published in the 'Journal of Endocrinology,' reducing blood glucose levels can partially restore reproductive hormone levels in obese females, leading to enha… [+3628 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Monkeypox outbreak: Tamil Nadu asks people coming from THESE countries to report symptoms- All you need to... - Zee News", "description": "As the threat of Monkeypox virus looms, the Tamil Nadu government on Sunday (May 29) urged people arriving from overseas including European and African countries to report to the local health officer if they detect any symptoms of the disease.", "url": "https://zeenews.india.com/india/monkeypox-outbreak-tamil-nadu-asks-people-coming-from-these-countries-to-report-symptoms-all-you-need-to-know-about-the-virus-2468506.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/05/29/1047951-monkeypox.jpg", "publishedAt": "2022-05-29T12:40:49Z", "content": "New Delhi: As the threat of Monkeypox virus looms, the Tamil Nadu government on Sunday (May 29) urged people arriving from overseas including European and African countries to report to the local hea… [+2642 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Homegrown herbs that can easily fix weight issues - Times of India", "description": "Here are some age-old herbs, which are known for their efficacy in burning fat and improving overall health. These simple homegrown herbs can boost your weightloss journey and help you stay fit! Read on…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/homegrown-herbs-that-can-easily-fix-weight-issues/photostory/91870570.cms", "urlToImage": "https://static.toiimg.com/photo/91870658.cms", "publishedAt": "2022-05-29T12:30:00Z", "content": "Another popularly used herb, Parsley can naturally help in weight loss. This is because of its diuretic properties, which helps in reducing water weight (water retention). Apart from that, this simpl… [+379 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Are you fatigued or just tired? Know the difference from expert - Hindustan Times", "description": "Being fatigued is different from being tired. Here's how to know the difference. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/are-you-fatigued-or-just-tired-know-the-difference-from-expert-101653825707877.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/29/1600x900/fatigue_vs_tired_1653825960414_1653825976684.jpg", "publishedAt": "2022-05-29T12:15:10Z", "content": "We often use the terms fatigue and tired interchangeably but medically they do not mean the same thing. While tiredness is something which we feel after a long or hectic day, when you are fatigued ev… [+2283 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "Explained: Monkeypox symptoms usually occur in these 4 stages - Hindustan Times", "description": "According to the WHO, monkeypox is usually a self-limited disease and typically lasts 2 to 4 weeks. It may be severe in children, pregnant women or persons with immunosuppression due to other conditions. | World News", "url": "https://www.hindustantimes.com/world-news/explained-monkeypox-symptoms-usually-occur-in-these-4-stages-101653824965084.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/29/1600x900/HEALTH-MONKEYPOX-GERMANY-VACCINE-10_1653664864439_1653825313414.JPG", "publishedAt": "2022-05-29T11:56:29Z", "content": "Ireland and Mexico on Saturday confirmed their first cases of the monkeypox just a day after Argentina reported its first case of the disease. Officials in Mexico said the infected person is a 50-yea… [+1854 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Promising cancer vaccine is hope for new treatment options - Play Crazy Game", "description": "Patients suffering from cancer should have in the coming years new treatment options that increase survival. One of them is the promising vaccine OVM-200, which is being developed by the company Oxford Vacmedix, linked to the University of Oxford, in the Unit…", "url": "https://playcrazygame.com/2022/05/29/promising-cancer-vaccine-is-hope-for-new-treatment-options/", "urlToImage": "https://www.cenariomt.com.br/wp-content/uploads/2022/05/injection-4544448_1920.jpg", "publishedAt": "2022-05-29T11:52:14Z", "content": "Patients suffering from cancer should have in the coming years new treatment options that increase survival. One of them is the promising vaccine OVM-200, which is being developed by the company Oxfo… [+2515 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Monkeypox, Scrub Typhus, Tomato and other viruses knocking on door in unexpect - Zee News", "description": "Some of the recent outbreaks include the Monkeypox virus, which has now reached the endemic stage in almost 11 countries, Tomato Fever, largely observed in India and the most recent Scrub Typhus.", "url": "https://zeenews.india.com/photos/world/monkeypox-scrub-typhus-tomato-and-other-viruses-knocking-on-door-in-unexpected-ways-2468462", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/05/29/1047922-virus-gallery.png", "publishedAt": "2022-05-29T11:20:08Z", "content": "As the world began to come out of the dangerous ramifications of the Covid-19 pandemic owing to the gradually declining cases, several other viruses, as predicted by the WHO started to emerge. Some o… [+849 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "David Hamilton", "title": "How to Manage Cravings While Losing Those Extra Kilos? - Global Circulate", "description": "Weight-Loss Hacks: Cravings are one of the most difficult obstacles to overcome when trying to lose weight. When we’re attempting to eat healthier and consume fewer calories, they always seem to hit us the hardest. You just know they’ll", "url": "https://globalcirculate.com/how-to-manage-cravings-while-losing-those-extra-kilos/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/05/WhatsApp-Image-2022-05-29-at-3.35.25-PM.jpeg", "publishedAt": "2022-05-29T11:17:07Z", "content": "Weight-Loss Hacks: Cravings are one of the most difficult obstacles to overcome when trying to lose weight. When were attempting to eat healthier and consume fewer calories, they always seem to hit u… [+2933 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manjari Chandra", "title": "Eat Right: Five signs of an unhealthy gut - The Indian Express", "description": "Does your child suffer from frequent diarrhoea and mood swings? They might simply be the effects of gut ill-health", "url": "https://indianexpress.com/article/parenting/eat-right-five-signs-of-an-unhealthy-gut-7941061/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-children-gut-health-1200.jpg", "publishedAt": "2022-05-29T11:04:07Z", "content": "The human gut that includes the stomach and intestines is lined by epithelial and immune cells that interact with the gut microbiota to form a protective barrier from the external environment. The gu… [+5844 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "Sindujaa D N", "title": "Chickenpox or Monkeypox? Check Here!! - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "health : At present, a new disease called Monkeypox is rampant all over the world. The disease, known as monkeypox, is spreading rapidly around the wo", "url": "https://www.indiaherald.com/Health/Read/994505156/Chickenpox-or-Monkeypox-Check-Here", "urlToImage": "https://www.indiaherald.com/imagestore/images/health/movies_news/chickenpox-or-monkeypox-check-here8d2adb5e-04fe-4a81-813a-abc709dc424c-415x250-IndiaHerald.jpg", "publishedAt": "2022-05-29T10:55:20Z", "content": "Trivitran Healthcare, a private healthcare company in india , said it would develop a real-time RT-PCR kit to detect the monkeypox virus. This real-time PCR kit, developed by Trivitran, will explain … [+1057 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Combating the emotional and mental burden of infertility - ETHealthWorld", "description": "Fertility treatments come with their own sets of biological, emotional, and financial pressure for couples. Some of the hormonal fluctuations caused by the treatment can cause psychological-emotional disorders or consequences including confusion, frustration,…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/combating-the-emotional-and-mental-burden-of-infertility/91869055", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91869055,imgsize-16578,width-1200,height-628,overlay-ethealthworld/combating-the-emotional-and-mental-burden-of-infertility.jpg", "publishedAt": "2022-05-29T10:11:00Z", "content": "By Akshat SethRising burden of infertility\r\nInfertility is something that impacts millions of couples around the world. In India alone, there are 28 million couples who experience the condition. Stud… [+4168 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Physical activity coupled with good diet help avoid health problems during menopause - ANI News", "description": "Finland [Europe], May 29 (ANI): According to a study conducted at the University of Jyvaskyla in Finland, menopausal transition increases women's body fat, particularly around the waist. As a result, women in their forties and fifties should pay special atten…", "url": "https://www.aninews.in/news/health/physical-activity-coupled-with-good-diet-help-avoid-health-problems-during-menopause20220529143806", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/Capturedgdsg20220529090754.jpg", "publishedAt": "2022-05-29T09:08:00Z", "content": "ANI | Updated: May 29, 2022 14:38 IST\r\nFinland [Europe], May 29 (ANI): According to a study conducted at the University of Jyvaskyla in Finland, menopausal transitionincreases women's body fat, parti… [+3182 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Disease experts call on WHO, governments for more action on monkeypox - ETHealthWorld", "description": "They are arguing that governments and the World Health Organization should not repeat the early missteps of the Covid-19 pandemic that delayed the detection of cases, helping the virus spread.", "url": "https://health.economictimes.indiatimes.com/news/policy/disease-experts-call-on-who-governments-for-more-action-on-monkeypox/91868235", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91868235,imgsize-8506,width-1200,height-628,overlay-ethealthworld/disease-experts-call-on-who-governments-for-more-action-on-monkeypox.jpg", "publishedAt": "2022-05-29T09:00:00Z", "content": "GENEVA: Some prominent infectious disease experts are pushing for faster action from global health authorities to contain a growing monkeypox outbreak that has spread to at least 20 countries.They ar… [+4278 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Top mental health disorders that often go undiagnosed - Hindustan Times", "description": "Why do people with mental health issues like depression and anxiety hide their symptoms from the world? An expert answers. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/top-mental-health-disorders-that-often-go-undiagnosed-101653813760791.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/29/1600x900/pjimage_(23)_1645866523127_1653813904101.jpg", "publishedAt": "2022-05-29T08:49:28Z", "content": "Mental health issues are on rise across the globe yet when it comes to treating them many of the disorders remain undiagnosed due to stigma attached to them. While it's easier to talk about physical … [+4435 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Abhishek  Hari", "title": "Irish man loses memory after having sex with wife: Report - NewsBytes", "description": "In a bizarre incident, a 66-year-old Irish man was hospitalized with short-term memory loss after having sex with his wife", "url": "https://www.newsbytesapp.com/news/world/man-loses-memory-after-having-sex-with-wife/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l49020220529133703.jpeg", "publishedAt": "2022-05-29T08:41:04Z", "content": "Irish man loses memory after having sex with wife: Report\r\nMay 29, 2022, 02:11 pm2 min read\r\nIn a bizarre incident, a 66-year-old Irish man was hospitalized with short-term memory loss soon after hav… [+1910 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "According to new study, heart rhythm disorder has been related to air pollution - DNA India", "description": "According to new study, heart rhythm disorder has been related to air pollution - According to recent research presented at the European Society of Cardiology's annual Congress, arrhythmias is life-threatening and occur with polluted air. According to World H…", "url": "https://www.dnaindia.com/lifestyle/video-according-to-new-study-heart-rhythm-disorder-has-been-related-to-air-pollution-2956436", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/05/29/2037985-1653809708-00000003.jpg", "publishedAt": "2022-05-29T07:35:11Z", "content": null}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Young people aged 12 to 17 can be immunized with the 3rd dose from Monday (30) - Play Crazy Game", "description": "Young people aged 12 to 17 can be immunized with the 3rd dose from Monday (30) Published on 05/28/2022 at 1:37 pm Jundiaí begins this Monday (30) to apply the 3rd dose of the COVID-19 vaccine to adolescents aged 12 to 17 years, according to a directive from t…", "url": "https://playcrazygame.com/2022/05/29/young-people-aged-12-to-17-can-be-immunized-with-the-3rd-dose-from-monday-30/", "urlToImage": "https://jundiai.sp.gov.br/noticias/wp-content/uploads/sites/32/2022/05/vacinacao-covid_parque-da-uva-105.jpg", "publishedAt": "2022-05-29T07:09:23Z", "content": "Published on 05/28/2022 at 1:37 pm \r\nJundiaí begins this Monday (30) to apply the 3rd dose of the COVID-19 vaccine to adolescents aged 12 to 17 years, according to a directive from the Ministry of He… [+3336 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Dr Alok V. Kulkarni", "title": "Dr Alok Kulkarni on factors causing borderline personality disorder - The Week", "description": "BPD is characterised by ongoing pattern of varying moods, unstable self-image", "url": "https://www.theweek.in/health/more/2022/05/27/dr-alok-kulkarni-on-factors-causing-borderline-personality-disorder.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/more/images/2022/5/27/37-Life-on-the-brink.jpg", "publishedAt": "2022-05-29T06:33:00Z", "content": "RAMONA, 36, visited me at the peak of the pandemic with anger outbursts, frequent threats of self-harm, problems with her spouse, family members and friends, and intense crying spells lasting hours. … [+3473 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Pinkvilla Desk", "title": "6 Foods to reduce stress and nourish your body - PINKVILLA", "description": "Discover foods that reduce stress by decreasing your cortisol levels-associated with your sleep cycles, inflammation, blood sugar levels, and blood pressure, while adding nourishment to your body", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/6-foods-reduce-stress-and-nourish-your-body-1123735", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/stress-busting-foods_1.jpg?itok=hs_wP9td", "publishedAt": "2022-05-29T05:50:17Z", "content": "Today, we can safely say that the stress in our lives is increasing exponentially and we find ways to relieve the stress, perhaps by indulging in hobbies or spending time with our friends and family.… [+4266 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Ayurvedic herbs to manage joint pain naturally - Hindustan Times", "description": "Injuries, overuse of joints or certain health conditions like arthritis can impact your joint mobility and make them swollen or painful. There are many ways to manage joint pain naturally from exercise, applying heating pad or ice packs to losing weight. Nutr…", "url": "https://www.hindustantimes.com/photos/lifestyle/ayurvedic-herbs-to-manage-joint-pain-naturally-101653802801511.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/29/1600x900/ayurvedic_herbs_joint_pain_thumb_1653802808978_1653802850077.jpg", "publishedAt": "2022-05-29T05:44:35Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Fruits and vegetables play important role in ADHD symptoms in kids - Hindustan Times", "description": "As part of a larger study, researchers asked parents of 134 kids with ADHD symptoms to complete a detailed questionnaire about the typical foods the children ate, including portion sizes, over a 90-day period. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/fruits-and-vegetables-play-important-role-in-adhd-symptoms-in-kids-101653800812550.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/29/1600x900/312eed96-2b76-11ec-a8a7-28039111faee_1634055317595_1653800862030.jpg", "publishedAt": "2022-05-29T05:09:30Z", "content": "Children who eat fruits and vegetables have less inattention, according to a recent study.\r\nThe findings of the study were published in the journal, 'Nutritional Neuroscience'.\r\nAs part of a larger s… [+4304 chars]"}, {"source": {"id": null, "name": "Mumbailive.com"}, "author": null, "title": "Breast cancer is not only limited to older women: Doctor - Mumbai Live", "description": "Wockhardt Hospitals Mira Road launched its own Breast Cancer Support Group at the facility to spread awareness among all generations The aim is to spread the message that breast cancer patients have a good survival rate and can lead a normal life Experts Dr A…", "url": "https://www.mumbailive.com/en/society/breast-cancer-is-not-only-limited-to-older-women-says-doctor-73405", "urlToImage": "https://www.mumbailive.com/images/media/images/breast_cancer_1653389046779jpeg?bg=5a5453&crop=1156%2C521%2C0%2Cnull&fit=fill&fitToScale=w%2C1368%2C768&fm=webp&h=606.3157894736842&height=521&w=1080&width=1156", "publishedAt": "2022-05-29T04:50:01Z", "content": "Wockhardt Hospitals, Mira Road launched its own Breast Cancer Support Group, at the facility to spread awareness among all generations. The aim is to spread the message that breast cancer patients ha… [+3959 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Expresso Health Updates Of The Week - The Indian Express", "description": "You are listening to the Expresso Health Update. Here is the latest news from the world of health brought to you by The Indian Express. “Let us begin with news about the long-term effects related to long working hours. Long working hours have been known to ca…", "url": "https://indianexpress.com/audio/expresso-entertainment-update/expresso-health-updates-of-the-week-4/7935702/", "urlToImage": "https://images.indianexpress.com/2022/04/Expresso-health-1200x630-1.jpg", "publishedAt": "2022-05-29T04:00:15Z", "content": "You are listening to the Expresso Health Update. Here is the latest news from the world of health brought to you by The Indian Express.“Let us begin with news about the long-term effects related to l… [+5898 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Dengue cases rise to 6 in dist in less than a fortnight - The Tribune India", "description": "In less than a fortnight, the number of dengue cases has climbed to six in the district. Though humidity levels are yet to touch the 75 mark (believed to be conducive for dengue larvae breeding), a steady rise in the number of cases is being witnessed.", "url": "https://www.tribuneindia.com/news/jalandhar/dengue-cases-rise-to-6-in-dist-in-less-than-a-fortnight-399181", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_1607814950.JPG", "publishedAt": "2022-05-29T03:41:00Z", "content": "Tribune News Service\r\nAparna Banerji\r\nJalandhar, May 28\r\nIn less than a fortnight, the number of dengue cases has climbed to six in the district. Though humidity levels are yet to touch the 75 mark (… [+3433 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Why weight watchers are choosing sourdough bread over regular bread - Times of India", "description": "Bread is one of the essential breakfast items for most people, especially busy professionals who love themselves a quick bite to eat. For them, bread can be salvaging and time-saving.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/why-weight-watchers-are-choosing-sourdough-bread-over-regular-bread/photostory/91837776.cms", "urlToImage": "https://static.toiimg.com/photo/91837799.cms", "publishedAt": "2022-05-29T01:30:00Z", "content": "Since sourdough bread is said to go through the fermentation process, many believe it may have several health benefits. Given that it contains beneficial bacteria and low phytates, some experts claim… [+709 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Dr Aruna Muralidhar", "title": "Puberty is just a period - Deccan Herald", "description": "Puberty is the time in your child’s life when they transition from a child to an adult. Special hormones are produced and released that trigger the signs of puberty. Girls between the age of 9 and 11 years usually develop certain physical changes in their bod…", "url": "https://www.deccanherald.com/sunday-herald/sh-top-stories/puberty-is-just-a-period-1112915.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/29/file7l2o9jmizmcwb5e0z8-1112915-1653765301.jpg", "publishedAt": "2022-05-28T19:00:56Z", "content": "Puberty is the time in your childs life when they transition from a child to an adult. Special hormones are produced and released that trigger the signs of puberty. Girls between the age of 9 and 11 … [+3886 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Andrew Lee, The Conversation", "title": "Like HIV, the spread of monkeypox runs the risk of stigmatising gay and bisexual men - Scroll.in", "description": "Experts need to get across the message that monkeypox is not a disease of men who have sex with men.", "url": "https://scroll.in/article/1024865/like-hiv-the-spread-of-monkeypox-runs-the-risk-of-stigmatising-gay-and-bisexual-men", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/174953-zzeuhzjfez-1653574040.jpg", "publishedAt": "2022-05-28T18:00:00Z", "content": "The first case of monkeypox in the current outbreak was reported to the World Health Organization on May 7. The person in question had recently returned to the UK from Nigeria, where they are believe… [+5687 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss: Beetroot raita and other refreshing low-cal raita recipes to lose weight faster - Times of India", "description": "A raita is high in protein and low in unhealthy fats.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-beetroot-raita-and-other-refreshing-low-cal-raita-recipes-to-lose-weight-faster/photostory/91838908.cms", "urlToImage": "https://static.toiimg.com/photo/91838944.cms", "publishedAt": "2022-05-28T17:30:00Z", "content": "When it comes to weight loss, diet plays a huge role. Substituting one junk-food meal with something super healthy can do wonders for your body. If you are exercising everyday, especially in summer t… [+345 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Dementia metaphors help describe the condition, but can also perpetuate stigma and hinder treatment - The Indian Express", "description": "These metaphors can compound beliefs that people with dementia are incompetent, unable to consent and do not need to be consulted about their care.", "url": "https://indianexpress.com/article/lifestyle/health/dementia-metaphors-condition-stigma-treatment-7923177/", "urlToImage": "https://images.indianexpress.com/2022/02/dementia-1200.jpg", "publishedAt": "2022-05-28T16:10:18Z", "content": "Half a million Canadians are living with dementia and one in five Canadians has cared for someone with dementia. Dementiais an umbrella term for many conditions causing loss of memory, language, prob… [+5573 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Do Not Fall for These Myths About Women's Sexual and Reproductive Health - News18", "description": "From not talking about menstruation out loud to frequently restricting women’s sexual activity everything is considered a taboo", "url": "https://www.news18.com/news/lifestyle/do-not-fall-for-these-myths-about-womens-sexual-and-reproductive-health-5251711.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-6-27-165288408816x9.png", "publishedAt": "2022-05-28T14:30:11Z", "content": "Womens reproductive health has always been part of one myth or another. When it comes to womens sexuality, it has often been considered taboo. From not talking about menstruation out loud to frequent… [+2308 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "These Daily Food Items May Raise Risk of Cardiovascular Diseases - News18", "description": "According to studies, consumption of a high amount of salt, sugar, and refined carbs can raise a higher risk of cardiovascular disease", "url": "https://www.news18.com/news/lifestyle/these-daily-food-items-may-raise-risk-of-cardiovascular-diseases-5251669.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/heart-attack-165276045916x9.png", "publishedAt": "2022-05-28T13:30:33Z", "content": "Choosing options to avoid any health complications has been a trend nowadays. According to studies, consumption of a high amount of salt, sugar, and refined carbs can raise a higher risk of cardiovas… [+1802 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "Multiple sclerosis: the discovery of a link with a virus gives hope for progress - OI Canadian", "description": "Stop the virus to prevent the disease The discovery of a link to the Epstein-Barr virus, which affects 95% of adults and is the cause of other diseases such as mononucleosis, suggests that most cases", "url": "https://oicanadian.com/multiple-sclerosis-the-discovery-of-a-link-with-a-virus-gives-hope-for-progress/", "urlToImage": "https://ds.static.rtbf.be/article/image/1920x1080/a/9/2/4ef920c362d1fea2a27e06cfbce05fef-1653732492.jpg", "publishedAt": "2022-05-28T12:58:17Z", "content": "The discovery of a link to the Epstein-Barr virus, which affects 95% of adults and is the cause of other diseases such as mononucleosis, suggests that most cases of multiple sclerosis could be preven… [+1365 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Men More Prone to Mosquito Bites Than Women, Explains Study - News18", "description": "The study says that the sweetness of blood has nothing to do with mosquito bites.", "url": "https://www.news18.com/news/buzz/men-more-prone-to-mosquito-bites-than-women-explains-study-5266453.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-14-3-1-165374151916x9.png", "publishedAt": "2022-05-28T12:39:09Z", "content": "We have all been subjected to mosquito bites and it can be one of the most irksome experiences. However, it will not come as a surprise to most of you that some people are more prone to mosquito bite… [+1564 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Pritam Saha", "title": "Scrub Typhus: Over 80 people in Bengal reportedly infected - causes and symptoms - Zee News", "description": "Symptoms   Like the common fever, the symptoms of this disease are: 1. Pain in the hands and feet.  2. Insect bite marks are found on the body.  3. Headache 4. Persistent fever  5. Low blood pressure 6. In some cases cough and cold 7. Rash all over the body. …", "url": "https://zeenews.india.com/india/scrub-typhus-over-80-cases-in-bengal-reportedly-infected-causes-and-symptoms-2468212.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/05/28/1047668-webp.net-resizeimage-2022-05-28t173618.281.jpg", "publishedAt": "2022-05-28T12:07:32Z", "content": "Did you have a fever? Then it's not too late. Go to the doctor now. This is what experts advise the residents of Coochbehar in West Bengal. The reason for this is that Scrub Typhus has increased the … [+1939 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "Regular exercise to sleep: 5 effective ways to be mentally healthy - Asianet Newsable ", "description": "Multiple research has found that physically active people are less likely to experience a decline in mental function.", "url": "https://newsable.asianetnews.com/gallery/lifestyle/regular-exercise-to-sleep-5-effective-ways-to-be-mentally-healthy-adt-rcldi0", "urlToImage": "https://static-ai.asianetnews.com/images/01esfy7znj7tpkcp6jtahds9tx/4-jpg_1200x630xt.jpg", "publishedAt": "2022-05-28T12:03:36Z", "content": "Multiple research has found that physically active people are less likely to experience a decline in mental function.\r\nAs you age, the mind starts to age too. Changes in the body aer easily visible; … [+2550 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "The #1 Worst Drinking Habit for Your Heart, Suggests New Study — Eat This Not That - Eat This, Not That", "description": "A new study suggests that even a moderate amount of alcohol consumed can be dangerous to your heart's health.", "url": "http://www.eatthis.com/the-1-worst-drinking-habit-for-your-heart-suggests-new-study/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/draft-beer-size-1.jpg?quality=82&strip=all", "publishedAt": "2022-05-28T12:00:47Z", "content": "While you might enjoy having a few beers while hanging out with friends or a couple of glasses of wine to unwind at the end of the day, you might also do your best to limit how much alcohol you drink… [+1988 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Sugandha Jha", "title": "Jagran Explainer | How Monkeypox Is Different From Smallpox And Chickenpox - Jagran English", "description": "Monkeypox has been reported in more than 20 countries as of now according to WHO. The Indian Council of Medical Research (ICMR), on Friday informed that children are more at risk of getting infected with the monkeypox virus.", "url": "https://english.jagran.com/india/jagran-explainer-how-monkeypox-is-different-from-smallpox-and-chickenpox-10044020", "urlToImage": "https://imgeng.jagran.com/images/2022/may/uupps1653739474621.jpg", "publishedAt": "2022-05-28T11:54:26Z", "content": "New Delhi | Jagran News Desk: As monkeypox cases are spreading fastly across many countries, experts are trying to understand how the virus works and how fatal it could be. As per the World Health Or… [+2329 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Women Health: 7 Healthy Eating Habits For Women With PCOS - NDTV Food", "description": "Women with polycystic ovarian syndrome (PCOS) need to take special care of their health and diet to keep up a good health. Here are a few expert food tips for you.", "url": "https://food.ndtv.com/health/women-health-7-healthy-eating-habits-for-women-with-pcos-3017616", "urlToImage": "https://i.ndtvimg.com/i/2017-03/periods-620x350_620x350_71488801591.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-28T11:38:01Z", "content": "It's likely for a person with Polycystic Ovarian Syndrome (PCOS) to have been advised certain foods that are good for them and certain foods that they should avoid to keep the weight down and hormone… [+3316 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "5 Healthy Way to Increase Fibre in Your Diet - News18", "description": "Fibre is the perfect nutrient for our gut microbiome and is recommended to consume 30 grams of it every day", "url": "https://www.news18.com/news/lifestyle/5-healthy-way-to-increase-fibre-in-your-diet-5250349.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/fibre-rich-food-165368610616x9.jpg", "publishedAt": "2022-05-28T11:30:57Z", "content": "To stay healthy, you need to make sure that your diet consists of a proper proportion of all nutrients. And getting enough fibre in your body is equally important for your health.\r\nFibre is the perfe… [+1681 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "Reasons You're Gaining Weight in Your Belly — Eat This Not That - Eat This, Not That", "description": "Having a little belly fat is normal, but an expanding waistline is unhealthy because of visceral fat, which is located deep in your abdomen.", "url": "http://www.eatthis.com/news-reasons-youre-gaining-weight-in-belly/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/02/woman-doctor-obese-obesity-belly-fat-measurment.jpg?quality=82&strip=all", "publishedAt": "2022-05-28T10:45:46Z", "content": "Having a little belly fat is normal, but an expanding waistline is unhealthy because of visceral fat, which is located deep in your abdomen and wraps around your vital organs. Visceral fat is actuall… [+7877 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Mrunal Manmay Dash", "title": "No mass vaccination needed for Monkeypox yet, says Odisha health expert - OTV News", "description": "Speaking to OTV, health expert Dr Neeraj Mishra said, “The WHO has raised its concern because cases of Monkeypox have been witnessed in the non-endemic African countries. The good news is that the virus has not changed its nature yet. It has similarities with…", "url": "https://odishatv.in/news/health/no-mass-vaccination-needed-for-monkeypox-yet-says-odisha-health-expert-177815", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/Monkeypox_1653622991.jpg", "publishedAt": "2022-05-28T09:30:00Z", "content": "Playing down the concerns of the World Health Organisation (WHO) regarding the Monkeypox disease, health experts in Odisha have said that there is no need for mass vaccination yet in the State.\r\nSpea… [+1526 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Smoking Takes a Toll On Male and Female Reproductive Health, Doctor Explains - India.com", "description": "Smoking has negative effects on men and women. It damages the genetic material in eggs and sperm leading to fertility problems. A couple might find it difficult to conceive.", "url": "https://www.india.com/health/smoking-takes-a-toll-on-male-and-female-reproductive-health-doctor-explains-5418251/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/03/pexels-lilartsy-2827798.jpg", "publishedAt": "2022-05-28T09:02:32Z", "content": "Pune: Smoking not only causes lung cancer, heart disease, stroke, and lung diseases, but also reproductive health problems in men and women. It can lead to erectile dysfunction and low sperm count in… [+3007 chars]"}, {"source": {"id": null, "name": "Dailyhover.com"}, "author": null, "title": "Top 6 Supplements for Skin Health - DailyHover", "description": "What you put in your body is just as important as what you put on it in terms of skin health. There are many products out there that claim to be “youth in a bottle” and that they are going to dramatically change your skin, which can often make shopping for yo…", "url": "https://dailyhover.com/top-6-supplements-for-skin-health/", "urlToImage": "https://dailyhover.com/wp-content/uploads/2022/05/Top-10-Supplements-for-Healthy-Skin.png", "publishedAt": "2022-05-28T08:20:27Z", "content": "What you put in your body is just as important as what you put on it in terms of skin health. There are many products out there that claim to be youth in a bottle and that they are going to dramatica… [+4561 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Health Benefits Of Khus During Summer - Nutritionist Rujuta Diwekar Explains - NDTV Food", "description": "Rujuta Diwekar stated khus can be grown easily, in the backyard, along the boundary wall or even alongside a crop. Read on to know about its benefits.", "url": "https://food.ndtv.com/food-drinks/health-benefits-of-khus-during-summer-nutritionist-rujuta-diwelar-explains-3016974", "urlToImage": "https://c.ndtvimg.com/2020-06/0hblcu68_khus_625x300_15_June_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-28T07:55:09Z", "content": "Mother nature has bestowed us with everything we need. However, in this fast faced world, we often tend to ignore these things. In fact, not many of us know about the herbs that people would use to c… [+1528 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Binay Singh", "title": "Monkeypox is symptomatic, cannot spread like Covid-19: Prof Sunit K Singh - Times of India", "description": "Noted molecular virologist at the Institute of Medical Sciences, Banaras Hindu University, Prof Sunit K Singh, believes that monkeypox cannot spread o", "url": "https://timesofindia.indiatimes.com/city/varanasi/monkeypox-is-symptomatic-cannot-spread-like-covid-19-prof-sunit-k-singh/articleshow/91849955.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91850107,width-1070,height-580,imgsize-702037,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-28T06:39:00Z", "content": ""}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Activity of a Carbohydrate-Binding Module Therapy, Neumifil, against SARS-CoV-2 Disease in a Hamster Model of Infection - DocWire News", "description": "Viruses. 2022 May 6;14(5):976. doi: 10.3390/v14050976.ABSTRACTThe rapid global spread of severe acute respiratory coronavirus 2 (SARS-CoV-2) has resulted", "url": "https://www.docwirenews.com/abstracts/activity-of-a-carbohydrate-binding-module-therapy-neumifil-against-sars-cov-2-disease-in-a-hamster-model-of-infection/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2022-05-28T06:00:00Z", "content": "Viruses. 2022 May 6;14(5):976. doi: 10.3390/v14050976.\r\nABSTRACT\r\nThe rapid global spread of severe acute respiratory coronavirus 2 (SARS-CoV-2) has resulted in an urgent effort to find efficacious t… [+1028 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "10 Simple Lifestyle Changes That Promote Healthy And Graceful Ageing - India.com", "description": "Shikha Dwivedi - Msc. Clinical Nutrition and Dietetics,  shared 10 tested tips that can help you age naturally and gracefully.", "url": "https://www.india.com/lifestyle/lifestyle-ageing-10-simple-lifestyle-changes-that-promote-healthy-and-graceful-ageing-5417931/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/05/pjimage-6-12.jpg", "publishedAt": "2022-05-28T05:35:59Z", "content": "Everybody wants to look young. However, ageing is a natural process, yet, there is no denying that long-term skin exposure to various external agents can accelerate the ageing process. These include … [+4076 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Why milk and water are important for absorbing vitamin D - Times of India", "description": "Dr Rasmus Espersen of Aarhus University in Denmark and his colleagues conducted a randomised trial on 30 postmenopausal women aged 60-80 with vitamin D deficiency. The findings were presented at the 24th European Congress of Endocrinology in Milan, Italy.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/why-milk-and-water-are-important-for-absorbing-vitamin-d/photostory/91838167.cms", "urlToImage": "https://static.toiimg.com/photo/91838195.cms", "publishedAt": "2022-05-28T05:30:00Z", "content": "The study aimed to measure immediate changes in blood concentrations in response to the consumption of various food items containing 200 g D3. In random order, 500 mL of water, milk, juice, juice wit… [+229 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "US confirms 9 monkeypox cases - Sentinelassam - The Sentinel Assam", "description": "The nine cases have been identified in California, Florida, Massachusetts, New York, Utah, Virginia...", "url": "https://www.sentinelassam.com/international/us-confirms-9-monkeypox-cases-593973", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/05/28/349889-mpx-localized-ncdc-training-manual16264799878011626528375128.jpg", "publishedAt": "2022-05-28T04:58:04Z", "content": "Los Angeles: The US has confirmed nine monkeypox cases across seven states, the US Centers for Disease Control and Prevention (CDC) has said.\r\n\"These cases were suspected by local clinicians. They we… [+723 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Aparna Dhar", "title": "Not losing weight? The answer could be in your genes - Deccan Herald", "description": "Have you noticed how some people respond effortlessly to exercise while others don't see a similar result? Or how some people can eat anything under the sun and not put on weight while others gain kilos by just smelling food? You can make tweaks in your fitne…", "url": "https://www.deccanherald.com/specials/not-losing-weight-the-answer-could-be-in-your-genes-1113215.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/28/weight-loss-istock-543180730-1113215-1653715629.jpg", "publishedAt": "2022-05-28T04:42:41Z", "content": "Have you noticed how some people respond effortlessly to exercise while others don't see a similar result? Or how some people can eat anything under the sun and not put on weight while others gain ki… [+2436 chars]"}, {"source": {"id": null, "name": "Dynamitenews.com"}, "author": null, "title": "Health: Study challenges previous link between diabetes medication and fractures - Dynamite News", "description": "In a recent study published in the journal CJASN, an SGLT2 inhibitor was not associated with a higher risk of fracture than another diabetes drug, regardless of the patient's kidney function. Read more on Dynamite News:", "url": "https://www.dynamitenews.com/story/health-study-challenges-previous-link-between-diabetes-medication-and-fractures", "urlToImage": "https://www.dynamitenews.com/images/2022/05/28/health-study-challenges-previous-link-between-diabetes-medication-and-fractures/6291a364b0cd1.jpg", "publishedAt": "2022-05-28T04:35:14Z", "content": "In a recent study published in the journal CJASN, an SGLT2 inhibitor was not associated with a higher risk of fracture than another diabetes drug, regardless of the patient's kidney function. Read mo… [+2215 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Eating one egg a day may help lower Cardiovascular Disease risk - Medical Dialogues", "description": "Researchers have shown how moderate egg consumption can increase the amount of heart-healthy...", "url": "https://medicaldialogues.in/mdtv/cardiology/videos/eating-one-egg-a-day-may-help-lower-cardiovascular-disease-risk-93608", "urlToImage": "https://medicaldialogues.in/h-upload/2022/05/28/177396-ananya-38.jpg", "publishedAt": "2022-05-28T04:15:07Z", "content": "Researchers have shown how moderate egg consumption can increase the amount of heart-healthy metabolites in the blood. The findings suggest that eating up to one egg per day may help lower the risk o… [+1661 chars]"}, {"source": {"id": null, "name": "Healthgrades.com"}, "author": "John Cartwright", "title": "What Are the Types of Schizophrenia? - Healthgrades", "description": "Learn about the different types of schizophrenia here. This guide also includes information about symptoms, causes, and treatment options.", "url": "https://www.healthgrades.com/right-care/schizophrenia/types-of-schizophrenia", "urlToImage": "https://dims.healthgrades.com/dims3/MMH/e5caa32/2147483647/strip/true/crop/400x210+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fucmscdn.healthgrades.com%2F94%2F66%2Ff4af16c14e0faabbef7228b5b5d2%2Fimage-hg-default-image.png", "publishedAt": "2022-05-28T04:13:20Z", "content": "Before 2013, medical professionals categorized schizophrenia into five main types. These were paranoid, disorganized, residual, undifferentiated, and catatonic schizophrenia.\r\nSchizophrenia is a ment… [+6400 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "COVID-19 in babies – here’s what to expect - EastMojo", "description": "Parents are understandably worried about what would happen if their infant caught COVID-19. Babies may be considered vulnerable due to immature immune", "url": "http://www.eastmojo.com/coronavirus-updates/2022/05/28/covid-19-in-babies-heres-what-to-expect/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/05/Untitled-design-5-9.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-05-28T03:10:00Z", "content": "Parents are understandably worried about what would happen if their infant caught COVID-19. Babies may be considered vulnerable due to immature immune systems, and are also not eligible for most of t… [+4439 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Common Neurological Conditions and How to Prevent Them - News18", "description": "Our nervous system controls our thoughts, movements and our responses to the world around us", "url": "https://www.news18.com/news/lifestyle/common-neurological-conditions-and-how-to-prevent-them-5238835.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/neurologial-165368296216x9.jpg", "publishedAt": "2022-05-28T02:30:03Z", "content": "The nervous system, which is the most important part of our body, is an extremely specialised and complex network. Our nervous system controls our thoughts, movements and our responses to the world a… [+2414 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "See Recipes and Menus to Lose Weight - Play Crazy Game", "description": "\"Maintaining lost weight is harder than losing weight.\" You must have heard this phrase and it is true. Research shows that 95% of people who lose weight on restrictive diets regain their weight — the famous accordion effect.This back and forth on the scale i…", "url": "https://playcrazygame.com/2022/05/28/see-recipes-and-menus-to-lose-weight-3/", "urlToImage": "https://conteudo.imguol.com.br/c/entretenimento/71/2017/10/17/balanca-1508250488700_v2_615x300.jpg", "publishedAt": "2022-05-27T22:06:51Z", "content": "“Maintaining lost weight is harder than losing weight.” You must have heard this phrase and it is true. Research shows that 95% of people who lose weight on restrictive diets regain their weight the … [+1336 chars]"}]}