{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correpondent", "title": "Chandigarh: GCE holds training programme for prevention of dengue - Hindustan Times", "description": "Dr Upendrajeet Singh Gill gave the concept of climate change; the trends of mosquito based mass concerns and the know-how on statistics of the region in light of the national figures during the training programme for prevention of dengue at GCE, Chandigarh", "url": "https://www.hindustantimes.com/cities/chandigarh-news/nss-cell-of-gce-sector-20d-organises-training-programme-for-prevention-of-dengue-with-dr-gill-as-guest-speaker-101684266673396.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/16/1600x900/NSS-incharge-Dr-Ravneet-Chawla-extended-a-vote-of-_1684266669614.jpg", "publishedAt": "2023-05-16T19:51:12Z", "content": "The NSS Cell of the Government College of Education (GCE), Sector 20 D, organised a sanitising training programme for prevention of dengue while observing the National Dengue Day on Tuesday. \r\nNSS in… [+1975 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Dr Nitya Reddy", "title": "Simple steps for foot health - The Hans India", "description": "Dr Nitya Reddy, MBBS, DPH from Sri Sai Venkateshwara Poly Clinic, Parvathapur, Medipally talks  about foot health. She is consultant on the Mfine app", "url": "https://www.thehansindia.com/life-style/health/simple-steps-for-foot-health-797673", "urlToImage": "https://assets.thehansindia.com/h-upload/2023/05/16/1351649-oo.jpg", "publishedAt": "2023-05-16T17:49:18Z", "content": "Diabetes is a metabolic disease. The complications of diabetes are far and widespread. We have microvascular and macrovascular complications. Diabetic foot is the sequelae of a combination of circula… [+2364 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "Science Update: Cellulose gel may help prevent spread of SARS-CoV-2, NIH study suggests - National Institute of Child Health and Human Development", "description": "A gel made from the seeds of a South American palm tree entraps SARS-CoV-2 and the protein the virus uses to enter cells, preventing the virus from infecting cells in laboratory cultures, a National Institutes of Health study has found. The findings raise the…", "url": "https://www.nichd.nih.gov/newsroom/news/051623-SARS-CoV-2-cellulose-gel", "urlToImage": "https://www.nichd.nih.gov/sites/default/files/2023-05/051623-SARS-CoV-2-cellulose-gel.jpg", "publishedAt": "2023-05-16T16:17:01Z", "content": "A gel made from the seeds of a South American palm tree entraps SARS-CoV-2 and the protein the virus uses to enter cells, preventing the virus from infecting cells in laboratory cultures, a National … [+2862 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Aayushi", "title": "Superfoods to maintain blood sugar level - DNA India", "description": "Here are some food items that can help you manage your blood sugar levels.", "url": "https://www.dnaindia.com/web-stories/lifestyle/superfoods-to-maintain-blood-sugar-level-manage-diabetes-1684251634569", "urlToImage": null, "publishedAt": "2023-05-16T16:10:25Z", "content": "Vegetables are a great choice for people seeking to control their blood sugar since they are low in calories and high in fibre. Gourds, green beans, carrots, eggplant, pumpkin, tomatoes, vibrant pepp… [+75 chars]"}, {"source": {"id": null, "name": "Derbyshire Live"}, "author": "Lydia Stephens", "title": "5:2 diet inventor Dr Michael Mosley explains how to live longer with three simple exercises - Derbyshire Live", "description": "The exercises can also slow ageing, help you lose weight, boost your metabolism and even improve your brain function", "url": "https://www.derbytelegraph.co.uk/news/uk-world-news/52-diet-inventor-dr-michael-8444174", "urlToImage": "https://i2-prod.derbytelegraph.co.uk/incoming/article7419088.ece/ALTERNATES/s1200/0_The-Truth-About-Getting-Fit.jpg", "publishedAt": "2023-05-16T15:39:46Z", "content": "The inventor of the 5:2 slimming diet, Dr Michael Mosley, has issued three simple exercises that can help you live longer, slow ageing, lose weight, boost your metabolism and even improve your brain … [+2118 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US man's rare Alzheimer's mutation delayed onset of disease by 2 decades - Daijiworld.com", "description": "New York, May 16 (IANS): A US man with a rare Alzheimer's disease gene mutation had a delayed onset of disease - about two decades later, a finding that can lead to the understanding of the neurodegenerative disease and development of novel therapies.\r\nThis i…", "url": "https://daijiworld.com/index.php/news/newsDisplay?newsID=1080251", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-05-16T15:35:42Z", "content": "New York, May 16 (IANS): A US man with a rare Alzheimer's disease gene mutation had a delayed onset of disease - about two decades later, a finding that can lead to the understanding of the neurodege… [+2600 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Julia Pugachevsky", "title": "2 dermatologists told us why you should never, ever tattoo over your moles - Business Insider India", "description": "Changes in moles can be the first clue of melanoma and other forms of skin cancer.Two dermatologists say they don't recommend tattooing over moles, especially", "url": "https://www.businessinsider.in/science/health/news/2-dermatologists-told-us-why-you-should-never-ever-tattoo-over-your-moles/articleshow/100284418.cms", "urlToImage": "https://www.businessinsider.in/photo/100284418/2-dermatologists-told-us-why-you-should-never-ever-tattoo-over-your-moles.jpg?imgsize=227136", "publishedAt": "2023-05-16T15:17:00Z", "content": "When it comes to diagnosing skin cancer, looking for changes in moles and performing self-examinations are some of the best ways to stay safe.\r\nBut the early signs aren't always easy to spot — especi… [+1818 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "NIH study finds high rates of persistent chronic pain among U.S. adults - National Institutes of Health (.gov)", "description": "Data are the first nationwide estimates on the incidence of new chronic pain and new high impact chronic pain.", "url": "https://www.nih.gov/news-events/news-releases/nih-study-finds-high-rates-persistent-chronic-pain-among-us-adults", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2023/20230516-pain.jpg", "publishedAt": "2023-05-16T15:16:26Z", "content": null}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Desk", "title": "7 Health Benefits Of Eating Falsa In Summer - Slurrp", "description": "Falsa, also known as Phalsa or Indian Sherbet Berry, is a small purple fruit that is commonly found in India, Pakistan, and Bangladesh during the summer months. It has a tangy, sweet flavour and is known for its various health benefits, particularly during th…", "url": "https://www.slurrp.com/article/7-health-benefits-of-eating-falsa-in-summer-1684249364089", "urlToImage": "https://images.slurrp.com/prodarticles/gstsz6xlth7.webp", "publishedAt": "2023-05-16T15:15:04Z", "content": "Falsa fruit, also known as Phalsa or \"Grewia asiatica\", is a small berry-like fruit that is native to South Asia, including India, Pakistan, and Bangladesh. It is also grown in some parts of Southeas… [+2613 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marlene Busko", "title": "Could Vitamin D Supplementation Help in Long COVID? - Medscape", "description": "If confirmed in large randomized clinical trials, vitamin D supplementation could be a strategy to reduce the burden of long COVID, say researchers, as suggested by a new retrospective study.", "url": "https://www.medscape.com/viewarticle/992013", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230516_vitamin_d_supplements_800x450.jpg", "publishedAt": "2023-05-16T15:06:13Z", "content": "Patients with long COVID-19 where the effects of an initial COVID infection last more than 12 weeks had lower levels of 25(OH) vitamin D than other patients who survived COVID-19, in a retrospective,… [+6837 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Oladimeji Ewumi", "title": "Chemotherapy and pizza: Eating during chemotherapy explained - Medical News Today", "description": "Generally, if a person can tolerate the food during chemotherapy, they can eat it. Learn more about eating foods, such as pizza, during chemotherapy here.", "url": "https://www.medicalnewstoday.com/articles/can-i-eat-pizza-during-chemo", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/04/pizza_and_chemo_resting_732x549_thumb.jpg", "publishedAt": "2023-05-16T14:29:16Z", "content": "Chemotherapy is a type of cancer treatment that stops or delays the growth of cancer cells. Healthcare professionals advise that a person undergoing chemotherapy can have pizza as long as they are ab… [+5590 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Thamarasee Jeewandara", "title": "Bioengineering active immunotherapy for personalized cancer treatment - Medical Xpress", "description": "Breast cancer is resistant to immunotherapies; therefore, bioengineers and oncologists seek to develop a slew of therapeutic strategies to overcome this challenge. In a new report in Science Advances, Kerui Wu and colleagues in the departments of cancer biolo…", "url": "https://medicalxpress.com/news/2023-05-bioengineering-immunotherapy-personalized-cancer-treatment.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/bioengineering-active.jpg", "publishedAt": "2023-05-16T13:52:54Z", "content": "Breast cancer is resistant to immunotherapies; therefore, bioengineers and oncologists seek to develop a slew of therapeutic strategies to overcome this challenge. In a new report in Science Advances… [+11706 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Health Desk", "title": "Lack of deep sleep may increase risk of stroke, Alzheimer's: Study - India Today", "description": "While the study doesn't prove that sleep apnea can cause changes in the brain, it does show an association.", "url": "https://www.indiatoday.in/health/story/lack-of-deep-sleep-may-increase-risk-of-stroke-alzheimers-study-2380046-2023-05-16", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202305/sleep_apnea-sixteen_nine.png?VersionId=ZEo5IEHUieCLwOWdxL5.nu_HwOpIjG49", "publishedAt": "2023-05-16T13:41:45Z", "content": "By India Today Health Desk: Sleep is a major part of our daily routine that has a significant role in our physical and mental health conditions. While in the early 1950s sleep was perceived as a pass… [+2324 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Minimum number of steps you should walk to avoid lifestyle diseases - Hindustan Times", "description": "Here are the number of steps you must walk everyday if you are not able to cover 10,000 steps daily, in order to stay healthy and disease-free. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/minimum-number-of-steps-you-should-walk-to-avoid-lifestyle-diseases-fitness-experts-reveal-101684243788135.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/16/1600x900/minimum_steps_1684243981500_1684243993048.jpg", "publishedAt": "2023-05-16T13:37:33Z", "content": "Walking is the easiest and one of the most effective ways to shed kilos, take care of your heart and also mind. It can help you lose weight sustainably with little risk of injuries and less impact on… [+3984 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Do Not Ignore These 5 Types Of Pains Signaling Heart Disease - News18", "description": "Heaviness, burning, and too much pressure on the chest can be a sign of a heart problem.", "url": "https://www.news18.com/lifestyle/do-not-ignore-these-5-types-of-pains-signaling-heart-disease-7834921.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/wp-image-792-168424366816x9.jpg", "publishedAt": "2023-05-16T13:28:36Z", "content": "Every one of us must have experienced chest pain at some point in our lives. Several types of pains can occur in the chest. Sometimes, this pain appears suddenly with great intensity and then soon di… [+2404 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weight Loss Tips: 8 Things To Keep In Mind When Trying To Follow A Healthy Diet - NDTV", "description": "A balanced healthy diet, combined with regular physical activity, is essential for achieving and maintaining a healthy weight and reducing the risk of obesity-related health problems.", "url": "https://www.ndtv.com/health/weight-loss-tips-8-things-to-keep-in-mind-when-trying-to-follow-a-healthy-diet-4039544", "urlToImage": "https://c.ndtvimg.com/2021-04/835n54u_healthy-diet_625x300_13_April_21.jpg", "publishedAt": "2023-05-16T13:27:42Z", "content": "Your diet should include a variety of foods from all the food groups\r\nA healthy diet and weight loss are inextricably linked because a healthy diet helps in weight loss and maintenance in several way… [+3374 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Devi Poojari", "title": "Try These Seven Detox Drinks For Glowing Skin - Slurrp", "description": "Starting your day with a glass of cold-pressed juices packed with essential vitamins and minerals necessary for healthy and supple skin, in known to be effective and yield almost immediate results.", "url": "https://www.slurrp.com/article/try-these-seven-detox-drinks-for-glowing-skin-1684243086683", "urlToImage": "https://images.slurrp.com/prodarticles/fsv7vzhpsm7.webp", "publishedAt": "2023-05-16T13:24:42Z", "content": "Skin is a mirror to your overall physical health. The goings-on inside your body is directly reflected on your skin, no matter what your lifestyle. Of course, while genetics have an important role to… [+887 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Are Grapes Good For Diabetics? All You Should Know About Its Nutrients - NDTV Food", "description": "Grapes contain several essential nutrients. But are they good for managing diabetes? Read on to know more.", "url": "https://food.ndtv.com/health/are-grapes-good-for-diabetics-all-you-should-know-about-its-nutrients-4039402", "urlToImage": "https://i.ndtvimg.com/i/2016-08/black-grapes_625x350_51472115863.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-05-16T12:56:02Z", "content": "Diabetes is a major concern, affecting thousands of lives across the globe. According to a report by the International Diabetes Federation (IDF), around 537 million adults are living with diabetes an… [+5365 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Avoid These 5 Foods In Summer To Protect Your Skin From Breakouts - NDTV Food", "description": "Struggling with skin breakouts in the summer season? Avoid these five foods that may be the cause of your acne.", "url": "https://food.ndtv.com/skin-care/avoid-these-5-foods-in-summer-to-protect-your-skin-from-breakouts-4039325", "urlToImage": "https://c.ndtvimg.com/2023-05/je7h3g0o_coffee_625x300_08_May_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-05-16T12:40:12Z", "content": "Acne is a common skin issue that most of us struggle with. It makes our skin sensitive, painful and itchy. People with sensitive skin struggle with frequent breakouts every now and then, especially i… [+2922 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US NIH to test universal flu vaccine based on mRNA tech - Daijiworld.com", "description": "New York, May 16 (IANS): A team of researchers at the US National Institutes of Health (NIH) has rolled out a clinical trial of an experimental mRNA-based universal influenza vaccine.\r\nThe Phase 1 trial will test the experimental vaccine, known as H1ssF-3928 …", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1080227", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-05-16T12:32:31Z", "content": "New York, May 16 (IANS): A team of researchers at the US National Institutes of Health (NIH) has rolled out a clinical trial of an experimental mRNA-based universal influenza vaccine.\r\nThe Phase 1 tr… [+2707 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Anxiety Medication: 5 Best OTC Medications For Anxiety - Deccan Herald", "description": "Anxiety is a normal and often healthy emotion characterized by feelings of worry, nervousness, or unease, typically about an imminent event or something with an uncertain outcome. However, when a person regularly feels disproportionate levels of anxiety, it m…", "url": "https://www.deccanherald.com/brandspot/pr-spot/anxiety-medication-5-best-otc-medications-for-anxiety-1219273.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Picture20-1219273-1684240213.jpg", "publishedAt": "2023-05-16T12:30:13Z", "content": "Anxiety is a normal and often healthy emotion characterized by feelings of worry, nervousness, or unease, typically about an imminent event or something with an uncertain outcome. However, when a per… [+19756 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nutritionist Warns Against These 6 Everyday Foods That Lead To Poor Gut Health - NDTV Food", "description": "Celebrity Nutritionist Lovneet Batra recently posted about foods that should be avoided for better gut health. Find out more below.", "url": "https://food.ndtv.com/health/nutritionist-warns-against-these-6-everyday-foods-that-lead-to-poor-gut-health-4039179", "urlToImage": "https://c.ndtvimg.com/2023-05/vip7hu28_fried-food_625x300_16_May_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-05-16T12:02:18Z", "content": "Your gut health affects not only how your food is digested but also how your entire body functions. If your gut health is compromised, it could lead to several issues including obesity, kidney proble… [+5226 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kinkini Gupta", "title": "Calories Deficit Diet: Can It Aid In Weight Loss? | TheHealthSite.com - TheHealthSite", "description": "Calorie deficit diet can help you lose weight a lot faster and also keep you well nourished.  TheHealthSite.com", "url": "https://www.thehealthsite.com/photo-gallery/calories-deficit-diet-can-it-aid-in-weight-loss-978278/", "urlToImage": "https://www.thehealthsite.com/wp-content/uploads/2023/05/pexels-jane-doan-936611-1.jpg", "publishedAt": "2023-05-16T12:00:07Z", "content": "TheHealthSite.com is India's fastest growing health information site with a team of health professionals and writers committed to providing unique, authentic, credible, well-researched, and timely in… [+355 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "What is Folate Deficiency? 6 Signs and Symptoms You Cannot Ignore - India.com", "description": "Folate deficiency is a rather lesser known problem that not many people are aware about. Therefore, it is of utmost importance to understand the signs and symptoms.", "url": "https://www.india.com/health/what-is-folate-deficiency-6-signs-and-symptoms-you-cannot-ignore-6053473/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/05/folate.jpg", "publishedAt": "2023-05-16T11:50:10Z", "content": "Folate deficiency is a rather lesser known problem that not many people are aware about. Therefore, it is of utmost importance to understand the signs and symptoms. \r\nWhat is Folate Deficiency? Why Y… [+2705 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Epidemic and emerging disease alerts in the Pacific as of 16 May 2023 - World - ReliefWeb", "description": "Map in English on World and 22 other countries about Health and Epidemic; published on 16 May 2023 by SPC", "url": "https://reliefweb.int/map/world/epidemic-and-emerging-disease-alerts-pacific-16-may-2023", "urlToImage": "https://reliefweb.int/sites/default/files/styles/large/public/previews/10/10/1010c1d2-438b-45cb-a0fc-3cef1f3faa47.png", "publishedAt": "2023-05-16T11:39:53Z", "content": "<li>American Samoa: As of the 30 April 2023, a total of 8,331 COVID-19 cases and 34 deaths were reported by the American Samoa Department of Health. Latest update received dated from more than 2 week… [+4863 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Slim DNA Keto Gummies {BUY Keto Trim Max & D1 Keto Gummies} Reviews Exposed Warning Turbo Keto Gummies Shark Tank Limited Time Offer HURRY UP!! - mid-day.com", "description": "Slim DNA Keto Gummies: Safe Way to Curb Extra Body Fat in Just 30 Days!", "url": "https://www.mid-day.com/brand-media/article/slim-dna-keto-gummies-buy-keto-trim-max--d1-keto-gummies-reviews-exposed-23286897", "urlToImage": "https://images.mid-day.com/images/images/2023/may/Slim-Keto-1605_d.jpg", "publishedAt": "2023-05-16T11:15:00Z", "content": "Slim DNA Keto Gummies: Safe Way to Curb Extra Body Fat in Just 30 Days!\r\nSlim DNA Keto Gummies Guaranteed weight loss results, giving popularity to keto gummies. These gummies are available in simple… [+10245 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "Eggs To Bananas: 7 Weight-Loss Friendly Foods To Have - Slurrp", "description": "Eggs To Bananas: 7 Weight-Loss Friendly Foods To HaveEggs To Bananas: 7 Weight-Loss Friendly Foods To HaveBy Tanisha SalwanEggsEggs are a great source of", "url": "https://www.slurrp.com/web-stories/eggs-to-bananas-7-weight-loss-friendly-foods-to-have/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2023/05/16162632/cropped-ledd-2.webp", "publishedAt": "2023-05-16T10:59:06Z", "content": "Again because of its fiber content, flax seeds keep stomach full for a longer time and prevent hunger pangs."}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kashish Sharma", "title": "Sitting All Day? You Might Be Inviting Health Trouble - TheHealthSite", "description": "Taking stairs if possible taking a walk after every 30 minutes of sitting walking while using the phone and others are a few things we can do to reduce the risk. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/sitting-all-day-long-you-might-be-inviting-health-trouble-978216/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/05/sitting-all-day.jpg", "publishedAt": "2023-05-16T10:42:00Z", "content": "A study found that even a light-intensity exercise between prolonged sitting routines could have significant advantages for the body.\r\nTaking stairs if possible, taking a walk after every 30 minutes … [+2883 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Eating late affects calorie burning and hunger levels - Mint Lounge", "description": "A recent study shows that eating late increases hunger levels during the day and impacts the number of calories people burn", "url": "https://lifestyle.livemint.com/health/wellness/health-eating-late-night-snack-calorie-burning-obesity-hunger-111684210435382.html", "urlToImage": "https://images.livemint.com/img/2023/05/16/1140x641/eating_late_1684211148506_1684211148693.jpg", "publishedAt": "2023-05-16T10:37:51Z", "content": "Turns out late night dinners or snacks are not good for overall health. A recent study found that eating later in the day affects biological weight in three waysthrough the number of calories that we… [+2380 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Cancer symptoms: Warning signs of oral cancer you should be checking at home - Times of India", "description": "Here are some common symptoms of oral cancer you can check at home.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/cancer-symptoms-warning-signs-of-oral-cancer-you-should-be-checking-at-home/photostory/100251973.cms", "urlToImage": "https://static.toiimg.com/photo/100251990.cms", "publishedAt": "2023-05-16T10:30:00Z", "content": "Smoking and drinking alcohol are the two main contributors to the development of oral cancer.\r\nExcessive alcohol consumption increases your risk of oral cancer by four, according to health experts.\r\n… [+238 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "How to boost metabolism in women after 40 - Daijiworld.com", "description": "By Cijith Sreedhar\r\nNew Delhi, May 16 (IANSlife): All the body functions slow down with age. One can follow the following five aspects to improve the metabolism:\r\nPhysical activity: Include yoga, weight training, being active throughout the day, any form of s…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1080171", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/sharmila_160523_women.jpg", "publishedAt": "2023-05-16T10:11:37Z", "content": "By Cijith Sreedhar\r\nNew Delhi, May 16 (IANSlife): All the body functions slow down with age. One can follow the following five aspects to improve the metabolism:\r\nPhysical activity: Include yoga, wei… [+4604 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "World Hypertension Day 2023: 5 Lifestyle Changes To Maintain Healthy Blood Pressure Levels - Jagran English", "description": "World Hypertension Day 2023 The theme for World Hypertension Day 2023 is measure your blood pressure accurately control it live longer’ focusing on combatting low awareness rates worldwide Scroll down to know more", "url": "https://english.jagran.com/lifestyle/world-hypertension-day-2023-lifestyle-changes-to-maintain-healthy-blood-pressure-levels-10078179", "urlToImage": "https://imgeng.jagran.com/images/2023/may/world-hypertension-day (2)1684231426618.jpg", "publishedAt": "2023-05-16T09:53:00Z", "content": "World Hypertension Day 2023: Every year, the occasion of World Hypertension Day is observed across parts of the world to spread awareness about hypertension as a major health threat. It is a global i… [+2654 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora, Times Now Digital", "title": "8 Foods That Make You Feel Hungrier After Eating - Times Now", "description": "", "url": "https://www.timesnownews.com/web-stories/health/8-foods-that-make-you-feel-hungrier-after-eating/photostory/100274922.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100274937,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-05-16T09:39:21Z", "content": "For those trying to drop extra kilos, low-fat yogurt may not necessarily be the perfect choice. It has high sugar levels which make one feel hungry too fast."}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Ovarian Cancer Is Third Most Common Gynaecological Cancer In India. Know Five Ways To Prevent The ‘Silent Killer’ - ABP Live", "description": "Ovarian cancer is a leading cause of cancer death in women. This disease has a poor prognosis because most often it is diagnosed in Stage III or IV due to early symptoms not being identifiable.", "url": "https://news.abplive.com/science/ovarian-cancer-is-third-most-common-gynaecological-cancer-in-india-know-five-ways-to-prevent-the-silent-killer-1602666", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/16/e533be70c57b4efa5d6842b35d4d3bf91684228527240324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-05-16T09:16:11Z", "content": "By Dr Amit Verma\r\nOvarian cancer is the third most common gynaecological cancer in India with an incidence of 5.4 to 8 per 100,000 women. It is a leading cause of cancer death in women. This disease … [+2620 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "RNA Molecules Show Promise for Detection and Treatment of Esophageal Cancers - Technology Networks", "description": "In a promising development for cancer screening and treatment, groundbreaking research has led to a new laboratory test to measure cell mechanotypes quickly and easily. <br /><br />", "url": "https://www.technologynetworks.com/cell-science/news/new-test-measures-cell-mechanotypes-quickly-and-easily-373368", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/373368/new-test-measures-cell-mechanotypes-quickly-and-easily-373368-640x360.jpg?cb=20230516", "publishedAt": "2023-05-16T09:00:25Z", "content": "Some diseases can be diagnosed by identifying physical changes in tissue, such as the hardening of arteries during heart disease. Diseased cells often exhibit different mechanical characteristics, or… [+2940 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kalpana Sharma", "title": "Sodium and potassium: What we need to know about the signs and risks of their imbalance - Times of India", "description": "Sodium and potassium are two important electrolytes that can lead to disturbing and confusing symptoms. They need to be diagnosed and treated. Read th", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/sodium-and-potassium-what-we-need-to-know-about-the-signs-and-risks-of-their-imbalance/articleshow/100272764.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100272854,width-1070,height-580,imgsize-38980,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-16T08:29:00Z", "content": "Heart surgeon explains why so many young people are dying of heart issuesUndiagnosed diabetes and hypertension in the young increases their heart risk and a lot of times these lifestyle diseases go u… [+120 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Structural heart disease: symptoms, diagnosis and treatment - Emergency Live International", "description": "Structural heart diseases are abnormalities of the heart valves that escape diagnosis due to symptoms that increase with age such as fatigue", "url": "https://www.emergency-live.com/health-and-safety/structural-heart-disease-causes-symptoms-diagnosis-and-treatment/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2021/10/scompenso-cardiaco-cardiologia-cuore-750x430-1.png", "publishedAt": "2023-05-16T08:22:51Z", "content": "The name of this disease seems less frightening than the others as the word structural does not suggest an immediate danger.\r\nHowever, their seriousness should not be underestimated, as structural he… [+4028 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "IANS", "title": "Diabetic kidney disease can be predicted early by AI through simple test | Lifestyle Health | English Manorama - Onmanorama", "description": "The new algorithm depends on measurements of a process called DNA methylation, which occurs when subtle changes accumulate in a person's DNA.", "url": "https://www.onmanorama.com/lifestyle/health/2023/05/16/diabetic-kidney-disease-prediction-early-ai-through-simple-test.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/lifestyle/health/images/2021/3/14/kidney-shutterstock-c.jpg", "publishedAt": "2023-05-16T07:32:43Z", "content": "New Delhi: An AI-based approach to predict whether a person with Type 2 diabetes will suffer kidney disease, has been developed by a team of researchers. Such disease is a frequent and dangerous cons… [+2177 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Kirtika Katira", "title": "Addressing mental health improves skin health and boosts confidence, says dermatologist | Exclusive - WION", "description": "Addressing mental health improves skin health and boosts confidence, says dermatologist | Exclusive", "url": "https://www.wionews.com/entertainment/lifestyle/news-addressing-mental-health-improves-skin-health-and-boosts-confidence-says-dermatologist--exclusive-592860", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/05/16/352073-untitled-design-2023-05-16t125817928.jpg", "publishedAt": "2023-05-16T07:21:47Z", "content": "In today's fast-paced and demanding world, mental health has become a topic of great importance. The challenges of everyday life can take a toll on our well-being, affecting both our mental and physi… [+6101 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Diabetes Diet: 6 Wholegrains to Perfectly Manage The Glucose Level in Your Body - msnNOW", "description": "Living with diabetes is not easy, however, few lifestyle tweaks and few foods when consumed in moderation can prove to be good for the body.", "url": "https://www.india.com/health/diabetes-diet-6-wholegrains-to-perfectly-manage-the-glucose-level-in-your-body-6052657/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1bf66l.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-16T06:55:34Z", "content": "© Jigyasa Sahay | India.com Lifestyle Staff\r\n Barley to Ragi, 6 Wholegrains To Add In Your Diabetes Diet (Freepik)\r\nLiving with diabetes is not easy. With the ample of restrictions that surround ever… [+2202 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Desk", "title": "7 Natural Foods To Strengthen Your Hair From The Inside Out - Slurrp", "description": "Are you tired of dealing with hair loss? Our diet and hair have a direct connection and eating the right kind of food will ensure your hair is strengthened by providing essential vitamins, minerals, and nutrients to the body. Read on to know more about the 7 …", "url": "https://www.slurrp.com/article/7-natural-foods-to-strengthen-your-hair-from-the-inside-out-1684213030939", "urlToImage": "https://images.slurrp.com/prodarticles/zn9pusfjeg.webp", "publishedAt": "2023-05-16T06:23:07Z", "content": "Our health is directly impacted by the food we consume, and it has been advised for years that a balanced and nutritious diet is crucial for maintaining a healthy life. This is because our body requi… [+3765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Saikat Kanjilal", "title": "Risk of heart attack: Can homocysteine blood test predict heart disease? - The Indian Express", "description": "Markedly elevated levels of homocysteine in the blood have primary atherogenic (blood vessel blockage) and prothrombotic (blood clotting) properties says Dr.Saikat Kanjilal, Consultant Interventional Cardiologist, Manipal Hospital, Bangalore", "url": "https://indianexpress.com/article/health-wellness/risk-of-heart-attack-homocysteine-blood-test-disease-8611686/", "urlToImage": "https://images.indianexpress.com/2023/05/heart_HS_getty.jpg", "publishedAt": "2023-05-16T05:18:26Z", "content": "The American biochemist Vincent DuVigneaud discovered a new amino acid in 1932 called Homocysteine. Little was known, however, about the biomedical significance of homocysteine until 1962, when child… [+4615 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Cardiovascular disease risk factor management may help preserve physical function as we age - Medical Dialogues", "description": "Managing cardiovascular disease (CVD) risk factors may play a role in preserving physical function during the aging process, according to new research published by The Journals of Gerontology,...", "url": "https://medicaldialogues.in/mdtv/cardiology/videos/cardiovascular-disease-risk-factor-management-may-help-preserve-physical-function-as-we-age-111537", "urlToImage": "https://medicaldialogues.in/h-upload/2023/05/16/209802-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-4.jpg", "publishedAt": "2023-05-16T04:00:36Z", "content": "Managing cardiovascular disease (CVD) risk factors may play a role in preserving physical function during the aging process, according to new research published by The Journals of Gerontology, Series… [+1656 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Artificially ripened mangoes a health risk - Times of India", "description": "Vijayawada: Artificial ripening of mangoes using hazardous ripening agents is posing threat to the health of the public.", "url": "https://timesofindia.indiatimes.com/city/vijayawada/artificially-ripened-mangoes-a-health-risk/articleshow/100264414.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-16T02:56:00Z", "content": "In MP's Bandhavgarh, signs of 2,000-year-old 'modern society'"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Tips to treat sunburned lips - Times of India", "description": "The sun has a different effect on our lips than on the rest of our face.", "url": "https://timesofindia.indiatimes.com/life-style/beauty/tips-to-treat-sunburned-lips/articleshow/100249101.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100249101,width-1070,height-580,imgsize-25922,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-16T02:30:00Z", "content": "When in Kerala, do not skip these traditional dishes"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "SMSala", "title": "Brain Tumors: Understanding Types, Symptoms, Diagnosis & Treatment - Rising Kashmir", "description": null, "url": "http://risingkashmir.com/brain-tumors-understanding-types-symptoms-diagnosis-treatment", "urlToImage": "http://admin.risingkashmir.com/Source/News/32e911f0-e129-43ab-9829-3708da5506cf.jpg", "publishedAt": "2023-05-15T20:24:41Z", "content": "Dr. NISHITH MODI \r\nCancer is a leading cause of death worldwide. Having said that, many cancers can be cured if detected early and treated effectively. An intracranial tumour, also known as a brain t… [+2803 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "5 healthy sweet alternatives of refined sugar to manage diabetes, belly fat, unhealthy weight - DNA India", "description": "Here are some healthy alternatives to refined sugar that will satisfy your sugar cravings without the fear of gaining unhealthy weight.", "url": "https://www.dnaindia.com/health/report-5-healthy-sweet-alternatives-of-refined-sugar-to-manage-diabetes-belly-fat-unhealthy-weight-3042532", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/05/15/2590042-untitled-design-56.jpg", "publishedAt": "2023-05-15T16:43:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: May 15, 2023, 11:02 PM ISTNowadays, most people who eat a balanced, healthy diet want to completely reduce their sugar intake. Ho… [+1433 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Schizophrenia`s Genetic Risk Linked To Placenta Rather Than Developing Brain: Study - Zee News", "description": "Feeling Anxious? Try 4 Calming Fragrances For Relieving Anxiety The researchers found that schizophrenia genes influence a critical function of the placenta to sense nutrients in the mothers bloodstream, including oxygen, and exchange nutrients based on what …", "url": "https://zeenews.india.com/health/schizophrenias-genetic-risk-linked-to-placenta-rather-than-developing-brain-study-2608534", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/05/15/1200844-schizophrenia.jpg", "publishedAt": "2023-05-15T15:40:53Z", "content": "More than 100 genes linked to the risk of schizophrenia seem to cause illness because of their role in the placenta rather than in the developing brain, according to a new study. Scientists had gener… [+2446 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Heat-loving marine bacteria may help detoxify asbestos: Study - ThePrint", "description": "Washington [US], May 15 (ANI): Because of its strength, resistance to heat and fire, and low electrical conductivity, asbestos materials were previously widely utilised in homes, buildings, vehicle brakes, and many other construction materials. Unfortunately,…", "url": "https://theprint.in/science/heat-loving-marine-bacteria-may-help-detoxify-asbestos-study/1575898/", "urlToImage": null, "publishedAt": "2023-05-15T15:16:23Z", "content": "Washington [US], May 15 (ANI): Because of its strength, resistance to heat and fire, and low electrical conductivity, asbestos materials were previously widely utilised in homes, buildings, vehicle b… [+2993 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Smartphone usage rises in city parks but falls in forests: Study - ThePrint", "description": "Washington [US], May 15 (ANI): While getting outside is a typical prescription for decreasing screen time, a new study indicates that being outside doesn’t always lower smartphone screen time. The new research, which tracked smartphone activity of 700 study p…", "url": "https://theprint.in/features/smartphone-usage-rises-in-city-parks-but-falls-in-forests-study/1575866/", "urlToImage": null, "publishedAt": "2023-05-15T15:13:53Z", "content": "Washington [US], May 15 (ANI): While getting outside is a typical prescription for decreasing screen time, a new study indicates that being outside doesn’t always lower smartphone screen time.\r\nThe n… [+3711 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "National Dengue Day: Is it Malaria or Dengue? Here's the difference - Hindustan Times", "description": "Though with common seasonal trend and high-grade fever as common signs, Malaria and Dengue both differ in other symptoms. Here's how to know the difference | Health", "url": "https://www.hindustantimes.com/lifestyle/health/is-it-malaria-or-dengue-heres-how-to-know-the-difference-between-the-two-mosquito-borne-diseases-101684160089784.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/15/1600x900/pexels-pragyan-bezbaruah-9891863_1684160372051_1684160395214.jpg", "publishedAt": "2023-05-15T14:47:14Z", "content": "Malaria and dengue are both mosquito-borne diseases that can cause significant health problems and are important global concerns whose prevention efforts, including mosquito control and personal prot… [+4751 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Shweta Singh", "title": "Non-alcoholic fatty liver: foods to eat in fatty liver - DNA India", "description": "Non-alcoholic fatty liver: foods to eat in fatty liver", "url": "https://www.dnaindia.com/web-stories/health/nonalcoholic-fatty-liver-foods-to-eat-in-fatty-liver-1684160080960", "urlToImage": null, "publishedAt": "2023-05-15T14:44:34Z", "content": "Fatty fish like salmon, tuna, sardines, flaxseeds and walnuts are all instances of foods rich in omega 3 fatty acids."}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "Heat Rashes Giving You A Tough Time In Summer? Know The Symptoms As Explained By A Doctor - Times Now", "description": "The patients present with round, circular patches of redness sometimes with a centre that is clear and an active spreading border. It causes intense itching in those patches that tend to be continuous in nature. It can also involve nail and lead to discolorat…", "url": "https://www.timesnownews.com/health/heat-rashes-giving-you-a-tough-time-in-summer-know-the-symptoms-as-explained-by-a-doctor-article-100255784", "urlToImage": "https://static.tnn.in/thumb/msid-100255784,updatedat-1684159591531,width-1280,height-720,resizemode-75/100255784.jpg", "publishedAt": "2023-05-15T14:06:31Z", "content": "MPBSE 5th, 8th Results Today (OUT) LIVE: MP Board Class 5th 8th Results DECLARED on mpbse.nic.in, mpresults.nic.in, Check Timings"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Devyani Madaik", "title": "Air Pollution: Effects Of Pollutant Air On Brain Functioning And Movement Disorders After Stroke - Swachh India NDTV", "description": "The polluted air in both cities and rural areas is causing fine particulate matter, which results in strokes, heart diseases, lung cancer, and acute and chronic respiratory diseases, among others", "url": "https://swachhindia.ndtv.com/air-pollution-effects-of-pollutant-air-on-brain-functioning-and-movement-disorders-after-stroke-76946/", "urlToImage": "https://w.ndtvimg.com/sites/3/2023/05/15192644/thumbnail_660-50.jpg", "publishedAt": "2023-05-15T13:59:23Z", "content": "New Delhi: Air pollution poses a major threat to human health. The polluted air in both cities and rural areas is causing fine particulate matter, which results in strokes, heart diseases, lung cance… [+6607 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Navneet Vyasan", "title": "Food Combinations to Keep in Mind for Managing High Cholesterol - News18", "description": "According to the World Health Organisation (WHO), a third of ischaemic heart disease globally is attributable to high cholesterol. Besides having a healthy lifestyle, your diet also has a powerful effect on your cholesterol levels.", "url": "https://www.news18.com/lifestyle/food-combinations-to-keep-in-mind-for-managing-high-cholesterol-7818835.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/04/wp-image-1252-168415606716x9.jpg", "publishedAt": "2023-05-15T13:08:06Z", "content": "Todays busy world has taken a toll on our health. An unhealthy lifestyle and improper diet have contributed to ill health, especially leaving a major impact on our heart health. Both high and low cho… [+1998 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Amazing Health Benefits Of Litchi You Should Know - NDTV Food", "description": "Litchi is a sweet fruit that also improves our health. Find out what health benefits litchi has to offer.", "url": "https://food.ndtv.com/food-drinks/5-amazing-health-benefits-of-litchi-you-should-know-4036162", "urlToImage": "https://c.ndtvimg.com/2023-03/9avrsee_litchi-juice_625x300_09_March_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-05-15T11:58:39Z", "content": "All year round, many of us crave this sweet fruit that is only available in the market during the summer season. We are talking about litchi. Litchi is a popular summer fruit that is loved by people … [+3537 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "\"Bonding hormone\" oxytocin is clinically deficient: Study - ETHealthWorld", "description": "Researchers from the University of Basel and the University Hospital of Basel have now successfully shown that individuals with a lack of vasopressin brought on by a condition of the pituitary gland also have a deficiency of oxytocin. This discovery could be …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/bonding-hormone-oxytocin-is-clinically-deficient-study/100252019", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100252019,imgsize-9204,width-1200,height=765,overlay-ethealth/diagnostics/bonding-hormone-oxytocin-is-clinically-deficient-study.jpg", "publishedAt": "2023-05-15T11:45:00Z", "content": "Washington: Oxytocin is a hormone that regulates emotions and is crucial for social interaction. Although it has never been verified, it has previously been hypothesised that this hormone is deficien… [+3220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "Dietary tips to manage endometriosis - The Indian Express", "description": "Dietary tips to manage endometriosis", "url": "https://indianexpress.com/web-stories/wellness/dietary-tips-to-manage-endometriosis/", "urlToImage": "https://images.indianexpress.com/2023/05/endometriosis-2.jpg", "publishedAt": "2023-05-15T08:25:09Z", "content": "Dietary tips to manage endometriosis \r\nEat a diet rich in anti-inflammatory foods: This includes foods like leafy greens, berries, fatty fish, nuts, seeds, and whole grains.\r\nAvoid inflammatory foods… [+735 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "King's College London scientists develop potential tech for producing new antivirals - India Education Diary", "description": "Led by Dr Ebrahimi Kourosh, the researchers developed a new, simple, in vivo technique called the VITAS assay that allows them to identify enzymes involved in the production of antivirals. The study highlights how the assay was able to analyse the en", "url": "https://indiaeducationdiary.in/kings-college-london-scientists-develop-potential-tech-for-producing-new-antivirals/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/lcms-vitas-assay-pic-780x450.x942b84fc.webp", "publishedAt": "2023-05-15T08:16:17Z", "content": "Led by Dr Ebrahimi Kourosh, the researchers developed a new, simple, in vivo technique called the VITAS assay that allows them to identify enzymes involved in the production of antivirals. The study … [+1942 chars]"}]}