{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Sleep irregularity may increase the risk for atherosclerosis - News-Medical.Net", "description": "Sleep irregularity -; chronically disrupted sleep and highly variable sleep durations night after night -; may increase the risk for atherosclerosis, according to a study led by Kelsie Full, PhD, MPH, of Vanderbilt University Medical Center.", "url": "https://www.news-medical.net/news/20230215/Sleep-irregularity-may-increase-the-risk-for-atherosclerosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Heart_Disease-620x480.jpg", "publishedAt": "2023-02-15T19:33:00Z", "content": "Sleep irregularity -; chronically disrupted sleep and highly variable sleep durations night after night -; may increase the risk for atherosclerosis, according to a study led by Kelsie Full, PhD, MPH… [+3084 chars]"}, {"source": {"id": null, "name": "Grid.news"}, "author": "Jonathan Lambert", "title": "Malaria mosquitoes are spreading into new territory as climate warms - Grid", "description": "A new study shows how the health threats of a warming climate are already here.", "url": "https://www.grid.news/story/climate/2023/02/16/malaria-mosquitoes-are-moving-quickly-into-new-territory-as-climate-warms/", "urlToImage": "https://www.grid.news/resizer/a3qKSIvma_RkwiusvY63S_Nc29k=/1200x630/filters:format(jpg):quality(100)/cloudfront-us-east-1.images.arcpublishing.com/thesummit/RJU4R4RPRBF3VH7TN7BCQFQY7Q.jpg", "publishedAt": "2023-02-15T19:08:02Z", "content": "Mosquitoes that can transmit malaria have moved southward in Africa by more than 310 miles, on average, since the late 19th century, a rapid expansion of their range that is consistent with predictio… [+5010 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What happens when you don't pee before and after sex - Times of India", "description": "When it comes to maintaining sexual and reproductive health, there's a lot of care and measures that we must take. Sexual activities can often put us at an increased risk of sexually transmitted diseases (STDs) and other viral and bacterial infections.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/what-happens-when-you-dont-pee-before-and-after-sex/photostory/97949820.cms", "urlToImage": "https://static.toiimg.com/photo/97949846.cms", "publishedAt": "2023-02-15T18:30:00Z", "content": "For those with a vagina, the possibility of infections is much greater during sexual activities. One such infection is urinary tract infection, which is not sexually transmitted, but can be triggered… [+443 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Chris Anderson", "title": "Gatekeeper Mutations Destabilize Kinases Increasing their Activity - Inside Precision Medicine", "description": "It appears that drug resistance develops due to the emergence of genetic mutations in an area of the kinase known as the gatekeeper residue.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/gatekeeper-mutations-destabilize-kinases-increasing-their-activity/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2023/02/Protein-Kinase-1366642671.jpg", "publishedAt": "2023-02-15T18:07:42Z", "content": "Researchers have discovered what they believe is an explanation for why protein kinase inhibitors lose their effectiveness against cancer and why recurring cancers are more aggressive. As described i… [+3413 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Research Team Develop Technique To Help Doctors Predict Opioid Prescription Risk For Patients - India Education Diary", "description": "Researchers at the University of Alberta are using a form of artificial intelligence to help doctors better predict which patients are at risk of adverse outcomes from opioid prescriptions. In newly published research, the collaborative team created", "url": "https://indiaeducationdiary.in/research-team-develop-technique-to-help-doctors-predict-opioid-prescription-risk-for-patients/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/University-of-Alberta.jpeg?fit=600%2C400&ssl=1", "publishedAt": "2023-02-15T16:31:23Z", "content": "Researchers at the University of Alberta are using a form of artificial intelligence to help doctors better predict which patients are at risk of adverse outcomes from opioid prescriptions. \r\nIn newl… [+3042 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Oral bacteria may increase heart disease risk: Research - ANI News", "description": "Infection with a bacterium that causes gum disease and bad breath may increase the risk of heart disease, shows a study published in eLife.", "url": "https://www.aninews.in/news/health/oral-bacteria-may-increase-heart-disease-risk-research20230215214813", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230215161637.jpeg", "publishedAt": "2023-02-15T16:18:00Z", "content": "Washington [US], February 15 (ANI): A study published today in eLife suggests that infection with a bacterium that causes gum disease and foul breath may raise the risk of heart disease.The study adv… [+3011 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pancreas: Diabetes Can Lead To Poor Pancreatic Health; Watch Out For These Signs - NDTV", "description": "In this article, we discuss the link between pancreatic health and diabetes. We also list some common early signs of poor pancreatic health.", "url": "https://www.ndtv.com/health/pancreas-diabetes-can-lead-to-poor-pancreatic-health-watch-out-for-these-signs-3785803", "urlToImage": "https://c.ndtvimg.com/2020-01/sd4pkkgo_pancreas-_625x300_10_January_20.jpg", "publishedAt": "2023-02-15T15:06:42Z", "content": "There are a variety of signs that might indicate poor pancreatic health\r\nA metabolic condition, such as diabetes, affects how the body uses digested food for energy and growth. The majority of food c… [+3557 chars]"}, {"source": {"id": null, "name": "Local3news.com"}, "author": "Kristen Rogers, CNN", "title": "Study finds link between 'free sugar' intake and cardiovascular disease - Local 3 News", "description": "The link between higher free sugar intake and cardiovascular disease risk lies in the differences between how the body metabolizes free sugar versus sugar in whole foods.", "url": "https://www.local3news.com/local-news/eye-on-health/study-finds-link-between-free-sugar-intake-and-cardiovascular-disease/article_7c525c1e-5eaf-5ddd-8505-f052004c47ca.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/local3news.com/content/tncms/assets/v3/editorial/7/c5/7c525c1e-5eaf-5ddd-8505-f052004c47ca/63ecf33ed9706.preview.jpg?crop=1919%2C1007%2C0%2C36&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2023-02-15T15:01:00Z", "content": "Eating a lot of free sugars also known as added sugars might feel harmless in the moment, but it could increase your risk for getting cardiovascular disease, a new study has found.\r\nFree sugars are t… [+6075 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Yash Manchanda", "title": "Memory Loss or Something More? Early Signs of Dementia - Sportskeeda", "description": "The early signs of dementia are something more than just normal memory loss.", "url": "https://www.sportskeeda.com/health-and-fitness/memory-loss-something-more-early-signs-dementia", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/02/283e5-16764713706044-1920.jpg", "publishedAt": "2023-02-15T14:52:00Z", "content": "The early signs of dementia are something more than just normal memory loss. Dementia is a progressive condition that exacerbates over time and can eventually interfere with a persons ability to perf… [+5192 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Drug That Cures Autism? Neuroscience Study Yields Promising Results - SciTechDaily", "description": "The behavioral disorders observed in autism are associated with a multitude of genetic alterations. Scientists from the Hector Institute for Translational Brain Research (HITBR) have now found another molecular cause for this condition. The transcription fact…", "url": "https://scitechdaily.com/?p=252035", "urlToImage": "https://scitechdaily.com/images/Prescription-Drug-Concept.jpg", "publishedAt": "2023-02-15T14:32:04Z", "content": "In a new study, a drug that blocks sodium channels was shown to curb autism-associated behaviors such as hyperactivity in mice. The drug, lamotrigine sold under the brand name Lamictal among others i… [+5089 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Natural and surgical menopause closely associated with kidney stone development - Medical Dialogues", "description": "A recent study published in the Annals of Epidemiology suggest that natural and surgical menopause are associated with kidney stone disease (KSD) in Asian population. However, postmenopausal...", "url": "https://medicaldialogues.in/urology/news/natural-and-surgical-menopause-closely-associated-with-kidney-stone-development-107081", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/18/124407-kidney-stone.jpg", "publishedAt": "2023-02-15T14:30:06Z", "content": "A recent study published in the Annals of Epidemiology suggest that natural and surgical menopause are associated with kidney stone disease (KSD) in Asian population. However, postmenopausal hormone … [+2048 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Chest CT reveals lung abnormalities in COVID-19 patients as late as two years - Medical Dialogues", "description": "China: Persistent lung abnormalities were seen on chest CT in patients two years after COVID-19, linked with decreased diffusion pulmonary function and respiratory symptoms, a study published in...", "url": "https://medicaldialogues.in/radiology/news/chest-ct-reveals-lung-abnormalities-in-covid-19-patients-as-late-as-two-years-107146", "urlToImage": "https://medicaldialogues.in/h-upload/2023/02/15/201757-chest-ct.jpg", "publishedAt": "2023-02-15T14:30:02Z", "content": "China: Persistent lung abnormalities were seen on chest CT in patients two years after COVID-19, linked with decreased diffusion pulmonary function and respiratory symptoms, a study published in the … [+3501 chars]"}, {"source": {"id": null, "name": "openPR"}, "author": "Analytics Market Research", "title": "Pre-Workout Supplements Market Latest Trends, Trades, Supply, Demand, Prospects by 2032 - openPR", "description": "Pre Workout Supplements Market size was valued at USD 14 2 Billion in 2022 and is projected to reach USD 26 8 Billion by 2030 growing at a CAGR of 7 9 from 2023 to 2030 The analysis offers a ...", "url": "https://www.openpr.com/news/2931797/pre-workout-supplements-market-latest-trends-trades-supply", "urlToImage": "https://cdn.openpr.com/W/2/W215471940_g.jpg", "publishedAt": "2023-02-15T13:51:00Z", "content": "Pre-Workout Supplements Market\r\nPre-Workout Supplements Market size was valued at USD 14.2 Billion in 2022 and is projected to reach USD 26.8 Billion by 2030, growing at a CAGR of 7.9% from 2023 to 2… [+5742 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bird Flu Spreads To New Countries, Threatens Non-Stop \"War\" On Poultry - NDTV", "description": "Avian flu has reached new corners of the globe and become endemic for the first time in some wild birds that transmit the virus to poultry, according to veterinarians and disease experts, who warn it is now a year-round problem.", "url": "https://www.ndtv.com/world-news/bird-flu-spreads-to-new-countries-threatens-non-stop-war-on-poultry-3785185", "urlToImage": "https://c.ndtvimg.com/2021-01/uitchfl8_bird-flu_625x300_08_January_21.jpg", "publishedAt": "2023-02-15T13:46:41Z", "content": "Farmers' best efforts to protect flocks are falling short. (Representational)\r\nChicago: Avian flu has reached new corners of the globe and become endemic for the first time in some wild birds that tr… [+6872 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Alternate-day fasting may benefit patients with fatty liver disease: Research - ETHealthWorld", "description": "Nonalcoholic fatty liver disease is a buildup of fat and inflammation in patients who drink little to no alcohol. Approximately 65% of obese adults have the disease, and this condition is strongly related to the development of insulin resistance and Type 2 di…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/alternate-day-fasting-may-benefit-patients-with-fatty-liver-disease-research/97953254", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97953254,imgsize-39078,width-1200,height-628,overlay-ethealthworld/alternate-day-fasting-may-benefit-patients-with-fatty-liver-disease-research.jpg", "publishedAt": "2023-02-15T13:25:00Z", "content": "Chicago [US]: University of Illinois Chicago nutrition researchers evaluated 80 persons with nonalcoholic fatty liver disease and discovered that those who followed an alternate-day fasting diet and … [+3472 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Maggie Beer Keto Gummies Australia Reviews [AU Scam Exposed 2023] Also Buy Maggie Beer Gummies Australia Must Read - mid-day.com", "description": "Maggie Beer Keto Gummies are a fantastic choice if you're prepared to experiment with a novel method of weight loss. They are the key to unlocking the secrets of quick weight loss and making everyone think you have changed your lifestyle.", "url": "https://www.mid-day.com/brand-media/article/maggie-beer-keto-gummies-australia-reviews-au-scam-exposed-2023-also-buy-23270597", "urlToImage": "https://images.mid-day.com/images/images/2023/feb/Maggie-Beer-Keto-Gummie11_d.jpg", "publishedAt": "2023-02-15T12:59:00Z", "content": "Maggie Beer Keto Gummies are a fantastic choice if you're prepared to experiment with a novel method of weight loss. They are the key to unlocking the secrets of quick weight loss and making everyone… [+6580 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "MSD pharma likely to participate when govt floats tender for vaccine against cervical cancer - Economic Times", "description": "The Serum Institute's made-in-India vaccine against cervical cancer, CERVAVAC, was launched last month. Prakash Kumar Singh, Director of Government and Regulatory Affairs at the Serum Institute of India (SII), wrote a letter to the Health Ministry recently, s…", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/msd-pharma-likely-to-participate-when-govt-floats-tender-for-vaccine-against-cervical-cancer/articleshow/97952530.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97952553,width-1070,height-580,imgsize-241727,overlay-economictimes/photo.jpg", "publishedAt": "2023-02-15T12:52:00Z", "content": "MSD Pharmaceuticals is willing to participate in a global tender that the Union Health Ministry is likely to float in April to procure HPV vaccine against cervical cancer for immunisation of girls ag… [+2627 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "6 Incredible health benefits of papaya seeds - Northeast Now", "description": "Papaya seeds contain vitamins and minerals including zinc, phosphorus, calcium, magnesium, iron, and calcium.", "url": "http://nenow.in/health/6-incredible-health-benefits-of-papaya-seeds.html", "urlToImage": "https://nenow.in/wp-content/uploads/2023/02/papaya-seeds.jpg", "publishedAt": "2023-02-15T12:37:41Z", "content": "Papaya is widely known for its nutritional value and health benefits that it contains but very few people are aware of the immensely beneficial papaya seeds that are usually thrown away. \r\nThe papaya… [+1562 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Scientists Design a Smart Necklace to Help You Quit Smoking | Weather.com - The Weather Channel", "description": "The necklace, called SmokeMon, tracks smoking by capturing heat signatures from thermal sensors.", "url": "https://weather.com/en-IN/india/health/news/2023-02-15-scientists-design-a-smart-necklace-to-help-you-quit-smoking", "urlToImage": "https://s.w-x.co/in-smoke_9.jpg", "publishedAt": "2023-02-15T12:31:23Z", "content": "A necklace that could help you stop smoking is now on the horizon. Northwestern Medicine researchers have developed a smart neck-worn device resembling a lapis blue pendant that detects a user's smok… [+1732 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Cancer symptom: The condition in the mouth that can last for weeks; signs to note - Indiatimes.com", "description": "We often overlook our oral health. However, according to the World Health Organization (WHO), it is a key indicator of overall health, well-being and quality of life. Oral diseases are among the most common noncommunicable illnesses worldwide, affecting an es…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/cancer-symptom-the-condition-in-the-mouth-that-can-last-for-weeks-signs-to-note/photostory/97949507.cms", "urlToImage": "https://static.toiimg.com/photo/97949519.cms", "publishedAt": "2023-02-15T12:30:00Z", "content": "Leukoplakia refers to the thick, white patches that appear in the mouth. It can affect different areas in the mouth such as the gums, the insides of your cheeks, the bottom of your mouth and, sometim… [+691 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Is Marburg Disease? Know Symptoms, Transmissions Rate And Treatment Options For This Ebola-Like Virus - NDTV", "description": "Marburg virus: Equatorial Guinea, Africa has logged 16 suspected cases of Marburg virus which belongs to the same family as the Ebola virus.", "url": "https://www.ndtv.com/health/what-is-marburg-disease-know-symptoms-transmissions-rate-and-treatment-options-for-this-ebola-like-virus-3785058", "urlToImage": "https://c.ndtvimg.com/2020-09/jqd92i1g_fever_625x300_28_September_20.jpg", "publishedAt": "2023-02-15T12:25:00Z", "content": "WHO has confirmed an outbreak of Marburg disease in Equatorial Guinea\r\nThe World Health Organization has confirmed the first-ever outbreak of an Ebola-like virus called Marburg disease in Equatorial … [+2664 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Adderall vs Concerta - Adderall Side Effects in Men and Women - Deccan Herald", "description": "It is essential for people to understand the basics of the medicinal drugs prior to starting to take these. This is especially important in the case of prescription drugs such as Adderall and others, which carry the potential to cause dependence, abuse and ad…", "url": "https://www.deccanherald.com/brandspot/pr-spot/adderall-vs-concerta-adderall-side-effects-in-men-and-women-1191494.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1191494-1676463520.png", "publishedAt": "2023-02-15T12:18:40Z", "content": "It is essential for people to understand the basics of the medicinal drugs prior to starting to take these. This is especially important in the case of prescription drugs such as Adderall and others,… [+33660 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "AI performs poorly in detecting Covid by listening to cough says a UK-based study - Business Insider India", "description": "The AI classifiers trained on audio recordings cannot accurately predict whether someone has Covid-19 by analysing the sound of their coughs, according to", "url": "https://www.businessinsider.in/science/news/ai-performs-poorly-in-detecting-covid-by-listening-to-cough-says-a-uk-based-study/articleshow/97950791.cms", "urlToImage": "https://www.businessinsider.in/photo/97950791/ai-performs-poorly-in-detecting-covid-by-listening-to-cough-says-a-uk-based-study.jpg?imgsize=47290", "publishedAt": "2023-02-15T11:51:00Z", "content": "The AI\r\n classifiers trained on audio recordings cannot accurately predict whether someone has Covid-19 by analysing the sound of their coughs, according to the study led by the UK's Alan Turing Inst… [+2711 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Covid-19 infection raises diabetes risk: Research - Indiatimes.com", "description": "Science News: WASHINGTON: Researchers at Cedars-Smidt Sinai's Heart Institute have confirmed that persons who have had Covid-19 have a higher risk of developing new.", "url": "https://timesofindia.indiatimes.com/home/science/covid-19-infection-raises-diabetes-risk-research/articleshow/97948186.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97948301,width-1070,height-580,imgsize-26750,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-02-15T10:31:00Z", "content": ""}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How a pioneering diabetes drug offers hope for preventing autoimmune disorders - Nature.com", "description": "The approval of an antibody therapy that pauses the progression of type 1 diabetes is a first in the field, and some say a model for other drug developers.", "url": "https://www.nature.com/articles/d41586-023-00400-x", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00400-x/d41586-023-00400-x_24020656.jpg", "publishedAt": "2023-02-15T10:11:08Z", "content": "Her sisters life-threatening experience with diabetes was a wake-up call for Mikayla Olsten.\r\nIn 2016, when Olsten was 14 years old, her youngest sibling Mia landed in intensive care with failing kid… [+15959 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Vitamin D deficiency: Unusual symptoms your body shows when it is low in Vitamin D - Indiatimes.com", "description": "So, next time when you ignore your daily dose of vitamin D from the sun just remind yourself, do you have sufficient vitamin for the day?", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/vitamin-d-deficiency-unusual-symptoms-your-body-shows-when-it-is-low-in-vitamin-d/photostory/97853936.cms", "urlToImage": "https://static.toiimg.com/photo/97853998.cms", "publishedAt": "2023-02-15T10:06:04Z", "content": null}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "IANS", "title": "Ageing well: What does it mean, how can it be made possible? | Lifestyle Health | English Manorama - Onmanorama", "description": "Due to boredom and overthinking many times, the elderly might not want to reach out to their young ones impacting adversely their mental and physical health.", "url": "https://www.onmanorama.com/lifestyle/health/2023/02/15/ageing-well-what-does-it-mean-how-made-possible.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/lifestyle/health/images/2021/10/3/elderly-c.jpg", "publishedAt": "2023-02-15T09:37:14Z", "content": "New Delhi: Ageing well includes a lot of factors and while elderly people can find it challenging to maintain good health and well-being, many of us let issues pass by as a natural course of action. … [+3273 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Strategies for hepatocellular carcinoma cell sensitization | JHC - Dove Medical Press", "description": "This study summarizes combination therapies and potential drugs that can be used to sensitize HCC cells to sorafenib.", "url": "https://www.dovepress.com/potential-treatment-strategies-for-hepatocellular-carcinoma-cell-sensi-peer-reviewed-fulltext-article-JHC", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-02-15T09:26:03Z", "content": "Introduction\r\nHepatocellular carcinoma (HCC) is insidious in nature and has a low early diagnosis rate. Surgical resection, local ablation, and liver transplantation are potential curative treatment … [+43281 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Use of antibiotic lock therapy | JMDH - Dove Medical Press", "description": "Response strategies for infections in infants with short bowel syndrome and solid abdominal tumours treated with totally implantable venous access ports", "url": "https://www.dovepress.com/a-retrospective-study-of-the-use-of-antibiotic-lock-therapy-and-cluste-peer-reviewed-fulltext-article-JMDH", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-02-15T09:21:12Z", "content": "Introduction\r\nA totally implantable venous access port (TIVAP) is a closed intravenous infusion device placed subcutaneously in patients and can remain in the body for a long time. It mainly consists… [+22411 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Experiences of teachers and community-based health workers in addressing adolescents' sexual reproductive health and rights problems in rural health systems: a case of the RISE project in Zambia - BMC Public Health - BMC Public Health", "description": "Background Adolescents in low-and-middle-income countries like Zambia face a high burden of sexual, reproductive, health and rights problems including coerced sex, teenage pregnancies, and early marriages. The Zambia government through Ministry of Education h…", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-023-15199-5", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2023-02-15T08:54:23Z", "content": null}, {"source": {"id": null, "name": "Zawya.com"}, "author": null, "title": "For every 2,000 steps a day, heart disease and premature deaths could decrease by 10% - ZAWYA", "description": "Peaking at 10,000 steps each day, new study by Abu Dhabi 360 shows", "url": "https://www.zawya.com/en/press-release/research-and-studies/for-every-2-000-steps-a-day-heart-disease-and-premature-deaths-could-decrease-by-10-nqzcnhni", "urlToImage": "https://static.zawya.com/version/c:NWI4OGIwZmUtNDU1Yi00:NDg4NTIz/image1-jpg.webp?f=3%3A2", "publishedAt": "2023-02-15T08:50:41Z", "content": "Whether youre already committed to a daily walk or looking to get started, when it comes to being fit and healthy, were often reminded to aim to walk 10,000 steps per day. But how set in stone is thi… [+6132 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Brain changes in fighter pilots may cast light on astronauts during space travel - Tech Explorist", "description": "The study is the first to investigate functional brain connectivity in fighter pilots.", "url": "https://www.techexplorist.com/brain-changes-fighter-pilots-cast-light-astronauts-during-space-travel/56957/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/fighter-plane.jpg", "publishedAt": "2023-02-15T08:43:24Z", "content": "To be able to adapt to changing environments functionally, the brain is capable of altering its function and structure. This process is called neuroplasticity and is crucial for skill learning and ad… [+2914 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Targeting microbiome can improve child undernutrition: Research - ETHealthWorld", "description": "The gut microbiome is a collective term for the trillions of different microbes living within the human gut, which are essential for developmental processes in early life, such as building immunity, hormone production and metabolism of certain nutrients.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/targeting-microbiome-can-improve-child-undernutrition-research/97941749", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97941749,imgsize-31180,width-1200,height-628,overlay-ethealthworld/targeting-microbiome-can-improve-child-undernutrition-research.jpg", "publishedAt": "2023-02-15T08:35:00Z", "content": "Washington: Research led by the Queen Mary University of London suggests that nutritional interventions used to tackle child undernutrition in lower and middle-income countries should target gut micr… [+3312 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "AI With Infrared Imaging Enables Precise Colon Cancer Diagnostics - Technology Networks", "description": "Researchers are using artificial intelligence in combination with infrared imaging to optimally tailor colon cancer therapy to individual patients.", "url": "https://www.technologynetworks.com/diagnostics/news/ai-with-infrared-imaging-enables-precise-colon-cancer-diagnostics-370211", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/370211/ai-with-infrared-imaging-enables-precise-colon-cancer-diagnostics-370211-640x360.jpg?cb=20230215", "publishedAt": "2023-02-15T08:32:46Z", "content": "The immense progress in the field of therapy options over the past years has significantly improved the chances of cure for patients with colon cancer. However, these new approaches, such as immunoth… [+4402 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "10 reasons why your cholesterol doesn't reduce (habits that keep cholesterol high) - Times of India", "description": "High cholesterol is when the cholesterol level in the blood is more than 200 mg/dL, specifically, the LDL or the low density lipoprotein component of the cholesterol though other components like HDL and triglycerides should not be ignored.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/10-reasons-why-your-cholesterol-doesnt-reduce-habits-that-keep-cholesterol-high/photostory/97940557.cms", "urlToImage": "https://static.toiimg.com/photo/97940647.cms", "publishedAt": "2023-02-15T08:30:00Z", "content": "High cholesterol is when the cholesterol level in the blood is more than 200 mg/dL, specifically, the LDL or the low density lipoprotein component of the cholesterol though other components like HDL … [+699 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Tanvi Mayur Patel", "title": "What have hormones got to do with diabetes? Everything! - Health shots", "description": "Do diabetes and hormone imbalance have a link? Apparently, yes, at every age and stage of life. A doctor tells you all about it.", "url": "https://www.healthshots.com/preventive-care/self-care/what-have-hormones-got-to-do-with-diabetes-everything/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/02/15132336/Diabetes-9.jpg", "publishedAt": "2023-02-15T08:02:29Z", "content": "Not many people know that diabetes is also called a disease of the endocrine system. The endocrine system consists of eight glands, each of which produces a different hormone. These hormones catalyse… [+4775 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Inhaled corticosteroid in COPD | COPD - Dove Medical Press", "description": "Developing a scoring model that predicts the effects of withrawing inhaled corticosteroids from triple therapy", "url": "https://www.dovepress.com/a-prediction-scoring-model-for-the-effect-of-withdrawal-or-addition-of-peer-reviewed-fulltext-article-COPD", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-02-15T07:45:54Z", "content": "Introduction\r\nChronic obstructive pulmonary disease (COPD) is among the most common causes of death in the world.1 The mainstay of treatment for COPD is inhaled bronchodilator therapy.2 Conversely, t… [+36159 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Masks made little or no difference during Covid? Here's what this study found - msnNOW", "description": "The report, prepared by the UK-based Cochrane Review, researched whether physical interventions – including masks – reduce the speed of respiratory viruses.", "url": "https://www.hindustantimes.com/science/masks-made-little-or-no-difference-during-covid-here-s-what-a-study-found-101676441470727.html?utm_source=microsoft-ht", "urlToImage": "https://static-entertainment-eus-s-msn-com.akamaized.net/sc/c6/519670.jpg", "publishedAt": "2023-02-15T07:13:37Z", "content": "Since the early days of the Covid-19 pandemic, we have been told that face masks, social distancing, sanitisation and vaccination, are the ways through which people can avoid contracting the viral di… [+1865 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "No woman should die from cervical cancer - Times of India", "description": "According to doctors, cervical cancer is one of the most preventable cancers. Most cases are caused by the Human Pa", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/no-woman-should-die-from-cervical-cancer/articleshow/97940303.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97940268,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-24948/97940268.jpg", "publishedAt": "2023-02-15T06:56:00Z", "content": "While the term cancer evokes fear, helplessness and fatalism, the reality is that almost 30-50% of the cancers are preventable. Cervical cancer, the cancer of the cervix in the uterus, is one of thos… [+6478 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Ipsita Bhattacharya", "title": "Exclusive: Dental Hygiene Tips - Should you Brush After or Before Breakfast, What`s the Verdict? - Zee News", "description": "Use a soft-bristled toothbrush and hydroxyapatite/fluoride toothpaste Brush in a circular motion, making sure to reach all surfaces of the teeth Brush for at least 2 minutes, aiming to spend equal time on each segment of the mouth Rinse your mouth with water …", "url": "https://zeenews.india.com/health/exclusive-dental-hygiene-tips-should-you-brush-after-or-before-breakfast-whats-the-verdict-2573450", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/02/15/1154286-brush-teeth-pixabay.jpg", "publishedAt": "2023-02-15T05:56:58Z", "content": "Dental hygiene is very essential and something as simple as brushing your teeth can go a long way in keeping your dental health in order. Taking care of your teeth is an important part of your overal… [+4203 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Brain Aneurysm: Signs that should not be ignored - Indiatimes.com", "description": "The UK National Health Services (NHS) defines an aneurysm as a 'bulge' in a blood vessel in the brain. This is caused by a weakness in the blood vessel wall, explains the healthy body. It often appears as a berry hanging on a stem, which can leak or rupture a…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/brain-aneurysm-signs-that-should-not-be-ignored/photostory/97916445.cms", "urlToImage": "https://static.toiimg.com/photo/97916465.cms", "publishedAt": "2023-02-15T05:30:00Z", "content": "According to the Mayo Clinic, a ruptured brain aneurysm is a medical emergency, wherein the aneurysm starts to leak and cause bleeding. Common symptoms include severe headache, nausea, vomiting, stif… [+321 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How You Can Slow Down The Effects Of Ageing - News18", "description": "Inculcating these lifestyle tips and tricks into your daily routine and do you a world of good, read on to know more-", "url": "https://www.news18.com/news/lifestyle/how-you-can-slow-down-the-effects-of-ageing-7078195.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/untitled-design-2023-02-14t211250.102-167638940216x9.png", "publishedAt": "2023-02-15T04:00:40Z", "content": "The natural process of ageing starts from the moment we are born and cannot be stopped. This doesnt mean that ageing cant be slowed down. People who live a healthier lifestyle tend to age slower than… [+3136 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra, Times Now Digital", "title": "Symptoms men should never ignore - Times Now", "description": "Symptoms men should never ignore", "url": "https://www.timesnownews.com/web-stories/health/symptoms-men-should-never-ignore/photostory/97935549.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97935643,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-02-15T03:58:21Z", "content": "Unexplained weight loss even without trying can be a sign of a serious health problem. In many cases, dramatic weight loss occurs in those with cancer of the pancreas, stomach, esophagus, or lungs"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Using radiomics to predict future cardiac events - News-Medical.Net", "description": "Researchers are using an approach called radiomics to predict future cardiac events like heart attacks, according to a study published in Radiology, a journal of the Radiological Society of North America.", "url": "https://www.news-medical.net/news/20230214/Using-radiomics-to-predict-future-cardiac-events.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2023-02-15T03:21:00Z", "content": "Researchers are using an approach called radiomics to predict future cardiac events like heart attacks, according to a study published in Radiology, a journal of the Radiological Society of North Ame… [+2395 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Krati Purwar", "title": "Dhanurasana To Garudasana, 7 Yoga Poses That Can Help With Tight Shoulders - HerZindagi English", "description": "Yoga can help you feel calm, stretch your body and improve your flexibility. If you have been experiencing stiffness around your shoulders and neck, a few postures like cat pose, eagle pose and cobra pose can be extremely helpful.", "url": "https://www.herzindagi.com/fitness/yoga-poses-to-help-with-stiff-shoulders-dhanurasana-garudasana-cobra-pose-article-222352", "urlToImage": "https://images.herzindagi.info/image/2023/Feb/yoga-asanas-for-shoulder-stiffness-and-pain.jpg", "publishedAt": "2023-02-15T03:00:46Z", "content": "Stiffness or tight feeling in the shoulders can lead to pain in the neck, back and upper parts of the body. The tightness could be due to stress, tension, injuries or sleeping in an uncomfortable pos… [+3456 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "No 'male disadvantage' in Covid-heart disease: Study - Sentinelassam - The Sentinel Assam", "description": "The so-called ‘male disadvantage’ in severity of Covid-19 cannot solely be explained by pre-existing ...", "url": "https://www.sentinelassam.com/topheadlines/no-male-disadvantage-in-covid-heart-disease-study-637563", "urlToImage": "https://assets.sentinelassam.com/h-upload/2023/02/15/438880-heart.jpg", "publishedAt": "2023-02-15T02:26:52Z", "content": "LONDON: The so-called male disadvantage in severity of Covid-19 cannot solely be explained by pre-existing cardiovascular disease as other factors also contribute to heart disease severity, researche… [+2112 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers explore how brain's immune system worsens epilepsy - ANI News", "description": "In a new study, the University of Iowa biologists have lain out a chain of events that can cause seizures, the most common manifestation of epilepsy, to worsen.", "url": "https://www.aninews.in/news/science/researchers-explore-how-brains-immune-system-worsens-epilepsy20230215070154", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230215002441.jpg", "publishedAt": "2023-02-15T01:31:00Z", "content": "Washington [US], February 15 (ANI): In a new study, the University of Iowa biologists have lain out a chain of events that can cause seizures, the most common manifestation of epilepsy, to worsen.The… [+4702 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Judy George", "title": "Long COVID or Functional Neurological Disorder? | MedPage Today - Medpage Today", "description": "Neurologic symptoms in long COVID insufficiently studied, systematic review suggests", "url": "https://www.medpagetoday.com/neurology/longcovid/103108", "urlToImage": "https://assets.medpagetoday.net/media/images/103xxx/103108.jpg", "publishedAt": "2023-02-14T22:00:26Z", "content": "The hypothesis that long COVID might be related to a functional neurological disorder (FND) remains untested, a systematic review showed.\r\nAcross 102 long COVID studies, neurologic symptoms were insu… [+5930 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Marlene Cimons", "title": "Plant-based foods may reduce prostate cancer progression, study says - The Washington Post", "description": "Men with prostate cancer who reported diets with the highest amounts of plants had a lower risk of disease progression and recurrence.", "url": "https://www.washingtonpost.com/wellness/2023/02/14/prostate-cancer-diet-fruits-vegetables/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67D6HA7QBAR43I2X5PUEDOYVIQ.jpg&w=1440", "publishedAt": "2023-02-14T21:40:31Z", "content": "Comment on this story\r\nA diet heavy in plant-based foods fresh fruits and vegetables can reduce both the progression of prostate cancer and the likelihood that it will return, new research shows.\r\nEa… [+6801 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "M. Sai Gopal", "title": "Backaches linked to Vitamin D deficiency - Telangana Today", "description": "Moreover, NIMS study says if someone is vulnerable to fractures and has brittle bones, this may be causative factor", "url": "https://telanganatoday.com/backaches-linked-to-vitamin-d-deficiency", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2023/02/women-running.jpg", "publishedAt": "2023-02-14T18:30:45Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Enhanced prediction of prostate cancer recurrence using machine learning model - News-Medical.Net", "description": "Predicting the course of prostate cancer is challenging because only a fraction of prostate cancer patients experience recurrence after radical prostatectomy or radiation therapy.", "url": "https://www.news-medical.net/news/20230214/Enhanced-prediction-of-prostate-cancer-recurrence-using-machine-learning-model.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-02-14T17:47:00Z", "content": "Predicting the course of prostate cancer is challenging because only a fraction of prostate cancer patients experience recurrence after radical prostatectomy or radiation therapy. Yet, prostate cance… [+4459 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Christopher Plain, Christopher Plain", "title": "Lion's Mane Mushrooms Found to 'Magically' Regrow Brain Cells, New Research Shows - The Debrief", "description": "Compounds isolated from edible “lion’s mane” mushrooms have shown the ability to magically regrow completely new brain cells.", "url": "https://thedebrief.org/lions-mane-mushrooms-found-to-magically-regrow-brain-cells-new-research-shows/", "urlToImage": "https://thedebrief.org/wp-content/uploads/2023/02/Resize-Lions-mane-mushrooms.jpeg", "publishedAt": "2023-02-14T17:00:19Z", "content": "Edible lions mane mushrooms have shown the ability to magically regrow completely new brain cells, according to new research.\r\nFormally named Hericium erinaceus, the formidable fungus has been used i… [+3780 chars]"}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Rahul Dolare", "title": "Mylab and Qure.ai join hands for Tuberculosis Screening Solutions Qure.ai will provide the AI-interpretation engine for Mylab's upcoming radiology devices - Punekar News", "description": "Punekarnews.in is the first and only English language hyper-local news portal of Pune and Pimpri Chinchwad. It was launched in July 2014.", "url": "https://www.punekarnews.in/mylab-and-qure-ai-join-hands-for-tuberculosis-screening-solutions-qure-ai-will-provide-the-ai-interpretation-engine-for-mylabs-upcoming-radiology-devices/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2015/10/Punekar-News-logo3.png", "publishedAt": "2023-02-14T16:38:20Z", "content": "Pune/Mumbai, 14th February 2023 Mylab Discovery Solutions, Indias leading biotech company, today announced its partnership with Qure.ai, a leading provider of artificial intelligence (AI) software, f… [+3753 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Buy Doxycycline 100mg Online - Cheap Price - The Tribune India", "description": "Doxycycline 100mg is a penicillin used to treat many bacterial infections, including streptococcus, staphylococcus, and scarlet fever. It also has anti-inflammatory properties, which makes it useful for treating skin infections and inflammatory diseases. The …", "url": "https://www.tribuneindia.com/news/brand-connect/buy-doxycycline-100mg-online-cheap-price-479737", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/2/2023_2$largeimg_1435619254.jpg", "publishedAt": "2023-02-14T16:10:00Z", "content": "Overview of Doxycycline 100mg\r\nDoxycycline 100mg is a penicillin used to treat many bacterial infections, including streptococcus, staphylococcus, and scarlet fever. It also has anti-inflammatory pro… [+7844 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Nutritional intelligence: do we have an inbuilt capacity to recognize differences in food composition? - News-Medical.Net", "description": "Researchers explored food sensitivities found in daily dietary decisions based on food composition.", "url": "https://www.news-medical.net/news/20230214/Nutritional-intelligence-do-we-have-an-inbuilt-capacity-to-recognize-differences-in-food-composition.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_738817_16763864361353834.jpg", "publishedAt": "2023-02-14T15:18:00Z", "content": "In a recent study published in Physiology &amp; Behavior, researchers explored food sensitivities found in daily dietary decisions based on food composition.\r\nStudy: Human nutritional intelligence un… [+5287 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Secret to Maximum Fat Burn: How Time of Day May Impact Exercise Results - SciTechDaily", "description": "Physical activity at the right time of the day seems able to increase fat metabolism, at least in mice. A new study from Karolinska Institutet in Sweden and the University of Copenhagen in Denmark shows that mice that did exercise in an early active phase, wh…", "url": "https://scitechdaily.com/secret-to-maximum-fat-burn-how-time-of-day-may-impact-exercise-results/", "urlToImage": "https://scitechdaily.com/images/Obesity-Weight-Loss-Concept-1.jpg", "publishedAt": "2023-02-14T14:53:17Z", "content": "A recent study by Karolinska Institutet in Sweden and the University of Copenhagen in Denmark suggests that timing of physical activity can influence fat metabolism, based on research conducted on mi… [+3403 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Study links low intracranial pressure with glaucoma development - Medical Dialogues", "description": "Lithuania: Intracranial pressure is significantly associated with normal-tension glaucoma that contributes to up to 50% of all glaucoma cases, according to a study by an international team of...", "url": "https://medicaldialogues.in/ophthalmology/news/study-links-low-intracranial-pressure-with-glaucoma-development-107095", "urlToImage": "https://medicaldialogues.in/h-upload/2023/02/14/201615-glaucoma.jpg", "publishedAt": "2023-02-14T14:30:19Z", "content": "Lithuania: Intracranial pressure is significantly associated with normal-tension glaucoma that contributes to up to 50% of all glaucoma cases, according to a study by an international team of researc… [+5591 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Economic impact of TB does not end with completion of TB treatment: Study - BSI bureau", "description": "Economic impact of TB does not end with completion of TB treatment: Study", "url": "https://www.biospectrumindia.com/news/98/22636/economic-impact-of-tb-does-not-end-with-completion-of-tb-treatment-study.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/tb-22636.png", "publishedAt": "2023-02-14T13:37:46Z", "content": "India has a long way to reach Zero Catastrophic Costs goal for TB patients: Suggests study by The George Institute for Global Health\r\nA recent study led by Dr Susmita Chatterjee from The George Insti… [+1838 chars]"}, {"source": {"id": null, "name": "Newsanyway.com"}, "author": null, "title": "Liba Weight Loss Tablets SCAM EXPOSED Must You Need To Know - News Anyway", "description": "Are you searching for various options to support your weight loss efforts? Becoming leaner can be a challenge for the general population, as we are mostly", "url": "https://www.newsanyway.com/2023/02/14/liba-weight-loss-tablets-scam-exposed-must-you-need-to-know/", "urlToImage": "https://www.newsanyway.com/wp-content/uploads/2023/02/liba.jpg", "publishedAt": "2023-02-14T12:34:42Z", "content": "Are you searching for various options to support your weight loss efforts? Becoming leaner can be a challenge for the general population, as we are mostly unique and our bodies and brains respond to … [+6037 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "All You Need To Know About Azoospermia; Diagnosis And How To Avoid It - News18", "description": "A blockage or missing link in the epididymis and vas deferens along the male reproductive system is what is meant by obstructive azoospermia", "url": "https://www.news18.com/news/lifestyle/all-you-need-to-know-about-azoospermia-diagnosis-and-how-to-avoid-it-7081903.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/news18-61-1-167637395616x9.png", "publishedAt": "2023-02-14T11:26:56Z", "content": "Azoospermia is the medical word for a lack of sperm in the ejaculate. It might be nonobstructive, which occurs when the testis produces less sperm or is obstructive, where there is a blockage prevent… [+2216 chars]"}, {"source": {"id": null, "name": "Foodingredientsfirst.com"}, "author": null, "title": "Researchers create nutritious gluten-free flour with sweet potato - Food Ingredients First", "description": "14 Feb 2023 --- Boasting high vitamin B levels, sweet potatoes are known as a healthy alternative to comfort food favorites such as fries, crisps or wedges. However, the full nutritional benefits of the spud may not yet have been extracted. A recent study has…", "url": "https://www.foodingredientsfirst.com/news/researchers-create-nutritious-gluten-free-flour-with-sweet-potato.html", "urlToImage": "https://article.innovadatabase.com/articleimgs/article_images/638119684344407315Sweet%20potato%20main.jpg", "publishedAt": "2023-02-14T10:54:37Z", "content": "14 Feb 2023 --- Boasting high vitamin B levels, sweet potatoes are known as a healthy alternative to comfort food favorites such as fries, crisps or wedges. However, the full nutritional benefits of … [+3656 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Your Skin Tone Determines The Effect Of UV Rays On It - News18", "description": "There are different ways your skin reacts to UV rays or sunlight, depending on your texture.", "url": "https://www.news18.com/news/lifestyle/how-your-skin-tone-determines-the-effect-of-uv-rays-on-it-7079725.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/untitled-1-335-167636769816x9.jpg", "publishedAt": "2023-02-14T09:42:02Z", "content": "Vitamin D is very important for the body. Sunlight is considered to be the best and biggest source of this Vitamin. It helps in making skin tissue healthy from the inside and increases the absorption… [+2045 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tulsi With Jaggery: Try This Powerful Combination To Fight Against Cold, Flu And Indigestion - NDTV", "description": "Struggling with cold flu and indigestion? Try this expert-recommended all-natural remedy for relief.", "url": "https://www.ndtv.com/health/tulsi-with-jaggery-try-this-powerful-combination-to-fight-against-cold-flu-and-indigestion-3780889", "urlToImage": "https://c.ndtvimg.com/2018-10/tnpr6h7g_tulsi-(basil)_625x300_25_October_18.jpg", "publishedAt": "2023-02-14T08:07:00Z", "content": "Tulsi is loaded with effective antioxidants, antiseptic and antiviral properties\r\nThe sudden drop in temperatures cause health issues like cold, cough or flu among others. During such times, all we d… [+1541 chars]"}, {"source": {"id": null, "name": "Dynamitenews.com"}, "author": null, "title": "Study: Change in how heart produces energy can be key to preventing heart failure - Dynamite News", "description": "Heart failure is often identified only when the heart has already deteriorated.  Read further on Dynamite News:", "url": "https://www.dynamitenews.com/story/study-change-in-how-heart-produces-energy-can-be-key-to-preventing-heart-failure", "urlToImage": "https://www.dynamitenews.com/images/2023/02/14/study-change-in-how-heart-produces-energy-can-be-key-to-preventing-heart-failure/63eb3b2e34caf.jpg", "publishedAt": "2023-02-14T07:56:18Z", "content": "Heart failure is often identified only when the heart has already deteriorated. Read further on Dynamite News:\r\n Washington [US]: Heart failure is often identified only when the heart has already det… [+3473 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Type 1 diabetes complications may be improved by short, frequent activity breaks - News-Medical.Net", "description": "In a review article published in the Canadian Journal of Diabetes, scientists have discussed the application and significance of decreasing sedentary behavior at frequent intervals in managing type 1 diabetes.", "url": "https://www.news-medical.net/news/20230213/Type-1-diabetes-complications-may-be-improved-by-short-frequent-activity-breaks.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_738754_16763362705566462.jpg", "publishedAt": "2023-02-14T00:58:00Z", "content": "In a review article published in the Canadian Journal of Diabetes, scientists have discussed the application and significance of decreasing sedentary behavior at frequent intervals in managing type 1… [+4812 chars]"}]}