{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "NIH awards eight research grants to advance diagnosis of Multisystem Inflammatory Syndrome in Children - News-Medical.Net", "description": "The National Institutes of Health has awarded eight research grants to refine new technologies for early diagnosis of severe illnesses resulting from SARS-CoV-2 infection in children.", "url": "https://www.news-medical.net/news/20230109/NIH-awards-eight-research-grants-to-advance-diagnosis-of-Multisystem-Inflammatory-Syndrome-in-Children.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2023-01-09T18:26:00Z", "content": "The National Institutes of Health has awarded eight research grants to refine new technologies for early diagnosis of severe illnesses resulting from SARS-CoV-2 infection in children. The new awards … [+3634 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Deep Shukla", "title": "Type 2 diabetes: Low-carb diet can help achieve full remission - Medical News Today", "description": "A new study involving 186 patients with type 2 diabetes suggests that a low-carbohydrate diet helped over half of the participants achieve remission.", "url": "https://www.medicalnewstoday.com/articles/low-carb-diet-reverses-type-2-diabetes-in-51-of-participants-to-new-study", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/01/low_carb_protein_salad_732x549_thumb.jpg", "publishedAt": "2023-01-09T17:50:44Z", "content": "<ul><li>Studies have shown that weight loss by reducing calorie intake can lead to the remission of type 2 diabetes, involving the return of blood glucose (sugar) levels to prediabetic levels in the … [+11726 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study: Two separate eye diseases may contribute to age-related macular degeneration - News-Medical.Net", "description": "Two separate eye diseases may contribute to age-related macular degeneration (AMD), a leading cause of blindness in the United States, according to a new study from New York Eye and Ear Infirmary of Mount Sinai.", "url": "https://www.news-medical.net/news/20230109/Study-Two-separate-eye-diseases-may-contribute-to-age-related-macular-degeneration.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/2/Close_up_of_the_beautiful_eye_of_a_young_child_-_Nik_Bruining_f959060df7e6466ba2733a4c18153083-620x480.jpg", "publishedAt": "2023-01-09T17:18:00Z", "content": "Two separate eye diseases may contribute to age-related macular degeneration (AMD), a leading cause of blindness in the United States, according to a new study from New York Eye and Ear Infirmary of … [+4767 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals variety of healthy eating patterns can lower risk of premature death - ThePrint", "description": "Boston (Massachusetts) [US], January 9 (ANI): A new study found that a variety of healthy eating habits are associated with a lower chance of dying before your time. They discovered that in comparison to participants with lower scores, those with high scores …", "url": "https://theprint.in/features/study-reveals-variety-of-healthy-eating-patterns-can-lower-risk-of-premature-death/1306840/", "urlToImage": null, "publishedAt": "2023-01-09T17:16:13Z", "content": "Boston (Massachusetts) [US], January 9 (ANI): A new study found that a variety of healthy eating habits are associated with a lower chance of dying before your time. They discovered that in compariso… [+2916 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Fewer cases of melanoma among people taking vitamin D supplements - Science Daily", "description": "Fewer cases of melanoma were observed among regular users of vitamin D supplements than among non-users, a new study finds. People taking vitamin D supplements regularly also had a considerably lower risk of skin cancer, according to estimates by experienced …", "url": "https://www.sciencedaily.com/releases/2023/01/230109112555.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-09T17:13:25Z", "content": "Fewer cases of melanoma were observed among regular users of vitamin D supplements than among non-users, a new study finds. People taking vitamin D supplements regularly also had a considerably lower… [+3853 chars]"}, {"source": {"id": null, "name": "Hartfordhealthcare.org"}, "author": null, "title": "Can Weight Loss Surgery Treat Type 2 Diabetes? - Hartford HealthCare", "description": "Learn more about News Detail at hartfordhealthcare.org", "url": "https://hartfordhealthcare.org/about-us/news-press/news-detail?articleid=46521&publicId=395", "urlToImage": "https://hartfordhealthcare.org/Image Library/Logos . Icons/hhcLinkedinOG12.jpg", "publishedAt": "2023-01-09T16:40:27Z", "content": "Hartford HealthCare Offices\r\n100 Pearl Street, Hartford, CT 06103  •  Contact Us\r\nDonations to Hartford HealthCare are managed by the Hartford Hospital Department of Philanthropy, a Connecticut tax-e… [+112 chars]"}, {"source": {"id": null, "name": "Neurologyadvisor.com"}, "author": "Maria Arini Lopez, PT, DPT", "title": "Triglyceride-Glucose Index Scores Predict Recurrent Stroke, Mortality in T2DM - Neurology Advisor", "description": "In a cross-sectional analysis, researchers investigated the association between TyG index and clinical prognosis of acute ischemic stroke in patients with T2DM.", "url": "https://www.neurologyadvisor.com/topics/stroke/triglyceride-glucose-index-scores-predict-recurrent-stroke-mortality-t2dm/", "urlToImage": null, "publishedAt": "2023-01-09T15:47:00Z", "content": "Triglyceride-glucose (TyG) index scores strongly correlated with the incidence of recurrent ischemic stroke and all-cause death in patients with acute ischemic stroke and type 2 diabetes mellitus (T2… [+3676 chars]"}, {"source": {"id": null, "name": "Gavi.org"}, "author": null, "title": "Colds, flu and COVID: how diet and lifestyle can boost your immune system - Gavi, the Vaccine Alliance", "description": "Here are some simple things you can do everyday to help your immune system fight off infections.", "url": "https://www.gavi.org/vaccineswork/colds-flu-and-covid-how-diet-and-lifestyle-can-boost-your-immune-system", "urlToImage": "https://www.gavi.org/sites/default/files/vaccineswork/2023/Header/baranq-Shutterstock_h1.jpg", "publishedAt": "2023-01-09T15:32:57Z", "content": "Every day we are exposed to a wide array of potentially harmful microorganisms such as colds, the flu and even COVID. But our immune system a network of intricate pathways within our body helps prote… [+6258 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: Glycemic control in patients with type 2 diabetes can be predicted by machine learning methods - ANI News", "description": "Machine learning techniques can predict with certainty the likelihood that patients with type 2 diabetes would have poor glycemic control. The length of type 2 diabetes, previous glucose levels, and the patient's use of anti-diabetic medications are the most …", "url": "https://www.aninews.in/news/science/study-glycemic-control-in-patients-with-type-2-diabetes-can-be-predicted-by-machine-learning-methods20230109205720", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230109152709.jpg", "publishedAt": "2023-01-09T15:29:41Z", "content": "Kuopio [Finland], January 9 (ANI): According to a recent study from Finland, machine learning techniques can predict with certainty the likelihood that patients with type 2 diabetes would have poor g… [+2027 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Study finds 6.5% of Spanish population refused COVID-19 vaccination - Medical Xpress", "description": "Europe is experiencing an increasingly large circulation of influenza and the respiratory syncytial virus (RSV). In addition to COVID-19, these viruses are expected to have a major impact on health services and populations this winter. This shows the importan…", "url": "https://medicalxpress.com/news/2023-01-spanish-population-covid-vaccination.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/vaccine-14.jpg", "publishedAt": "2023-01-09T15:21:12Z", "content": "Europe is experiencing an increasingly large circulation of influenza and the respiratory syncytial virus (RSV). In addition to COVID-19, these viruses are expected to have a major impact on health s… [+6215 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Isabel Shaw", "title": "New test could diagnose autism in minutes – and all you need is a strand of hair... - The US Sun", "description": "SCIENTISTS have developed a revolutionary new test that can detect autism in babies from a single strand of hair. The new test, which can predict the developmental disorder years before symptoms ap…", "url": "https://www.the-sun.com/health/7090343/baby-test-hair-autism/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2023/01/detail-baby-toddler-looking-away-787446852-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2023-01-09T15:16:26Z", "content": "SCIENTISTS have developed a revolutionary new test that can detect autism in babies from a single strand of hair.\r\nThe new test, which can predict the developmental disorder years before symptoms app… [+4097 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Chanel Georgina", "title": "Two foods you must 'avoid' if you have high cholesterol - 'Be more careful', says charity - Express", "description": "High amounts of cholesterol in the blood is a prerequisite for a potentially deadly health scare.", "url": "https://www.express.co.uk/life-style/health/1718882/high-cholesterol-diet-offal-liver", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4496943.jpg?r=1673276731792", "publishedAt": "2023-01-09T15:04:00Z", "content": null}, {"source": {"id": null, "name": "Express"}, "author": "Chanel Georgina", "title": "Five symptoms of dementia to watch out for in the earliest of stages – 'See your GP' - Express", "description": "The number of people suffering from dementia is predicted to reach over two million by 2051, but what are the early warning signs of the disease?", "url": "https://www.express.co.uk/life-style/health/1718866/dementia-symptoms-signs-early-stages", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4496877.jpg?r=1673275451702", "publishedAt": "2023-01-09T14:43:00Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "High bed-occupancy rates increase the risk of in-hospital mortality - News-Medical.Net", "description": "Researchers have long suspected a link between bed occupancy and mortality in hospitals. Now, a study by the University of Basel has provided the missing data, revealing that smaller hospitals reach their capacity limit much earlier.", "url": "https://www.news-medical.net/news/20230109/High-bed-occupancy-rates-increase-the-risk-of-in-hospital-mortality.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2023-01-09T14:16:00Z", "content": "Researchers have long suspected a link between bed occupancy and mortality in hospitals. Now, a study by the University of Basel has provided the missing data, revealing that smaller hospitals reach … [+3222 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Daily consumption of almonds alters metabolism for faster recovery after strenuous exercise - Medical Dialogues", "description": "Researchers have found in a new randomized controlled trial that daily consumption of almonds changes the metabolism to recover faster after strenuous exercise.The participants who daily ate 57g...", "url": "https://medicaldialogues.in/diet-nutrition/news/daily-consumption-of-almonds-alters-metabolism-for-faster-recovery-after-strenuous-exercise-105343", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/09/196977-untitled-design-2023-01-09t112008976.jpg", "publishedAt": "2023-01-09T14:15:15Z", "content": "Researchers have found in a new randomized controlled trial that daily consumption of almonds changes the metabolism to recover faster after strenuous exercise.\r\nThe participants who daily ate 57g al… [+4271 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "AI Model Predicts Cognitive Diseases Using Brain Age - AZoRobotics", "description": "Currently, a new artificial intelligence (AI) model that examines magnetic resonance imaging (MRI) brain scans built by USC scientists can be employed to precisely capture cognitive decline in association with neurodegenerative diseases such as Alzheimer’s mu…", "url": "https://www.azorobotics.com/News.aspx?newsID=13498", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/SocialSharingImage_13498_16732733015925220.jpg", "publishedAt": "2023-01-09T14:14:00Z", "content": "The human brain carries several clues regarding an individual’s long-term health—in fact, studies show that the brain age of a person is a more valuable and precise forecaster of health threats and f… [+5352 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers reveal how obesity increases risk for dementia - ANI News", "description": "A significant global public health concern, dementia now affects 50 million individuals and is projected to reach more than 150 million cases by 2050. An ongoing global problem is obesity, which is typically assessed by body mass index (BMI). Previous researc…", "url": "https://www.aninews.in/news/health/researchers-reveal-how-obesity-increases-risk-for-dementia20230109194252", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230109141237.jpg", "publishedAt": "2023-01-09T14:12:00Z", "content": "Boston [Massachusetts], January 9 (ANI): A significant global public health concern, dementia now affects 50 million individuals and is projected to reach more than 150 million cases by 2050. An ongo… [+2346 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Trisha Yearwood Keto Gummies Reviews [SCAM REVEALED] Facts of Trisha Yearwood Weight Loss Gummies - The Tribune India", "description": "A high BMI negatively impacts a person's health and, therefore, their quality of life. Scientists and those who aim to reduce weight are on the constant lookout for an approach that will allow them to do so in a healthy manner and, more significantly, one tha…", "url": "https://www.tribuneindia.com/news/brand-connect/trisha-yearwood-keto-gummies-reviews-scam-revealed-facts-of-trisha-yearwood-weight-loss-gummies-468897", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1412010900.jpg", "publishedAt": "2023-01-09T13:11:00Z", "content": "A high BMI negatively impacts a person's health and, therefore, their quality of life. Scientists and those who aim to reduce weight are on the constant lookout for an approach that will allow them t… [+13094 chars]"}, {"source": {"id": null, "name": "Kashmir Life"}, "author": "Kashmir Life", "title": "Harvard Scientist Made Cancer Cells Kill The Brain Tumour - Kashmir Life", "description": "Kashmir-born geneticist, Dr Khalid Shah, who is now a professor at the Harvard Medical School has finally succeeded in converting the live cancer cells into the main battle tanks against the brain tumours. The cells turned turncoats after a decade-long experi…", "url": "https://kashmirlife.net/making-cancer-fight-cancer-vol-14-issue-41-307934/", "urlToImage": "https://kashmirlife.net/wp-content/uploads/2021/05/Dr-Khalid-Shah-1.jpg", "publishedAt": "2023-01-09T12:56:51Z", "content": "After a series of failures in various laboratories across the globe, Dr Khalid Shah, a young Kashmir scientist, currently, a professor at the Harvard Medical School, led a team of researchers to devi… [+13485 chars]"}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Deutsche Presse-Agentur - dpa", "title": "Another year of COVID-19 studies: Here's what we learned about virus | Daily Sabah - Daily Sabah", "description": "After another year of living with COVID-19, the world is now almost three years into the pandemic with dozens of studies under scientists&#039; belt, many...", "url": "https://www.dailysabah.com/life/health/another-year-of-covid-19-studies-heres-what-we-learned-about-virus", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2023/01/09/thumbs/800x531/250742.jpg", "publishedAt": "2023-01-09T12:47:13Z", "content": "After another year of living with COVID-19, the world is now almost three years into the pandemic with dozens of studies under scientists' belt, many of which came in 2022 and have helped expand our … [+13057 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Importance of having a plant-based diet and active nutrients in them - The Statesman", "description": "Consuming good amounts of fruits and vegetables at 300g of vegetables and 100g of fruits, as recommended by ICMR in addition to pulses, cereals, millet and other plant foods are known to be protective against diseases caused by chronic oxidative stress.", "url": "https://www.thestatesman.com/lifestyle/importance-of-having-a-plant-based-diet-and-active-nutrients-in-them-1503145205.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2023/01/9a871c9e538020a5657591efa1dd71e8.jpg", "publishedAt": "2023-01-09T12:15:00Z", "content": "Obesity is an emerging public health problem of epidemic proportions worldwide. As to WHO, globally, obesity has nearly tripled since 1975 and as per 2016 data 1.9 billion adults are overweight or ob… [+6374 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Bat Attacks, Bites Three Siblings in Mexico Village; Two Die of Rabies - LatestLY", "description": "Hospital officials said that though the trio got bitten by the bat on December 1 in their home in the city of Palo de Lima, but it took the family 20 days to go to the nearest health centre.", "url": "https://www.latestly.com/world/bat-attack-bite-three-siblings-in-mexico-village-two-die-of-rabies-4690318.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/01/DE845F30-3E94-430F-9764-1BC1D749337A-784x441.jpeg", "publishedAt": "2023-01-09T12:03:23Z", "content": "Mexico, January 9: In a tragic incident reported from Mexico, two young siblings died just days apart from rabies after being bitten by a bat. The 8-year-old girl died this Saturday and became the se… [+1759 chars]"}, {"source": {"id": null, "name": "Shethepeople.tv"}, "author": "Rudrani Gupta", "title": "Mental Health And Weight Gain: Why Can’t People Look Beyond My Body? - SheThePeople", "description": "Imagine you came across two people in a public place. One is neatly dressed while the other is smelly and dishevelled. Next to whom would you sit? Most of you would say the neat one because it is a human tendency to choose what looks good. But would you ever…", "url": "https://www.shethepeople.tv/personal-stories/mental-health-and-weight-gain/", "urlToImage": "https://www.shethepeople.tv/wp-content/uploads/2021/04/Mental-health.jpg", "publishedAt": "2023-01-09T11:54:50Z", "content": "Imagine you came across two people in a public place. One is neatly dressed while the other is smelly and dishevelled. Next to whom would you sit? Most of you would say the neat one because it is a h… [+3872 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arthritis Management: Follow These 7 Tips In Winter If You Have Arthritis - NDTV", "description": "Below we list tips that will help you manage arthritis through the winter season.", "url": "https://www.ndtv.com/health/arthritis-follow-these-7-tips-for-winter-if-you-have-arthritis-3668015", "urlToImage": "https://c.ndtvimg.com/2022-10/bgdbifj8_world-arthritis-day-2022_625x300_12_October_22.jpg", "publishedAt": "2023-01-09T11:43:46Z", "content": "The cold weather might worsen arthritis symptoms\r\nThere may be some truth to the urban legend that painful joints might be a sign of a change in weather. Winter weather can be particularly difficult … [+4053 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Alpilean Alpine Ice Hack Reviews (2023) Fake Weight Loss Pills or Real Secret Himalayan Fat Burner? - mid-day.com", "description": "Alpilean is a daily supplement that can help consumers shed unwanted pounds with many helpful and effective ingredients tested using third-party research. The weight loss formula is easy to take daily, and the Alpilean formula can burn fat while sleeping.", "url": "https://www.mid-day.com/brand-media/article/alpilean-alpine-ice-hack-reviews-2023-fake-weight-loss-pills-or-real-secret-23264622", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Alpilean121231_d.jpg", "publishedAt": "2023-01-09T11:36:00Z", "content": "Alpilean is a daily supplement that can help consumers shed unwanted pounds with many helpful and effective ingredients tested using third-party research. The weight loss formula is easy to take dail… [+17220 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "Dysarthria could be 'early' sign of stroke that can appear 'seven days before' the attack - Express", "description": "Your speech could alert of an upcoming stroke as early as a week before the event.", "url": "https://www.express.co.uk/life-style/health/1718743/stroke-early-signs-symptoms-dysarthria-difficulty-speaking", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4496349.jpg?r=1673263377654", "publishedAt": "2023-01-09T11:21:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Researchers discover toxic process involving ‘jumping genes’ - Times of India", "description": "Scientists from The University of Texas Health Science Center at San Antonio (UT Health San Antonio) on Sunday reported that an inflammatory trigger like one present during viral infections is elevated in Alzheimer's disease and progressive supranuclear palsy…", "url": "https://timesofindia.indiatimes.com/videos/news/researchers-discover-toxic-process-involving-jumping-genes/videoshow/96855073.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-96855073,imgsize-83550.cms", "publishedAt": "2023-01-09T10:49:07Z", "content": "Jan 09, 2023, 04:19PM ISTSource: ANIScientists from The University of Texas Health Science Center at San Antonio (UT Health San Antonio) on Sunday reported that an inflammatory trigger like one prese… [+701 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Crossfire Keto Reviews LEGIT or SCAM Read It First Before Buying - The Tribune India", "description": "Crossfire Keto Capsules are a great way to lose weight. It makes people feel fuller and less hungry. It allows the body to burn fat efficiently without using too much energy.", "url": "https://www.tribuneindia.com/news/brand-connect/crossfire-keto-reviews-legit-or-scam-read-it-first-before-buying-468873", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_452409297.png", "publishedAt": "2023-01-09T10:16:00Z", "content": "Crossfire Keto Capsules are a great way to lose weight. It makes people feel fuller and less hungry. It allows the body to burn fat efficiently without using too much energy.\r\nHow can you lose weight… [+11637 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Lipozene Review 2023: Does Lipozene Work? Read Side Effects, Dosage, Before & After (Update) - The Tribune India", "description": "People often go to great lengths to maintain and improve their health. After all, who wants to suffer through illnesses and diseases? Doctors and experts consider weight to be an important indicator of overall health. There is good evidence that suggests that…", "url": "https://www.tribuneindia.com/news/brand-connect/lipozene-review-2023-does-lipozene-work-read-side-effects-dosage-before-after-update-468865", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_616458848.jpg", "publishedAt": "2023-01-09T10:00:00Z", "content": "Introduction\r\nPeople often go to great lengths to maintain and improve their health. After all, who wants to suffer through illnesses and diseases? Doctors and experts consider weight to be an import… [+16395 chars]"}, {"source": {"id": null, "name": "Bioenergy-news.com"}, "author": null, "title": "Study identifies efficient method to replace thermal drying of plant biomass - Bioenergy Insight Magazine - Bioenergy Insight Magazine", "description": "Researchers from Okayama University have identified an effective mechanical compression system for drying plant biomass for power generation without the need for thermal drying. This is significant because, since plant biomass contains more than 50% moisture,…", "url": "https://www.bioenergy-news.com/news/study-identifies-efficient-method-to-replace-thermal-drying-of-plant-biomass/", "urlToImage": "https://www.bioenergy-news.com/wp-content/uploads/2022/08/bigstock-Green-Corn-Field-On-Clear-Sunn-456006401-768x513.jpg", "publishedAt": "2023-01-09T09:28:28Z", "content": "Cookies are required to use this site. Please turn them on!\r\nJan 9, 2023\r\nResearchers from Okayama University have identified an effective mechanical compression system for drying plant biomass for p… [+7350 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals benefits of eating almonds for people who work out daily - ANI News", "description": "According to a study published in the journal Frontiers in Nutrition', participants of both sexes who ate 57g almonds every day for one month had a greater amount of the beneficial fat 12,13-dihydroxy-9Z-octadecenoic acid (12,13-DiHOME) in their blood immedia…", "url": "https://www.aninews.in/news/health/study-reveals-benefits-of-eating-almonds-for-people-who-work-out-daily20230109144214", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230109091155.jpg", "publishedAt": "2023-01-09T09:12:00Z", "content": "Los Angeles [US], January 9 (ANI): Eating almonds every day may be the ideal new year's resolution for those who exercise on a regular basis.According to a study published in the journal Frontiers in… [+3821 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Chhavi", "title": "COVID-19 Can Cause Diabetes, Suggests Study - Medical Dialogues", "description": "COVID-19 Can Cause Diabetes, Suggests Study", "url": "https://medicaldialogues.in/photo-stories/covid-19-can-cause-diabetes-suggests-study-198", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/09/196979-amp-stories-cover-7.jpg", "publishedAt": "2023-01-09T08:54:29Z", "content": "COVID-19 CAN CAUSE DIABETES\r\nRubino, F., McIntyre, R., Chai, Z., et al. (2023). New-onset diabetes and COVID-19: Evidence from a global clinical registry. Research Square, doi: 10.21203/rs.3.rs-24053… [+58 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Past brain injury may be linked to an increased risk of FTD: Study - ANI News", "description": "According to a study by the University of Eastern Finland, past traumatic brain damage may increase the risk of frontotemporal dementia.", "url": "https://www.aninews.in/news/health/past-brain-injury-may-be-linked-to-an-increased-risk-of-ftd-study20230109141715", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230109084109.jpg", "publishedAt": "2023-01-09T08:47:00Z", "content": "Kuopio [Finland], January 9 (ANI): According to a study by the University of Eastern Finland, past traumatic brain damage may increase the risk of frontotemporal dementia.Frontotemporal dementia (FTD… [+1648 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Prostate 911 Reviews: PhytAge Labs Prostate Health Supplement Legit or Scam? - Deccan Herald", "description": "Inflamed prostate affects many aging men. The constant urge to pee, the inability to empty the bladder completely, poor sleep quality, and chronic urinary infections are common symptoms of a malfunctioning prostate system. Some men opt for dangerous and expen…", "url": "https://www.deccanherald.com/brandspot/pr-spot/prostate-911-reviews-phytage-labs-prostate-health-supplement-legit-or-scam-1179237.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1179237-1673253106.png", "publishedAt": "2023-01-09T08:31:46Z", "content": "Inflamed prostate affects many aging men. The constant urge to pee, the inability to empty the bladder completely, poor sleep quality, and chronic urinary infections are common symptoms of a malfunct… [+10620 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Christina Jackson", "title": "Circadian Clock Proteins Seized by Liver Cancer - Genetic Engineering & Biotechnology News", "description": "A direct link between circadian clock proteins to liver cancer uncovered.", "url": "https://www.genengnews.com/topics/cancer/circadian-clock-proteins-seized-by-liver-cancer/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2023/01/Jan_1_2023_PNAS_HCC_clockliver.jpg", "publishedAt": "2023-01-09T08:00:32Z", "content": "Hepatocellular carcinoma (HCC) is the third leading cause of cancer-related deaths globally. While chemotherapy, surgery, and liver transplants have helped some patients, targeted treatments for HCC … [+4011 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "10 Best Bulking Steroids (2023 Reports) For Muscle Growth and Gain, Stack for Bulking Cycles - Deccan Herald", "description": "If you're trying to increase your muscle mass and you are wondering what the most effective steroids to bulk up your cycles are and what they are, we have the answer. Dianabol is generally considered to be the most efficient steroids for building muscle. If y…", "url": "https://www.deccanherald.com/brandspot/pr-spot/10-best-bulking-steroids-2023-reports-for-muscle-growth-and-gain-stack-for-bulking-cycles-1179226.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1179226-1673248618.png", "publishedAt": "2023-01-09T07:16:58Z", "content": "If you're trying to increase your muscle mass and you are wondering what the most effective steroids to bulk up your cycles are and what they are, we have the answer. Dianabol is generally considered… [+32968 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Awareness of COPD and Its Risk Factors Among the Adult Population of t | COPD - Dove Medical Press", "description": "Awareness of COPD and Its Risk Factors Among the Adult Population of the Aseer Region, Saudi Arabia", "url": "https://www.dovepress.com/awareness-of-copd-and-its-risk-factors-among-the-adult-population-of-t-peer-reviewed-fulltext-article-COPD", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-01-09T07:07:48Z", "content": "Introduction\r\nChronic obstructive pulmonary disease (COPD) is generally characterized by the presence of chronic bronchitis or emphysema that can lead to airway obstruction.1 It is a disease of the a… [+34507 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iron Deficiency: 5 Iron-Rich Drinks That You Can Prepare At Home - NDTV", "description": "Want to boost iron levels in the body? Try these easy-to-prepare drinks.", "url": "https://www.ndtv.com/health/iron-deficiency-drinks-to-boost-iron-levels-iron-rich-foods-3675639", "urlToImage": "https://c.ndtvimg.com/2020-09/4ppj4glg_smoothie_625x300_03_September_20.jpg", "publishedAt": "2023-01-09T06:52:00Z", "content": "Iron deficiency can lead to low energy levels and constant tiredness\r\nIron is an essential nutrient for your overall health. Its vital function is to ensure the proper functioning of haemoglobin. Iro… [+2512 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "COVID Autopsies Reveal The Virus Spreading Through The 'Entire Body' - ScienceAlert", "description": "COVID-19 is defined as a respiratory infection, but the effects of the novel coronavirus are certainly not confined to any one organ.", "url": "https://www.sciencealert.com/covid-autopsies-reveal-the-virus-spreading-through-the-entire-body", "urlToImage": "https://www.sciencealert.com/images/2023/01/SARSCOV2MultiOrganSpread.jpg", "publishedAt": "2023-01-09T06:33:57Z", "content": "COVID-19 is defined as a respiratory infection, but the effects of the novel coronavirus are certainly not confined to any one organ.\r\nDozens of recent autopsies show persistent evidence of SARS-CoV-… [+3548 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: 5 best and worst fruits for managing blood sugar - Hindustan Times", "description": "Some fruits are good for people with diabetes, while others are not. However, every fruit has its own benefits and should be consumed on a regular basis. Experts on best and worst fruits for managing your blood sugar levels. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-5-best-and-worst-fruits-for-managing-blood-sugar-101673243640046.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/09/1600x900/fruits_thumb_1673243705056_1673243721709_1673243721709.jpg", "publishedAt": "2023-01-09T06:05:30Z", "content": "People who are diagnosed with diabetes often hesitate in adding fruits to their daily diet fearing they could raise their blood sugar levels being sweet in taste. However, their fear is only partly t… [+6823 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "How Covid can disturb your sleep and dreams – and what could help - The Indian Express", "description": "There's no simple explanation for why catching COVID may increase nightmares, but mental health may again play a role", "url": "https://indianexpress.com/article/lifestyle/health/covid-disturb-sleep-and-dreams-8365615/", "urlToImage": "https://images.indianexpress.com/2023/01/sleeplessness_200_getty.jpg", "publishedAt": "2023-01-09T06:00:18Z", "content": "By the end of 2022, more than 650 million COVID infections had been reported to the World Health Organisation.With the true number likely much higher, and the tally increasing by hundreds of thousand… [+5501 chars]"}, {"source": {"id": null, "name": "VOGUE India"}, "author": "Tatiana Dias", "title": "Raw food cleanse: Should you hop onto this detox in 2023? Experts weigh in - VOGUE India", "description": "Cijith Sreedhar, Chief Medical Officer, Prakriti Shakti tell us everything you need to know about raw food cleanses and detoxes", "url": "https://www.vogue.in/beauty/content/should-you-hop-onto-the-raw-food-cleanse-in-2023-experts-weigh-in", "urlToImage": "https://assets.vogue.in/photos/63b4574bca525deacf28061f/16:9/w_1280,c_limit/269832536_452228303229628_5512462746472947769_n.jpg", "publishedAt": "2023-01-09T05:51:22Z", "content": "Eat your greensever since childhood, we've heard this phrase like a broken record. As children, it was a bargaining chip in exchange for delicious ice cream, while as adults, it transitioned to a hea… [+4573 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Swelling in Joint Could be a Sign of Arthritis: Advice by 10 Best Orthopedics - Deccan Herald", "description": "New Delhi (India), January 07: Dr. Karun Jain, MBBS, D'Ortho, MS (Ortho), MCh Ortho (UK), Senior Orthopedic, Sports Injury & Joint Replacement Surgeon, Pushpanjali Medical Centre & Shri Mahaveer Ortho Clinic, Delhi", "url": "https://www.deccanherald.com/brandspot/pr-spot/swelling-in-joint-could-be-a-sign-of-arthritis-advice-by-10-best-orthopedics-1179207.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1179207-1673241357.png", "publishedAt": "2023-01-09T05:15:57Z", "content": "New Delhi (India), January 07: Dr. Karun Jain, MBBS, D'Ortho, MS (Ortho), MCh Ortho (UK), Senior Orthopedic, Sports Injury &amp; Joint Replacement Surgeon, Pushpanjali Medical Centre &amp; Shri Mahav… [+9311 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Is universal coronavirus immunity possible? - News-Medical.Net", "description": "In a recent study posted to the bioRxiv* preprint server, researchers at Columbia University characterized reciprocal and non-reciprocal T-cell responses against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2).", "url": "https://www.news-medical.net/news/20230108/Is-universal-coronavirus-immunity-possible.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_735146_16732368713819864.jpg", "publishedAt": "2023-01-09T04:02:00Z", "content": "In a recent study posted to the bioRxiv* preprint server, researchers at Columbia University characterized reciprocal and non-reciprocal T-cell responses against severe acute respiratory syndrome cor… [+6860 chars]"}, {"source": {"id": null, "name": "Startup.info"}, "author": "Startup Info Team", "title": "GlucoTrust Reviews Does It Really Work For Blood Sugar Level? - Startup.info", "description": "In most people's minds, the first thing that comes to mind when they encounter the term \"diabetes\" is the sugar that is responsible for the disease. Having", "url": "https://startup.info/glucotrust-reviews-does-it-really-work-for-blood-sugar-level/", "urlToImage": "https://startup.info/wp-content/uploads/2023/01/glucotrust.png", "publishedAt": "2023-01-08T20:14:10Z", "content": "GlucoTrust Reviews: Read this Frank Assessment Carefully before Putting it to Use!\r\nIn most people’s minds, the first thing that comes to mind when they encounter the term “diabetes” is the sugar tha… [+11981 chars]"}, {"source": {"id": null, "name": "Bharattimes.co.in"}, "author": null, "title": "सेहत – क्या अनानास से वजन होता है कम? जानें वेट लॉस में पाइनएप्पल डाइट के फायदे, फॉलो करने का सही तरीका – INA News Agancy - English Bharat Times", "description": "What is Pineapple Diet: Who does not like sour-sweet pineapple. Apart from being super tasty, pineapple is also very beneficial for health. Today we have", "url": "https://eng.bharattimes.co.in/%e0%a4%b8%e0%a5%87%e0%a4%b9%e0%a4%a4-%e0%a4%95%e0%a5%8d%e0%a4%af%e0%a4%be-%e0%a4%85%e0%a4%a8%e0%a4%be%e0%a4%a8%e0%a4%be%e0%a4%b8-%e0%a4%b8%e0%a5%87-%e0%a4%b5%e0%a4%9c%e0%a4%a8-%e0%a4%b9%e0%a5%8b/", "urlToImage": "https://images.news18.com/ibnkhabar/uploads/2023/01/pinapple-benefits-167309505716x9.jpg", "publishedAt": "2023-01-08T20:00:58Z", "content": "highlights\r\nPineapple diet is beneficial in rapid weight loss.\r\nAlong with following the Pineapple Diet, include exercise and healthy foods in the daily routine. \r\nConsuming pineapple helps to get ri… [+3088 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "Tushar Kaushik", "title": "Docs call for awareness to beat cervical cancer - Deccan Chronicle", "description": "", "url": "https://www.deccanchronicle.com/featured/080123/docs-call-for-awareness-to-beat-cervical-cancer.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-gj2s9qmged01vkpaa0htc763n2-20230108210830.Medi.jpeg", "publishedAt": "2023-01-08T18:49:00Z", "content": "Hyderabad: On the occasion of cervical cancer awareness month, observed every January, oncologists called for increased awareness about the availability of a vaccine, good hygiene and regular screeni… [+1961 chars]"}, {"source": {"id": null, "name": "Von.gov.ng"}, "author": "Temitope Obatoke", "title": "Mediterranean Diet Ranks Best Six Years In A Row – Voice of Nigeria - Voice of Nigeria", "description": "The Mediterranean diet has been named the healthiest way to eat for the sixth year in a row by a panel of experts for US News & World Report.The eating plan, based on a traditional consumption patterns in countries like Greece, Italy and Spain, i", "url": "https://von.gov.ng/mediterranean-diet-ranks-best-six-years-in-a-row/", "urlToImage": "https://von.gov.ng/wp-content/uploads/2023/01/images-1-5.jpeg", "publishedAt": "2023-01-08T17:33:28Z", "content": "The Mediterranean diet has been named the healthiest way to eat for the sixth year in a row by a panel of experts for US News &amp; World Report.\r\nThe eating plan, based on a traditional consumption … [+2310 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Heres why community gardening should be your new years resolution - Geo News", "description": "Study shows even inexperienced gardeners can experience meaningful health advantages in their first growing season", "url": "https://www.geo.tv/latest/463745-benefits-of-gardening", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-01-08/463745_062437_updates.jpg", "publishedAt": "2023-01-08T17:16:00Z", "content": "New CU Boulder research published in the journal Lancet Planetary Health reveals that adding gardening to our lists of goals for 2023 could have a significant effect.\r\nThe first-ever randomised, cont… [+3426 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Researchers suggest how brain games predict risk of viral infection - Hindustan Times", "description": "Subtle variations in every day cognitive performance can signal changes in brain states that are known to increase the risk of illness such as stress, fatigue and poor sleep. The team wanted to measure cognitive function and explore whether it was predictive …", "url": "https://www.hindustantimes.com/science/researchers-suggest-how-brain-games-predict-risk-of-viral-infection-101673195476829.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/08/1600x900/BELGIUM-DISABLED--8_1673196410291_1673196410291_1673196451769_1673196451769.JPG", "publishedAt": "2023-01-08T17:06:03Z", "content": "If your alertness and reaction speed fluctuate more than usual, you may be more vulnerable to a viral disease.\r\nThe study was led by experts from the University of Michigan, who collaborated closely … [+3814 chars]"}, {"source": {"id": null, "name": "ABC Action News"}, "author": null, "title": "PhenQ Amazon Review 2023: Do These Amazon PhenQ Pills Work for Weight Loss? - ABC Action News Tampa Bay", "description": "Why is PhenQ Amazon consistently ranked as one of the best fat burners for weight loss? We look closely at its ingredients, price, and customer reviews", "url": "https://www.abcactionnews.com/sponsor-generated-content/phenq-amazon", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/e29610f/2147483647/strip/true/crop/1080x567+0+37/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F0c%2F2e%2F850735064bafa7d47a737a7ac1f7%2Fphenq-amazon-abc.jpg", "publishedAt": "2023-01-08T15:08:00Z", "content": "Disclaimer: This is sponsored content. All opinions and views are of the advertiser and do not reflect the same of WFTS.Weight loss is challenging and requires dedication to a healthy diet and regula… [+9907 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Dietary Cholesterol May Increase Risks Of Diabetes, Find Out Ways To Avoid It - News18", "description": "The study found that items including red meat, edible oil and butter, among others, contain dietary cholesterol.", "url": "https://www.news18.com/news/lifestyle/dietary-cholesterol-may-increase-risks-of-diabetes-find-out-ways-to-avoid-it-6779833.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/untitled-1-143-167068081116x9.jpg", "publishedAt": "2023-01-08T13:32:11Z", "content": "Diabetes is becoming more and more prevalent in India. In fact, over the past few years, both the number of men and women with diabetes has considerably increased. The major cause for this is our sed… [+2294 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Different Types Of Breast Lumps: How To Tell If It's Cancerous Or Not? - News18", "description": "It's important for you to understand the difference between cancerous and benign breast lumps. Early detection of breast cancer may lower the risk of complications.", "url": "https://www.news18.com/news/lifestyle/different-types-of-breast-lumps-how-to-tell-if-its-cancerous-or-not-6780457.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/shutterstock_475542628-167191313416x9.jpg", "publishedAt": "2023-01-08T12:52:39Z", "content": "\\It is extremely important for women to self-examine their breasts on a daily basis. Anything unusual, particularly a breast lump or changes in the breast size and shape, should be communicated to yo… [+2806 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "Menopause – Symptoms, Causes & Treatment - Northeast Now", "description": "Menopause is the time that marks the end of your menstrual cycles.", "url": "http://nenow.in/health/menopause-symptoms-causes-treatment.html", "urlToImage": "https://nenow.in/wp-content/uploads/2023/01/Menopause-symptoms.jpg", "publishedAt": "2023-01-08T12:18:15Z", "content": "Many people know about menstruation, but very few know about the term Menopause and its complications. \r\nMenopause brings significant changes in a womens body just as the menstruation. Menopause is t… [+8048 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Study finds new cellular component important for sense of smell - The Tribune India", "description": "In the neurons that our noses utilise to detect smell, scientists at Umea University in Sweden have found a previously unidentified cellular component called an organelle. The discovery may spur more studies into the COVID-19 symptom of poor smell perception.", "url": "https://www.tribuneindia.com/news/health/study-finds-new-cellular-component-important-for-sense-of-smell-468589", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_344598169.JPG", "publishedAt": "2023-01-08T10:07:00Z", "content": "ANI\r\nStockholm, January 8\r\nIn the neurons that our noses utilise to detect smell, scientists at Umea University in Sweden have found a previously unidentified cellular component called an organelle. … [+2929 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Sugar causes swelling, which leads to common kidney disease: Study - ANI News", "description": "A study published in the journal 'Nature Communications' throws light on the role sugar plays in the contraction of common kidney disease.", "url": "https://www.aninews.in/news/health/sugar-causes-swelling-which-leads-to-common-kidney-disease-study20230108145604", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230108092546.jpg", "publishedAt": "2023-01-08T09:26:00Z", "content": "Washington [US], January 8 (ANI): A study of the organoids present in kidneys in a novel lab setting could have implications for the treatment of polycystic kidney disease (PKD), an incurable disease… [+3065 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Child's weight has little effect on mood, behavioural disorders: Study - Hindustan Times", "description": "Children with obesity are more likely to be diagnosed with depression, anxiety, or attention-deficit hyperactivity disorder (ADHD). But the nature of the relationship between obesity and these mental health conditions is not clear. Obesity might contribute to…", "url": "https://www.hindustantimes.com/lifestyle/health/childs-weight-has-little-effect-on-mood-behavioural-disorders-study-101673163265587.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/08/1600x900/798c475f4f7e6644e4ca1d289688b8bd_1610626636219_1610626659702_1673163420707_1673163420707.jpg", "publishedAt": "2023-01-08T07:40:40Z", "content": "According to a new study, childhood BMI is unlikely to have a significant impact on children's mood or behavioural disorders.\r\nThe results suggest that some previous studies, which have shown a stron… [+3239 chars]"}, {"source": {"id": null, "name": "Onlinewiki.in"}, "author": "OnlineWiki", "title": "Hathras News: Depression occurs in the cold, these are the symptoms of winter depression – Winter Depression Occurs In The Cold - Online Wiki", "description": "dark thick fog – Photo: Amar Ujala listen to the news listen to the news Since Corona, there has been an increase in cases related to mental health among people. During the time of Corona, people stayed in their homes for a long time. Because of this he has b…", "url": "https://www.onlinewiki.in/wiki/news/hathras-news-depression-occurs-in-the-cold-these-are-the-symptoms-of-winter-depression-winter-depression-occurs-in-the-cold/", "urlToImage": "https://www.onlinewiki.in/wp-content/uploads/2023/01/rajasthan-weather-update_1673002391.jpeg", "publishedAt": "2023-01-08T05:41:18Z", "content": "Since Corona, there has been an increase in cases related to mental health among people. During the time of Corona, people stayed in their homes for a long time. Because of this he has become a victi… [+4562 chars]"}, {"source": {"id": null, "name": "Dunya News"}, "author": null, "title": "How staying properly hydrated may help you live healthier, longer - Dunya News", "description": "How staying properly hydrated may help you live healthier, longer", "url": "https://dunyanews.tv/en/Health/687860-How-staying-properly-hydrated-may-help-you-live-healthier-longer", "urlToImage": "https://img.dunyanews.tv/news/2023/January/01-08-23/news_big_images/687860_21583564.jpg", "publishedAt": "2023-01-08T03:46:21Z", "content": "How staying properly hydrated may help you live healthier, longer\r\nISLAMABAD, (Online) - A new study from researchers at the U.S. National Institute of Health (NIH) reports that middle-aged people wh… [+5755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Can a simple blood test hold the key to detecting Alzheimer’s? - The Indian Express", "description": "Dr Pravat Mandal, a researcher from the National Brain Research Centre, believes that the levels of the antioxidant glutathione and iron in critical parts of the brain are predictors of Alzheimer’s. With a specialised MRI machine that can detect chemical comp…", "url": "https://indianexpress.com/article/lifestyle/health-specials/blood-test-detecting-alzheimers-disease-8367524/", "urlToImage": "https://images.indianexpress.com/2023/01/alzheimers.jpg", "publishedAt": "2023-01-08T01:30:48Z", "content": "Can a simple blood test coupled with a short neuro-psychological check diagnose Alzheimers? Can taking a daily supplement prevent cognitive decline in those with early stages of the disease?A researc… [+4329 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "GoKeto Gummies Reviews (SCAM Exposed) Does It Work? Read It First Before BUY! - The Tribune India", "description": "Losing weight can be difficult, especially when attempting to do so using severe means such as exercise and diets. But this review will tell you about a magical supplement based on a ketogenic dietary supplement.&nbsp;", "url": "https://www.tribuneindia.com/news/brand-connect/goketo-gummies-reviews-scam-exposed-does-it-work-read-it-first-before-buy-468346", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_103246391.jpg", "publishedAt": "2023-01-07T19:21:00Z", "content": "Losing weight can be difficult, especially when attempting to do so using severe means such as exercise and diets. But this review will tell you about a magical supplement based on a ketogenic dietar… [+13508 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Interior Design of Human Cells is Mapped for the First Time, a Breakthrough That Could Revolutionize Healthcare - Good News Network", "description": "Scientists have just debuted a new way to see how cells organize themselves, shedding modern light on the building blocks of life.", "url": "https://www.goodnewsnetwork.org/interior-design-of-human-cells-is-mapped-for-the-first-time-allen-institute/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/01/Variance_-Integrated-Cell-released-Allen-Institute-for-Cell-Science.jpg", "publishedAt": "2023-01-07T19:20:15Z", "content": "One of the first 3D renderings using the new technique shows the cell with 17 of its major components – Allen Institute for Cell Science\r\nScientists have just debuted a new way to see how cells organ… [+3417 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Beth Bradford", "title": "Why You Should Consider Taking B12 Supplements If You Follow A Plant-Based Diet - Health Digest", "description": "While there are many health benefits to a plant-based diet, there can be some drawbacks as well. Here&#039;s why you should consider supplementing vitamin B12.", "url": "https://www.healthdigest.com/1160063/why-you-should-consider-taking-b12-supplements-if-you-follow-a-plant-based-diet/", "urlToImage": "https://www.healthdigest.com/img/gallery/why-you-should-consider-taking-b12-supplements-if-you-follow-a-plant-based-diet/l-intro-1673118763.jpg", "publishedAt": "2023-01-07T19:17:00Z", "content": "Health experts advocate a plant-based diet because it helps you to lose and maintain a healthy weight while fighting off chronic conditions such as heart disease, diabetes, cancer, and cognitive decl… [+897 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Scars can be repaired with hair follicle transplants: Study - TheNewsMill", "description": "According to a new study, skin scars began to behave more like uninjured skin after being treated with hair follicle transplants. Scarred skin generates new cells and blood vessels, remodelled collagen to reestablish healthy patterns, and even expressed genes…", "url": "https://thenewsmill.com/2023/01/scars-can-be-repaired-with-hair-follicle-transplants-study/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=63449&object_id=63449&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F01%252Fscars-can-be-repaired-with-hair-follicle-transplants-study.jpg", "publishedAt": "2023-01-07T18:31:57Z", "content": "According to a new study, skin scars began to behave more like uninjured skin after being treated with hair follicle transplants. Scarred skin generates new cells and blood vessels, remodelled collag… [+5291 chars]"}]}