{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Discover Key Factor To Make It Easier To Stick To Exercise and Diet Goals - SciTechDaily", "description": "People who had higher scores for sleep health — based on regularity, satisfaction, alertness, timing, efficiency, and duration — during a 12-month weight loss program were more likely to follow the caloric intake and exercise components of the program in comp…", "url": "https://scitechdaily.com/researchers-discover-key-factor-to-make-it-easier-to-stick-to-exercise-and-diet-goals/", "urlToImage": "https://scitechdaily.com/images/Fitness-Energy-Vitality-Longevity-Couple-Concept.jpg", "publishedAt": "2023-03-05T11:13:01Z", "content": "Preliminary research presented at the American Heart Associations Epidemiology, Prevention, Lifestyle &amp; Cardiometabolic Health Scientific Sessions 2023 suggests that individuals who reported havi… [+8177 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Merrell Readman", "title": "The Four Foods You Should Be Eating Daily If You Suffer From Hair Loss - Yahoo Life", "description": "This post has been updated since its initial publish date to include more expert insight. Hair loss is a common yet frustrating struggle that can leave a...", "url": "https://www.shefinds.com/collections/food-for-hair-loss/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/e42bf0faae6333265cc3af39a7bd8b96", "publishedAt": "2023-03-04T13:30:11Z", "content": "This post has been updated since its initial publish date to include more expert insight. \r\nHair loss is a common yet frustrating struggle that can leave a significant mark on your self-esteem, makin… [+4898 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Balance exercises for seniors: 5 moves you can try at home - Health shots", "description": "Balancing yourself can become a problem, especially when you enter the senior phase. So, try out some balance exercises for seniors, and have less number of falling down episodes.", "url": "https://www.healthshots.com/fitness/muscle-gain/5-balance-exercises-to-avoid-falls-and-fractures-in-old-age/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/03/04102550/elderly.jpg", "publishedAt": "2023-03-04T12:00:54Z", "content": "Balance is something that you don’t think about in your younger days. Your focus is just on walking or moving forward. But as you grow older, sometimes balancing yourself becomes hard. You tend to lo… [+3225 chars]"}]}