{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Gut Health: From Spicy Food to Unhealthy Bowel Movements, 8 Causes of Unhealthy Gut - India.com", "description": "Your immune system won't work properly if your gut isn't healthy.", "url": "https://www.india.com/health/gut-health-from-spicy-food-to-unhealthy-bowel-movements-8-causes-of-unhealthy-gut-5711431/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/10/Gut-Health.jpg", "publishedAt": "2022-10-29T06:11:03Z", "content": "Gut Health: Having a balance of beneficial and harmful bacteria as well as yeast in your digestive tract is a sign that you have a healthy gut. Your hormones and the immune system won’t work properly… [+2179 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "Canada confirms 1,435 monkeypox cases - The Siasat Daily", "description": "Monkeypox is a viral disease that can spread from person to person through close contact with an infected person,", "url": "https://www.siasat.com/canada-confirms-1435-monkeypox-cases-2444686/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/06/IMG_20062022_202510_1200_x_900_pixel.jpg", "publishedAt": "2022-10-29T05:37:00Z", "content": "Ottawa: Canada has confirmed 1,435 cases of monkeypox, including 42 hospitalisations, health authoties announced.\r\nThe Public Health Agency of Canada said on Friday that of the confirmed cases, 684 a… [+981 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "What is thrombosis and which body parts does it impact? Doctor reveals - Hindustan Times", "description": "Thrombosis is a life-threatening condition because if a clot forms in the blood vessels, it can block or obstruct blood flow to vital organs. Here are the body parts it impacts, the factors that raise the possibility of developing it, complications that occur…", "url": "https://www.hindustantimes.com/lifestyle/health/what-is-thrombosis-and-which-body-parts-does-it-impact-doctor-reveals-factors-that-raises-its-possibility-and-more-101667017056899.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/29/1600x900/artery-g805d52bde_1920_1667017234070_1667017252616_1667017252616.jpg", "publishedAt": "2022-10-29T04:32:35Z", "content": "The solidification of blood in a blood vessel is known as thrombosis and it is a life-threatening condition because if a clot forms in the blood vessels, it can block or obstruct blood flow to vital … [+3910 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "World Stroke Day 2022: Are winter weather and stroke risk related? - Zee News", "description": "When a blood artery in the brain bursts and bleeds or the blood supply to the brain is cut off, it can result in a dangerous health condition called a brain stroke. This obstruction disrupts the flow of blood and oxygen to the brains tissues.", "url": "https://zeenews.india.com/health/world-stroke-day-2022-are-winter-weather-and-stroke-risk-related-2527941", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/29/1109399-winter-strokes.jpg", "publishedAt": "2022-10-29T03:57:35Z", "content": "World Stroke Day 2022: When a blood artery in the brain bursts and bleeds or the blood supply to the brain is cut off, it can result in a dangerous health condition called a brain stroke. This obstru… [+2741 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr B L Jangid", "title": "On World Psoriasis Day, know 6 myths and facts about this condition - Health shots", "description": "World Psoriasis Day: If you think this skin disease is contagious then you’re wrong. Here are 6 such myths about psoriasis.", "url": "https://www.healthshots.com/beauty/skin-care/world-psoriasis-day-6-common-myths-about-psoriasis/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/10/28145604/Psoriasis-.jpg", "publishedAt": "2022-10-29T03:29:57Z", "content": "Psoriasis is a chronic autoimmune inflammatory condition of skin, which causes it to become silvery with white scales and reddish plaques. Along with impacting the skin, it affects individuals mental… [+2718 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Monkeypox risk higher in younger kids: Study | Mint - Mint", "description": "Petra Zimmermann, MD, Ph.D. of the University of Fribourg, Switzerland, and Nigel Curtis, Ph.D. of The University of Melbourne and Murdoch Children's Research Institute, Australia has reviewed this latest study on monkeypox infection.", "url": "https://www.livemint.com/science/health/monkeypox-risk-higher-in-younger-kids-study-11667002186873.html", "urlToImage": "https://images.livemint.com/img/2022/10/29/600x338/monkeypox_1667003377158_1667003377277_1667003377277.jpg", "publishedAt": "2022-10-29T00:33:23Z", "content": "A new study on monkeypox disease says that children aged 8 or younger should be thought of as a population at high risk for more serious viral infection, according to The Pediatric Infectious Disease… [+2859 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Namrata Sindwani", "title": "India in top 30 with highest Tuberculosis burden - The New Indian Express", "description": "India stands in the top 30 countries carrying the highest burden of tuberculosis (TB) cases across the world.", "url": "https://www.newindianexpress.com/states/karnataka/2022/oct/29/india-in-top-30-with-highest-tuberculosis-burden-2512752.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/10/29/w600X390/tuberculosis.jpg", "publishedAt": "2022-10-28T23:59:00Z", "content": "BENGALURU:  India stands in the top 30 countries carrying the highest burden of tuberculosis (TB) cases across the world. TB was called the second most infectious killer after Covid-19, affecting the… [+3666 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New clues into a serious neurodegenerative disease - News-Medical.Net", "description": "Dementia encompasses a range of neurodegenerative conditions that lead to memory loss and cognitive deficiencies and affect some 55 million people worldwide.", "url": "https://www.news-medical.net/news/20221028/New-clues-into-a-serious-neurodegenerative-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/92036744-620x480.jpg", "publishedAt": "2022-10-28T23:00:00Z", "content": "Dementia encompasses a range of neurodegenerative conditions that lead to memory loss and cognitive deficiencies and affect some 55 million people worldwide. Yet despite its prevalence, there are few… [+5906 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Huntington's disease impairs autophagy in older patients - News-Medical.Net", "description": "Huntington's disease, a fatal, inherited neurodegenerative condition, is caused by a genetic error present at birth, though its symptoms often don't begin until middle adulthood.", "url": "https://www.news-medical.net/news/20221028/Huntingtons-disease-impairs-autophagy-in-older-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Neuroscience-620x480.jpg", "publishedAt": "2022-10-28T22:38:00Z", "content": "Huntington's disease, a fatal, inherited neurodegenerative condition, is caused by a genetic error present at birth, though its symptoms often don't begin until middle adulthood. Scientists at Washin… [+6315 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Specific stem cell protein found to be involved in the recurrence of medulloblastoma - News-Medical.Net", "description": "The malignant brain tumor type medulloblastoma can become resistant to therapy which can cause relapse. Researchers at Uppsala University have discovered a certain protein that makes tumor cells resting and insensitive to radiation treatment.", "url": "https://www.news-medical.net/news/20221028/Specific-stem-cell-protein-found-to-be-involved-in-the-recurrence-of-medulloblastoma.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2022-10-28T22:26:00Z", "content": "The malignant brain tumor type medulloblastoma can become resistant to therapy which can cause relapse. Researchers at Uppsala University have discovered a certain protein that makes tumor cells rest… [+3351 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals how naturally occurring compound kills major drug resistant bacteria - ThePrint", "description": "Portsmouth [UK], October 29 (ANI): Scientists studying how an organic molecule affects bacteria that are resistant to drugs have found that it can suppress and destroy a pathogen that can cause significant disease or, in some circumstances, death. Often seen …", "url": "https://theprint.in/science/study-reveals-how-naturally-occurring-compound-kills-major-drug-resistant-bacteria/1186388/", "urlToImage": null, "publishedAt": "2022-10-28T22:13:03Z", "content": "Portsmouth [UK], October 29 (ANI): Scientists studying how an organic molecule affects bacteria that are resistant to drugs have found that it can suppress and destroy a pathogen that can cause signi… [+3065 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Ashley Lyles", "title": "COVID-19 Tied to Increased Risk for CV Events and Death - Medscape", "description": "Patients with COVID-19 have an elevated risk for cardiovascular events and death, particularly if hospitalized, a retrospective analysis suggests. The risk was higher in the first 30 days after infection.", "url": "https://www.medscape.com/viewarticle/983210", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220308_heart_covid_disease_800x450.jpg", "publishedAt": "2022-10-28T22:10:24Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nCOVID-19 infection is associated with an elevated risk for incident cardiovascular disease events… [+7753 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Andrea Jiménez", "title": "How Will Lack of Exercise Affect Global Health in the 2020s? - Medscape", "description": "The World Health Organization warns of the potential toll in heart disease, obesity, and other noncommunicable diseases.", "url": "https://www.medscape.com/viewarticle/983206", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220830_group_women_running_urban_streets_800x450.jpg", "publishedAt": "2022-10-28T21:11:06Z", "content": "A report recently published by the World Health Organization (WHO) warns that, as a result of physical inactivity, almost 500 million people will develop heart disease, obesity, diabetes, or other no… [+5096 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Lisa Rapaport", "title": "Crosswords Slow Memory Loss More Than Video Games - Everyday Health", "description": "A new study suggests that a pretty old-school pastime — the humble crossword puzzle — may actually be better for the aging brain than new-fangled video games.", "url": "https://www.everydayhealth.com/senior-health/crosswords-slow-memory-loss-more-than-video-games/", "urlToImage": "https://images.everydayhealth.com/images/crosswords-slow-memory-loss-1440x810.jpg?sfvrsn=9f5a10a6_1", "publishedAt": "2022-10-28T20:18:07Z", "content": "People of a certain age are bombarded with ads for brain games promising to help keep their mind sharp. Now, a new study suggests that a pretty old-school pastime the humble crossword puzzle may actu… [+3747 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Long COVID: how lost connections between nerve cells in the brain may explain cognitive symptom - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "Stockholm (Sweden), Oct 28: For a portion of people who get COVID, symptoms continue for months or even years after the initial infection. This is commonly referred to as “long COVID”. Some people with long COVID complain of “brain fog”, which includes a wide…", "url": "https://www.dailyexcelsior.com/long-covid-how-lost-connections-between-nerve-cells-in-the-brain-may-explain-cognitive-symptom/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/10/2-18.jpg", "publishedAt": "2022-10-28T19:29:56Z", "content": "Stockholm (Sweden), Oct 28: For a portion of people who get COVID, symptoms continue for months or even years after the initial infection. This is commonly referred to as long COVID.Some people with … [+3511 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Newly discovered species of bacteria in the microbiome may be a culprit behind rheumatoid arthritis - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "Aurora, Oct 28: Rheumatoid arthritis affects 1 in 100 people worldwide. It causes inflamed, painful and swollen joints, often in the hands and wrists, and can lead to loss of joint function as well as chronic pain and joint deformities and damage. What causes…", "url": "https://www.dailyexcelsior.com/newly-discovered-species-of-bacteria-in-the-microbiome-may-be-a-culprit-behind-rheumatoid-arthritis/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/10/5-8.jpg", "publishedAt": "2022-10-28T19:29:07Z", "content": "Aurora, Oct 28: Rheumatoid arthritis affects 1 in 100 people worldwide. It causes inflamed, painful and swollen joints, often in the hands and wrists, and can lead to loss of joint function as well a… [+4870 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Early clinical trial of targeted lung cancer drug suggests it can be helpful - ANI News", "description": "Certain type of non-small cell lung cancer (NSCLC) patients can be helped by repotrectinib usage, suggests early trials of the targeted drug.", "url": "https://www.aninews.in/news/health/early-clinical-trial-of-targeted-lung-cancer-drug-suggests-it-can-be-helpful20221028235543", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221028181524.jpg", "publishedAt": "2022-10-28T18:25:00Z", "content": "Washington [US], October 28 (ANI): Certain type of non-small cell lung cancer (NSCLC) patients can be helped by repotrectinib usage, suggests early trials of the targeted drug.The results of the TRID… [+3942 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Q&A: Vocal biomarkers may be used to monitor patients with COVID-19 - Healio", "description": "With a simple 25-second voice recording, researchers may be able to monitor symptom resolution in patients with COVID-19.      Guy Fagherazzi, PhD, ADR, the director of the department of precision health and group leader of the deep digital phenotyping resear…", "url": "https://www.healio.com/news/primary-care/20221028/qa-vocal-biomarkers-may-be-used-to-monitor-patients-with-covid19", "urlToImage": "https://www.healio.com/~/media/slack-news/fm_im/misc/infographics/2022/10-oct/pc1022fagherazzi_graphic_01_web.jpg", "publishedAt": "2022-10-28T18:17:07Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nWith a simple 25-second voice recording,… [+4251 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Pandemic-induced stress affects menstrual cycle - The Tribune India", "description": "Women with high stress related to the pandemic were twice as likely to experience changes in their menstrual cycle compared to those with low pandemic-related stress, according to new research.", "url": "https://www.tribuneindia.com/news/health/pandemic-induced-stress-affects-menstrual-cycle-445320", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1246639843.jpg", "publishedAt": "2022-10-28T17:52:00Z", "content": "IANS\r\nNew York, October 28\r\nWomen with high stress related to the pandemic were twice as likely to experience changes in their menstrual cycle compared to those with low pandemic-related stress, acco… [+2202 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Cardiovascular morbidity and all-cause mortality in patients with retinal vein occlusion: a Danish nationwide cohort study - British Journal of Ophthalmology", "description": "Background/aims Associations between retinal vein occlusion (RVO) and subsequent cardiovascular disease (CVD) or mortality have not been evaluated in a recent cohort, after novel therapeutic options have increased referrals for treatment of the condition. We …", "url": "https://bjo.bmj.com/content/early/2022/10/28/bjophthalmol-2022-321225", "urlToImage": "https://bjo.bmj.com/sites/default/files/highwire/bjophthalmol/106/11.cover-source.jpg", "publishedAt": "2022-10-28T17:49:33Z", "content": "Introduction\r\nRetinal vein occlusion (RVO) is a sight-threatening retinal disease classified as branch and central retinal vein occlusion (BRVO and CRVO, respectively) according to anatomical locatio… [+2332 chars]"}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "Canada: Toronto Public Health reminds families to update student immunization records - indiablooms", "description": "Toronto/IBNS: Toronto Public Health has launched a campaign to raise awareness of the importance of child-age immunizations for diseases including Diphtheria, Tetanus, Polio, Measles, Mumps, Rubella, Meningococcal Disease, Pertussis (whooping cough) and Varic…", "url": "https://www.indiablooms.com/world-details/USN/36636/canada-toronto-public-health-reminds-families-to-update-student-immunization-records.html", "urlToImage": "https://www.indiablooms.com/world_pic/2022/a2ecd2eb9ca9782db124e24c34acc2ec.jpg", "publishedAt": "2022-10-28T17:35:21Z", "content": "Toronto/IBNS: Toronto\r\n Public Health has launched a campaign to raise awareness of the importance of child-age immunizations for diseases including Diphtheria, Tetanus, Polio, Measles, Mumps, Rubell… [+1367 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Jyoti", "title": "Health Benefits Of Kiwi And Why You Should Eat It - HerZindagi", "description": "Health Benefits Of Kiwi And Why You Should Eat It", "url": "https://www.herzindagi.com/web-stories/diet-nutrition/health-benefits-of-kiwi-and-why-you-should-eat-it-ws-3877", "urlToImage": "https://images.herzindagi.info/webstories/3877/1666976517-social-image-jyoti--12-.jpg", "publishedAt": "2022-10-28T17:22:03Z", "content": "<ul>Every fruit has its own benefits Same is the case with Kiwi. It is not just juice and tangy but also adds nutrients to your body. Tap to see what they are.</ul>\r\nRich In Vitamins\r\n<ul>Kiwi is a r… [+922 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Priyanka Sharma", "title": "India’s swine flu cases, deaths jump | Mint - Mint", "description": "The number of swine flu cases across the country has seen a 15-fold rise from last year with 11,450 cases reported this year so far against 778 cases in 2021.321 people have been killed by the virus this year till 30 September compared with 12 last year", "url": "https://www.livemint.com/science/health/indias-swine-flu-cases-deaths-jump-11666976863227.html", "urlToImage": "https://images.livemint.com/img/2022/10/28/600x338/swineflu_1666976902103_1666976902247_1666976902247.jpg", "publishedAt": "2022-10-28T17:09:28Z", "content": "NEW DELHI : The number of swine flu cases across the country has seen a 15-fold rise from last year with 11,450 cases reported this year so far against 778 cases in 2021. More importantly, 321 people… [+1583 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "What is ‘brain fog’? - EastMojo", "description": "The COVID pandemic has introduced many scientific and medical terms into our everyday language. Many of us are now fluent in conversations about viral", "url": "http://www.eastmojo.com/health/2022/10/28/what-is-brain-fog/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/10/Untitled-design-2022-10-26T194852.232.png?fit=1280%2C720&ssl=1", "publishedAt": "2022-10-28T16:30:00Z", "content": "The COVID pandemic has introduced many scientific and medical terms into our everyday language. Many of us are now fluent in conversations about viral strains, PCR tests and mortality rates. Brain fo… [+6827 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Ayurvedic Practices For A Healthy Liver - News18", "description": "From processing the food that we eat to removing harmful toxins, our liver does most of the work to keep us healthy", "url": "https://www.news18.com/news/lifestyle/ayurvedic-practices-for-a-healthy-liver-6247051.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/shutterstock_1350063266-166679191916x9.jpg", "publishedAt": "2022-10-28T16:20:00Z", "content": "From processing the food that we eat to removing harmful toxins, our liver does most of the work to keep us healthy. This is why, Yoga and Ayurveda Practitioner, Life Coach and Founder of Yogi Fuel, … [+9123 chars]"}, {"source": {"id": null, "name": "Psychiatric Times"}, "author": "Heidi Anne Duerr, MPH", "title": "Tackling Treatment Issues in Adult ADHD - Psychiatric Times", "description": "There are no treatment guidelines for ADHD in adults in the United States, but you can still tackle this challenging diagnosis.", "url": "https://www.psychiatrictimes.com/view/tackling-treatment-issues-in-adult-adhd", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/psychtimes/d703ecd25453674c60d7f8b273c991cce20b2929-1000x562.jpg?fit=crop&auto=format", "publishedAt": "2022-10-28T15:05:46Z", "content": "AROUND THE PRACTICE\r\nFrom fallacies to frustrations, experts shared insights on adult attention-deficit/hyperactivity disorder (ADHD) in a recent custom Around the Practice video discussion.\r\nThere i… [+12666 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Could We Develop Vaccines for Depression and Anxiety? - Technology Networks", "description": "Could the same technology that trains the immune system against pathogens also be used as a preventative for depression and anxiety?", "url": "https://www.technologynetworks.com/vaccines/articles/could-we-develop-vaccines-for-depression-and-anxiety-365886", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/365886/could-we-develop-vaccines-for-depression-and-anxiety-365886-640x360.jpg?cb=20221028", "publishedAt": "2022-10-28T14:53:21Z", "content": "In response to the pandemic, scientists around the world developed COVID-19 vaccines in record-time, saving millions of lives. Vaccines have been hailed one of the greatest medical advances of modern… [+11587 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Anuradha Varanasi", "title": "Autistic Women Have A Far Higher Risk Of Being Hospitalized Due To Mental Illness Than Men - Forbes", "description": "In a new study, researchers found that autistic women are far more susceptible to hospitalization than their male counterparts due to depression, anxiety, and self-harm, among nine other psychiatric conditions.", "url": "https://www.forbes.com/sites/anuradhavaranasi/2022/10/28/autistic-women-have-a-far-higher-risk-of-being-hospitalized-due-to-mental-illness-than-men/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/635ba7405177dad2cd876e01/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-10-28T14:26:28Z", "content": "Woman seen in Warsaw on January 27, 2019. (Photo by Maciej Luczniewski/NurPhoto via Getty Images)\r\nNurPhoto via Getty Images\r\nCompared with neurotypicals or non-autistic people, young autistic men an… [+1933 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Killing Two Birds With One Stone - New Research Shows How Cancer Drug Could Fight Malaria - AllAfrica - Top Africa News", "description": "Malaria is the world's most important and deadly tropical mosquito-borne parasitic disease, according to the United Nations, killing a child under five every 75 seconds, and making it an urgent public health priority for the world.", "url": "https://allafrica.com/stories/202210280364.html", "urlToImage": "https://cdn03.allafrica.com/download/pic/main/main/csiid/00611959:825bbb88920874205c226b02dae107c0:arc614x376:w1200.jpg", "publishedAt": "2022-10-28T14:12:25Z", "content": "Harare — Malaria is the world's most important and deadly tropical mosquito-borne parasitic disease, according to the United Nations, killing a child under five every 75 seconds, and making it an urg… [+6101 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Govindraj Ethiraj, IndiaSpend.com", "title": "‘We still need to work hard’: An interview with the doctor who runs India’s last polio ward - Scroll.in", "description": "Orthopaedic surgeon Mathew Varghese talks of similarities between Covid-19 and polio, vaccination and how global cooperation helped eradicate the affliction.", "url": "https://scroll.in/article/1035855/we-still-need-to-work-hard-an-interview-with-the-doctor-who-runs-indias-last-polio-ward", "urlToImage": "https://s02.sgp1.cdn.digitaloceanspaces.com/book/61593-xxyfgryvmt-1498483867.jpg", "publishedAt": "2022-10-28T14:00:00Z", "content": "October 24 was World Polio Day. There are still about 20 new cases of polio globally, specifically in Pakistan, Afghanistan and Mozambique, but even one case is dangerous. Thus, many governments have… [+19301 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Research: Presence of ancient viral DNA in human genome protects against infections - ETHealthWorld", "description": "The study is significant because it could discover a pool of natural antiviral proteins that could lead to treatments without autoimmune side effects.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/research-presence-of-ancient-viral-dna-in-human-genome-protects-against-infections/95149109", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95149109,imgsize-6842,width-1200,height-628,overlay-ethealthworld/research-presence-of-ancient-viral-dna-in-human-genome-protects-against-infections.jpg", "publishedAt": "2022-10-28T13:57:00Z", "content": "New York (US): According to new research, viral DNA embedded in human genomes from ancient infections acts as antivirals, protecting human cells from certain modern viruses. The paper \"Evolution and … [+4352 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "Is intermittent fasting a good practice? Study reveals it affects female hormones - India Today", "description": "The study found that DHEA, a hormone that fertility clinics prescribe to improve ovarian function and egg quality, was significantly lower in both pre and post-menopausal women at the end of the trial. It dropped by about 14%.", "url": "https://www.indiatoday.in/health/story/is-intermittent-fasting-a-good-practice-study-reveals-it-affects-female-hormones-2290626-2022-10-28", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202210/Untitled%20design%20-%202022-10-28T185552.551-sixteen_nine_1.png?VersionId=KvHikQk20rX9YahVMM3.hB.PqrFeXuwT", "publishedAt": "2022-10-28T13:30:08Z", "content": "By Daphne Clarance: One of the most effective ways of weight loss is intermittent fasting (IF), advise many nutritionists. This form of lifestyle makes a person eat for a certain window of time and t… [+2673 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Youtheory Fat Burner Supplement Of 2022 [#BE Informed] - Deccan Herald", "description": "Overview", "url": "https://www.deccanherald.com/brandspot/pr-spot/youtheory-fat-burner-supplement-of-2022-be-informed-1157450.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1157450-1666962162.png", "publishedAt": "2022-10-28T13:02:42Z", "content": "Overview\r\nFor eliminating body fat people should start with a healthy diet and improve their metabolic rate. Many amazing Youtheory Fat Burner Supplement promote proper weight loss and give a better … [+12314 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "BS Web Team", "title": "Donating blood? Eligibility to advantages, herere things to keep in mind - Business Standard", "description": "Every person can donate on a regular basis Men can donate every three months and women can donate every four months", "url": "https://www.business-standard.com/article/current-affairs/donating-blood-eligibility-to-advantages-here-re-things-to-keep-in-mind-122102800987_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-09/13/full/1568365675-6723.jpg", "publishedAt": "2022-10-28T12:10:00Z", "content": "Blood donation saves millions of lives and improves the health and quality of life of many in need across the globe. Donating blood is an altruistic act of saving lives and a lifeline in emergencies,… [+3212 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "High blood pressure dangers: Effect of uncontrolled high bp on the kidneys - Zee News", "description": "Uncontrolled high blood pressure? Lower the risk of heart failure with lifestyle changes Control your blood pressure to protect your kidneys.  High blood pressure-related kidney failure is a cumulative process that might take years to manifest.", "url": "https://zeenews.india.com/health/high-blood-pressure-dangers-effect-of-uncontrolled-high-bp-on-the-kidneys-2527776", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/28/1109242-high-bp-kidneys.jpg", "publishedAt": "2022-10-28T12:03:27Z", "content": "The body can be silently harmed by high blood pressure (hypertension) for years before symptoms appear. Inability to function, poor quality of life, or even a fatal heart attack or stroke might resul… [+2197 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "8 things to watch if you want to understand ADHD better - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/health/wellness/8-things-to-watch-if-you-want-to-understand-adhd-better-111666951471771.html", "urlToImage": "https://images.livemint.com/img/2022/10/28/1140x641/western-art-the-simpsons_1612452379560_1612452394842_1666956192720_1666956192720.jpeg", "publishedAt": "2022-10-28T11:58:48Z", "content": "ADHD (Attention Deficit Hyperactivity Disorder) is now a common behavioural disorder diagnosed among children and, to an increasing extent, among adults as well.  People who suffer from ADHD could fa… [+5428 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "CinnaChroma Reviews (Barton Nutrition) Is It Really Effective? - The Tribune India", "description": "When Barton Nutrition&rsquo;s head Joe Barton decided to act against type 2 diabetes by creating the CinnaChroma supplement, the disease had already become an epidemic in the USA. Type 2 diabetes is a condition that causes blood glucose levels to become high.…", "url": "https://www.tribuneindia.com/news/brand-connect/cinnachroma-reviews-barton-nutrition-is-it-really-effective-445269", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_2095392492.jpg", "publishedAt": "2022-10-28T11:22:00Z", "content": "When Barton Nutrition’s head Joe Barton decided to act against type 2 diabetes by creating the CinnaChroma supplement, the disease had already become an epidemic in the USA. Type 2 diabetes is a cond… [+9754 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[#Exposed] Keto Gummies Shark Tank Reviews [Fact Check] Report!! *Shocking Discovery* Customer Results? - Deccan Herald", "description": "Overview of Shark Tank Keto Gummies, CANADA, United States, United Kingdom Keto Gummies Shark Tank are a great way to reduce weight and improve your health. The keto gummy diet is a low-carb, high-fat diet that has been shown to be effective for weight loss a…", "url": "https://www.deccanherald.com/brandspot/pr-spot/exposed-keto-gummies-shark-tank-reviews-fact-check-report-shocking-discovery-customer-results-1157419.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/fgncvh-1157419-1666955876.png", "publishedAt": "2022-10-28T11:17:56Z", "content": "Overview of Shark Tank Keto Gummies, CANADA, United States, United KingdomKeto Gummies Shark Tank are a great way to reduce weight and improve your health. The keto gummy diet is a low-carb, high-fat… [+9581 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Dr Ankit Mahavukar", "title": "Sexually transmitted virus HPV is established risk factor for oropharyngeal cancers; early detection is... - News9 LIVE", "description": "A sexually transmitted virus called HPV is an established risk factor for oropharyngeal cancers.", "url": "https://www.news9live.com/health/health-conditions/sexually-transmitted-virus-hpv-is-established-risk-factor-for-oropharyngeal-cancers-early-detection-is-key-204661", "urlToImage": "https://media.news9live.com/h-upload/2022/10/28/575571-cancer2.jpg", "publishedAt": "2022-10-28T11:08:57Z", "content": "A healthybody starts with a healthy mouth as it is a gateway into the body's overall health. To maintain a healthy self, one has to regularly do self-check tests, ideally once every month to look out… [+5722 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Liza Laws", "title": "Dark matter could change cancer treatment, scientists say - Labiotech.eu", "description": "A new level of control of cancer gene activity has been described by peers at The Institute of Cancer Research as ‘dark matter’.", "url": "https://www.labiotech.eu/more-news/dark-matter-could-change-cancer-treatment/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2022/10/shutterstock-dark-matter.jpg", "publishedAt": "2022-10-28T11:08:53Z", "content": "A whole new level of control of cancer gene activity within tumors, has been described by researchers as dark matter.\r\nIt was recently discovered and published in two major studies at the same time i… [+6886 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Dr. Reza Hosseini Ghomi", "title": "Signs Your Memory Loss is Not Normal and You Should See a Doctor — Eat This Not That - Eat This, Not That", "description": "We’ve all been touched by memory loss. The thing is, there is a lot we can do if we are empowered with information.", "url": "https://www.eatthis.com/signs-your-memory-loss-is-not-normal-and-you-should-see-a-doctor/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2019/06/woman-memory-loss.jpg?quality=82&strip=all", "publishedAt": "2022-10-28T11:07:58Z", "content": "We've all been touched by memory loss. Whether personally (TBI, Post-COVID, Dementia) or someone we love. The thing is, there is a lot we can do if we are empowered with information. I trained in bot… [+5580 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "Madhya Pradesh records 1,595 dengue cases so far this year; significant drop from 2021 - The New Indian Express", "description": "A survey was conducted in more than 79 lakh houses in the state for dengue larvae and efforts were constantly underway to eliminate mosquitoes (aedes aegypti), he said.", "url": "https://www.newindianexpress.com/nation/2022/oct/28/madhya-pradesh-records-1595-dengue-cases-so-far-this-year-significant-drop-from-2021-2512599.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/1/31/w600X390/Mosquito_Spray_EPS.jpg", "publishedAt": "2022-10-28T10:58:00Z", "content": "BHOPAL: At least 1,595 cases of dengue have been detected in Madhya Pradesh so far this year, which is a significant decline from the last year's infections, an official from the state health departm… [+1744 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Metabolic syndrome linked with elevated risk of bladder cancer - Medical Dialogues", "description": "China: Metabolic syndrome (MetS) is associated with an elevated risk of bladder cancer in the general population, a recent study in Frontiers in Oncology has revealed. The results underscore the...", "url": "https://medicaldialogues.in/medicine/news/metabolic-syndrome-linked-with-elevated-risk-of-bladder-cancer-101331", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/27/189072-bladder-cancer-2.jpg", "publishedAt": "2022-10-28T10:00:21Z", "content": "China: Metabolic syndrome (MetS) is associated with an elevated risk of bladder cancer in the general population, a recent study in Frontiers in Oncology has revealed. The results underscore the impo… [+3072 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Smart Materials Leading to Restorative Dentistry: An Overview - Cureus", "description": "Dental material has emerged in the last few decades with enhanced biological properties. The prime characteristics required for dental materials are that they should be compatible with oral cavity fluids such as saliva and gingival crevicular fluids. Their fu…", "url": "https://www.cureus.com/articles/101108-smart-materials-leading-to-restorative-dentistry-an-overview", "urlToImage": "https://assets.cureus.com/uploads/figure/file/389172/article_river_bc44ebf0e3d711ecb882832432240a8a-Img-1-.png", "publishedAt": "2022-10-28T09:52:31Z", "content": "According to traditional thought, it was believed that for a material to stay for a long period of time in a patient's mouth, the material needs to be passive in nature; thus, conventional materials … [+18760 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brain Health: 10 Superfoods To Add To Your Kids Diet To Improve Their Brain Health - NDTV", "description": "In this article, we list the best superfoods to improve the brain health of your kid.", "url": "https://www.ndtv.com/health/brain-health-10-superfoods-to-add-to-your-kids-diet-to-improve-their-brain-health-3467995", "urlToImage": "https://c.ndtvimg.com/2021-03/m6tjcpro_eggs-_625x300_16_March_21.jpg", "publishedAt": "2022-10-28T08:32:23Z", "content": "Brain Health: Spinach as well as eggs are highly beneficial for kid's brain health\r\nIf you have children you undoubtedly want to ensure they eat well so they can live the healthiest lives possible. A… [+5075 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Beyond Simplex Reviews - Effective Herpes Supplement or Cheap Anti-Viral Support Complex? - The Tribune India", "description": "Beyond Simplex from Beyond Nutrition Research is a dietary supplement that can help you control and reduce herpes symptoms. It&rsquo;s manufactured using high-quality ingredients that are safe for human consumption and which are without any side effects.", "url": "https://www.tribuneindia.com/news/brand-connect/beyond-simplex-reviews-effective-herpes-supplement-or-cheap-anti-viral-support-complex-445223", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_626089048.jpg", "publishedAt": "2022-10-28T07:10:00Z", "content": "Beyond Simplex from Beyond Nutrition Research is a dietary supplement that can help you control and reduce herpes symptoms. It’s manufactured using high-quality ingredients that are safe for human co… [+8413 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Can PCOS in young women cause Type 2 diabetes by 40? - The Indian Express", "description": "Women with PCOS frequently develop insulin resistance, which increases the risk of Type 2 diabetes even if their bodies can produce insulin. They are also more prone to gestational diabetes, says Dr Harsh Parekh, Consultant Endocrinologist and Diabetologist a…", "url": "https://indianexpress.com/article/lifestyle/health-specials/pcos-young-women-type-2-diabetes-8234679/", "urlToImage": "https://images.indianexpress.com/2022/10/PCOS.jpeg", "publishedAt": "2022-10-28T06:59:03Z", "content": "Women with PCOS (polycystic ovary syndrome) are often insulin-resistant; their bodies can make insulin but cant use it effectively, increasing their risk for Type 2 diabetes. As per the US Centres fo… [+3884 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Dr Sudarshana Pati", "title": "Diabetes: Patients should watch their sugar levels during festive season - Firstpost", "description": "Festival time can be tough for those having diabetes or high cholesterol. It is the time of fasting and feasting, and a majority of people tend to over-indulge in sweets, namkeens, and other fried foods that can take a toll on their overall well-being", "url": "https://www.firstpost.com/health/diabetes-patients-should-watch-their-sugar-levels-during-festive-season-11526791.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/09/WhatsApp-Image-2022-09-21-at-9.4-1.jpg", "publishedAt": "2022-10-28T06:49:20Z", "content": "Majority of people with diabetes gorge on sweets and snacks deep-fried in oil during festive season. There can be unhealthy indulgence during the festival season and diabetics will find it hard to co… [+2918 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Vitamin B12 Benefits: Relieving depression to anemia, know why is it important - India TV News", "description": "Vitamin B12 is an important substance that is found in nutritional foods and help in developing the brain and nerve cells. Apart from forming the red blood cell, cell metabolism, and the production of DNA, vitamin b12 also fights against depression. Know othe…", "url": "https://www.indiatvnews.com/health/vitamin-b12-benefits-relieving-depression-to-anemia-know-why-is-it-important-2022-10-28-815744", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/10/vitamin-b12-1-1666878799.jpg", "publishedAt": "2022-10-28T06:39:57Z", "content": "Vitamin B12 is the largest and most structural vitamin that helps in increasing normal red blood cell production (anemia). It is believed that this vitamin helps in impairing oxygen delivery which re… [+2441 chars]"}, {"source": {"id": null, "name": "Womansera.com"}, "author": "Adiba Ghaus", "title": "3 Drinks You Should Add To Your Lifestyle In This Winter Season! - Woman's Era", "description": "3 Drinks You Should Add To Your Lifestyle In This Winter Season. Subscribe to India's No.1 women's magazine!", "url": "https://www.womansera.com/3-drinks-you-should-add-to-your-lifestyle-in-this-winter-season/", "urlToImage": "https://www.womansera.com/wp-content/uploads/2022/10/AF53EA1A-B21E-49CD-B510-5DE5896CAF92.jpeg", "publishedAt": "2022-10-28T06:22:49Z", "content": "The 3 things we all should try to improve in our lifestyle are weight management, skin and immunity. And we all tend to neglect all these 3 things in winter the most. Because cold weather always make… [+3307 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Protetox Reviews : Protetox Pills Scam or Real Weight Loss Results - The Tribune India", "description": "A capsulated weight reduction supplement called Protetox's supplementation is produced in the&nbsp;United States&nbsp;in a GMP and FDA-authorized unit. It is a scientifically formulated product for weight loss that stimulates a potent fat-burning metabolic ac…", "url": "https://www.tribuneindia.com/news/brand-connect/protetox-reviews-protetox-pills-scam-or-real-weight-loss-results-445181", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1425022565.jpg", "publishedAt": "2022-10-28T05:33:00Z", "content": "A capsulated weight reduction supplement called Protetox's supplementation is produced in the United States in a GMP and FDA-authorized unit. It is a scientifically formulated product for weight loss… [+11376 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Does high-protein grilled chicken help you lose weight? - The Indian Express", "description": "Komal Malik, Head Dietician, Asian Hospital dispels some weight loss myths", "url": "https://indianexpress.com/article/lifestyle/health-specials/high-protein-grilled-chicken-weight-loss-myths-diet-tips-8234519/", "urlToImage": "https://images.indianexpress.com/2022/10/grilled-chicken.jpg", "publishedAt": "2022-10-28T05:19:56Z", "content": "Should I weigh myself often? Is that obsessive?\r\nKeeping a track of weight is very important but do that weekly. If you want to lose weight, losing about 5 to 10 per cent of your current weight over … [+1684 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "African countries have reported 6,883 Monkeypox cases, 173 deaths in 2022 - Business Insider India", "description": "Some 13 African countries have reported 6,883 monkeypox cases since the start of 2022, the Africa Centers for Disease Control and Prevention (Africa CDC) has", "url": "https://www.businessinsider.in/science/health/news/african-countries-have-reported-6883-monkeypox-cases-173-deaths-in-2022/articleshow/95135227.cms", "urlToImage": "https://www.businessinsider.in/photo/95135227/african-countries-have-reported-6883-monkeypox-cases-173-deaths-in-2022.jpg?imgsize=26794", "publishedAt": "2022-10-28T04:12:00Z", "content": "Some 13 African countries have reported 6,883 monkeypox cases\r\n since the start of 2022, the Africa Centers for Disease Control and Prevention\r\n (Africa CDC\r\n) has disclosed.\r\nAccording to data relea… [+1607 chars]"}, {"source": {"id": null, "name": "Mims.com"}, "author": "Sarah Cheung", "title": "Real-world data during HK's Omicron wave: Molnupiravir and nirmatrelvir/ritonavir effective in community-dwelling outpatients with COVID-19 | Latest news for Doctors, Nurses and Pharmacists | Pharmacy - MIMS", "description": "In a real-world, territory-wide, propensity score (PS)–matched\r\nstudy during Hong Kong’s Omicron BA.2.2 wave, early initiation of molnupir...", "url": "https://specialty.mims.com/topic/real-world-data-during-hk-s-omicron-wave--molnupiravir-and-nirmatrelvir-ritonavir-effective-in-community-dwelling-outpatients-with-covid-19", "urlToImage": "https://pubmiddleware.mims.com/resource/image/633E0AA6-DF78-4B86-8755-AF3B0173A11F/OriginalThumbnail/THUMBNAIL_shutterstock_1915560559.jpg", "publishedAt": "2022-10-28T00:40:42Z", "content": "In a real-world, territory-wide, propensity score (PS)matched study during Hong Kongs Omicron BA.2.2 wave, early initiation of molnupiravir or nirmatrelvir/ritonavir is shown to reduce the risks of m… [+3532 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Connor Boyd, Cassidy Morrison Senior", "title": "Flu and RSV coinfection creates entirely new untreatable hybrid - Daily Mail", "description": "The flu and a seasonal common cold virus can fuse together and create an entirely new  pathogen, which could evade the power of our immune systems.", "url": "https://www.dailymail.co.uk/health/article-11361767/Flu-RSV-coinfection-creates-entirely-new-untreatable-hybrid.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/10/27/23/63925933-0-image-a-53_1666910056757.jpg", "publishedAt": "2022-10-27T22:36:27Z", "content": "The flu and a seasonal common cold virus can fuse together and create an entirely new pathogen, scientists have shown for the first time.\r\nInfluenza A and respiratory syncytial virus (RSV) - which is… [+5108 chars]"}, {"source": {"id": null, "name": "Uchicago.edu"}, "author": null, "title": "Ancient DNA shows people with certain genes were more likely to survive the Black Death - UChicago News", "description": "UChicago scientists find bubonic plague had effect on human genome", "url": "https://news.uchicago.edu/story/ancient-dna-shows-people-certain-genes-were-more-likely-survive-black-death", "urlToImage": "https://news.uchicago.edu/sites/default/files/images/2022-10/plague.jpg", "publishedAt": "2022-10-27T21:46:45Z", "content": "This is, to my knowledge, the first demonstration that indeed, the Black Death was an important selective pressure to the evolution of the human immune system, said Barreiro. \r\nThe research team zero… [+2140 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Why some people are mosquito magnets - Science Daily", "description": "The female mosquito will hunt down any human, but some of us get bitten far more than others. The answer why may be hidden in our skin.", "url": "https://www.sciencedaily.com/releases/2022/10/221027124001.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-10-27T18:09:03Z", "content": "It's impossible to hide from a female mosquito -- she will hunt down any member of the human species by tracking our CO2 exhalations, body heat, and body odor. But some of us are distinct \"mosquito m… [+5939 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Trivedi", "title": "Down with viral infections? Try these home remedies - Zee News", "description": "Viral infections have become a talk of the town these days. Be it the capital city or other states, people are down with viral fever and other viral infections. So, what is viral infection? Well, it occurs when a virus enters the body to disrupt the body’s im…", "url": "https://zeenews.india.com/health/down-with-viral-infections-try-these-home-remedies-2527433", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/27/1108866-untitled-design-2022-10-27t203813.293.png", "publishedAt": "2022-10-27T15:08:51Z", "content": "New Delhi: Viral infections have become a talk of the town these days. Be it the capital city or other states, people are down with viral fever and other viral infections. So, what is viral infection… [+1585 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Improve your bone health naturally - Open Access Government", "description": "MyBones explores the potential Low-intensity Vibration therapy has as a natural alternative to prevent and combat osteoporosis", "url": "https://www.openaccessgovernment.org/improve-your-bone-health-naturally/146218/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2022/10/MyBones-ebook-10289-Front-Cover-495px.png", "publishedAt": "2022-10-27T13:45:33Z", "content": "Osteoporosis is one of many musculoskeletal conditions that is currently gaining prominence in public health, driven by ageing population trends across the globe. Its key features include reduced bon… [+13944 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Tanisha Salwan", "title": "Love Murabba? See These Murabba Varieties With Zero Haters - Slurrp", "description": "Murabbas can never annoy us!!", "url": "https://www.slurrp.com/article/love-murabba-see-these-murabba-varieties-with-zero-haters-1666876375869", "urlToImage": "https://images.slurrp.com/prodarticles/k3tmbahjlf.webp", "publishedAt": "2022-10-27T13:32:26Z", "content": "What comes to your mind when you think of a delectable treat preserved with spices, sugar, and fruit mostly protein-rich ones? I know right, it is nothing but our beloved murabba. Murabba has our hea… [+2088 chars]"}, {"source": {"id": null, "name": "Dynamitenews.com"}, "author": null, "title": "Study: Here's How Early Inhibitions Fuel Future Depression - Dynamite News", "description": "The study, published 26 Oct in JAMA Psychiatry, followed a group of 165 people from the age of four months to the age of 26 between 1989 and 1993. Read on for details:", "url": "https://www.dynamitenews.com/story/study-heres-how-early-inhibitions-fuel-future-depression", "urlToImage": "https://www.dynamitenews.com/images/2022/10/27/study-heres-how-early-inhibitions-fuel-future-depression/635a734625866.jpg", "publishedAt": "2022-10-27T12:06:44Z", "content": "The study, published 26 Oct in JAMA Psychiatry, followed a group of 165 people from the age of four months to the age of 26 between 1989 and 1993. Read on for details:\r\nDallas (Texas): A recent imagi… [+5012 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Abantika Ghosh", "title": "Swiss researchers may have found a new way to ferry cancer drugs to tumours — ‘magnetic’ bacteria - ThePrint", "description": "Scientists from ETH Zurich demonstrate how movements of bacterium Magnetospirillum magneticum can be controlled by magnets from outside body. Findings published in Science Robotics.", "url": "https://theprint.in/health/swiss-researchers-may-have-found-a-new-way-to-ferry-cancer-drugs-to-tumours-magnetic-bacteria/1184042/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/10/Magnetic-bateria-1.jpg", "publishedAt": "2022-10-27T10:54:11Z", "content": "New Delhi: Swiss researchers may have found a way to target cancerous tumours using the natural magnetic properties of some bacteria, thanks to the presence of iron oxide particles in them. \r\nIn an a… [+4240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Is The Mono Diet? Here's Everything You Need To Know - NDTV", "description": "Mono Diet: In this article, we discuss what the mono diet is and everything else you must know.", "url": "https://www.ndtv.com/health/what-is-the-mono-diet-heres-everything-you-need-to-know-3464886", "urlToImage": "https://c.ndtvimg.com/2022-05/gft66lq8_weight-loss-habits_625x300_06_May_22.jpg", "publishedAt": "2022-10-27T09:50:09Z", "content": "Mono Diet may result in significant weight loss but it is extremely temporary\r\nThe mono diet is a straightforward eating program that calls for sticking to a single food or food group at each meal of… [+3465 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "SGLT-2i Therapy in Kidney Transplant Recipients With Diabetes - DocWire News", "description": "In non-transplant patients with chronic kidney disease (CKD) and diabetes, the use of sodium glucose linked transporter inhibitors (SGLT-2i) has been Results of a study examining the long-term benefits of the use of sodium glucose linked transporter inhibitor…", "url": "https://www.docwirenews.com/nephtimes/nephtimes-features/nephtimes-focus-on-transplantation/sglt-2i-therapy-in-kidney-transplant-recipients-with-diabetes/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2022/09/NT_14.07-October-2022_Cover.png", "publishedAt": "2022-10-27T09:24:51Z", "content": "In non-transplant patients with chronic kidney disease (CKD) and diabetes, the use of sodium glucose linked transporter inhibitors (SGLT-2i) has been shown to reduce cardiovascular mortality, delay C… [+2715 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eating Almonds Daily May Help Improve Gut Health: Study - NDTV Food", "description": "It was found that the group who ate almonds had increased potassium level and higher amount of butyrates in the gut.", "url": "https://food.ndtv.com/news/eating-almonds-daily-may-help-improve-gut-health-study-3465790", "urlToImage": "https://c.ndtvimg.com/2022-05/20re8gm8_almonds_625x300_27_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-10-27T07:45:57Z", "content": "Rich, crunchy and nutty - almonds are not just delicious, but are packed with various health benefitting properties. According to health experts, almonds are rich in protein, vitamins, antioxidants a… [+1966 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Amarachi Orie, news reporter", "title": "Fungal infections 'increased significantly' during COVID pandemic as WHO reveals health-threatening fungi list - Sky News", "description": "", "url": "https://news.sky.com/story/fungal-infections-increased-significantly-during-covid-pandemic-as-who-reveals-health-threatening-fungi-list-12730791", "urlToImage": "https://e3.365dm.com/22/10/1600x900/skynews-aspergillus-fumigatus_5944800.jpg?20221026234335", "publishedAt": "2022-10-26T23:16:25Z", "content": "Fungal infections \"increased significantly\" among hospital patients during the COVID pandemic, says the World Health Organisation as it released its first-ever list of fungi posing the greatest threa… [+3214 chars]"}]}