{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Rajeshwaari Kalla", "title": "Sinus infections or plain cold and cough? Spot the differences, causes, symptoms and cure for sinusitis - Moneycontrol", "description": "Sinusitis: Runny and stuffy nose, sore throat, pain and soreness over your face, headache, and even loss of smell? You could be suffering from sinusitis, a debilitating inflammatory condition that can severely affect your quality of life. Here are the causes,…", "url": "https://www.moneycontrol.com/news/health-and-fitness/sinus-infections-or-plain-cold-and-cough-spot-the-differences-causes-symptoms-and-cure-for-sinusitis-10655821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/Sinusitis-causes-and-symptoms-770x433.jpg", "publishedAt": "2023-05-25T03:30:11Z", "content": "Runny and stuffy nose, sore throat, pain and soreness over your face, headache and even loss of smell? If you've been dealing with these for a long time, you could be suffering from sinusitis, a debi… [+3480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "World Thyroid Day: Ways to effectively diagnose and manage the condition among the elderly - The Indian Express", "description": "\"Any new onset symptoms in the elderly, which are not fully explainable, should warrant an evaluation of thyroid function tests,\" said Dr Harshal Ekatpure, consultant endocrinologist and diabetologist, Ruby Hall Clinic, Pune", "url": "https://indianexpress.com/article/lifestyle/health/world-thyroid-day-disorder-symptoms-diagnosis-management-prevention-elderly-8626698/", "urlToImage": "https://images.indianexpress.com/2023/05/thyroid_200_getty_elderly.jpg", "publishedAt": "2023-05-25T02:50:20Z", "content": "While everyone needs to be careful about their health, when it comes to the elderly population, especially those living with an ailment, one needs to be extra cautious. The same also applies for the … [+4615 chars]"}, {"source": {"id": null, "name": "Lifestyleasia.com"}, "author": "Sreetama Basu", "title": "7 vegetarian Indian foods you need to include in your diet to burn belly fat - Lifestyle Asia Singapore", "description": "Here are some of the best vegetarian Indian foods to burn belly fat. Paired with a healthy lifestyle, this is your gateway to a flat tummy.", "url": "https://www.lifestyleasia.com/sg/beauty-grooming/wellness/vegetarian-indian-foods-to-burn-belly-fat/", "urlToImage": "https://images.lifestyleasia.com/wp-content/uploads/sites/6/2023/05/25101223/vegetarian-Indian-food-burn-belly-fat-increase-metabiolism.jpg", "publishedAt": "2023-05-25T02:18:54Z", "content": "Which is one of your biggest enemies when it comes to your lifestyle? One of the answers might be belly fat. Desk jobs and a sedentary lifestyle are the major reasons behind the accumulation of fat i… [+3479 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 'bites the apple': Abdominal obesity ignites cytokine storm - News-Medical.Net", "description": "Abdominal obesity increases the risk of severe COVID-19 and mortality due to heightened inflammatory responses, according to a study on Japanese patients and a murine COVID-19 model. Blocking inflammatory cytokines and preventing obesity may improve survival …", "url": "https://www.news-medical.net/news/20230524/COVID-19-bites-the-apple-Abdominal-obesity-ignites-cytokine-storm.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749165_16849562239439473.jpg", "publishedAt": "2023-05-25T02:01:00Z", "content": "A recent study published in the journal PNAS reports that abdominal obesity is associated with excessive inflammatory responses and an increased risk of mortality in coronavirus disease 2019 (COVID-1… [+6019 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Study shows key role for human T cells in the control of Respiratory Syncytial Virus (RSV) infection - Science Daily", "description": "A new study has shown that human T cells have an important role to play in controlling infection.", "url": "https://www.sciencedaily.com/releases/2023/05/230524181935.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-25T01:39:11Z", "content": "Respiratory Syncytial Virus (RSV) is a highly contagious and seasonal respiratory virus that mainly causes common cold symptoms in healthy adults but can cause more serious lung infections in infants… [+3797 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study unravels links between obesity, mental health, and self-esteem in adolescents: Early intervention key to prevention - News-Medical.Net", "description": "How happiness with appearance, dieting, bullying, and self-esteem mediates the relationship between mental health and BMI in adolescents.", "url": "https://www.news-medical.net/news/20230524/Study-unravels-links-between-obesity-mental-health-and-self-esteem-in-adolescents-Early-intervention-key-to-prevention.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749132_16849452068975246.jpg", "publishedAt": "2023-05-25T01:32:00Z", "content": "Two of the main challenges faced by public health authorities throughout the world are obesity and mental health issues. A better understanding of the psychosocial factors that influence mental healt… [+5759 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "7 weight loss friendly snacks you can munch on without guilt - Indiatimes.com", "description": "Try these snacks that'll help you lose weight as well.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/7-weight-loss-friendly-snacks-you-can-munch-on-without-guilt/photostory/100471474.cms", "urlToImage": "https://static.toiimg.com/photo/100471758.cms", "publishedAt": "2023-05-25T01:30:00Z", "content": "“Moong dal chilla is a savory pancake made from ground moong dal (yellow split lentils). It's packed with protein and can be customized with chopped vegetables and spices like cumin, turmeric, and co… [+135 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Swati Chaturvedi", "title": "Childhood Obesity: A Looming Health Crisis in Our Society - News18", "description": "Childhood obesity is typically assessed using body mass index (BMI), which takes into account a child's height and weight", "url": "https://www.news18.com/lifestyle/childhood-obesity-a-looming-health-crisis-in-our-society-7902361.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/shutterstock_1413695459-168473805616x9.jpg", "publishedAt": "2023-05-25T00:54:21Z", "content": "Childhood obesity refers to the condition where excess body fat accumulates in children and adolescents, significantly increasing their risk of health problems. It is a serious and complex medical co… [+3177 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "CT scan may be better at predicting heart disease than genetics, report says - CBS Boston", "description": "A common imaging scan may be better at gauging your risk for heart disease than your underlying genetics.", "url": "https://www.youtube.com/watch?v=4_WDTcloqrs", "urlToImage": "https://i.ytimg.com/vi/4_WDTcloqrs/maxresdefault.jpg", "publishedAt": "2023-05-24T21:39:01Z", "content": null}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": null, "title": "Chemical compound stimulates nerve regeneration, protects heart tissue - The Science Board", "description": "ScienceBoard.net is a community of international scientific professionals working in the life science and medical industries. We provide opportunities for news, research, and collaboration to scientists, laboratory and medical professionals, academic trainees…", "url": "https://www.scienceboard.net/index.aspx?sec=log&amp;itemID=5453", "urlToImage": "https://www.scienceboard.net/images/logos/narrow_header.gif", "publishedAt": "2023-05-24T20:35:12Z", "content": "Join us to influence the development of the next generation of scientific and medical technologies. We are looking for professionals who are actively conducting life science research, development or … [+692 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Chris Anderson", "title": "Researchers Identify Potential New Method to Hinder Renal Toxicity from Cisplatin - Inside Precision Medicine", "description": "Researchers have identified a potential method to hinder renal toxicity that is often associated with treating cancer with cisplatin.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/oncologics/researchers-identify-potential-new-method-to-hinder-renal-toxicity-from-cisplatin/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2021/01/Kidneys-1001972142-scaled.jpg", "publishedAt": "2023-05-24T19:32:27Z", "content": "Researchers at Fukita Health University, Japan say they have identified a new potential method to hinder renal toxicity that is often associated with treating cancer with the chemotherapeutic agent c… [+2903 chars]"}, {"source": {"id": null, "name": "Aarp.org"}, "author": "Kimberly Goad", "title": "4 Nonalcoholic Fatty Liver Disease Treatments - AARP", "description": "About 1 in 4 U.S. adults have nonalcoholic fatty liver disease (NAFLD), which can harm the liver. Learn how to heal your liver naturally.", "url": "https://www.aarp.org/health/conditions-treatments/info-2023/reverse-nonalcoholic-fatty-liver-disease/", "urlToImage": "https://cdn.aarp.net/content/dam/aarp/health/conditions_treatments/2023/05/1140-fatty-liver-disease-rendering.jpg", "publishedAt": "2023-05-24T19:16:56Z", "content": "Nonalcoholic fatty liver disease (NAFLD) might just be the most common disease youve never heard of.\r\nThe condition which occurs when excess fat accumulates in the liver of people who arent heavy dri… [+2442 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers use AI models to advance drug delivery system for chronic eye diseases - News-Medical.Net", "description": "Wilmer Eye Institute, Johns Hopkins Medicine researchers say they have used artificial intelligence models and machine-learning algorithms to successfully predict which components of amino acids that make up therapeutic proteins are most likely to safely deli…", "url": "https://www.news-medical.net/news/20230524/Researchers-use-AI-models-to-advance-drug-delivery-system-for-chronic-eye-diseases.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/futuristic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg", "publishedAt": "2023-05-24T19:03:00Z", "content": "Wilmer Eye Institute, Johns Hopkins Medicine researchers say they have used artificial intelligence models and machine-learning algorithms to successfully predict which components of amino acids that… [+5460 chars]"}, {"source": {"id": null, "name": "MakeUseOf"}, "author": "Angela Yates", "title": "8 YouTube Exercise Channels to Help You Work Out if You're Short on Time - MUO - MakeUseOf", "description": "Exercising is important for your overall wellbeing, but doing so is hard if you're short of time. These YouTube channels will help, though.", "url": "https://www.makeuseof.com/youtube-channels-for-quick-exercises/", "urlToImage": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2023/05/a-woman-lying-on-an-exercise-mat-with-weights-choosing-a-workout-on-a-laptop.jpg", "publishedAt": "2023-05-24T19:00:00Z", "content": "One of the most frequent excuses made by people who don’t work out regularly is that they don’t have time. While it’s certainly true that life can be hectic, exercise confers so many health benefits … [+7756 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Protein can improve muscle function in Duchenne muscular dystrophy: Study - ThePrint", "description": "Washington [US], May 24 (ANI): A team of researchers has found that protein plays a vital role in the development of the immune system, they can slow down disease progression and improve muscle function in Duchenne muscular dystrophy (DMD). The study was publ…", "url": "https://theprint.in/health/protein-can-improve-muscle-function-in-duchenne-muscular-dystrophy-study/1593006/", "urlToImage": null, "publishedAt": "2023-05-24T18:17:45Z", "content": "Washington [US], May 24 (ANI): A team of researchers has found that protein plays a vital role in the development of the immune system, they can slow down disease progression and improve muscle funct… [+2302 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Chhavi Puri", "title": "11 Effective Homemade Moisturizers for Dry Skin Treatment - PINKVILLA", "description": "A DIY Moisturizer May Help You Keep Your Skin Hydrated While Being Easy On The Pocket. Check Out These Effective Homemade Moisturizers For Dry Skin Treatment.", "url": "https://www.pinkvilla.com/beauty/skin-care/effective-homemade-moisturizers-for-dry-skin-1222310", "urlToImage": "https://www.pinkvilla.com/english/images/2023/05/224558875_cream-g39d93ff3c_1280_1280*720.jpg", "publishedAt": "2023-05-24T18:12:49Z", "content": "Glowing, fresh skin makes us feel good about ourselves and induces confidence. However, people who have dry skin may often struggle to achieve this. Using an effective homemade moisturizer for dry sk… [+19885 chars]"}, {"source": {"id": null, "name": "Organiser.org"}, "author": "WEB DESK", "title": "Study suggests diet that can improve blood pressure, sugar levels and weight control - Organiser", "description": "According to a study, adults who are overweight or obese and have type 2 diabetes or prediabetes are at a higher risk of developing severe health issues.", "url": "https://organiser.org/2023/05/24/175411/world/study-suggests-diet-that-can-improve-blood-pressure-sugar-levels-and-weight-control/", "urlToImage": "https://organiser.org/wp-content/uploads/2023/05/whatsapp-image-2023-05-24-at-2.48.31-pm-1.jpeg", "publishedAt": "2023-05-24T17:33:16Z", "content": "According to a study, adults who are overweight or obese and have type 2 diabetes or prediabetes are at a higher risk of developing severe health issues. Experts disagree on the best dietary regimens… [+2056 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds biomarkers may help in treatment of acute kidney injury - ANI News", "description": "Hospital inpatients who acquire an acute kidney injury (AKI) often perform badly after discharge and have few therapy choices.", "url": "https://www.aninews.in/news/health/study-finds-biomarkers-may-help-in-treatment-of-acute-kidney-injury20230524223507", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230524144712.jpg", "publishedAt": "2023-05-24T17:05:00Z", "content": "Washington [US], May 24 (ANI): Hospital inpatients who acquire an acute kidney injury (AKI) often perform badly after discharge and have few therapy choices.A UW Medicine-led study published recently… [+3341 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Kalyan Ray", "title": "New Indian drug candidates to fight existing as well as emerging Covid strains and influenza - Deccan Herald", "description": "Indian scientists have come out with a new class of broad-spectrum anti-viral drug candidates that not only work remarkably well against disease causing variants of Covid-19 and influenza but also remain effective in tackling the emerging strains.", "url": "https://www.deccanherald.com/science-and-environment/new-indian-drug-candidates-to-fight-existing-as-well-as-emerging-covid-strains-and-influenza-1221670.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/05/25/2022-02-03t154829z1383685553rc2fcs9me52artrmadp3merck-co-resultsjpg-1079721-1644403088-1221670-1684981596.jpg", "publishedAt": "2023-05-24T16:29:41Z", "content": "Indian scientists have come out with a new class of broad-spectrum anti-viral drug candidates that not only work remarkably well against disease causing variants of Covid-19 and influenza but also re… [+3830 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Serena Crawford", "title": "Supporting your digestive system: Three ways to improve gut health - Medical Xpress", "description": "Our digestive health has a vast influence on our well-being, affecting our immune system, brain function, body weight, and more, says Avlin Imaeda, MD, Ph.D., associate professor of medicine (digestive diseases), an expert in metabolic health and weight loss.…", "url": "https://medicalxpress.com/news/2023-05-digestive-ways-gut-health.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/fruits-and-vegetables-1.jpg", "publishedAt": "2023-05-24T16:20:50Z", "content": "Our digestive health has a vast influence on our well-being, affecting our immune system, brain function, body weight, and more, says Avlin Imaeda, MD, Ph.D., associate professor of medicine (digesti… [+2967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Not just genetics or health issues, these habits could also be the reason behind your hair fall - The Indian Express", "description": "Consistency in maintaining healthy habits and seeking professional guidance when needed will help tackle hair fall", "url": "https://indianexpress.com/article/lifestyle/life-style/hair-hacks-causes-hairfall-8624356/", "urlToImage": "https://images.indianexpress.com/2023/05/hair-fall-1.jpg", "publishedAt": "2023-05-24T16:10:27Z", "content": "Hair loss has become extremely common these days, and the reasons can be many. Anyone can lose hair on their head, but according to experts, it is more common in men. While in some cases, it could be… [+3709 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "Gauri Mundle", "title": "Monitoring mental health using AI in a wearable device - Inceptive Mind", "description": "An algorithm to measure mental health issues using a wearable device integrated with machine learning.", "url": "https://www.inceptivemind.com/monitoring-mental-health-using-ai-wearable-device/30908/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2023/05/mount-sinai-warrior-watch.jpg", "publishedAt": "2023-05-24T15:36:00Z", "content": "Mental health issues are common and affect how we think, feel, and act; mental health can be challenging to deal with. The World Health Organization considers psychological disorders the leading caus… [+3280 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Diet Apps Nutrition Apps Weight Loss Apps: Before You Consider Using One – Read This | TheHealthSite.com - TheHealthSite", "description": "It may not be a good idea to rely on an app for planning your diet to manage your weight or a health condition. Read on to know why. TheHealthSite.com", "url": "https://www.thehealthsite.com/fitness/diet/diet-apps-how-helpful-and-accurate-are-they-980462/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/05/diet-apps.jpg", "publishedAt": "2023-05-24T15:18:00Z", "content": "Do not follow diet plans given by Apps or Instagram influencers or self-proclaimed diet coaches. \r\nDiet Apps, Nutrition Apps, Weight Loss Apps - It may not be a good idea to rely on an app for planni… [+4479 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Bob Yirka", "title": "Heart donors with COVID-19 found to confer higher mortality risk to those receiving new hearts - Medical Xpress", "description": "A team of medical researchers from Montefiore Medical Center and Albert Einstein College of Medicine in New York has found that mortality rates are higher for transplant patients receiving a new heart from a person infected with the SARS-CoV-2 virus than from…", "url": "https://medicalxpress.com/news/2023-05-heart-donors-covid-confer-higher.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/heart-doners-with-covi.jpg", "publishedAt": "2023-05-24T15:03:49Z", "content": "A team of medical researchers from Montefiore Medical Center and Albert Einstein College of Medicine in New York has found that mortality rates are higher for transplant patients receiving a new hear… [+2543 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's The Ultimate Trick To Stop Overeating - NDTV", "description": "Staying in a highly low caloric state can result in fatigue, weakness, and other physical and mental health problems.", "url": "https://www.ndtv.com/health/heres-the-ultimate-trick-to-stop-overeating-4063262", "urlToImage": "https://c.ndtvimg.com/overeating-_625x300_1526968112936.jpg", "publishedAt": "2023-05-24T14:52:17Z", "content": "When the body is in a low calorie state, it goes into a state of starvation mode and insists overeating\r\nUnder-eating means consuming fewer calories than what our body requires to function properly. … [+2368 chars]"}, {"source": {"id": null, "name": "Thebetterindia.com"}, "author": null, "title": "Cardiac Arrests: Why Do They Happen & What to Do in an Emergency - The Better India", "description": "Did you know that cardiac arrests are the most common cause of death in India. We spoke to an expert to understand the causes and prevention.", "url": "https://www.thebetterindia.com/web-stories/cardiac-arrests-why-do-they-happen-what-to-do-in-an-emergency/", "urlToImage": "https://en-media.thebetterindia.com/uploads/2023/05/cropped-pexels-karolina-grabowska-4386467-1-1-1-1684936247-1684936383.jpg", "publishedAt": "2023-05-24T14:12:16Z", "content": "Disclaimer: While this information is being put out to help, it is in no way a substitute for a qualified medical opinion. Always consult a specialist or your doctor for more information.\r\nSudden car… [+1845 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Bloomberg", "title": "The spike in child mortality won’t go away on its own - Hindustan Times", "description": "It will take a concerted effort to reverse pandemic-era increases in suicides, murders, overdoses and accidents. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/the-spike-in-child-mortality-won-t-go-away-on-its-own-101684936884853.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/24/1600x900/children_mortality_1684937034533_1684937039852.jpg", "publishedAt": "2023-05-24T14:07:48Z", "content": "For Americans under 20, an epidemic much deadlier than Covid-19 has raged over the last three years. Deaths among those aged 1 to 19 surged 20% driven by an increase in car crashes, suicide, homicide… [+4811 chars]"}, {"source": {"id": null, "name": "Diagnostic and Interventional Cardiology"}, "author": "milla1cf", "title": "Photon-Counting CT Offers Superior Imaging in Babies with Heart Defects - Diagnostic and Interventional Cardiology", "description": "May 24, 2023 — A new advanced form of computed tomography (CT) imaging called photon-counting computed tomography (PCCT) offers better cardiovascular imaging quality at a similar radiation dose compared to dual-source CT (DSCT) in infants with suspected cardi…", "url": "https://www.dicardiology.com/content/photon-counting-ct-offers-superior-imaging-babies-heart-defectshttps://www.itnonline.com/content/photon-counting-ct-offers-superior-imaging-babies-heart-defects", "urlToImage": "http://www.dicardiology.com/sites/default/files/PhotonCounting.png", "publishedAt": "2023-05-24T14:04:23Z", "content": "May 24, 2023  A new advanced form of computed tomography (CT) imaging called photon-counting computed tomography (PCCT) offers better cardiovascular imaging quality at a similar radiation dose compar… [+3161 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kanakanjali Roy", "title": "Home Remedies To Treat Heat Stroke - Times Now", "description": "Heat Stroke Remedy: From onion paste to aloe vera juice, here are some home remedies to treat heat stroke.", "url": "https://www.timesnownews.com/web-stories/lifestyle/home-remedies-to-treat-heat-stroke/photostory/100479976.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100480004,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-05-24T13:56:55Z", "content": null}, {"source": {"id": null, "name": "Webnewsobserver.com"}, "author": "https://www.facebook.com/webnewsobserver", "title": "6 Detox drinks and juices to lose belly fat - Web News Observer", "description": "Detox drinks and juices have proven to be highly crucial to the weight loss journey. They aid the process and keep the person full instead of consuming old", "url": "https://webnewsobserver.com/6-detox-drinks-juices-to-lose-belly-fat/", "urlToImage": "https://webnewsobserver.com/wp-content/uploads/2023/04/6-Detox-Drinks-Juices-to-Lose-Belly-Fat.-.png", "publishedAt": "2023-05-24T12:41:11Z", "content": "Detox drinks and juices have proven to be highly crucial to the weight loss journey. They aid the process and keep the person full instead of consuming old fried snacks. These drinks act as a natural… [+3476 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study sheds more insight into diagnosis of type 1 diabetes after SARS-CoV-2 infection - ETHealthWorld", "description": "Several studies have found a rise in type 1 diabetes during the COVID-19 pandemic. However, none of the research distinguishes between children infected with SARS-CoV-2 and those who are not. Researchers can now acquire fresh insights since the KVB data set c…", "url": "https://health.economictimes.indiatimes.com/news/industry/study-sheds-more-insight-into-diagnosis-of-type-1-diabetes-after-sars-cov-2-infection/100478346", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100478346,imgsize-70688,width-1200,height=765,overlay-ethealth/industry/study-sheds-more-insight-into-diagnosis-of-type-1-diabetes-after-sars-cov-2-infection.jpg", "publishedAt": "2023-05-24T12:37:37Z", "content": "Washington: Several studies have found a rise in type 1 diabetes during the COVID-19 pandemic. However, none of the research distinguishes between children infected with SARS-CoV-2 and those who are … [+2343 chars]"}, {"source": {"id": null, "name": "Mirchi.in"}, "author": "Toshiro Agarwal", "title": "Schizophrenia Awareness Day 2023: Combating stigma and fostering understanding - Mirchi Plus", "description": "Explore the significance of Schizophrenia Awareness Day, raising public understanding of the complex mental health disorder, reducing stigma, promoting early intervention, providing support, and advancing research.", "url": "https://mirchi.in/stories/lifestyle/schizophrenia-awareness-day-2023-combating-stigma-and-fostering-understanding/100477371", "urlToImage": "https://static.mirchi.in/thumb/imgsize-13412,msid-100477371,width-800,height-450,resizemode-1/100477371.jpg", "publishedAt": "2023-05-24T12:24:52Z", "content": "Schizophrenia Awareness Day\r\n, observed on May 24th each year, serves as a crucial platform to increase public understanding and knowledge about schizophrenia\r\n. This article explores the significanc… [+3342 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Scientists Reveal Detailed Human Pangenome Reference That Captures Human Diversity - India Education Diary", "description": "The Human Genome Project, funded by the National Institutes of Health (NIH), ended in April 2003 and produced a human genome sequence made up of a patchwork of data from a small number of individuals. This lack of diversity limited its usefulness as", "url": "https://indiaeducationdiary.in/scientists-reveal-detailed-human-pangenome-reference-that-captures-human-diversity/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/Washington-University-in-St.Louis_.jpg", "publishedAt": "2023-05-24T11:38:32Z", "content": "The Human Genome Project, funded by the National Institutes of Health (NIH), ended in April 2003 and produced a human genome sequence made up of a patchwork of data from a small number of individuals… [+3759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shreya Agrawal", "title": "Why the summer season can be ‘challenging’ for people with diabetes - The Indian Express", "description": "Experts noted that people with hypoglycemia — low blood sugar levels in the body — also need to be cautious during this season as they can also get affected", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-summer-season-challenges-causes-management-8618453/", "urlToImage": "https://images.indianexpress.com/2023/05/summer-and-diabetes-1200.jpg", "publishedAt": "2023-05-24T11:30:44Z", "content": "A few months back, we discussed the effects of the winter season and cold weather on blood sugar in people with diabetes, arising from various factors, such as reduced physical activity, dietary chan… [+6577 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Heat can trigger mental health issues: KGMU experts - Morung Express", "description": "", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2023/05/96640302_1684926867_f9bd129b9edb7c799016d942dd178832.jpg", "publishedAt": "2023-05-24T11:14:43Z", "content": "LUCKNOW, MAY 24 (IANS): WHAT HAS HEAT GOT TO DO WITH MENTAL HEALTH?\r\nA lot, if one believes the doctors at the King George's Medical University (KGMU).\r\nAccording to medical experts, there has been a… [+2211 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "10 Health Benefits Of Eating Papaya In Summer - Slurrp", "description": "10 Health Benefits Of Eating Papaya In Summer 10 Health Benefits Of Eating Papaya In Summer10 Health Benefits Of Eating Papaya In Summer By Shireen", "url": "https://www.slurrp.com/web-stories/10-health-benefits-of-eating-papaya-in-summer/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2023/05/24134105/cropped-shutterstock_2100077542.jpg", "publishedAt": "2023-05-24T11:10:51Z", "content": "Papaya is packed with vitamins A, E, and K, as well as essential minerals like potassium and magnesium."}, {"source": {"id": "wired", "name": "Wired"}, "author": "Grace Huckins", "title": "New Alzheimer’s Drugs Offer Subtle Benefits—With Real Risks - WIRED", "description": "Antibody treatments clear amyloid protein from patients' brains, slowing the progression of their disease but potentially inducing deadly swelling.", "url": "https://www.wired.com/story/alzheimers-drugs-benefits-risks-lecanemab-donanemab/", "urlToImage": "https://media.wired.com/photos/646d0a360a0f9ed43773f04d/191:100/w_1280,c_limit/alzheimers_science_GettyImages-1477638649-(1).jpg", "publishedAt": "2023-05-24T11:00:00Z", "content": "Nearly 30 years ago, when the first effective Alzheimers drugs were approved, optimism was in the air. True, the drugs didnt slow the underlying disease, but they made a meaningful difference to symp… [+3215 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Healthy cooking oils: 5 best types recommended for meal prep - Hindustan Times", "description": "When it comes to healthy oils for cooking, there are several options to choose from. Here are some commonly recommended oils:", "url": "https://www.hindustantimes.com/photos/lifestyle/healthy-cooking-oils-5-best-types-recommended-for-meal-prep-101684923190030.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/24/1600x900/edgar-castrejon-zVNCNzQg30s-unsplash_1684923776119_1684923857489.jpg", "publishedAt": "2023-05-24T10:27:39Z", "content": null}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Letitia Dean Keto Gummies UK Reviews (London Scam Alert 2023) - Pros, Cons, Keto Gummies Letitia Dean United Kingdom Price and Customer Feedback!! - mid-day.com", "description": "Letitia Dean Keto Gummies Review", "url": "https://www.mid-day.com/brand-media/article/letitia-dean-keto-gummies-uk-reviews-pros-cons-keto-gummies--23288416", "urlToImage": "https://images.mid-day.com/images/images/2023/may/gummiessdfgyhdhjcvck_d.jpg", "publishedAt": "2023-05-24T10:18:00Z", "content": "Letitia Dean Keto Gummies Review\r\nLetitia Dean Keto Gummies Review: - When we start talking about weight loss there are few things that come to mind. The very first thing is dietary management becaus… [+14254 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Suchandrima Bhowmik", "title": "Esophageal cancer and alcohol: Link and risks explained - Medical News Today", "description": "Alcohol consumption is a major risk factor for various types of cancer, including esophageal cancer. Learn why.", "url": "https://www.medicalnewstoday.com/articles/esophageal-cancer-and-alcohol", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/04/Wine-Drinking-Night-732x549-Thumbnail.jpg", "publishedAt": "2023-05-24T10:10:16Z", "content": "Alcohol consumption is one of several factors that can increase the risk of esophageal cancer. \r\nEsophageal cancer is cancer of the esophagus, which is the tube that connects the throat and stomach.\r… [+6834 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Devi Poojari", "title": "Want Long Hair? Eat These Seven Hair-Friendly Foods - Slurrp", "description": "Hair, like skin, really defines the appearance of a person and while, having thick, lustrous hair is everyone’s goal, not many people are fortunate enough to be blessed naturally with it. Hence, including these foods in your diet are highly beneficial for hea…", "url": "https://www.slurrp.com/article/want-long-hair-eat-these-seven-hair-friendly-foods-1684921883069", "urlToImage": "https://images.slurrp.com/prodarticles/s924gaj8pup.webp", "publishedAt": "2023-05-24T10:03:55Z", "content": "Hair, like skin, really defines the appearance of a person and while, having thick, lustrous hair is everyones goal, not many people are fortunate enough to be blessed naturally with it. Hence, inclu… [+985 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Firstpost", "title": "Too hot to handle? These fruits could help keep you cool - Firstpost", "description": "The scorching summer is leaving people parched, dehydrated and prone to heat- strokes. In order to stay fit and refreshed, here’s a list of fruits that can help keep you cool", "url": "https://www.firstpost.com/web-stories/lifestyle/too-hot-to-handle-these-fruits-could-help-keep-you-cool-2252.html", "urlToImage": "https://images.news18.com/webstories/2023/05/cropped-1553f507ae736176e250efdc12c43b28.jpg", "publishedAt": "2023-05-24T09:28:11Z", "content": "Muskmelon is a good source of vitamin A, C, potassium, and magnesium."}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Is COVID-19 booster vaccination in early pregnancy associated with an increased risk of spontaneous abortion? - News-Medical.Net", "description": "Researchers studied the relationship between COVID-19 booster vaccination and spontaneous abortion.", "url": "https://www.news-medical.net/news/20230524/Is-COVID-19-booster-vaccination-in-early-pregnancy-associated-with-an-increased-risk-of-spontaneous-abortion.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749068_1684919643828435.jpg", "publishedAt": "2023-05-24T09:19:00Z", "content": "A recent study published in JAMA Network Open determined the relationship between coronavirus disease 2019 (COVID-19) booster vaccination in early pregnancy and spontaneous abortion.\r\nStudy: COVID-19… [+5390 chars]"}, {"source": {"id": null, "name": "Businessnewsthisweek.com"}, "author": "Neel Achary", "title": "Numen Health Partners With Aster Hospitals To Help Heart Patients Lead A Normal Life - Business News This Week", "description": "Stay connected with Business News This Week for business news, news this week, news headlines, business news, health, education, startups", "url": "http://businessnewsthisweek.com/health/numen-health-partners-with-aster-hospitals-to-help-heart-patients-lead-a-normal-life/", "urlToImage": null, "publishedAt": "2023-05-24T08:31:19Z", "content": "India, May 24, 2023: Numen Health, India’s largest Digital-First Heart Care platform today announced a partnership with Aster Hospitals to provide preventive and rehabilitative medical attention to p… [+3219 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ghee Or Butter? Nutritionist Reveals Which One Is Healthier - NDTV", "description": "Both ghee and butter offer several health benefits. However, should be used in different ways.", "url": "https://www.ndtv.com/health/ghee-or-butter-nutritionist-reveals-which-one-is-healthier-4061837", "urlToImage": "https://c.ndtvimg.com/2021-07/hbpb765_ghee_625x300_27_July_21.jpg", "publishedAt": "2023-05-24T08:29:37Z", "content": "Ghee is a good source of omega-3 fatty acids\r\nIt is always advised to consume adequate quantities of all macronutrients which include fats too. Now, butter and ghee are the most common form in which … [+2239 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "How poor sleep quality impacts brain’s cognitive performance? Expert answers - News9 LIVE", "description": "According to the expert, sticking to a sleep routine help improve memory of an individual", "url": "https://www.news9live.com/health/health-conditions/how-poor-sleep-quality-impacts-brains-cognitive-performance-expert-answers-2152874", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/01/sleep-disorder.jpg", "publishedAt": "2023-05-24T08:17:45Z", "content": "According to the expert, sticking to a sleep routine help improve memory of an individual\r\nDisturbed sleep patterns has been linked with several physical and mental health issues. While it can lead t… [+1809 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "Daily Pioneer", "title": "Ageing, population surge add to spike in back pain cases: Study - Daily Pioneer", "description": "Worldwide, the number of people suffering from back pain is on the increase with a study predicting the cases to spike to more than 840 million by 2050, a 36 per cent rise from 2020 largely due to population increase and the ageing of people, according to a s…", "url": "https://www.dailypioneer.com/2023/india/ageing--population-surge-add-to-spike-in-back-pain-cases--study.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2023-05-24T07:51:29Z", "content": "Worldwide, the number of people suffering from back pain is on the increase with a study predicting the cases to spike to more than 840 million by 2050, a 36 per cent rise from 2020 largely due to po… [+2953 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health And Lifestyle: Why nutrition is key on people living with HIV / AIDs | DAY BREAK - Citizen TV Kenya", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/watch?v=iEkt9gW5CHI", "urlToImage": null, "publishedAt": "2023-05-24T06:10:25Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Doctor suggests one miracle medicine for high blood pressure - Indiatimes.com", "description": "Here's one thing that can keep your blood pressure levels in order.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/doctor-suggests-one-miracle-medicine-for-high-blood-pressure/photostory/100444825.cms", "urlToImage": "https://static.toiimg.com/photo/100444840.cms", "publishedAt": "2023-05-24T05:30:00Z", "content": "High blood pressure, or hypertension, is a common health condition affecting millions of people worldwide. While medication can help control blood pressure, there's another, often-overlooked treatmen… [+692 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Oxygen restriction associated with longer lifespan in lab mice - News-Medical.Net", "description": "For the first time, researchers have shown that reduced oxygen intake, or \"oxygen restriction\", is associated with longer lifespan in lab mice, highlighting its anti-aging potential.", "url": "https://www.news-medical.net/news/20230524/Oxygen-restriction-associated-with-longer-lifespan-in-lab-mice.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/shutterstock_1028141632_649cad8889c647fc8d0bd83bf7503e08-620x480.jpg", "publishedAt": "2023-05-24T05:28:00Z", "content": "For the first time, researchers have shown that reduced oxygen intake, or \"oxygen restriction\", is associated with longer lifespan in lab mice, highlighting its anti-aging potential. Robert Rogers of… [+2615 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Know About The Health Benefits Of Ajwain - ABP Live", "description": "Owing to the abundance of essential oils, vitamins, minerals, and antioxidants in ajwain, in addition to its culinary usage, it also has a number of health advantages.", "url": "https://news.abplive.com/lifestyle/know-about-the-health-benefits-of-ajwain-1603921", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/24/0866ff8dc94f8d6015054a9becabeb1e1684905833593557_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-05-24T05:24:35Z", "content": "New Delhi: Popular spice ajwain, commonly referred to as carom seeds, is used in Indian cuisine and traditional medicine. It is renowned for its potent scent and peculiar flavour, which is similar to… [+2726 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "TB vaccine may have protective effect against Alzheimer's: Study - EastMojo", "description": "Treatment with the Bacillus Calmette-Guerin (BCG) vaccine which prevents tuberculosis is associated with a reduced risk of Alzheimer's disease and related dementias, according to a study.", "url": "http://www.eastmojo.com/health/2023/05/24/tb-vaccine-may-have-protective-effect-against-alzheimers-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2023/05/Untitled-design-6.jpg?fit=1920%2C1080&ssl=1", "publishedAt": "2023-05-24T03:10:00Z", "content": "New Delhi: Treatment with the Bacillus Calmette-Guerin (BCG) vaccine which prevents tuberculosis is associated with a reduced risk of Alzheimer’s disease and related dementias, according to a study.\r… [+3208 chars]"}, {"source": {"id": null, "name": "Mims.com"}, "author": "Audrey Abella", "title": "TAK-003 elicits cellular immune response against all dengue serotypes in paediatric cohort | Latest news for Doctors, Nurses and Pharmacists | Pharmacy - MIMS", "description": "TAK-003, a live-attenuated, recombinant tetravalent dengue vaccine covering all four dengue virus (DENV) strains, elicited a cell-mediated immune (CMI...", "url": "https://specialty.mims.com/topic/tak-003-elicits-cellular-immune-response-against-all-dengue-serotypes-in-paediatric-cohort", "urlToImage": "https://pubmiddleware.mims.com/resource/image/D9064BEC-F985-4C1A-90D7-B0040150A5A1/OriginalThumbnail/THUMBNAIL_DSC00103--.JPG", "publishedAt": "2023-05-24T02:35:58Z", "content": "TAK-003, a live-attenuated, recombinant tetravalent dengue vaccine covering all four dengue virus (DENV) strains, elicited a cell-mediated immune (CMI) response in healthy children and adolescents ag… [+4205 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "WHO launches global network to detect and prevent infectious disease threats - India Education Diary", "description": "WHO and partners are launching a global network to help protect people from infectious disease threats through the power of pathogen genomics. The International Pathogen Surveillance Network (IPSN) will provide a platform to connect countries and reg", "url": "https://indiaeducationdiary.in/who-launches-global-network-to-detect-and-prevent-infectious-disease-threats/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/04/who.jpg", "publishedAt": "2023-05-24T01:38:34Z", "content": "WHO and partners are launching a global network to help protect people from infectious disease threats through the power of pathogen genomics. The International Pathogen Surveillance Network (IPSN) w… [+4080 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Diabetes management: Eating habits that can lead to high blood sugar levels - msnNOW", "description": "Overeating eating when not hungry and heavy dinners can all over time cause diabetes", "url": "https://www.dnaindia.com/lifestyle/report-diabetes-management-eating-habits-that-can-lead-to-high-blood-sugar-levels-3044128", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1bBlhI.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-24T01:35:47Z", "content": "© Provided by DNADiabetes is a problem that develops as a result of an unhealthy diet and way of life. Although we are all aware that diabetes can be avoided by making wise decisions and leading a he… [+1780 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Raha Jamal", "title": "Hepatitis C and Cirrhosis link, progression and treatment - Sportskeeda", "description": "The link between hepatitis C and cirrhosis is a strong and well-established one. Hepatitis C is a viral infection that primarily targets the liver, leading to inflammation and damage over time.", "url": "https://www.sportskeeda.com/health-and-fitness/hepatitis-c-cirrhosis-link-progression-treatment", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/05/05af7-16848736571898-1920.jpg", "publishedAt": "2023-05-23T21:58:00Z", "content": "The link between hepatitis C and cirrhosis is a strong and well-established one. Hepatitis C is a viral infection that primarily targets the liver, leading to inflammation and damage over time. \r\nOne… [+3333 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Kristen Monaco", "title": "High-Quality Foster Care Protects Tots From Psychological Harms of Deprivation - Medpage Today", "description": "Kids had better cognition, psychopathology than those who remained in institutional care", "url": "https://www.medpagetoday.com/meetingcoverage/apa/104665", "urlToImage": "https://assets.medpagetoday.net/media/images/104xxx/104665.jpg", "publishedAt": "2023-05-23T21:12:10Z", "content": "SAN FRANCISCO -- Placement into foster care after institutional care may help protect young children against the psychological harms of early severe deprivation, according to an analysis of the Bucha… [+5888 chars]"}, {"source": {"id": null, "name": "NutraIngredients-usa.com"}, "author": "nutraingredients-asia.com", "title": "Omega-3 fatty acid lipid findings could be a game-changer in the aging brain - NutraIngredients-Asia", "description": "The new understanding could lead to the development of dietary supplements aimed at help mitigating the damaging effects of aging on the brain.", "url": "https://www.nutraingredients-usa.com/Article/2023/05/23/Omega-3-fatty-acid-lipid-findings-could-be-a-game-changer-in-the-aging-brain", "urlToImage": "https://www.nutraingredients-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-usa.com/article/2023/05/23/omega-3-fatty-acid-lipid-findings-could-be-a-game-changer-in-the-aging-brain/16438886-1-eng-GB/Omega-3-fatty-acid-lipid-findings-could-be-a-game-changer-in-the-aging-brain.jpg", "publishedAt": "2023-05-23T14:27:00Z", "content": "A new study carried out by researchers at Duke-NUS Medical School and the National University of Singapore recently discovered that Mfsd2a a major transporter for DHA uptake into brainplays a major r… [+2564 chars]"}, {"source": {"id": null, "name": "Reportinsight.biz"}, "author": "crediablemarket", "title": "Global Preeclampsia Diagnostics Market Analysis By Type of diagnostic tool , By Method of diagnosis, By End User, Trends, Dynamics, Size & Forecast 2023-2032 - Digital Journal", "description": "Global Preeclampsia Diagnostics Market In 2021, the market for Preeclampsia Diagnostics worldwide was worth $1.10 billion US dollars. AMR Group projects that the market will reach US$ 1.28 billion by", "url": "https://reportinsight.biz/health/global-preeclampsia-diagnostics-market-analysis-by-type-of-diagnostic-tool-by-method-of-diagnosis-by-end-user-trends-dynamics-size-forecast-2023-2032/", "urlToImage": "https://reportinsight.biz/wp-content/uploads/2023/05/Preeclampsia-Diagnostics-780x470.jpg", "publishedAt": "2023-05-23T12:47:00Z", "content": "Global Preeclampsia Diagnostics Market\r\nIn 2021, the market for Preeclampsia Diagnostics worldwide was worth $1.10 billion US dollars. AMR Group projects that the market will reach US$ 1.28 billion b… [+12805 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "https://www.cnbctv18.com", "title": "FSSAI to assess WHO's report against artificial sweetener, focuses on health impact - CNBCTV18", "description": "WHO, in its advisory released on May 15, cautioned against the use of artificial sweeteners as a substitute for sugar the purpose of controlling body weight or reducing the risk of non-communicable diseases. The organisation highlighted potential health conce…", "url": "https://www.cnbctv18.com/healthcare/fssai-to-assess-whos-report-on-artificial-sweetener-focuses-on-health-impact-16740151.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2023/05/shutterstock_1081128197-1019x573.jpg", "publishedAt": "2023-05-23T11:41:59Z", "content": "homehealthcare NewsFSSAI to assess WHO's report against artificial sweetener, focuses on health impact\r\nWHO, in its advisory released on May 15, cautioned against the use of artificial sweeteners as … [+1392 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Neha Yadav", "title": "5 Amazing Benefits Of Fresh Milk Cream - Hindustan Times", "description": "Here are some health benefits of fresh milk cream, also known as 'Malai' in Hindi", "url": "https://www.hindustantimes.com/web-stories/lifestyle/5-amazing-benefits-of-fresh-milk-cream-101684827092344.html", "urlToImage": null, "publishedAt": "2023-05-23T10:05:40Z", "content": "By Neha YadavPublished May 23, 2023\r\nHindustan TimesLifestylePhoto Credits: Pexels"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Sumi Sukanya Dutta", "title": "No Polio National Immunization Day this yr due to ‘vaccine shortage’. Govt to focus on high-risk areas - ThePrint", "description": "Govt to only organise Sub-National Immunization Days for 200 'high-risk' districts. Virologists say no major ramifications likely as India's has good routine vaccination track record.", "url": "https://theprint.in/health/no-polio-national-immunization-day-this-yr-due-to-vaccine-shortage-govt-to-focus-on-high-risk-areas/1589496/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/05/Polio-vaccine.png", "publishedAt": "2023-05-23T09:56:58Z", "content": "New Delhi:A shortage of oral polio vaccines has forced the Union government to cancel this year’s Polio National Immunization Day, ThePrint has learnt. Under the government’s flagship pulse polio imm… [+6429 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "Weight Loss: Can Lemon Water Help You Shed Extra Kilos? - Zee News", "description": "Everyone has probably heard that consuming lemon water may aid in weight loss and general health improvement. Continue reading to learn how to create lemon water to aid in weight reduction, if there is any medical support for these health and wellness claims,…", "url": "https://zeenews.india.com/health/weight-loss-can-lemon-water-help-you-shed-extra-kilos-2612072", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/05/23/1205895-lemon-water.png?im=FitAndFill=(1200,900)", "publishedAt": "2023-05-23T07:44:25Z", "content": "Weight loss drinks: Everyone has probably heard that consuming lemon water may aid in weight loss and general health improvement. Continue reading to learn how to create lemon water to aid in weight … [+3853 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Heatwave: 5 Foods You Should Eat While The Temperature Soars - msnNOW", "description": "Keep an eye on yourself to stay healthy as a heatwave is expected to hit India soon. Eat these 5 foods to keep your body cool this season.", "url": "https://zeenews.india.com/health/heatwave-5-foods-you-should-eat-while-the-temperature-soars-2612039", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1byxRW.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg&x=156&y=133", "publishedAt": "2023-05-23T07:05:08Z", "content": "© Provided by Zee News\r\nHeatwave in  India: During a severe heatwave that hit northern India last year, the temperature in some areas of the capital city, New Delhi, reached a record-breaking 49.2 de… [+2729 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "IANS", "title": "Woman can start undergoing regular mammography from this age | Lifestyle Women | English Manorama - Onmanorama", "description": "If detected timely in most cases breast cancer can also be cured. Doctors suggest that early detection is the key and that it can accelerate diagnosis and treatments.", "url": "https://www.onmanorama.com/lifestyle/women/2023/05/23/woman-start-undergoing-regular-mammography-from-this-age.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/lifestyle/women/images/2023/5/23/mammography-c.jpg", "publishedAt": "2023-05-23T06:54:16Z", "content": "New Delhi: Women should start getting regular mammograms at age 40 to prevent the risk of breast cancer, said doctors on Monday. This comes after the US Preventive Services Task Force (USPSTF), last … [+3405 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Editorial", "title": "Diet For Kids: How To Establish Healthy Eating Habits For Life - Slurrp", "description": "As parents, it is absolutely necessary to look after your child's health. This can be maintained by a well balanced diet and consuming healthy food. It is essential to establish healthy eating habits since early age. Thus, read to know the best diets for kids.", "url": "https://www.slurrp.com/article/diet-for-kids-how-to-establish-healthy-eating-habits-for-life-1684411549133", "urlToImage": "https://images.slurrp.com/prodarticles/p8ugukmu2k.webp", "publishedAt": "2023-05-23T05:18:14Z", "content": "The importance of diet for weight loss and health   \r\nRead More: 3 Easy Egg Recipes For Kids Tiffin \r\nWhat the best diet for kids is all about and the science behind it   \r\nA healthy diet for kids fo… [+5828 chars]"}]}