{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Reducing sodium intake can help patients with heart failure? Study says this - Hindustan Times", "description": "Though reducing salt intake does not lead to fewer emergency hospitalisations or deaths for patients with heart failure, the researchers did find an improvement in symptoms such as swelling, fatigue and coughing, as well as better overall better quality of li…", "url": "https://www.hindustantimes.com/lifestyle/health/reducing-sodium-intake-can-help-patients-with-heart-failure-heres-what-study-says-101649058776669.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/04/1600x900/salt_thumb_1636705817418_1649059667528.jpg", "publishedAt": "2022-04-04T08:10:04Z", "content": "A new study has explored how reducing sodium intake can help patients with heart failure.\r\nThe findings of the study were published in the journal, 'The Lancet'.\r\nThough reducing salt intake did not … [+2763 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Exercise could help reduce severity of serious cancer complication, finds study - ANI News", "description": "Greensboro [US], April 4 (ANI): Researchers have identified yet another benefit of keeping up the exercise routine. A recent study has found that exercising prior to developing cancer was associated with slower tumor growth and helped reduce the effects of a …", "url": "https://www.aninews.in/news/health/exercise-could-help-reduce-severity-of-serious-cancer-complication-finds-study20220404131244", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Capture202203170940502022032100273820220404072307-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-04T07:42:00Z", "content": "Greensboro [US], April 4 (ANI): Researchers have identified yet another benefit of keeping up the exercise routine. A recent study has found that exercising prior to developing cancer was associated … [+2273 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "IANS", "title": "New CRISPR technique in human blood to help find cure for HIV - Telangana Today", "description": "New CRISPR technique in human blood to help find cure for HIV", "url": "https://telanganatoday.com/new-crispr-technique-in-human-blood-to-help-find-cure-for-hiv", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/04/HIV.jpg", "publishedAt": "2022-04-04T07:31:14Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "New study sheds light on how people gained weight during COVID-19 pandemic - ANI News", "description": "Washington [US], April 4 (ANI): A new study has found that more people weighed in as obese during the first year of the COVID-19 pandemic than the previous year.", "url": "https://www.aninews.in/news/health/new-study-sheds-light-on-how-people-gained-weight-during-covid-19-pandemic20220404123713", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/obesiettty20210828095434202109111611392022021811482820220404065046-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-04T07:09:21Z", "content": "ANI | Updated: Apr 04, 2022 12:37 IST\r\nWashington [US], April 4 (ANI): A new study has found that more people weighed in as obese during the first year of the COVID-19pandemic than the previous year.… [+2639 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "COVID-19 Infection Raised Risk of Heart Problems More Than mRNA-Based Vaccine: CDC | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "These findings, which were for both males and females in all age groups, supported the continued use of recommended mRNA COVID-19 vaccines. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-04-04-covid-infection-raised-risk-of-heart-problems-more-than-vaccine", "urlToImage": "https://s.w-x.co/in-vaccine_29.jpg", "publishedAt": "2022-04-04T05:19:23Z", "content": "The risk for cardiac complications was significantly higher after COVID-19 infection than after mRNA vaccination developed by Pfizer or Moderna against the deadly infectious disease, according to an … [+2260 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Want to eat guilt free? Take a look at these light foods - Play Crazy Game", "description": "If you're on a new diet that somehow restricts the amount of food you can eat, you know it's not easy to stay in line. Starving yourself is not recommended on any diet, after all, if you don't eat enough to sustain yourself you can end up making your health w…", "url": "https://playcrazygame.com/2022/04/04/want-to-eat-guilt-free-take-a-look-at-these-light-foods/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/03/frango.jpg", "publishedAt": "2022-04-04T04:59:59Z", "content": "If you’re on a new diet that somehow restricts the amount of food you can eat, you know it’s not easy to stay in line. Starving yourself is not recommended on any diet, after all, if you don’t eat en… [+2347 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Addiction to Online Streaming Affects Health; Experts Advise Balance - Sentinelassam - The Sentinel Assam", "description": "Other behavioural changes include increased dependence of caffeinated drinks and sometimes...", "url": "https://www.sentinelassam.com/life/addiction-to-online-streaming-affects-health-experts-advise-balance-585915", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/04/04/332052-binge-watching.jpg", "publishedAt": "2022-04-04T04:37:35Z", "content": "Rahul (name changed), a 23-year-old Delhi-based working professional, loved the online streaming services. It gave him the ease of watching premium original content from his couch, all for a yearly p… [+5111 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How to Avoid Risk of Headaches While Following the Keto Diet? - News18", "description": "Headache is a common symptom observed by those consuming keto diets. Also known as keto headache, it becomes a constant cause of worry for the first few weeks with the dieters.", "url": "https://www.news18.com/news/lifestyle/how-to-avoid-risk-of-headaches-while-following-the-keto-diet-4936160.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/protein-day-2022-2-164587346016x9.jpg", "publishedAt": "2022-04-04T04:30:47Z", "content": "The journey of losing weight is not easy. With work from home becoming our new normal, the sedentary lifestyle has once again found its way into our lives and has made us all bit lazy. Our physical m… [+2551 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "My five-year-old is now eligible for a COVID vaccine – should I get them immunised? - Devdiscourse", "description": "This risk far outweighed by the potential for adverse effects from the virus, including more severe and long-lasting heart inflammation stemming from infection.Much like a seatbelt, in the rare event that its needed to stave off the worst, Id much rather my c…", "url": "https://www.devdiscourse.com/article/health/1989307-my-five-year-old-is-now-eligible-for-a-covid-vaccine---should-i-get-them-immunised", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/20_11_2021_15_42_13_4150567.jpg?width=920&format=jpeg", "publishedAt": "2022-04-04T04:05:12Z", "content": "Since 2020, we've heard that COVID is mainly a problem for the elderly or vulnerable. Vaccines have dramatically improved their protection against the disease, but children and younger people – becau… [+4893 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Kevin Kunzmann", "title": "Rivaroxaban Benefits LER Patients Safely Regardless of Chronic Kidney Disease - MD Magazine", "description": "VOYAGER PAD subgroup analyses showed the anticoagulant reduced likelihood of hospitalization without increasing bleeding risk in patients with CKD.", "url": "https://www.hcplive.com/view/rivaroxaban-benefits-ler-patients-safely-chronic-kidney-disease", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/4234007874376ea88a7343def8b8918805e62ad3-620x618.png?fit=crop&auto=format", "publishedAt": "2022-04-04T03:32:29Z", "content": "A subgroup analysis from the VOYAGER PAD trial showed anticoagulant rivaroxaban (Xarelto) was associated with reduced coronary or peripheral events resulting hospitalization among patients with recen… [+2022 chars]"}, {"source": {"id": null, "name": "Thelatch.com.au"}, "author": "Jack Revell", "title": "Can You Be Immune to COVID? Why Some Will Never Catch It - The Latch", "description": "Scientists have long suspected that there are some people who are naturally immune to COVID. They appear to have genetic qualities that make their immune systems particularly adept at fighting the SARS-COV-2 virus.", "url": "https://thelatch.com.au/can-you-be-immune-to-covid/", "urlToImage": "https://thelatch.com.au/wp-content/uploads/2021/12/rapid-antigen-tests-free-australia-1-1200x630.jpg", "publishedAt": "2022-04-04T03:03:51Z", "content": "If you’ve yet to catch COVID-19, over two years into the pandemic that has swept the world, you may well be one of the rare people who are naturally immune to the disease.\r\nEither that or, as one Kor… [+5057 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Experimental heart failure drug does not improve exercise capacity in HFrEF patients - News-Medical.Net", "description": "Patients with heart failure with reduced ejection fraction (HFrEF) did not experience any improvement in their ability to exercise vigorously after taking the experimental heart failure drug omecamtiv mecarbil, in a study presented at the American College of …", "url": "https://www.news-medical.net/news/20220403/Experimental-heart-failure-drug-does-not-improve-exercise-capacity-in-HFrEF-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/87802400-620x480.jpg", "publishedAt": "2022-04-04T01:21:00Z", "content": "Patients with heart failure with reduced ejection fraction (HFrEF) did not experience any improvement in their ability to exercise vigorously after taking the experimental heart failure drug omecamti… [+4011 chars]"}, {"source": {"id": null, "name": "Centralrecorder.com"}, "author": null, "title": "Idea that the odd alcoholic drink is good for heart 'is a MYTH and should not be promoted' - Central Recorder", "description": "THE idea that the odd tipple is good for the heart is a myth and should not be promoted, scientists have warned.", "url": "https://centralrecorder.com/idea-that-the-odd-alcoholic-drink-is-good-for-heart-is-a-myth-and-should-not-be-promoted/", "urlToImage": "https://centralrecorder.com/wp-admin/admin-ajax.php?action=rank_math_overlay_thumb&id=92134&type=play", "publishedAt": "2022-04-04T01:18:55Z", "content": "THE idea that the odd tipple is good for the heart is a myth and should not be promoted, scientists have warned.\r\nEven drinking within current health guidelines increases the risk of cardiovascular d… [+761 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Quit smoking: It may kill your chances of surviving a heart attack - Times Now", "description": "The study has also found that levels of Alpha-1 Anti Trypsin (A1AT)--a protein in the liver that protects the body's tissues--in smokers were 'significantly less' than in non-smokers.", "url": "https://www.timesnownews.com/health/quit-smoking-it-may-kill-your-chances-of-surviving-a-heart-attack-article-90631035", "urlToImage": "https://static.tnn.in/thumb/msid-90631035,imgsize-100,width-1280,height-720,resizemode-75/90631035.jpg", "publishedAt": "2022-04-04T00:49:00Z", "content": "Post-merger HDFC, HDFC bank could be India's 2nd largest company, beats TCS in m-cap"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The effect of COVID-19 on the lung function of young adults - News-Medical.Net", "description": "Researchers evaluate whether SARS-CoV-2 infection has a negative impact on lung function in young adults who experienced mild to moderate COVID-19.", "url": "https://www.news-medical.net/news/20220403/The-effect-of-COVID-19-on-the-lung-function-of-young-adults.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_709493_16490242825213262.jpg", "publishedAt": "2022-04-03T23:59:00Z", "content": "A reduced diffusion capacity in the pulmonary function of patients who have experienced severe coronavirus disease 2019 (COVID-19) has been widely reported, which has contributed to some of the sever… [+5490 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Mutations in Noncoding DNA Are Found to Protect the Brain From ALS - Neuroscience News", "description": "Mutations in the IL18RAP gene reduce inflammation and appears to protect the brain against ALS.", "url": "https://neurosciencenews.com/genetics-als-neuroprotection-20304/", "urlToImage": "https://neurosciencenews.com/files/2022/04/dna-als-neurosicnes-public.jpg", "publishedAt": "2022-04-03T23:24:03Z", "content": "Summary: Mutations in the IL18RAP gene reduce inflammation and appear to protect the brain against ALS.\r\nSource: Weizmann Institute of Science\r\nGenetic mutations linked to a disease often spell bad n… [+6221 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Ask a Doctor: Is There a Way to Help Prevent or Reverse Diabetes? - The Epoch Times", "description": "You have a tremendous power over how disease progresses or regresses in your body. If you're facing diabetes, these steps can make all the difference.", "url": "https://www.theepochtimes.com/ask-a-doctor-is-there-a-way-to-help-prevent-or-reverse-diabetes_4365490.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/03/15/shutterstock_1033367926.jpg", "publishedAt": "2022-04-03T20:00:38Z", "content": "Have you had a pre-diabetes scare? Are you looking to turn your health around before its too late? If so, you know better than anyone how scary it can be to hear that your blood sugar is dangerously … [+8227 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "High cholesterol? 6 foods you can’t miss on your shopping list - Play Crazy Game", "description": "O cholesterol high is an evil that afflicts many people around the world. And, as much as doctors prescribe medication and patients always take the pills in the correct amount and time, there is no better way to control cholesterol than maintaining an exercis…", "url": "https://playcrazygame.com/2022/04/04/high-cholesterol-6-foods-you-cant-miss-on-your-shopping-list/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/03/chocolate.jpg", "publishedAt": "2022-04-03T19:52:37Z", "content": "O cholesterol high is an evil that afflicts many people around the world. And, as much as doctors prescribe medication and patients always take the pills in the correct amount and time, there is no b… [+2482 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Cardamonin shows promise for treating aggressive breast cancer - Medical Xpress", "description": "Cardamonin—a natural compound found in the spice cardamom and other plants—could have therapeutic potential for triple-negative breast cancer, according to a new study using human cancer cells. The findings also show that the compound targets a gene that help…", "url": "https://medicalxpress.com/news/2022-04-cardamonin-aggressive-breast-cancer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/cardamonin-shows-promi.jpg", "publishedAt": "2022-04-03T18:20:14Z", "content": "Cardamonina natural compound found in the spice cardamom and other plantscould have therapeutic potential for triple-negative breast cancer, according to a new study using human cancer cells. The fin… [+3502 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Harjinder", "title": "Avocados may lower risk of cardiovascular disease: Study - DTNEXT", "description": "The study was published in 'Journal of the American Heart Association'. Avocados contain dietary fibre, unsaturated fats especially monounsaturated fat (healthy fats) and other favourable components that have been associated with good cardiovascular health.", "url": "https://www.dtnext.in/amp/Lifestyle/Wellbeing/2022/04/03222516/1360957/Avocados-may-lower-risk-of-cardiovascular-disease-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2022/Apr/202204032225161545_Avocados-may-lower-risk-of-cardiovascular-disease-Study_SECVPF.gif", "publishedAt": "2022-04-03T17:49:14Z", "content": "The study was published in 'Journal of the American Heart Association'. Avocados contain dietary fibre, unsaturated fats especially monounsaturated fat (healthy fats) and other favourable components … [+4141 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Research suggests bats host most virulent zoonotic viruses, though not most dangerous ones - ThePrint", "description": "Washington [US], April 3 (ANI): Researchers studying zoonotic viral risks across animal reservoirs have found that bats host the most virulent viruses but not always the most dangerous ones. A study of statistical trends in case fatality rates, transmission c…", "url": "https://theprint.in/science/research-suggests-bats-host-most-virulent-zoonotic-viruses-though-not-most-dangerous-ones/901057/", "urlToImage": null, "publishedAt": "2022-04-03T16:30:47Z", "content": "Washington [US], April 3 (ANI): Researchers studying zoonotic viral risks across animal reservoirs have found that bats host the most virulent viruses but not always the most dangerous ones.\r\nA study… [+1339 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Alzheimer’s: these are the 3 metabolic warning signs at 35 that you should pay attention to - Code List", "description": "Alzheimer's accounts for 70% of the more than 50 million people who suffer from it. dementia, according to the World Health Organization. Consequently, it is the first type of mental diseases that can develop once dementia begins, therefore it is likely that …", "url": "https://codelist.biz/2022/04/03/alzheimers-these-are-the-3-metabolic-warning-signs-at-35-that-you-should-pay-attention-to/", "urlToImage": "https://www.terra.com.mx/u/fotografias/m/2022/4/1/f1280x720-36820_168495_5050.png", "publishedAt": "2022-04-03T16:29:46Z", "content": "Alzheimer’s accounts for 70% of the more than 50 million people who suffer from it. dementia, according to the World Health Organization. Consequently, it is the first type of mental diseases that ca… [+1931 chars]"}, {"source": {"id": null, "name": "Flipboard.com"}, "author": "LIVESTRONG.COM", "title": "The 6 Best Types of Exercise to Reduce Inflammation - Flipboard", "description": "Chronic inflammation is kryptonite for your health. It's been linked to a host of conditions like type 2 diabetes, cancer and heart disease. But get this: The right types of exercise reduce inflammation.", "url": "https://flipboard.com/@livestrong/the-6-best-types-of-exercise-to-reduce-inflammation-kblnulmb76untdul", "urlToImage": "https://ic-cdn.flipboard.com/flipboard.com/21f24cb94a015b49538604ffa73479962985380f/_medium.jpeg", "publishedAt": "2022-04-03T16:10:44Z", "content": "Chronic inflammation is kryptonite for your health. It's been linked to a host of conditions like type 2 diabetes, cancer and heart disease. But get this: The right types of exercise reduce inflammat… [+3 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Eating Habits You Think Are Healthy But Could Be Harmful – 01/04/2022 - Play Crazy Game", "description": "Everyone knows and it's true: eating vegetables, reducing sugar intake and exercising regularly are healthy habits. In fact, they are among the practices recommended by the WHO (World Health Organization) to increase the quality — and the expectation — of lif…", "url": "https://playcrazygame.com/2022/04/03/eating-habits-you-think-are-healthy-but-could-be-harmful-01-04-2022-2/", "urlToImage": "https://conteudo.imguol.com.br/c/entretenimento/95/2022/03/31/habito-saudavel-alimentacao-low-carb-suco-verde-mulher-comendo-1648754103966_v2_615x300.jpg", "publishedAt": "2022-04-03T15:15:00Z", "content": "Everyone knows and it’s true: eating vegetables, reducing sugar intake and exercising regularly are healthy habits. In fact, they are among the practices recommended by the WHO (World Health Organiza… [+8088 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Zoe Weiner", "title": "The Plant-Based Fat That Can Help You Live Longer Is Also Great for Strengthening Your Skin Barrier - Well+Good", "description": "Dermatologists reveal six linoleic acid skin benefits, and explain why the ingredient is great for strangthening the skin barrier.", "url": "https://www.wellandgood.com/linoleic-acid-skin-benefits/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/04/GettyImages-1327623672.jpg", "publishedAt": "2022-04-03T15:08:00Z", "content": null}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Clara Olshansky", "title": "These Popular Drinks May Increase Cancer Risk, New Study Suggests — Eat This Not That - Eat This, Not That", "description": "There are some drinks that are better than others when it comes to preventing cancer. A new study shows the correlation.", "url": "http://www.eatthis.com/news-drinks-increase-cancer-risk/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/02/energy-drinks.jpg?quality=82&strip=all", "publishedAt": "2022-04-03T15:00:53Z", "content": "If you're grabbing a beverage on the go, unless you're specifically looking for organic or all-natural options, odds are you're going to end up drinking something with at least some ingredients you d… [+2608 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "Virus Experts Warn This Could Happen Next — Eat This Not That - Eat This, Not That", "description": "It's been two years since COVID-19 was declared a global pandemic and it looks like the virus is here to stay for the time being.", "url": "http://www.eatthis.com/news-this-could-happen-next-covid/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/08/hospital-doctors-nurse-statistics.jpg?quality=82&strip=all", "publishedAt": "2022-04-03T14:01:52Z", "content": "It's been two years since the World Health Organization declared COVID-19 a global pandemic and it looks like the virus is here to stay for the time being, according to experts. While COVID has prove… [+5279 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Robert Preidt", "title": "When Diabetes Strikes, Eye Exams Can Save Your Sight - HealthDay News", "description": "SUNDAY, April 3, 2022 (HealthDay News) -- Could an annual eye exam save your sight if you have diabetes? Most definitely, one vision expert says.\"Diabetes is known to alter the health of the blood vessels in the retina and these vascular changes do not cause …", "url": "https://consumer.healthday.com/b-4-3-diabetes-2657025557.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNzgxMTMwOS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3NTkzNDA2Mn0.uYwUnN_Y_FguyVHGfxGe0dq9pciGKHZ2t-oQ0buo7V8/image.jpg?width=1200&coordinates=0%2C64%2C0%2C64&height=600", "publishedAt": "2022-04-03T13:02:03Z", "content": "SUNDAY, April 3, 2022 (HealthDay News) -- Could an annual eye exam save your sight if you have diabetes? Most definitely, one vision expert says.\r\n\"Diabetes is known to alter the health of the blood … [+2572 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Do you have flu or Covid-19? How to find out, risks involved. WHO answers - Mint", "description": "Both viruses share similar symptoms, including cough, runny nose, sore throat, fever, headache and fatigue. But people may have varying levels of illness with both COVID-19 and influenza.", "url": "https://www.livemint.com/science/health/do-you-have-flu-or-covid-19-how-to-find-out-risks-involved-who-answers-11648982041249.html", "urlToImage": "https://images.livemint.com/img/2022/04/03/600x338/Hong_Kong_1646828384391_1648984066334.jpg", "publishedAt": "2022-04-03T11:08:59Z", "content": "How would you know if you have flu or COVID-19? Should you take both flu vaccine and COVID-19 vaccineif these are available to you? All these questions may bother you in these times when you are unsu… [+4363 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Increased Blood Fat Levels in Type 2 Diabetic Patients More Harmful Than Previous Beliefs: Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "In patients with metabolic diseases, elevated fat levels in the blood create stress in muscle cells. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/health/news/2022-04-03-increased-blood-fat-levels-in-type-2-diabetic-patients-more-harmful", "urlToImage": "https://s.w-x.co/in-diabetes_0.jpg", "publishedAt": "2022-04-03T10:47:07Z", "content": "A new study has found that increased levels of blood fats, also known as lipids, in people with Type 2 diabetes and obesity are more harmful than previously thought.\r\nIn patients with metabolic disea… [+2266 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Lack of sleep may increase unhealthy abdominal fat: Study - Times of India", "description": "Researchers from Mayo Clinic have found that lack of sleep and free access to food increases calorie consumption and fat accumulation, especially inside the belly. The findings of the research were published in the 'Journal of the American College of Cardiolo…", "url": "https://timesofindia.indiatimes.com/videos/news/lack-of-sleep-may-increase-unhealthy-abdominal-fat-study/videoshow/90623525.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90623525,imgsize-35172.cms", "publishedAt": "2022-04-03T10:22:39Z", "content": "Apr 03, 2022, 03:52PM ISTSource: ANIResearchers from Mayo Clinic have found that lack of sleep and free access to food increases calorie consumption and fat accumulation, especially inside the belly.… [+486 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Suffering from irritable bowel syndrome? Avoid these foods, consume these - Hindustan Times", "description": "Diet, like any other health issue, is the key to managing irritable bowel syndrome. While certain food items can help you keep the symptoms under control, others can aggravate the pain further. Check this list to know which foods to consume and which to avoid…", "url": "https://www.hindustantimes.com/lifestyle/health/suffering-from-irritable-bowel-syndrome-avoid-these-foods-consume-these-101648979132266.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/03/1600x900/constipation-6655333_960_720_1648980583168_1648980614629.jpg", "publishedAt": "2022-04-03T10:12:14Z", "content": "According to WebMD, irritable bowel syndrome or IBS is a mix of belly discomfort or pain and trouble with bowel habits: either going more or less often than normal (diarrhoea or constipation) or havi… [+4756 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Brain damage in infants can be prevented by stabilizing blood sugar level: Study - ANI News", "description": "Washington [US], April 3 (ANI): The treatment of low blood sugar in infancy can ward off long-term brain damage in infants, according to a recent clinical study.", "url": "https://www.aninews.in/news/science/brain-damage-in-infants-can-be-prevented-by-stabilizing-blood-sugar-level-study20220403154212", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/fffffffffffffffeasrwerwer666666666662022040309475920220403100850-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-03T10:12:00Z", "content": "ANI | Updated: Apr 03, 2022 15:42 IST\r\nWashington [US], April 3 (ANI): The treatment of low blood sugar in infancy can ward off long-term brain damage in infants, according to a recent clinical study… [+3074 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Explained: How COVID-19 causes severe brain inflammation and neuronal damage - News9 LIVE", "description": "Researchers have now discovered severe brain inflammation and injury, including cell destruction and ...", "url": "https://www.news9live.com/health/covid-19/explained-how-covid-19-causes-severe-brain-inflammation-and-neuronal-damage-162563", "urlToImage": "https://media.news9live.com/h-upload/2022/04/03/272286-webf070219ns14-1024x64011zon.jpg", "publishedAt": "2022-04-03T09:40:26Z", "content": "Patients who have had COVID-19 frequently complain of headaches, confusion, and other neurological symptoms. However, doctors are not sure how the disease targets the brain during infection. But now,… [+1327 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Fitness experts reveal effects of PCOS on skin, hair health - Hindustan Times", "description": "Polycystic Ovary Syndrome is the most common hormonal disturbance and women with PCOS often face unique challenges with their skin and hair health which leads to depression and lack of confidence. Health experts share a few skin and hair issues linked to PCOS…", "url": "https://www.hindustantimes.com/lifestyle/health/fitness-experts-reveal-effects-of-pcos-on-skin-hair-health-101648782657776.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/01/1600x900/dermatologist-g39caa2cda_1280_1648783292601_1648783309715.png", "publishedAt": "2022-04-03T08:58:00Z", "content": "Polycystic Ovary Syndrome (PCOS) is one of the most common endocrine disorders among women of reproductive age that affects at least one in every 10 women in India and its symptoms include missed, ir… [+5421 chars]"}, {"source": {"id": null, "name": "Amp.dev"}, "author": null, "title": "Exercise may reduce depression, boost effects of therapy, says study - PTC News", "description": "Exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and increase the benefits of therapy, according to a new study led published in the journal, 'Frontiers In Psychiatry'.", "url": "https://amp.dev/documentation/guides-and-tutorials/start/create/basic_markup/", "urlToImage": "https://ptcnews-wp.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/04/Exercise-benefits-people-with-depression-1.jpg", "publishedAt": "2022-04-03T08:10:36Z", "content": "Washington, April 3: Exercising for half an hour may reduce symptoms of depression for at least 75 minutes post-workout and increase the benefits of therapy, according to a new study led published in… [+2538 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "A new drug multiplies survival in women with metastatic breast cancer - Code List", "description": "In the history of small accumulated victories, which is the fight against cancer, trastuzumab is an example of ingenuity. Team from the International Breast Cancer Center (IBCC) in Barcelona that has led the new study. Photo: The Country of Spain. The Destiny…", "url": "https://codelist.biz/2022/04/03/a-new-drug-multiplies-survival-in-women-with-metastatic-breast-cancer/", "urlToImage": "https://medicinaysaludpublica.blob.core.windows.net.optimalcdn.com/images/2022/04/01/sacs-5-cda907b3-focus-0-0-688-364-e58ab36e.jpg", "publishedAt": "2022-04-03T06:56:40Z", "content": "In the history of small accumulated victories, which is the fight against cancer, trastuzumab is an example of ingenuity.\r\n Team from the International Breast Cancer Center (IBCC) in Barcelona that h… [+2727 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Quinoa to Curd: 5 Things Vegetarians Must Add In Their Diet - India.com", "description": "What people don’t realise is that vegetarians have a lot of protein enriched food items too. Their nutritional content is usually higher and affordable.", "url": "https://www.india.com/health/quinoa-to-curd-5-things-vegetarians-must-add-in-their-diet-5317074/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/04/pjimage-2022-04-03T101826.776.jpg", "publishedAt": "2022-04-03T04:49:55Z", "content": "A lot of people believe that vegetarians are losing out protein as their choices are very limited. For non-vegetarians, their major source of protein is chicken, salmon and eggs. What people dont rea… [+1410 chars]"}, {"source": {"id": null, "name": "Eastafricanewspost.com"}, "author": "Phyllis Ward", "title": "The continued increase in the rate of positivity for COVID-19 puts it this Saturday at 7.25%. - East Africa News Post", "description": "For the seventh day in a row, it was a positive rate COVID-19 In Puerto Rico, its percentage rose to 7.25% today, Saturday, according to the Ministry of", "url": "https://www.eastafricanewspost.com/the-continued-increase-in-the-rate-of-positivity-for-covid-19-puts-it-this-saturday-at-7-25/", "urlToImage": null, "publishedAt": "2022-04-03T03:25:56Z", "content": "For the seventh day in a row, it was a positive rate COVID-19 In Puerto Rico, its percentage rose to 7.25% today, Saturday, according to the Ministry of Health.\r\nThis percentage indicates that the le… [+2776 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Boost immune system: Eat more oily fish and reduce added sugar or saturated fat - Verve Times", "description": "Immunologist Doctor Jenna Macciochi, on behalf of Berocca spoke exclusively with Express.co.uk to offer her tips when it comes to the best and worst foods for keeping your immunity strong no matter the season.Your immune system is your greatest healt", "url": "https://vervetimes.com/boost-immune-system-eat-more-oily-fish-and-reduce-added-sugar-or-saturated-fat/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1590070.jpg", "publishedAt": "2022-04-03T03:14:04Z", "content": "Immunologist Doctor Jenna Macciochi, on behalf of Berocca spoke exclusively with Express.co.uk to offer her tips when it comes to the best and worst foods for keeping your immunity strong no matter t… [+1300 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David R Clark et al., The Conversation", "title": "Why You Don't Need to Feel Sore After a Workout to Know if You've Exercised Enough - ScienceAlert", "description": "\"No pain, no gain\" is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you've done enough.", "url": "https://www.sciencealert.com/why-you-don-t-need-to-feel-sore-a-workout-to-know-if-you-ve-exercised-enough", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/PersonDeadLiftsWeights_1024.jpg", "publishedAt": "2022-04-03T03:01:08Z", "content": "\"No pain, no gain\" is a commonly used expression when it comes to getting in shape. It may also be why many of us think that you need to feel sore after a workout to know that you've done enough.\r\nTh… [+4676 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Eating prunes every day may reduce pro-inflammatory mediators in postmenopausal women - News-Medical.Net", "description": "A study in postmenopausal people suggests eating nutrient-rich prunes every day may be beneficial to bone health, reducing inflammatory factors that contribute to osteoporosis.", "url": "https://www.news-medical.net/news/20220402/Eating-prunes-every-day-may-reduce-pro-inflammatory-mediators-in-postmenopausal-women.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/spine-620x480.jpg", "publishedAt": "2022-04-03T00:52:00Z", "content": "A study in postmenopausal people suggests eating nutrient-rich prunes every day may be beneficial to bone health, reducing inflammatory factors that contribute to osteoporosis. The research will be p… [+1946 chars]"}, {"source": {"id": null, "name": "Zyri.net"}, "author": "Zyri", "title": "Influenza Virus: Flu vaccination begins in the region - Zyri", "description": "The Ministry of Health of the province of Buenos Aires announced that as of the first Monday of April, the flu vaccination 2022 for pregnant people, boys and girls from 6 to 24 months of age. Also to those between 24 and 36 months who present risk factors. Th…", "url": "https://www.zyri.net/2022/04/02/influenza-virus-flu-vaccination-begins-in-the-region/", "urlToImage": "https://tn.com.ar/resizer/GuXDC4zNB-Bos_9v7uaDbuoTdyw=/1023x0/smart/filters:quality(60)/cloudfront-us-east-1.images.arcpublishing.com/artear/O4UIIGKJ2ZEOJJDDHWJF5BDCCQ.jpg", "publishedAt": "2022-04-02T23:17:05Z", "content": "The Ministry of Health of the province of Buenos Aires announced that as of the first Monday of April, theflu vaccination 2022 for pregnant people, boys and girls from 6 to 24 months of age. Also to … [+2872 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": "Kuldeep Singh", "title": "What makes Alzheimer’s patients drowsy? - Revyuh", "description": "Extreme drowsiness during the day is a common sign of Alzheimer's disease, but what causes it? We now have an answer thanks to a recent study. Even after", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/what-makes-alzheimers-patients-drowsy/", "urlToImage": "https://653015-2129923-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/04/What-makes-Alzheimers-patients-drowsy.jpg", "publishedAt": "2022-04-02T23:15:13Z", "content": "Extreme drowsiness during the day is a common sign of Alzheimer’s disease, but what causes it? We now have an answer thanks to a recent study.\r\nEven after a full night’s sleep, many persons with Alzh… [+3678 chars]"}, {"source": {"id": null, "name": "Neurologylive.com"}, "author": "Matt Hoffman", "title": "SAGE-718 Demonstrates Safety, Signs of Improvement in Phase 2 Alzheimer Disease Study - Neurology Live", "description": "Sage Therapeutics’ investigational NMDA receptor positive allosteric modulator was well-tolerated, with signs of cognitive and functional improvements reported for patients with AD in the phase 2 LUMINARY study.", "url": "https://www.neurologylive.com/view/sage-718-demonstrates-safety-improvement-phase-2-alzheimer-disease-study", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/neurolive/68dd9993297c50393f3eef388c0b83e3e6a8e00d-300x300.png?fit=crop&auto=format", "publishedAt": "2022-04-02T22:59:59Z", "content": "According to data presented at the 2022 American Academy of Neurology (AAN) Annual Meeting, April 2-7, in Seattle, Washington, the investigational SAGE-718, a first-in-class positive allosteric modul… [+6035 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Patrice Wendling and Catherine Hackett", "title": "POISE-3 Backs Wider Use of TXA in Noncardiac Surgery - Medscape", "description": "", "url": "https://www.medscape.com/viewarticle/971483", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_190128_surgeon_operation_800x450.jpg", "publishedAt": "2022-04-02T22:43:21Z", "content": "The antifibrinolytic tranexamic acid (TXA) reduced serious bleeding without a significant effect on major vascular outcomes in patients undergoing noncardiac surgery at risk for these complications i… [+8861 chars]"}, {"source": {"id": null, "name": "Dicksonpost.com"}, "author": "MOHSEN HASANIN, M.D", "title": "New guidelines could help prevent colon cancer in younger patients - Dickson Post", "description": "Colon cancer is the third-most common type of cancer and the third-leading cause of cancer death in both men and women, but it doesn’t have to be. As a gastroenterologist,", "url": "https://www.dicksonpost.com/lifestyles/new-guidelines-could-help-prevent-colon-cancer-in-younger-patients/article_e8393470-abd6-11ec-9848-6f1238d704b2.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/dicksonpost.com/content/tncms/assets/v3/editorial/a/7a/a7a6e028-abd7-11ec-bc11-e763b9c00a84/623d15780bd53.image.jpg?crop=1288%2C676%2C0%2C466&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2022-04-02T20:30:00Z", "content": "Colon cancer is the third-most common type of cancer and the third-leading cause of cancer death in both men and women, but it doesnt have to be. As a gastroenterologist, I believe colonoscopies are … [+2351 chars]"}, {"source": {"id": null, "name": "D1softballnews.com"}, "author": "Zach", "title": "A study explains why people with allergic asthma are less susceptible to severe COVID-19 - D1SoftballNews.com", "description": "Researchers at the University of North Carolina at Chapel Hill in the United States have revealed the biological reasons for how COVID-19 progresses and why a certain population of asthma patients is", "url": "https://d1softballnews.com/a-study-explains-why-people-with-allergic-asthma-are-less-susceptible-to-severe-covid-19/", "urlToImage": "https://images2.listindiario.com/n/content/716/715563/p/680x460/202204021703061.png", "publishedAt": "2022-04-02T19:40:12Z", "content": "Researchers at the University of North Carolina at Chapel Hill in the United States have revealed the biological reasons for how COVID-19 progresses and why a certain population of asthma patients is… [+4978 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Diltiazem not effective in patients with angina, nonobstructive CAD - Healio", "description": "WASHINGTON &mdash; In the first randomized trial of a therapy for treatment of patients with angina and nonobstructive CAD, diltiazem did not improve coronary vasomotor dysfunction compared with placebo. For the EDIT-CMD trial, researchers randomly assigned 8…", "url": "https://www.healio.com/news/cardiology/20220402/diltiazem-not-effective-in-patients-with-angina-nonobstructive-cad", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/fm_im/w/woman-with-heart-attack_adobe.jpeg", "publishedAt": "2022-04-02T19:37:21Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nWASHINGTON — In the first randomized tri… [+5941 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "WHO warns of pandemic in-waiting - Daily Pioneer", "description": "Even as several pockets of the world continue to reel under the variants of the Coronavirus, the World Health Organisation (WHO) has now warned of another pandemic in-waiting, this time to be caused by the Arboviruses like Zika, yellow fever, Chikungunya and …", "url": "https://www.dailypioneer.com/2022/india/who-warns-of-pandemic-in-waiting.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-04-02T19:22:44Z", "content": "Even as several pockets of the world continue to reel under the variants of the Coronavirus, the World Health Organisation (WHO) has now warned of another pandemic in-waiting, this time to be caused … [+3224 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Y. Lee", "title": "Tweet Claims Vitamin D Deficiency Is ‘One Of The More Serious Issues Of Our Time’ - Forbes", "description": "\"Vitamin D\" was trending on Twitter, after a Twitterer claimed that Vitamin D deficiency is overlooked. Here was the response.", "url": "https://www.forbes.com/sites/brucelee/2022/04/02/tweet-claims-vitamin-d-deficiency-is-one-of-the-more-serious-issues-of-our-time/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62488dcd1b7085e94f7fe7c1/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-04-02T18:09:36Z", "content": "\"Vitamin D\" was trending on Twitter after a Twitterer made a claim about Vitamin D deficiency. ... [+] (Photo: Getty)\r\ngetty\r\nWhats one of the more serious issues of our time? Pollution and climate c… [+5126 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Maddy Biddulph", "title": "6 probiotic foods to support your gut - Livescience.com", "description": "Including these probiotic foods in your diet can help your gut microbes to flourish", "url": "https://www.livescience.com/6-probiotic-foods-to-support-your-gut", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kv56vQMZWFmAVvSuezg9dk-1200-80.jpg", "publishedAt": "2022-04-02T15:52:59Z", "content": "Want to know which probiotic foods to eat to improve your health and wellbeing? As well as breaking down foods and absorbing nutrients, the gut has a massive impact on how well the body and mind work… [+5018 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Dr. Heather Moday", "title": "These are the 4 major warning signs of a weak immune system—and what you can do about it: Immunologist - CNBC", "description": "Do you have a weakened immune system? Immunologist Dr. Heather Moday shares how to tell if your immune system needs to be strengthened — plus the steps she suggests for better immune health.", "url": "https://www.cnbc.com/2022/04/02/these-are-the-4-major-signs-you-may-have-a-weak-immune-systemand-what-to-do-about-it-immunologist.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107040538-1648833116721-gettyimages-1329701927-1019255910.jpeg?v=1648833189&w=1920&h=1080", "publishedAt": "2022-04-02T14:30:02Z", "content": "Prioritizing your immune system has never been more important, especially with the highly contagious Omicron subvariant, BA.2, that is helping to drive another surge of Covid cases around the world. … [+6372 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Study shows half of older adults now die with dementia - Times of India", "description": "According to a new study, nearly half of all older adults now die with a diagnosis of dementia listed on their medical record, up 36 per cent from two decades ago. Watch the video for more details.", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/study-shows-half-of-older-adults-now-die-with-dementia/videoshow/90613343.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/90613343/size-42676/90613343.jpg", "publishedAt": "2022-04-02T14:16:39Z", "content": "02:26Gudi Padwa and Ugadi 2022: Amitabh Bachchan, Shraddha Kapoor, Ajay Devgn, Hema Malini, Malaika Arora among others wish their fans"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "How to Completely Abandon Alcohol Consumption ⋆ Ceng News - Ceng News", "description": "Excessive consumption of alcohol can have negative consequences for your body, mind, and daily life.\"The negative effects on the body,", "url": "https://www.cengnews.com/news/how-to-completely-abandon-alcohol-consumption-382449.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/04/1648908320_woman-bed-alcohol-nearby.jpg", "publishedAt": "2022-04-02T14:07:53Z", "content": "Excessive consumption of alcohol can have negative consequences for your body, mind, and daily life.\r\n“The negative effects on the body, brain, and mind are irreversible” at some point, according to … [+6483 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Detox foods that speed up metabolism and help with weight loss - Play Crazy Game", "description": "If you do a search for lists of foods that help to lose weight and detoxify the body, you will come across different types of foods that, in addition to contributing to weight loss, are quite nutritious. See too: Strawberry and oatmeal healthy drink recipe fo…", "url": "https://playcrazygame.com/2022/04/02/detox-foods-that-speed-up-metabolism-and-help-with-weight-loss/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/02/cha-verde.jpg", "publishedAt": "2022-04-02T13:56:54Z", "content": "If you do a search for lists of foods that help to lose weight and detoxify the body, you will come across different types of foods that, in addition to contributing to weight loss, are quite nutriti… [+2223 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Study reveals Covid's lingering impacts on brain - Daijiworld.com", "description": "New York, Apr 2 (IANS): Covid-19 patients commonly report having headaches, confusion and other neurological symptoms but doctors do not fully understand how the disease targets the brain during infection.\r\nAnd now, researchers have found severe brain inflamm…", "url": "https://daijiworld.com/news/newsDisplay?newsID=943784", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/arun_010621_covd.jpg", "publishedAt": "2022-04-02T13:54:24Z", "content": "New York, Apr 2 (IANS): Covid-19 patients commonly report having headaches, confusion and other neurological symptoms but doctors do not fully understand how the disease targets the brain during infe… [+1366 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "4 health conditions that can make you more prone to heart attack - Times of India", "description": "Cardiovascular diseases (CVDs) have become a major source of concern in India and across the globe. According to the World Health Organization (WHO), heart-related diseases are the leading cause of death globally. An estimated 17.9 million people died from CV…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/4-health-conditions-that-can-make-you-more-prone-to-heart-attack/photostory/90598904.cms", "urlToImage": "https://static.toiimg.com/photo/90598915.cms", "publishedAt": "2022-04-02T13:30:00Z", "content": "Cardiovascular diseases (CVDs) have become a major source of concern in India and across the globe. According to the World Health Organization (WHO), heart-related diseases are the leading cause of d… [+863 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "Omicron 'less severe' than Delta for children below 5: Study - IANS", "description": "The study, published in the journal 'JAMA Pediatrics', also showed that the Omicron variant is 6-8 times more infectious than the Delta variant.", "url": "https://ianslive.in/news/omicron_less_severe_than_delta_for_children_below_5_study-862232/LatestNews/0", "urlToImage": "https://ianslive.in/upload/2022/April/02/r-1648897693202204021638131182_l.jpg", "publishedAt": "2022-04-02T12:41:15Z", "content": "Photo Credit: IANS\r\nIANSLive\r\nNew York, April 2 (IANS) Children younger than 5 years of age who are infected with the Omicron variant have less risk of severe health outcomes than those infected with… [+2033 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": null, "title": "Surefire Signs Omicron is in Your Body - msnNOW", "description": "BA.2, the highly contagious Omicron subvariant, has become the dominant type of COVID-19 worldwide. Here's what the experts say.", "url": "https://www.eatthis.com/news-signs-omicron-is-in-your-body-covid/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AARg05X.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-04-02T12:01:46Z", "content": null}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Nutritional value of mushrooms may be good for your gut health: Research - Free Press Journal", "description": "Next time you order a pizza or whip up a creamy risotto, go ahead and load on the mushrooms", "url": "https://www.freepressjournal.in/health/nutritional-value-of-mushrooms-may-be-good-for-your-gut-health-research", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-04/bf52d8ff-a845-4ba4-bfee-3d80be04411d/mushroom_story.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-04-02T12:01:43Z", "content": "Adding more edible fungi into your diet may be one way to counteract the health risks associated with the Western-style diet (WSD), which often features an abundance of fatty foods and added sugars. … [+1655 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Anna Medaris Miller", "title": "6 tell-tale physical traits of a heavy alcohol drinker, according to experts — from brittle hair to skin blotches - Business Insider India", "description": "Reuters/Toby MelvilleHeavy drinking can raise the risk of cancers, heart disease, and other serious conditions. But first, it can affect appearance — and that can make some people change their behaviors.", "url": "https://www.businessinsider.in/science/health/news/6-tell-tale-physical-traits-of-a-heavy-alcohol-drinker-according-to-experts-ampmdash-from-brittle-hair-to-skin-blotches/slidelist/90611806.cms", "urlToImage": "https://www.businessinsider.in/photo/90611806/6-tell-tale-physical-traits-of-a-heavy-alcohol-drinker-according-to-experts-mdash-from-brittle-hair-to-skin-blotches.jpg", "publishedAt": "2022-04-02T12:00:12Z", "content": "Utter recalls the men at her family's bar fittingly named Utter Nonsense sporting rosy faces. \"It's almost like the capillaries around the nose and cheeks would start to burst,\" she said. \r\nThat's co… [+627 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Heart disease: Two coffees a day could cut risk of heart disease by 15 percent – study - Verve Times", "description": "Whether it’s an espresso, cappuccino, latte, cortado, or a flat white; over the past 20 years the nation’s coffee order has become ever more complicated. Nevertheless, polls have increasingly shown coffee is now more popular than its leaf-based count", "url": "https://vervetimes.com/heart-disease-two-coffees-a-day-could-cut-risk-of-heart-disease-by-15-percent-study/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1590205.jpg", "publishedAt": "2022-04-02T11:45:16Z", "content": "Whether its an espresso, cappuccino, latte, cortado, or a flat white; over the past 20 years the nations coffee order has become ever more complicated. Nevertheless, polls have increasingly shown cof… [+3157 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "Sindujaa D N", "title": "Omicron is nothing, New XE Strain spreads 10x faster! - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "health : Omicron is nothing, New XE Strain spreads 10x faster \n\nAccording to research, the Coronavirus BA. When compared to the other two versions, th", "url": "https://www.indiaherald.com/Health/Read/994491459/Omicron-is-nothing-New-XE-Strain-spreads-x-faster", "urlToImage": "https://www.indiaherald.com/imagestore/images/health/movies_news/omicron-is-nothing-new-xe-strain-spreads-x-faster14ad0f11-f404-47af-a43e-e072b2cd3a69-415x250-IndiaHerald.jpg", "publishedAt": "2022-04-02T11:14:15Z", "content": "Relaxation: \r\nCorona deficits have been entirely eradicated in several states, despite the fact that the incidence of coronavirus in india is in the thousands. Furthermore, several jurisdictions have… [+659 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "Signs You've Already Had COVID, According to the Mayo Clinic — Eat This Not That - Eat This, Not That", "description": "Although cases are declining, the effects of Long COVID are not. People are experiencing symptoms that can last for weeks or months.", "url": "http://www.eatthis.com/news-mayo-clinic-signs-already-had-covid/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2020/12/woman-tired-fatigue-headache-fever-pain-sleep-problem-bed.jpg?quality=82&strip=all", "publishedAt": "2022-04-02T10:31:45Z", "content": "Although COVID cases are declining, the effects of the virus are here to stay. Millions of people are experiencing symptoms that can last for weeks or months even though they're no longer positive fo… [+4777 chars]"}]}