{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "“Backdoor” into the ear offers new hope for reversing deafness - Freethink", "description": "A new study has unlocked a “backdoor” into the inner ear that could make administering gene therapies to restore hearing less risky.", "url": "https://www.freethink.com/health/restore-hearing", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/06/restore-hearing-thumb.jpg?resize=1200,630", "publishedAt": "2023-07-01T13:00:00Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Nivedita Jayaram Pawar", "title": "All about the Korean Weight Loss Diet that everyone’s talking about - Moneycontrol", "description": "K-Pop stars stay slim and lean thanks to the Korean Weight Loss Diet that stresses on whole foods high in fibre and excludes processed meals high in fat and sugar. Does it work in the Indian context? Health and nutrition experts weigh in", "url": "https://www.moneycontrol.com/news/health-and-fitness/all-about-the-korean-weight-loss-diet-that-everyones-talking-about-10887951.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/07/The-Korean-Weight-Loss-Diet-allows-for-a-lot-of-vegetables-along-with-tofu.-Photo_-Anh-Nguyen-via-unsplash-770x433.jpg", "publishedAt": "2023-07-01T12:32:32Z", "content": "After Korean food, fashion, movies, dramas and music, its Korean weight loss diet, also known as the K-pop diet that has gained much momentum recently. Its believed to be the secret to their beautifu… [+6849 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of California, Davis: Bat-Borne Sarbecoviruses Spilled Over in Southeast Asia Pre-Pandemic - India Education Diary", "description": "Avirus previously found only in bats was detected in the antibodies of people screened for exposure to sarbecoviruses between 2017 and 2020 in rural Myanmar in Southeast Asia, according to a study from the University of California, Davis and collabor", "url": "https://indiaeducationdiary.in/university-of-california-davis-bat-borne-sarbecoviruses-spilled-over-in-southeast-asia-pre-pandemic/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/07/elephant-loggers_uc-davis-1024x576.jpg", "publishedAt": "2023-07-01T11:11:49Z", "content": "Avirus previously found only in bats was detected in the antibodies of people screened for exposure to sarbecoviruses between 2017 and 2020 in rural Myanmar in Southeast Asia, according to a study fr… [+3122 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Puja Menon", "title": "Look At The Remarkable Health Benefits Of Kachri | TheHealthSite.com - TheHealthSite", "description": "Lovneet Batra’s latest instagram post sheds light on the health benefits of wild melon. TheHealthSite.com", "url": "https://www.thehealthsite.com/news/look-at-the-remarkable-health-benefits-of-kachri-stst-989331/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/07/Untitled-design-1-1.jpg", "publishedAt": "2023-07-01T11:09:00Z", "content": "Kachri is renowned for its ability to stimulate appetite. (Credits: Instagram)\r\nLovneet Batra's latest instagram post sheds light on the health benefits of wild melon.\r\nDid you know that there might … [+2398 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Carbs - How Much Is Enough? Does Carb Intake Affect Lifespan? - NDTV Food", "description": "Carbs are important for good health but too much can adversely affect our well-being. So, what's the right way to consume carbs?", "url": "https://food.ndtv.com/health/carbs-how-much-is-enough-does-carb-intake-affect-lifespan-4168843", "urlToImage": "https://c.ndtvimg.com/2019-02/v38jltfo_carbs_625x300_08_February_19.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-07-01T11:06:09Z", "content": "Carbohydrates, the primary source of energy in our diets, have gained significant attention in recent years due to the rising prevalence of obesity. Numerous diets advocating both high and low-carb i… [+3507 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Bornika Das", "title": "5 Things To Keep In Mind While Buying Packed Foods - Slurrp", "description": "We often buy packed foods from the market. Packed foods are generally considered highly processed junk food. While buying these foods, we need to keep in mind certain nutritional values mentioned on the labels of the packages. Through these labels, you’ll be …", "url": "https://www.slurrp.com/article/5-things-to-keep-in-mind-while-buying-packed-foods-1688106333079", "urlToImage": "https://images.slurrp.com/prodarticles/wnum9wj8q7.webp", "publishedAt": "2023-07-01T10:52:30Z", "content": "Junk food, on the other hand, causes weight gain, increases the risk of hypertension and heart disease, and causes lifestyle diseases too. Items like processed cheese, packaged juice in tetra packs, … [+3255 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "As the weekend arrives, here are the cautions on binge drinking for your perusal - Indiatimes.com", "description": "​Binge drinking refers to excessive consumption of alcohol. The US Centers for Disease Control and Prevention (US CDC) defines binge drinking as consuming 5 or more drinks for men and 4 or more for women. A noticeable pattern in binge drinking is observed dur…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/as-the-weekend-arrives-here-are-the-cautions-on-binge-drinking-for-your-perusal/photostory/101410797.cms", "urlToImage": "https://static.toiimg.com/photo/101410833.cms", "publishedAt": "2023-07-01T10:30:00Z", "content": "In January 2023, the WHO released guidelines on alcohol consumption in which it urged people to not consume alcohol. On \"a safe\" level of alcohol for human consumption, a WHO expert says, \"We cannot … [+325 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Manasvi Jain", "title": "Know how to make nannari sharbat: Beat the summer heat with health and flavour! - Health shots", "description": "There are a lot of desi summer coolers that are healthy and hydrating but have you ever tried nannari sharbat? It’s time to add this to your summer drinks by learning how to make nannari sharbat at home.", "url": "https://www.healthshots.com/how-to/nannari-sharbat-recipe/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/06/01112539/nannari-sharbat.jpg", "publishedAt": "2023-07-01T10:15:31Z", "content": "Finding ways to stay cool and hydrated is a part and parcel of summer. One delightful and refreshing option is nannari sharbat, a traditional Indian drink made from the roots of the nannari plant als… [+3366 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Queen Mary University Of London Experts Find Cause And Cure Of Common Blood Pressure - India Education Diary", "description": "The cause is a tiny benign nodule, present in one-in-twenty people with hypertension. The nodule produces a hormone, aldosterone, that controls how much salt is in the body. The new discovery is a gene variant in some of these nodules which leads to", "url": "https://indiaeducationdiary.in/queen-mary-university-of-london-experts-find-cause-and-cure-of-common-blood-pressure/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/Queen-Mary-University-of-London.jpg", "publishedAt": "2023-07-01T10:15:14Z", "content": "The cause is a tiny benign nodule, present in one-in-twenty people with hypertension. The nodule produces a hormone, aldosterone, that controls how much salt is in the body. The new discovery is a ge… [+3262 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Queen Mary University Of London's DNA discovery highlights how we maintain healthy blood sugar levels after meals - India Education Diary", "description": "The findings, published in Nature Genetics, could help inform future treatments of type 2 diabetes, which affects around 4 million people in the UK and over 460 million people worldwide. Several factors contribute to an increased risk of type 2 diabe", "url": "https://indiaeducationdiary.in/queen-mary-university-of-londons-dna-discovery-highlights-how-we-maintain-healthy-blood-sugar-levels-after-meals/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/Queen-Mary-University-of-London.jpg", "publishedAt": "2023-07-01T09:55:58Z", "content": "The findings, published in Nature Genetics, could help inform future treatments of type 2 diabetes, which affects around 4 million people in the UK and over 460 million people worldwide. Several fact… [+3711 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Khushi Rathore", "title": "Healthy & Delicious: Top 10 Food Items to Help You Gain Weight - News Track English", "description": "Are you looking to gain weight in a healthy and balanced way? While many articles focus on weight loss, it’s important to address the needs of those who want to gain weight. Whether you’re aiming to build muscles, recover from an illness, or simply want to re…", "url": "https://english.newstracklive.com/news/top-10-food-items-to-help-you-gain-weight-sc56-nu402-ta267-1282511-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/relationship/Jul/01/big_thumb/weight-gain_649ff0161a7f5.JPG", "publishedAt": "2023-07-01T09:37:27Z", "content": "Are you looking to gain weight in a healthy and balanced way? While many articles focus on weight loss, it’s important to address the needs of those who want to gain weight. Whether you’re aiming to … [+5657 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Menopausal hormone therapy found to be linked with increased rate of dementia - The Week", "description": "Menopausal hormone therapy, used to relieve menopausal symptoms like hot flushes and night sweats, is associated with an increased rate of dementia and Alzheimer's disease, even though no causal relationship has been established, a new BMJ research has said.", "url": "https://www.theweek.in/news/health/2023/07/01/menopausal-hormone-therapy-found-to-be-linked-with-increased-rat.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/quickscan/images/2022/5/27/12-Early-menopause-may-raise.jpg", "publishedAt": "2023-07-01T09:15:00Z", "content": "Menopausal hormone therapy, used to relieve menopausal symptoms like hot flushes and night sweats, is associated with an increased rate of dementia and Alzheimer's disease, even though no causal rela… [+2204 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Allpr Solution", "title": "Keto ACV Gummies Shark Tank (Weight Loss Gummies Shark Tank) Exposed Reviews 2023 | Shark Tank Keto ACV Gummies Worthy or Not? - Devdiscourse", "description": "Read more about Keto ACV Gummies Shark Tank (Xtreme Fit Keto Gummies) Exposed Reviews 2023 | Shark Tank Keto ACV Gummies Worthy or Not? on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/2507390-keto-acv-gummies-shark-tank-xtreme-fit-keto-gummies-exposed-reviews-2023-shark-tank-keto-acv-gummies-worthy-or-not", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_07_2023_14_13_01_6545388.png?width=920&format=jpeg", "publishedAt": "2023-07-01T08:48:42Z", "content": "Obesity is a well-known health and medical problem that is rampant in modern times and most importantly, it plagues almost everyone at some point in their lives. It has also long been thought to be t… [+11613 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Sanskar Tiwari", "title": "Warning Signs of Acute Sinusitis: What to Watch Out For - News Track English", "description": "Introduction\r\nSinusitis is a common condition that affects millions of people worldwide. It occurs when the sinuses, which are hollow spaces in the skull, become inflamed and infected. Acute sinusitis refers to a sudden onset of sinus inflammation, usually ca…", "url": "https://english.newstracklive.com/news/warning-signs-of-acute-sinusitis-what-to-watch-out-for-emc-sc53-nu384-ta384-1282497-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/health-tips/Jul/01/big_thumb/Create-a-clinical-design-that-highlights-the-warning-signs-of-acute_649fe73d62b75.jpeg", "publishedAt": "2023-07-01T08:45:33Z", "content": "IntroductionSinusitis is a common condition that affects millions of people worldwide. It occurs when the sinuses, which are hollow spaces in the skull, become inflamed and infected. Acute sinusitis … [+3427 chars]"}, {"source": {"id": null, "name": "Organiser.org"}, "author": "WEB DESK", "title": "Water fasts could help with weight loss, but benefits may not last long: Study - Organiser", "description": "Water fasts, in which participants consume only water for a period of time, may help with weight loss, but it's unclear how long it will remain, according", "url": "https://organiser.org/2023/07/01/181563/world/water-fasts-could-help-with-weight-loss-but-benefits-may-not-last-long-study/", "urlToImage": "https://organiser.org/wp-content/uploads/2023/07/untitled-5.jpg", "publishedAt": "2023-07-01T07:02:36Z", "content": "Water fasts, in which participants consume only water for a period of time, may help with weight loss, but it’s unclear how long it will remain, according to a study from the University of Illinois a… [+3441 chars]"}, {"source": {"id": null, "name": "Pratidintime.com"}, "author": "Pratidin Time", "title": "Assam: Child Dies Of 'Japanese Encephalitis' In Lakhimpur; 24 Others Infected - Pratidin Time", "description": "A child has died of Japanese Encephalitis (JE) while several others have been infected with the virus in Assam’s Lakhimpur district. According to the district h", "url": "https://www.pratidintime.com/latest-assam-news-breaking-news-assam/lakhimpur/assam-child-dies-of-japanese-encephalitis-in-lakhimpur-24-others-infected", "urlToImage": "https://gumlet.assettype.com/pratidintime%2Fimport%2F2019%2F07%2F2-1.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-07-01T06:54:37Z", "content": "According to the district health department, as many as 24 persons are infected with JE and are currently under treatment.\r\nJE is a viral brain infection that spreads through mosquito bites. The viru… [+227 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Loneliness linked with risk of heart disease in diabetic patients - Devdiscourse", "description": "Researchers have found that among people with diabetes, loneliness poses a larger risk for heart disease than diet, exercise, smoking, and depression.", "url": "https://www.devdiscourse.com/article/science-environment/2507322-loneliness-linked-with-risk-of-heart-disease-in-diabetic-patients", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_07_2023_06_41_21_9469963.jpg?width=920&format=jpeg", "publishedAt": "2023-07-01T06:41:23Z", "content": "Researchers have found that among people with diabetes, loneliness poses a larger risk for heart disease than diet, exercise, smoking, and depression. The results of this study were published in the … [+4227 chars]"}, {"source": {"id": null, "name": "Financial Express"}, "author": null, "title": "How to live a better life after Prostate Cancer? - The Financial Express", "description": "Rehabilitation exercises, such as pelvic floor muscle training, can often aid in regaining urinary control and improving continence.", "url": "https://www.financialexpress.com/lifestyle/health/how-to-live-a-better-life-after-prostate-cancer/3150247/", "urlToImage": "https://www.financialexpress.com/wp-content/uploads/2023/05/cancer-gc50db6a0c_1920.jpg", "publishedAt": "2023-07-01T06:30:00Z", "content": "By Dr. Anant Kumar\r\nIndia is witnessing a rapid surge in cancer cases, with over 2.25 million reported this year. Among them, prostate cancer remains a prevalent condition that profoundly affects the… [+5521 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Small molecules have impact on different brain, role in Alzheimer's disease - DTNEXT", "description": "A recent study from the Netherlands Institute for Neuroscience and the VIB-KU Leuven Centre for Brain and Disease Research demonstrates that a little molecule known as rna-132\"microRNA-132 can...", "url": "https://www.dtnext.in/lifestyle/wellbeing/small-molecules-have-impact-on-different-brain-role-in-alzheimers-disease-721534", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/07/01/745106-ani-20230630130951.jpg", "publishedAt": "2023-07-01T05:52:44Z", "content": "AMSTERDAM: A recent study from the Netherlands Institute for Neuroscience and the VIB-KU Leuven Centre for Brain and Disease Research demonstrates that a little molecule known as rna-132\"&gt;microRNA… [+4786 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "DC Correspondent", "title": "Fungal Infections in Monsoons: Prevention, Treatment - Deccan Chronicle", "description": "Fungal Infections in Monsoons: Prevention, Treatment", "url": "https://www.deccanchronicle.com/lifestyle/health-and-wellbeing/010723/fungal-infections-in-monsoons-prevention-treatment.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-hjdv61ohhjcjlcv2ofabbtqb92-20190416015124.Medi.jpeg", "publishedAt": "2023-07-01T04:54:20Z", "content": "Fungal infections can arise from multiple factors. Environmental exposure to high fungal concentrations, such as in damp areas, can contribute to infection. Neutropenia, characterized by low neutroph… [+89 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify an Unconventional Treatment for Depression and Anxiety: Humor - SciTechDaily", "description": "A review of academic research indicates that the use of humor therapy might alleviate signs of depression and anxiety. For the analysis, which was published in Brain and Behavior, researchers analyzed 29 pertinent studies. These studies collectively involved …", "url": "https://scitechdaily.com/scientists-identify-an-unconventional-treatment-for-depression-and-anxiety-humor/", "urlToImage": "https://scitechdaily.com/images/Depression-Relief-Concept.jpg", "publishedAt": "2023-07-01T04:40:19Z", "content": "Research suggests humor therapy may alleviate symptoms of depression and anxiety, based on an analysis of 29 studies involving nearly 3,000 participants from various demographics and health backgroun… [+1220 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Tooth Avulsion and Replantation - The Hans India", "description": "Dr Siva Srinivas, BDS, MDS (Osm) Gold Medalist from Anand Bagh Dental Hospital, Malkajgiri talks about Tooth Avulsion and its treatment", "url": "https://www.thehansindia.com/life-style/tooth-avulsion-and-replantation-806563", "urlToImage": "https://assets.thehansindia.com/h-upload/2023/07/01/1361895-dental-trauma.jpg", "publishedAt": "2023-07-01T04:37:11Z", "content": "Tooth Avulsion is the complete displacement of tooth from its alveolar socket. This is usually a consequence of traumatic injuries- be it accidental or sports related. Tooth avulsion in milk teeth (b… [+3539 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "The importance of regular visits to a general physician - The Hans India", "description": "Dr Usman Shaik from Good Care Multi Specialty Hospital, Borabanda, Hyderabad speaks about reasons why regular visits to a general physician are important", "url": "https://www.thehansindia.com/life-style/the-importance-of-regular-visits-to-a-general-physician-806559", "urlToImage": "https://assets.thehansindia.com/h-upload/2023/07/01/1361891-general-physician.jpg", "publishedAt": "2023-07-01T04:10:15Z", "content": "Regular visits to a general physician are crucial for maintaining optimal health and preventing potential health issues. A general physician is a primary care doctor who can diagnose and treat a wide… [+2570 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What is breadfruit that looks like jackfruit and why its called nutritious - Indiatimes.com", "description": "This fruit that has a striking resemblance with jackfruit is known for its nutritional benefits, and is a tropical fruit that originates from the South Pacific. This fruit is popular for its large size and spiky exterior, and is gaining recognition as a nutri…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/what-is-breadfruit-that-looks-like-jackfruit-and-why-its-called-nutritious/photostory/101407578.cms", "urlToImage": "https://static.toiimg.com/photo/101407586.cms", "publishedAt": "2023-07-01T02:32:22Z", "content": "Beyond its nutritional prowess, breadfruit's versatility in the culinary world makes it even more intriguing. This fruit can be prepared in various ways to suit different tastes and preferences. It c… [+384 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "U.S. reports 1st 'domestically acquired' malaria cases in 20 years - CBC News: The National", "description": "The U.S. has reported ‘domestically acquired’ cases of malaria for the first time in 20 years, and experts say the disease could become more common because o...", "url": "https://www.youtube.com/watch?v=OP-I5_dysMY", "urlToImage": "https://i.ytimg.com/vi/OP-I5_dysMY/maxresdefault.jpg", "publishedAt": "2023-07-01T01:56:52Z", "content": null}, {"source": {"id": null, "name": "Mirchi.in"}, "author": "Girish Shukla", "title": "Mastering Kapalbhati for mind and body - Mirchi Plus", "description": "Breathing is an essential part of our existence, but did you know that the way we breathe can have a significant impact on our overall well-being? One breathing technique that has gained popularity for its magical benefits is Kapalbhati.", "url": "https://mirchi.in/stories/lifestyle/mastering-kapalbhati-for-mind-and-body/101309356", "urlToImage": "https://static.mirchi.in/thumb/imgsize-27272,msid-101309356,width-800,height-450,resizemode-1/101309356.jpg", "publishedAt": "2023-07-01T00:40:45Z", "content": "In the quest for holistic well-being\r\n, we often stumble upon hidden gems that hold the power to transform our lives. One such gem is Kapalbhati\r\n, a breathing technique known for its extraordinary b… [+4216 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "Elly Burhaini Faizal", "title": "Wellcome, Gates Foundation to fund TB vaccine research - The Jakarta Post", "description": "The M72 could potentially become the first new vaccine to help prevent pulmonary tuberculosis (TB) in more than 100 years if it is proven effective.", "url": "http://www.thejakartapost.com/paper/2023/07/01/wellcome-gates-foundation-to-fund-tb-vaccine-research.html", "urlToImage": "https://img.jakpost.net/c/2022/11/23/2022_11_23_132579_1669215051.jpg", "publishedAt": "2023-06-30T23:45:05Z", "content": "Wellcome and the Bill &amp; Melinda Gates Foundation announced on Wednesday funding to advance a tuberculosis (TB) vaccine candidate, the M72/AS01E (M72), through a Phase III clinical trial.\r\nThe M72… [+391 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "DTNEXT Bureau", "title": "Diabetes to hit Indians bad by 2050 despite low BMI, says expert - DTNEXT", "description": "The professor warned that complications related to diabetes are expected to push the global burden of diabetes to more than 521 million people.", "url": "https://www.dtnext.in/lifestyle/wellbeing/diabetes-to-hit-indians-bad-by-2050-despite-low-bmi-says-expert-721469", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/30/745029-diabetes.jpg", "publishedAt": "2023-06-30T23:29:21Z", "content": "VELLORE: Exposure to environmental pollutants and chemicals is a risk factor for the early onset of diabetes impacting life expectancy, said Dr Nihal Thomas of CMCs endocrinology and diabetes departm… [+1367 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Shannen Zitz", "title": "Vaginal Cramps: 11 Causes and When to See a Doctor - Prevention Magazine", "description": "Plus, when to see your doctor.", "url": "https://www.prevention.com/health/health-conditions/a44374904/vaginal-cramps/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/stomach-ache-1557864082.jpg?crop=1.00xw:0.752xh;0,0.115xh&resize=1200:*", "publishedAt": "2023-06-30T19:55:42Z", "content": "Muscle cramps and pelvic pain are often high on the list of uncomfortable health issuesbut when these symptoms combine with vaginal cramps, you may start to worry. While cramps can be completely norm… [+8126 chars]"}, {"source": {"id": null, "name": "Lww.com"}, "author": null, "title": "Cardiac Abnormalities and COVID-19 : Emergency Medicine News - LWW Journals", "description": "An abstract is unavailable.", "url": "https://journals.lww.com/em-news/fulltext/2023/07000/cardiac_abnormalities_and_covid_19.10.aspx", "urlToImage": "https://images.journals.lww.com/em-news/SocialThumb.00132981-202307000-00010.FU1-10.jpeg", "publishedAt": "2023-06-30T19:11:45Z", "content": "Experts are working to decipher the causes, but myocarditis is not as common as believed\r\nFigure: COVID-19, cardiac abnormality, myocarditis, pandemic, emergency department, biomarkers, cardiac tropo… [+12097 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Who Benefits From Continuous Glucose Monitoring? - Medscape", "description": "Will continuous glucose monitoring add to healthcare professionals' workload and worsen diabetes distress in patients with type 2 diabetes?", "url": "https://www.medscape.com/viewarticle/993910", "urlToImage": "https://img.medscape.com/thumbnail_library/ht_230630_kevin_fernando_800x450.jpg", "publishedAt": "2023-06-30T18:16:20Z", "content": "Kevin Fernando, MBChB, MSc\r\nThe use of diabetes technology (specifically for blood glucose monitoring) has advanced at an almost exponential rate over the past few years. Continuous glucose monitorin… [+6792 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Kelly Kennedy, RDN", "title": "How to Cut a Pineapple: A Step-by-Step Guide - Everyday Health", "description": "Pineapple is a high-sugar fruit, but it also contains vitamin C and fiber, and an enzyme, bromelain, known for tis anti-inflammatory properties. Learn how to cut and cook with pineapple.", "url": "https://www.everydayhealth.com/diet-nutrition/how-to-cut-a-pineapple-a-step-by-step-guide/", "urlToImage": "https://images.everydayhealth.com/images/how-to-cut-it-pineapple-header-1440x810.jpg?sfvrsn=e56c9d47_1", "publishedAt": "2023-06-30T18:15:50Z", "content": "Its sweet, tropical flavor makes pineapple a fan favorite, but it has often gotten a bad rap as a high-sugar fruit. What you may not know: Pineapple is loaded with essential vitamins, minerals, and n… [+2987 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A new bacterial blueprint to aid in the war on antibiotic resistance - Phys.org", "description": "A team of scientists from around the globe, including those from Trinity College Dublin, has gained high-res structural insights into a key bacterial enzyme that may help chemists design new drugs to inhibit it and thus suppress disease-causing bacteria. Thei…", "url": "https://phys.org/news/2023-06-bacterial-blueprint-aid-war-antibiotic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/microscope-2.jpg", "publishedAt": "2023-06-30T18:00:01Z", "content": "A team of scientists from around the globe, including those from Trinity College Dublin, has gained high-res structural insights into a key bacterial enzyme that may help chemists design new drugs to… [+2295 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Monthly Vitamin D May Prevent Heart Attacks in Older People, Study Shows - Sci.News", "description": "New research indicates that vitamin D supplementation might reduce the incidence of major cardiovascular events, particularly myocardial infarction and coronary revascularization, among people aged over 60.", "url": "https://www.sci.news/medicine/monthly-vitamin-d-cardiovascular-events-12053.html", "urlToImage": "https://cdn.sci.news/images/2023/06/image_12053-Vitamin-D.jpg", "publishedAt": "2023-06-30T17:41:50Z", "content": "New research indicates that vitamin D supplementation might reduce the incidence of major cardiovascular events, particularly myocardial infarction and coronary revascularization, among people aged o… [+4137 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Elana Gotkine", "title": "Pegozafermin Leads to Improvements in Fibrosis in NASH | Health | crossroadstoday.com - Crossroads Today", "description": "FRIDAY, June 30, 2023 (HealthDay News) -- For patients with biopsy-confirmed nonalcoholic steatohepatitis (NASH) and stage F2 or F3 fibrosis, treatment with pegozafermin leads to improvements in fibrosis, according to", "url": "https://consumer.healthday.com/physician-s-briefing-nash-2661826022.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/crossroadstoday.com/content/tncms/assets/v3/editorial/1/26/126ce1f2-a54d-5803-b704-cd76bb776f2f/649f0db33c026.image.jpg?crop=600%2C315%2C0%2C37&resize=600%2C315&order=crop%2Cresize", "publishedAt": "2023-06-30T17:29:30Z", "content": "FRIDAY, June 30, 2023 (HealthDay News) -- For patients with biopsy-confirmed nonalcoholic steatohepatitis (NASH) and stage F2 or F3 fibrosis, treatment with pegozafermin leads to improvements in fibr… [+1611 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Senior Manager, Risk - Switzerland - ReliefWeb", "description": "Monitoring and Evaluation Job in Switzerland about Health, requiring 5-9 years of experience, from GAVI; closing on 20 Jul 2023", "url": "https://reliefweb.int/job/3975972/senior-manager-risk", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/default.png", "publishedAt": "2023-06-30T17:24:26Z", "content": "Gavi, the Vaccine Alliance is a public-private partnership committed to saving children's lives and protecting people's health by increasing equitable use of vaccines in lower-income countries. The V… [+8552 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kiley Price", "title": "'Disappearing' Y chromosome in aging men may worsen bladder cancer, mouse study shows - Livescience.com", "description": "As men get older, they can lose Y chromosomes in a portion of their cells. This could be helping certain cancers evade the immune system.", "url": "https://www.livescience.com/health/cancer/disappearing-y-chromosome-in-aging-men-may-worsen-bladder-cancer-mouse-study-shows", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EE9CaBtt5M5raai9vw2SWk-1200-80.jpg", "publishedAt": "2023-06-30T16:17:32Z", "content": "Most men carry one X and one Y sex chromosome in each of their body's cells. However, over their lifetimes, many men start losing Y chromosomes in a portion of their cells, and this might hamper thei… [+4399 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Jane Langille", "title": "International team develops new vaccine distribution model - Medical Xpress", "description": "Researchers from Weill Cornell Medicine, Cornell's Ithaca campus, Singapore University of Technology and Design, and San Jose State University in California have developed a model for optimizing the dispensing of vaccines during pandemics that uses a new meas…", "url": "https://medicalxpress.com/news/2023-06-international-team-vaccine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/international-team-dev.jpg", "publishedAt": "2023-06-30T15:47:05Z", "content": "Researchers from Weill Cornell Medicine, Cornell's Ithaca campus, Singapore University of Technology and Design, and San Jose State University in California have developed a model for optimizing the … [+5725 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "ECG-AI Tool Diagnoses Heart Attacks Faster and More Accurately Than Current Approaches - HospiMedica", "description": "A new tool is now available to detect subtle ECG indicators that clinicians might find challenging to identify, making it easier for them to classify chest pain patients.", "url": "https://www.hospimedica.com/critical-care/articles/294797742/ecg-ai-tool-diagnoses-heart-attacks-faster-and-more-accurately-than-current-approaches.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2023-06-30/SDD-294797742.jpg", "publishedAt": "2023-06-30T14:55:28Z", "content": "When a patient experiences chest pain and is rushed to the hospital, an electrocardiogram (ECG) is typically the first diagnostic tool used to confirm or rule out a heart attack. In an ECG, healthcar… [+2850 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Batya Swift Yasgur, LSW", "title": "Intense Exercise May Be Risky in Moderate to Severe Stenosis - Medscape", "description": "Exercise is usually beneficial for cardiovascular health, but this study suggests it may raise the ischemic stroke risk among those with moderate to severe carotid stenosis.", "url": "https://www.medscape.com/viewarticle/993912", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_230630_senior_man_in_gym_800x450.jpg", "publishedAt": "2023-06-30T14:07:45Z", "content": "Intense exercise may increase stroke risk among patients with moderate or severe stenosis, new research suggests.\r\nInvestigators simulated blood flow in a sophisticated computational model of the int… [+6525 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Manya Singh", "title": "Haircare Tips: Eat These Vitamin B-Rich Foods For Thicker Healthier Hair - NDTV Doctor", "description": "When it comes to hair health, vitamin B plays a vital role in promoting strong and healthy hair growth, here's how to add it to your diet.", "url": "https://doctor.ndtv.com/nutrition/haircare-tips-eat-these-vitamin-b-rich-foods-for-thicker-healthier-hair-4166799", "urlToImage": "https://c.ndtvimg.com/2022-11/1232buc_haircare650_625x300_25_November_22.jpg", "publishedAt": "2023-06-30T14:00:34Z", "content": "Vitamin B is a group of essential water-soluble vitamins that play a crucial role in supporting various bodily functions. There are eight different types of vitamin B, including thiamine (B1), ribofl… [+3812 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Sight Care Reviews (Customer SCAM ALERT 2023) SightCare Supplement Ingredients Are Safe or Any Side Effects? Check (Official Website) - mid-day.com", "description": "Sight Care Supplement Reviews - Hello! Are you looking for real sight care customer reviews? Then you are in the right place. Read this Sight care review about", "url": "https://www.mid-day.com/lifestyle/infotainment/article/sight-care-reviews-customer-scam-alert-2023-sightcare-supplement-ingredients-23295220", "urlToImage": "https://images.mid-day.com/images/images/2023/jun/Sight-Care3006_d.jpg", "publishedAt": "2023-06-30T13:18:00Z", "content": "Sight Care Supplement Reviews - Hello! Are you looking for real sight care customer reviews? Then you are in the right place. Read this Sight care review about ingredients, side effects, supplement, … [+13585 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nutritionist Explains How Fibre, Protein And A Pre-Diabetic Diet May Help Manage PCOS - NDTV Food", "description": "PCOS diet: Nutritionist Simrun Chopra recently shared some important dietary and lifestyle habits that could help those with PCOS.", "url": "https://food.ndtv.com/health/how-to-manage-pcos-nutritionist-reveals-key-diet-tips-to-follow-4166448", "urlToImage": "https://c.ndtvimg.com/2023-06/qca0m2s8_pcos-diet_625x300_30_June_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-06-30T12:31:36Z", "content": "Polycystic Ovary Syndrome (PCOS) is a hormonal disorder experienced by women in which cysts get formed in the ovaries, caused by an over-production of hormones called androgens. PCOS may lead to infr… [+2251 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "What is alcohol poisoning? Here's what happens to your liver and body if you drink too much alcohol - Moneycontrol", "description": "Alcohol poisoning wreaks havoc on the liver, inducing a cascade of damaging effects that can lead to severe health complications. From fatty liver disease to cirrhosis, the liver's ability to metabolise alcohol is overwhelmed, resulting in inflammation, scarr…", "url": "https://www.moneycontrol.com/news/health-and-fitness/what-is-alcohol-poisoning-heres-what-happens-to-your-liver-and-body-if-you-drink-too-much-alcohol-10882721.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/Causes-and-symptoms-of-alcohol-poisoning--770x433.jpg", "publishedAt": "2023-06-30T11:50:02Z", "content": "Planning on binge drinking with friends this weekend? You might want to rethink your plan. For too much alcohol can turn a fun night into an absolute nightmare in no time! Alcohol poisoning is a seve… [+3535 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover That Experimental Cancer Drug May Slow Inflammation Linked to Heart Disease - SciTechDaily", "description": "Potential new therapy emerges from\"reverse-engineering\" an existing compound. A new study conducted by researchers at NYU Grossman School of Medicine suggests that an experimental drug, previously tested for the potential treatment of cancer, lung, and Alzhei…", "url": "https://scitechdaily.com/scientists-discover-that-experimental-cancer-drug-may-slow-inflammation-linked-to-heart-disease/", "urlToImage": "https://scitechdaily.com/images/Heart-Disease-Concept-1.jpg", "publishedAt": "2023-06-30T10:41:35Z", "content": "ByNYU Langone Health / NYU Grossman School of MedicineJune 30, 2023\r\nResearchers have discovered that the experimental drug saracatinib, previously tested for potential use in treating various diseas… [+8587 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Long Covid not a single condition, symptoms can change over time: Study - Daijiworld.com", "description": "New York, Jun 30 (IANS): Long Covid is not a single condition, and should not be treated as such, according to a new study.\r\nAccording to researchers from the University of Washington, most long Covid studies have focused primarily on the individual symptoms …", "url": "https://www.daijiworld.com/index.php/news/newsDisplay?newsID=1095087", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-06-30T09:31:16Z", "content": "New York, Jun 30 (IANS): Long Covid is not a single condition, and should not be treated as such, according to a new study.\r\nAccording to researchers from the University of Washington, most long Covi… [+1935 chars]"}, {"source": {"id": null, "name": "Bizzbuzz.news"}, "author": "Bizz Buzz", "title": "Why type A blood linked to Covid risk? - Bizz Buzz", "description": "The SARS-CoV-2 preferentially infects blood group A cells, finds a study providing a direct link between this blood group and a higher rate of infection with the virus", "url": "https://www.bizzbuzz.news/eco-buzz/why-type-a-blood-linked-to-covid-risk-1229379", "urlToImage": "https://www.bizzbuzz.news/h-upload/2023/06/30/1739303-covid.jpg", "publishedAt": "2023-06-30T08:31:59Z", "content": "New York The SARS-CoV-2, the virus that causes Covid-19, preferentially infects blood group A cells, finds a study providing a direct link between this blood group and a higher rate of infection with… [+2492 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Stress, microRNAs, and stress-related psychiatric disorders: an overview | Molecular Psychiatry - Nature.com", "description": "Molecular Psychiatry - Stress, microRNAs, and stress-related psychiatric disorders: an overview", "url": "https://www.nature.com/articles/s41380-023-02139-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41380-023-02139-3/MediaObjects/41380_2023_2139_Fig1_HTML.png", "publishedAt": "2023-06-30T07:57:51Z", "content": null}, {"source": {"id": null, "name": "Editorji.com"}, "author": "Editorji News Desk", "title": "Why does consuming yogurt in the morning have immense health benefits? - Editorji", "description": "If you’re looking for a breakfast that offers immense health benefits, consider adding yogurt to your morning routine.", "url": "https://www.editorji.com/lifestyle-news/health/why-does-consuming-yogurt-in-the-morning-have-immense-health-benefits-1688109154849", "urlToImage": "https://cdn.editorji.com/4UTTOb8nuR.jpg", "publishedAt": "2023-06-30T07:12:34Z", "content": "Yogurt is a popular dairy product that is consumed by most people. This dairy product can be eaten with fruits, blended into smoothies, or can be added to many dishes. \r\nStarting your day with a serv… [+1238 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "RSV infection responsible for up to 10000 deaths among older adults per year in the US: CDC | TheHealthSi - TheHealthSite", "description": "Acknowledging the RSV risk among senior citizens CDC recommends people aged 60 years and older to get a dose of RSV vaccine this fall after discussing with their healthcare provider. TheHealthSite.com", "url": "https://www.thehealthsite.com/news/respiratory-syncytial-virus-infections-cdc-recommends-older-adults-to-get-rsv-vaccine-this-fall-989087/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/Respiratory-Syncytial-Virus-RSV.jpg", "publishedAt": "2023-06-30T06:26:00Z", "content": "RSV infections and other respiratory infections are most common during the fall. \r\nInfants and older adults are at greatest risk for severe illness from RSV infection. The CDC has approved use of new… [+2333 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Consult experts for weight guidance during pregnancy, study recommends - ETHealthWorld", "description": "A meta-analysis of nearly 35,000 individuals from 99 studies published in JAMA Network Open discovered that interventions from allied health professionals like as dietitians were the most beneficial for managing gestational weight gain (GWG).", "url": "https://health.economictimes.indiatimes.com/news/industry/consult-experts-for-weight-guidance-during-pregnancy-study-recommends/101382510", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-101382510,imgsize-9902,width-1200,height=765,overlay-ethealth/industry/consult-experts-for-weight-guidance-during-pregnancy-study-recommends.jpg", "publishedAt": "2023-06-30T05:02:30Z", "content": "England: A recent review of over 100 research papers suggests that pregnant women may benefit from more support from qualified dietitians in controlling weight gain during pregnancy.A meta-analysis o… [+2401 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Tavishi Dogra", "title": "Latest Trends In The Fertility Sector In India | TheHealthSite.com - TheHealthSite", "description": "The Indian fertility rate in 2023 is at 2 lower than the replacement rate of 2.1. TheHealthSite.com", "url": "https://www.thehealthsite.com/pregnancy/infertility/latest-trends-in-the-fertility-sector-in-india-989079/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/infertility.jpg", "publishedAt": "2023-06-30T04:29:00Z", "content": "Fertility is a shared responsibility\r\nThe Indian fertility rate in 2023 is at 2, lower than the replacement rate of 2.1.\r\nAssisted Reproductive Technology ACT (ART): The ART Act includes much-needed … [+2644 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Kajal Rajput", "title": "Doctors at Marengo Asia Hospital Gurugram perform India's First Schizophrenia Surgery on 28-year-old man - Medical Dialogues", "description": "Gurugram: A 28-year-old man suffering from Schizophrenia from 13 years of age, became the first to undergo surgery for schizophrenia in India. In a path-breaking effort, the Neurosurgery team at...", "url": "https://medicaldialogues.in/news/health/hospital-diagnostics/doctors-at-marengo-asia-hospital-gurugram-perform-indias-first-schizophrenia-surgery-on-28-year-old-man-113661", "urlToImage": "https://medicaldialogues.in/h-upload/2023/06/29/213142-marengo-asia-hospital.jpg", "publishedAt": "2023-06-30T04:00:22Z", "content": "Gurugram: A 28-year-old man suffering from Schizophrenia from 13 years of age, became the first to undergo surgery for schizophrenia in India. In a path-breaking effort, the Neurosurgery team at Mare… [+5432 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Roshni Dhar", "title": "Study reveals significant RBCs alterations after COVID-19 infection in children - Medical Dialogues", "description": "A team of researchers conducted a study to understand the relationship between alterations in RBCs and the clinical course of COVID-19 in this age group. This article was published in Scientific...", "url": "https://medicaldialogues.in/mdtv/pediatrics-neonatology/videos/study-reveals-significant-rbcs-alterations-after-covid-19-infection-in-children-113703", "urlToImage": "https://medicaldialogues.in/h-upload/2023/06/30/213184-study-reveals-significant-rbcs-alterations-after-covid-19-infection-in-children.jpg", "publishedAt": "2023-06-30T03:45:52Z", "content": "A team of researchers conducted a study to understand the relationship between alterations in RBCs and the clinical course of COVID-19 in this age group. This article was published in Scientific Repo… [+1830 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Risk Factors of Overweight, Obesity - School Children 6-18 y | NDS - Dove Medical Press", "description": "Intricate network of risk factors inc. socioeconomic, household, environmental, biological elements signif. contribute to growing prevalence of obesity", "url": "https://www.dovepress.com/risk-factors-of-overweight-and-obesity-among-school-children-aged-6-to-peer-reviewed-fulltext-article-NDS", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-06-30T03:39:29Z", "content": "Introduction\r\nDisease patterns are undergoing significant changes worldwide, capturing the interest of different healthcare professionals and policymakers.1 This is especially noticeable in low- and … [+65550 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "11 benefits of using mango seeds for body, skin, and hair - Recipes", "description": "As per Ayurveda, mango seeds are rich in nutrients and have antioxidant and anti-inflammatory properties that fight inflammation and boost metabolism and immunity. Tap next to learn its benefits for the body, skin, and hair.", "url": "https://recipes.timesofindia.com/web-stories/11-benefits-of-using-mango-seeds-for-body-skin-and-hair/photostory/101379191.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101379204,imgsize-56648,width-900,height-1200,resizemode-6/101379204.jpg", "publishedAt": "2023-06-30T03:30:00Z", "content": "As per Ayurveda, mango seeds are rich in nutrients and have antioxidant and anti-inflammatory properties that fight inflammation and boost metabolism and immunity. Tap next to learn its benefits for … [+24 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rajeshwaari Kalla", "title": "Symptoms of enlarged adenoids in children: Persistent common cold, difficulty breathing, hearing loss - Moneycontrol", "description": "Is your child having difficulty breathing? Frequent colds and mouth breathing may be signs of adenoid enlargement. Here are the symptoms, diagnosis, and treatment options for this common condition in children.", "url": "https://www.moneycontrol.com/news/health-and-fitness/symptoms-of-enlarged-adenoids-in-children-persistent-common-cold-difficulty-breathing-hearing-loss-10880281.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/Symptoms-of-enlarged-adenoids-in-children-770x433.jpg", "publishedAt": "2023-06-30T03:20:30Z", "content": "Is your child complaining of difficulty in breathing? Do they frequently suffer from a common cold and find it more comfortable to breathe through their mouth? Pay attention if you notice symptoms su… [+3499 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vinod Kumar", "title": "Experts pick holes in Pb malaria surveillance net - Indiatimes.com", "description": "An evaluation of malaria surveillance in Punjab carried out by a team of experts has found the state wanting in most parameters.", "url": "https://timesofindia.indiatimes.com/city/chandigarh/experts-pick-holes-in-pb-malaria-surveillance-net/articleshow/101379614.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101381592,width-1070,height-580,imgsize-1173608,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-30T03:02:00Z", "content": "9 soft skills that are always in demand at work"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A healthy lifestyle reduces risk of developing severe liver disease - News-Medical.Net", "description": "Researchers investigate the correlation between a healthy lifestyle and Life’s Essential 8 scores in new-onset severe non-alcoholic fatty liver disease.", "url": "https://www.news-medical.net/news/20230629/A-healthy-lifestyle-reduces-risk-of-developing-severe-liver-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_752559_16880886301772685.jpg", "publishedAt": "2023-06-30T02:48:00Z", "content": "In a recent study published in Metabolism, researchers investigate the correlation between a healthy lifestyle and Life's Essential 8 (LE8) scores in new-onset severe non-alcoholic fatty liver diseas… [+5320 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Parth Shastri", "title": "Never too young for a heart attack: Sudden deaths leave more questions than answers - Times of India", "description": "Earlier this week, Gujarat was jolted by shocking deaths of two students - a 17-year-old girl in Navsari and a 28-year-old youth in Rajkot - who fata", "url": "https://timesofindia.indiatimes.com/city/ahmedabad/emri-108-logs-14-of-heart-emergencies-in-10-30-age-grp/articleshow/101377301.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101377325,width-1070,height-580,imgsize-1242523,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-30T00:03:00Z", "content": "9 soft skills that are always in demand at work"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Probing the underlying mechanisms of immune dysfunction in Chronic lymphocytic leukemia - Tech Explorist", "description": "With a median age at diagnosis of 70 years, chronic lymphocytic leukemia (CLL) is the most common form of leukemia in Western nations and primarily", "url": "https://www.techexplorist.com/mechanisms-immune-dysfunction-chronic-lymphocytic-leukemia/63211/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/3qk8xDI.jpg", "publishedAt": "2023-06-29T18:00:00Z", "content": "With a median age at diagnosis of 70 years, chronic lymphocytic leukemia (CLL) is the most common form of leukemia in Western nations and primarily affects the elderly. Following SARS-CoV-2 mRNA immu… [+3590 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Noah Fromson", "title": "Researchers discover new opportunities for preventing kidney injury following cardiac surgery - Medical Xpress", "description": "When a person has heart surgery, they're often managed on cardiopulmonary bypass. This process, involving a machine that temporarily takes over for the heart and lungs during the operation, has been linked to an elevated risk of kidney injury, including requi…", "url": "https://medicalxpress.com/news/2023-06-opportunities-kidney-injury-cardiac-surgery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/kidney.jpg", "publishedAt": "2023-06-29T17:25:58Z", "content": "When a person has heart surgery, they're often managed on cardiopulmonary bypass. This process, involving a machine that temporarily takes over for the heart and lungs during the operation, has been … [+4680 chars]"}, {"source": {"id": null, "name": "Boldsky.com"}, "author": "Amritha K", "title": "Fenugreek For Weight Loss: 3 Ways To Use This Kitchen Herb To Lose Fat - Boldsky", "description": "Read on to know how fenugreek can aid in weight loss with these 3 powerful methods....", "url": "https://www.boldsky.com/health/fenugreek-for-weight-loss-3-ways-to-use-this-kitchen-herb-to-lose-fat-147084.html", "urlToImage": "https://www.boldsky.com/img/1200x60x675/2023/06/fenugreek-weightloss-feature-1688055421.jpg", "publishedAt": "2023-06-29T16:20:57Z", "content": "Fenugreek,\r\na\r\npowerful\r\nherb\r\nknown\r\nfor\r\nits\r\nnumerous\r\nhealth\r\nbenefits,\r\ncan\r\nalso\r\nbe\r\nan\r\neffective\r\naid\r\nin\r\nweight\r\nloss.\r\nWith\r\nits\r\nnatural\r\nproperties,\r\nfenugreek\r\ncan\r\nhelp\r\nboost\r\nmetabo… [+2975 chars]"}, {"source": {"id": null, "name": "Cityairnews.com"}, "author": "City Air News", "title": "Bladder Cancer in Women: Symptoms, Treatment & Prevention - Cityairnews", "description": "Bladder cancer is a highly prevalent disease that affects both men and women. However, when it comes to diagnosing and treating this condition, women encounter various difficulties. Bladder cancer in women sometimes occurs with unusual symptoms and needs spec…", "url": "https://www.cityairnews.com/content/bladder-cancer-in-women-symptoms-treatment-prevention", "urlToImage": "https://www.cityairnews.com/uploads/images/image_750x_5e15b93be6415.jpg", "publishedAt": "2023-06-29T15:44:45Z", "content": "By Dr. Chandrashekhar Prasad Singh, Medical Oncologist, HCG Cancer Centre, Ranchi\r\nBladder cancer is a highly prevalent disease that affects both men and women. However, when it comes to diagnosing a… [+4177 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Durgesh Nandan Jha", "title": "If you are prediabetic, this is your chance to beat diabetes - Indiatimes.com", "description": "Diabetes is one of the fastest-growing health issues in India.", "url": "https://timesofindia.indiatimes.com/do-you-have-prediabetes/articleshow/101371551.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101371690,width-1070,height-580,imgsize-8240,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-29T14:43:00Z", "content": null}]}