{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Australian researchers unearth a new form of antimicrobial resistance - News-Medical.Net", "description": "Australian researchers have uncovered a new form of antimicrobial resistance (AMR) – undetectable using traditional laboratory testing methods – in a discovery set to challenge existing efforts to monitor and tackle one of the world's greatest health threats.", "url": "https://www.news-medical.net/news/20221130/Australian-researchers-unearth-a-new-form-of-antimicrobial-resistance.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/pill_antibiotics-620x480.jpg", "publishedAt": "2022-11-30T16:14:00Z", "content": "Australian researchers have uncovered a new form of antimicrobial resistance (AMR) – undetectable using traditional laboratory testing methods – in a discovery set to challenge existing efforts to mo… [+3969 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Paurush Omar", "title": "Mumbai: Measles cases rise to 323, response immunisation to begin tomorrow | Mint - Mint", "description": "Mumbai on Wednesday recorded 15 new measles cases which took the tally of cases recorded in Maharashtra's capital since the start of the year to 323", "url": "https://www.livemint.com/news/india/mumbai-measles-cases-rise-to-323-response-immunisation-to-begin-tomorrow-11669821131053.html", "urlToImage": "https://images.livemint.com/img/2022/11/30/600x338/Measles_1669375173293_1669821557624_1669821557624.jpg", "publishedAt": "2022-11-30T15:25:31Z", "content": "The Brihanmumbai Municipal Corporation (BMC) reported that Mumbai saw 15 new cases of the measles on Wednesday, with no fatalities. Since the beginning of the year, 323 cases have been reported in th… [+1270 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "48500-Year-Old Zombie Virus Revived In Russia: What Is The Pandoravirus & Is It Killer? - India Today", "description": "Climate change due to global warming is rapidly thawing the ancient permafrost, which may pose a new threat to humans, according to researchers who revived n...", "url": "https://www.youtube.com/watch?v=_jxOXXocsoY", "urlToImage": "https://i.ytimg.com/vi/_jxOXXocsoY/maxresdefault.jpg", "publishedAt": "2022-11-30T14:55:52Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Brand Studio", "title": "Transition Care, a necessity for total health recovery in senior citizens - Hindustan Times", "description": "Transition Care is defined as a short-term specialized care and support provided during a movement from one healthcare setting to either another or to home that helps the patient regain functional independence and full recovery", "url": "https://www.hindustantimes.com/brand-stories/transition-care-a-necessity-for-total-health-recovery-in-senior-citizens-101669798426446.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/30/1600x900/SG_1669798555807_1669798563251_1669798563251.jpg", "publishedAt": "2022-11-30T12:28:46Z", "content": "Aging is often notable for imposing numerous health conditions that require hospitalization. Health conditions that occur in such age groups range from mild infections to severe health disorders. Hos… [+4080 chars]"}, {"source": {"id": null, "name": "Diagnostic Imaging"}, "author": "Katie Robinson", "title": "Can Ultrasound-Guided Hydrodissection be a Viable Alternative for Carpal Tunnel Syndrome? - Diagnostic Imaging", "description": "A randomized controlled trial shows that the minimally invasive treatment provided long-term relief of carpal tunnel syndrome.", "url": "https://www.diagnosticimaging.com/view/can-ultrasound-guided-hydrodissection-be-a-viable-alternative-for-carpal-tunnel-syndrome-", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/diag_imaging/eb513545caf5a386b32048793554ae4247f17126-940x788.png?fit=crop&auto=format", "publishedAt": "2022-11-30T12:14:50Z", "content": "Ultrasound-guided hydrodissection of the median nerve with normal saline provided complete relief for patients with carpal tunnel syndrome (CTS), a condition that affects about 3 percent of the popul… [+3359 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Jagran Josh", "title": "What is Parvovirus?: Know how it spreads, what are the symptoms and how to prevent it - Jagran Josh", "description": "The infectious DNA disease Parvo is a virus that usually causes severe illness in young unvaccinated dogs and as per recent reports, the virus is on the verge of an outbreak.", "url": "https://www.jagranjosh.com/general-knowledge/what-is-parvovirus-1669810498-1", "urlToImage": "https://img.jagranjosh.com/images/2022/November/30112022/parvovirus.jpg", "publishedAt": "2022-11-30T12:12:00Z", "content": "The infectious DNA disease Parvo is a virus that usually causes severe illness in young unvaccinated dogs and as per recent reports, the virus is on the verge of an outbreak. This disease affects the… [+3495 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weight Loss Tips: Can Genetically Slow Metabolism Be Improved? - NDTV", "description": "The resting metabolic rates of people who share the same sex, age, height, weight, and body composition can vary. Unfortunately, increasing your metabolism is not as simple as it may seem.", "url": "https://www.ndtv.com/health/weight-loss-tips-can-genetically-slow-metabolism-be-improved-3566229", "urlToImage": "https://c.ndtvimg.com/bubib2kg_genes_625x300_13_July_18.jpg", "publishedAt": "2022-11-30T11:41:30Z", "content": "Metabolism is greatly influenced by our genetics\r\nOur metabolism is often talked about a lot when discussing weight gain or weight loss. Metabolism in layman's terms is the rate at which your body bu… [+4142 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Mrityunjay Bose", "title": "Missed opportunities affecting AIDS control: Dr Ishwar Gilada - Deccan Herald", "description": "An array of “missed opportunities‟ is plaguing the AIDS response worldwide and there is need to progress on every SDG goal, says Dr Ishwar Gilada,  the first person to raise the alarm against AIDS in India and to start the first AIDS clinic.", "url": "https://www.deccanherald.com/national/missed-opportunities-affecting-aids-control-dr-ishwar-gilada-1167128.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/30/hiv-istock-1130764-1658947846-1166407-1669630597-1167128-1669808355.jpg", "publishedAt": "2022-11-30T11:39:15Z", "content": "An array of missed opportunities is plaguing the AIDS response worldwide and there is need to progress on every SDG goal, says Dr Ishwar Gilada,  the first person to raise the alarm against AIDS in I… [+3434 chars]"}, {"source": {"id": null, "name": "Techbullion.com"}, "author": "Henry ford, Angela Scott-Briggs, TechBullion", "title": "How to Choose the Right Hair Loss Treatment - TechBullion", "description": "Hair loss can be a difficult and embarrassing experience, but the good news is that there is a wide range of treatments available to help restore hair growth. Making an informed decision can be challenging when there are so many options to choose from. To mak…", "url": "https://techbullion.com/how-to-choose-the-right-hair-loss-treatment/", "urlToImage": "https://techbullion.com/wp-content/uploads/2022/11/hair-fall-1000x600.webp", "publishedAt": "2022-11-30T11:33:16Z", "content": "Hair loss can be a difficult and embarrassing experience, but the good news is that there is a wide range of treatments available to help restore hair growth. Making an informed decision can be chall… [+6350 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "5 pre-workout snacks that you can munch on before exercise - Northeast Now", "description": "It is always recommended by healthcare experts that a person should not eat heavy meals before exercise.", "url": "http://nenow.in/lifestyle/5-pre-workout-snacks-that-you-can-munch-on-before-exercise.html", "urlToImage": "https://nenow.in/wp-content/uploads/2022/11/5-pre-workout-snacks.jpg", "publishedAt": "2022-11-30T11:08:58Z", "content": "Exercise is an important activity for maintaining both physical and mental health and is overall a necessity for holistic well-being.\r\nIt is always recommended by healthcare experts that a person sho… [+2255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mylab launches kit for detecting TB, multidrug resistance variant in single test - The Indian Express", "description": "The kit has been named PathoDetect MTB RIF and INH drug resistance kit.", "url": "https://indianexpress.com/article/cities/pune/tuberculosis-mylab-testing-kit-8298568/", "urlToImage": "https://images.indianexpress.com/2022/11/TB_kit_1200.jpeg", "publishedAt": "2022-11-30T11:02:35Z", "content": "In a first, a single test that will be able to detect tuberculosis and multidrug-resistant tuberculosis was launched Wednesday by Pune-based Mylab Discovery Solutions private limited.After leading di… [+3628 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "New potential drug target to treat heart disease found: Study - The Week", "description": "Scientists have uncovered details of a phenomenon that contributes to coronary artery disease, more commonly known as heart disease, an advance that may lead to new drug treatments for fighting heart disease, according to a study.", "url": "https://www.theweek.in/news/health/2022/11/30/new-potential-drug-target-to-treat-heart-disease-found--study.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/health/images/2020/8/25/heart-rep.jpg", "publishedAt": "2022-11-30T10:50:00Z", "content": "Scientists have uncovered details of a phenomenon that contributes to coronary artery disease, more commonly known as heart disease, an advance that may lead to new drug treatments for fighting heart… [+3830 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "World AIDS Day 2022: What is the theme for this year, when is it? - Economic Times", "description": "To provide everyone with access to HIV research, communities and countries in the Global South and North must share their technological resources. Communities may utilize the  Equalize  message to highlight the inequities they experience and push for the meas…", "url": "https://economictimes.indiatimes.com/news/new-updates/world-aids-day-2022-what-is-the-theme-for-this-year-when-is-it/articleshow/95883294.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95883311,width-1070,height-580,imgsize-25280,overlay-economictimes/photo.jpg", "publishedAt": "2022-11-30T10:49:00Z", "content": "The acronym AIDS refers to the illness known as acquired immunodeficiency syndrome. Infection with the human immunodeficiency virus is terminal for most people. When a virus severely compromises the … [+1445 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Measles outbreak in Kerala: 160 cases registered in Malappuram, parents urged to get children vaccinated - CNBCTV18", "description": "Measles also known as 'ancham pani' in local parlance, mainly affects children aged between 9 months and 5 years.", "url": "https://www.cnbctv18.com/healthcare/measles-outbreak-in-kerala-160-cases-registered-in-malappuram-parents-urged-to-get-children-vaccinated-15297461.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/11/measles-1019x573.jpg", "publishedAt": "2022-11-30T10:44:12Z", "content": "Next Article\r\nNew Alzheimer's drug found effective in reducing cognitive decline, claims study"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Carbon ultrafine particles accelerate lung cancer progression - ETHealthWorld", "description": "These particles are not just found in cigarette smoke; environmental and other natural fires also produce ultrafine particles by incompletely combusting organic debris. Kheradmand and colleagues at Rice University previously discovered that immune cells in th…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/carbon-ultrafine-particles-accelerate-lung-cancer-progression/95881459", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95881459,imgsize-5286,width-1200,height-628,overlay-ethealthworld/carbon-ultrafine-particles-accelerate-lung-cancer-progression.jpg", "publishedAt": "2022-11-30T10:30:00Z", "content": "Houston (US): While it may appear that smoking is hazardous for your lungs, it is unknown whether and how ultrafine particles in cigarette smoke affect the development and progression of lung cancer.… [+3524 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "New single-dose drug 95 per cent effective against sleeping sickness in adults: Lancet study - The Tribune India", "description": "A new, single-dose oral treatment for sleeping sickness is 95 per cent effective in adults and adolescents, regardless of disease stage, and could be a key factor in eliminating disease transmission by 2030, according to a study published in The Lancet Infect…", "url": "https://www.tribuneindia.com/news/health/new-single-dose-drug-95-per-cent-effective-against-sleeping-sickness-in-adults-lancet-study-456306", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_676253892.jpg", "publishedAt": "2022-11-30T10:28:00Z", "content": "PTI\r\nGeneva, November 30\r\nA new, single-dose oral treatment for sleeping sickness is 95 per cent effective in adults and adolescents, regardless of disease stage, and could be a key factor in elimina… [+5346 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI", "title": "New gadget identifies Covid-19 antibodies in five minutes: Report - Business Standard", "description": "The innovation is described in an article published in the journal ACS Biomaterials Science and Engineering", "url": "https://www.business-standard.com/article/technology/new-gadget-identifies-covid-19-antibodies-in-five-minutes-report-122113000038_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-04/12/full/1649747414-57.jpg", "publishedAt": "2022-11-30T10:27:00Z", "content": "Rapid, low-cost, and accurate tests are still required for epidemiological surveillance and healthcare services to monitor and contain the spread of SARS-CoV-2. Brazilian researchers have contributed… [+4185 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "These 3 foods can boost your child’s immunity | Parenting News - The Indian Express", "description": "Dr Dimple Jangda, an Ayurveda expert, said honey can liquefy the mucus accumulated in the nose, throat, and chest region of children", "url": "https://indianexpress.com/article/parenting/health-fitness/3-foods-can-boost-your-childs-immunity-honey-mint-leaves-healthy-snacks-8285532/", "urlToImage": "https://images.indianexpress.com/2022/11/kids-1.jpg", "publishedAt": "2022-11-30T10:10:13Z", "content": "Winter is here, and it needs no retelling that along with relief from the hot summer, it brings a host of diseases like cold, cough, etc. Generally, cold weather affects children more and they are pr… [+2007 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Healthy swaps for a healthier you - Ahmedabad Mirror", "description": "Healthy swaps for a healthier you", "url": "https://www.ahmedabadmirror.com/healthy-swaps-for-a-healthier-you/81848158.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1669748152156.jpg-org", "publishedAt": "2022-11-30T10:03:18Z", "content": "Healthy lifestyle, a common phrase that has come under scrutiny over the last couple years, has some of us checking our calorie count with every meal intake, and most of us aiming to achieve it, but … [+2941 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Miracles Start in the Lab: the quest to find a vaccine to cure AIDS - News-Medical.Net", "description": "To commemorate World AIDS Day, News Medical spoke to Dr. Larry Corey, an internationally renowned expert in virology, immunology, and vaccine development, and the former president and director of Fred Hutch, about his work within the field of HIV/AIDS researc…", "url": "https://www.news-medical.net/news/20221130/Miracles-start-in-the-lab-the-quest-to-find-a-vaccine-to-cure-AIDS.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731933_16692182142828828.png", "publishedAt": "2022-11-30T10:00:00Z", "content": "To commemorate World AIDS Day, News Medical spoke to Dr. Larry Corey, an internationally renowned expert in virology, immunology, and vaccine development, and the former president and director of Fre… [+6793 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "PTI", "title": "New Alzheimer's drug found effective in reducing cognitive decline, claims study - CNBCTV18", "description": "Alzheimer's is a complex disease with multiple underlying causes tied to the biology of aging. The Alzheimer’s Drug Discovery Foundation has long held that a combination drug approach is needed.", "url": "https://www.cnbctv18.com/healthcare/alzheimer-drug-found-effective-in-reducing-cognitive-decline-usa-15296851.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/11/Alzheimer-1019x573.jpg", "publishedAt": "2022-11-30T09:50:15Z", "content": "Previous Article\r\nMeasles outbreak in Kerala: 160 cases registered in Malappuram, parents urged to get children vaccinated"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Australia - Maggie Beer Keto Diet Gummies Gold Coast Keto Gummies SHOCKING Chemist Warehouse? - The Tribune India", "description": "Maggie Beer Keto Diet Gummies- A succor for all health ailments", "url": "https://www.tribuneindia.com/news/brand-connect/australia-maggie-beer-keto-diet-gummies-gold-coast-keto-gummies-shocking-chemist-warehouse-456292", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1540889088.jpg", "publishedAt": "2022-11-30T09:17:00Z", "content": "Maggie Beer Keto Diet Gummies- A succor for all health ailments\r\nThe researchers said Maggie Beer Keto Diet Gummies are an effective and natural alternative established to address innumerable health … [+8834 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Editorial", "title": "Make The Perfect Meal Plan For Intermittent Fasting - Slurrp", "description": "Once your body enters a fasted state, it begins to shift its primary source of fuel from glucose to fat. This can be a good thing if you’re trying to lose fat, but it also means that you need to be consuming adequate amounts of certain nutrients in order to s…", "url": "https://www.slurrp.com/article/make-the-perfect-meal-plan-for-intermittent-fasting-1669798945566", "urlToImage": "https://images.slurrp.com/prodarticles/aaoe01zpo6.webp", "publishedAt": "2022-11-30T09:16:57Z", "content": "Intermittent fasting is a powerful tool for anyone looking to get leaner, healthier, and maybe even live longer. Its also not the easiest nutrition strategy to adopt and sustain. In fact, its quite d… [+4279 chars]"}, {"source": {"id": null, "name": "Egypt Independent"}, "author": "CNN", "title": "Early research suggests promising use of AI to predict risk of heart attack or stroke using a single chest X-ray - Egypt Independent", "description": "Early research suggests a promising use of artificial intelligence to predict the 10-year risk of death from a heart attack or stroke from a single chest X-ray. The preliminary findings were presented", "url": "https://www.egyptindependent.com/early-research-suggests-promising-use-of-ai-to-predict-risk-of-heart-attack-or-stroke-using-a-single-chest-x-ray/", "urlToImage": "https://amayei.nyc3.digitaloceanspaces.com/2022/11/190225162327-heart-attack-young-women-heartbeat-00001007.jpg", "publishedAt": "2022-11-30T08:23:39Z", "content": "Early research suggests a promising use of artificial intelligence to predict the 10-year risk of death from a heart attack or stroke from a single chest X-ray.\r\nThe preliminary findings were present… [+4160 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/prashasti-sudhakarzeemedia-esselgroup-com/", "title": "New Covid Variant: What Is XBB Variant Of Coronavirus? How Severe Is It? All You Need To Know - Watch Video - India.com", "description": "New Covid Variant: What Is XBB Variant Of Coronavirus? How Severe Is It? All You Need To Know - Watch Video", "url": "https://www.india.com/video-gallery/new-covid-variant-what-is-xbb-variant-of-coronavirus-how-severe-is-it-all-you-need-to-know-watch-video-5772678/", "urlToImage": "https://www.india.com/wp-content/uploads/2022/11/xxb-variant-covid.jpg", "publishedAt": "2022-11-30T08:19:00Z", "content": "Talking about the countries where it has spread., then XBB has been detected in 35 countries as of October 2022. It recently drove a surge of corona cases in Singapore and has been responsible for ma… [+755 chars]"}, {"source": {"id": null, "name": "Gutmicrobiotaforhealth.com"}, "author": "GMFH Editing Team", "title": "Lifestyle management for type 2 diabetes: it's all about what's inside - Gut Microbiota for Health", "description": "Dr. Stéphane Schneider explains what recent studies have shown regarding the importance of taking care of what you eat for preventing or better controlling type 2 diabetes through the gut microbiome.", "url": "https://www.gutmicrobiotaforhealth.com/lifestyle-management-for-type-2-diabetes-its-all-about-whats-inside/", "urlToImage": "https://www.gutmicrobiotaforhealth.com/wp-content/uploads/2022/11/stephane-schneider-10-years-GMFH.png", "publishedAt": "2022-11-30T08:01:49Z", "content": "Emerging evidence suggests a balanced diet with a predominance of plant-based foods is associated with specific gut microbes, which are linked to a lower risk of developing type 2 diabetes. Dr. Stéph… [+3182 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Retinal cells have potential to protect from diabetic retinopathy: Study - Hindustan Times", "description": "New research suggests that an endogenous system that protects human retinal endothelial cells from harmful effects of the hyperglycemia (an excess of blood sugar) may be responsible for the delayed onset of DR. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/retinal-cells-have-potential-to-protect-from-diabetic-retinopathy-study-101669793746780.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/30/1600x900/eye_complications_covid_thumb_1650965553720_1669794044483_1669794044483.jpg", "publishedAt": "2022-11-30T07:43:01Z", "content": "Diabetic retinopathy (DR), a primary cause of blindness in working-age people, affects about one-third of diabetic patients. DR usually develops after a long period of diabetes mellitus (DM), and som… [+3885 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Subhasish Dutta", "title": "What Is Colon Cancer? Know Its Causes, Symptoms And Different Types - Jagran English", "description": "", "url": "https://english.jagran.com/lifestyle/what-is-colon-cancer-know-its-causes-symptoms-and-different-types-10055829", "urlToImage": "https://imgeng.jagran.com/images/2022/nov/coloncancer1669793974966.jpg", "publishedAt": "2022-11-30T07:20:10Z", "content": "COLON CANCER is the name for the sort of cancer that develops in your colon or rectum. Depending on the stage of the colon cancer, the signs, the course of treatment, and the prognosis will all vary.… [+2265 chars]"}, {"source": {"id": null, "name": "Adda247.com"}, "author": "priyankadasgupta", "title": "Monkeypox Disease Name Changed to Mpox by WHO - Adda247", "description": "The World Health Organisation has changed the name of the disease Monkeypox to Mpox, as they receive complaints about the word Monkeypox conjuring up racist tropes and stigmatizing patients. The recommendation follows outbreaks that began about six months ago…", "url": "https://currentaffairs.adda247.com/monkeypox-disease-name-changed-to-mpox-by-who/", "urlToImage": "https://wpassets.adda247.com/wp-content/uploads/multisite/sites/5/2022/11/30121408/WHO-has-changed-the-name-of-Monkeypox-disease-to-mpox-.png", "publishedAt": "2022-11-30T06:47:07Z", "content": "The World Health Organisation has changed the name of the disease Monkeypox to Mpox, as they receive complaints about the word Monkeypox conjuring up racist tropes and stigmatizing patients. The reco… [+1318 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Ways To Improve Your Gut Health - NDTV", "description": "Gut health: Your diet and lifestyle affect gut health in more ways than one. Here are 5 simple steps that can help you achieve a healthy gut.", "url": "https://www.ndtv.com/health/gut-health-heres-what-you-should-do-for-a-heathy-gut-3565240", "urlToImage": "https://c.ndtvimg.com/2019-11/tmr4blao_milk-and-curd-_625x300_08_November_19.jpg", "publishedAt": "2022-11-30T06:37:29Z", "content": "Adding probiotics and prebiotics to your diet can help boost gut health\r\nIt is essential to take care of your gastrointestinal or gut health in order to have a healthy body. Our gut plays a crucial r… [+2128 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: Prevention And Diet Management Strategy By Our Consultant Nutritionist - NDTV Food", "description": "Diabetic prevention is all about a healthy lifestyle that needs daily inputs. It is not a \"DIET\" that only one person needs to adhere to but a way for all to follow.", "url": "https://food.ndtv.com/health/diabetes-prevention-and-diet-management-strategy-by-our-consultant-nutritionist-3565101", "urlToImage": "https://c.ndtvimg.com/2022-09/0mft5mk8_raw-food-diet-in-diabetes_625x300_06_September_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-11-30T05:34:03Z", "content": "Diabetes is a condition wherein the body's glucose metabolism is out of sync. Normally, food is digested and glucose is released into the blood stream. At the same time the beta cells of the pancreas… [+5585 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Nearly 40 million children are dangerously susceptible to growing measles threat: WHO - Express Healthcare", "description": "In 2021, there were an estimated 9 million cases and 128 000 deaths from measles worldwide. Twenty-two countries experienced large and disruptive outbreaks", "url": "https://www.expresshealthcare.in/news/nearly-40-million-children-are-dangerously-susceptible-to-growing-measles-threat-who/437115/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2022/11/syringe-417786_640.jpg", "publishedAt": "2022-11-30T05:28:48Z", "content": "In 2021, there were an estimated 9 million cases and 128 000 deaths from measles worldwide. Twenty-two countries experienced large and disruptive outbreaks\r\nMeasles vaccination coverage has steadily … [+2995 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "What is a dangerously low blood sugar level or hypoglycemia? Know how to regulate it - Times Now", "description": "Dangerously low blood sugar or hypoglycemia needs immediate treatment or else it can be life-threatening. Treatment involves quickly getting your blood sugar back to within the standard range either with a high-sugar food or drink or with medication. Long-ter…", "url": "https://www.timesnownews.com/health/what-is-a-dangerously-low-blood-sugar-level-or-hypoglycemia-know-how-to-regulate-it-article-95872343", "urlToImage": "https://static.tnn.in/thumb/msid-95872343,imgsize-100,width-1280,height-720,resizemode-75/95872343.jpg", "publishedAt": "2022-11-30T04:12:01Z", "content": "Hiring across e-commerce, BFSI, retail surge during festive season; temp staff demand in FMCG zooms 2300%"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Study finds people with persistent asthma linked to artery blockages; Low, moderate stress has b... - Click On Detroit | Local 4 | WDIV", "description": "Dr. Frank McGeorge is here with a new study highlighting a long-term risk for people with asthma. The research was published in the Journal of the American H...", "url": "https://www.youtube.com/watch?v=ADtskFlrc3I", "urlToImage": "https://i.ytimg.com/vi/ADtskFlrc3I/maxresdefault.jpg", "publishedAt": "2022-11-29T23:55:45Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New weight loss drug could be life-saving for some patients - CBS Boston", "description": "Weight loss drug Wegovy is not available to everyone. WBZ-TV's Dr. Mallika Marshall reports.", "url": "https://www.youtube.com/watch?v=TddU2KWRrXo", "urlToImage": "https://i.ytimg.com/vi/TddU2KWRrXo/hqdefault.jpg", "publishedAt": "2022-11-29T22:38:00Z", "content": null}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Study on masks vs N95 respirators for health workers spurs concerns - CIDRAP", "description": "The findings suggest medical masks may offer similar protection as respirators against COVID-19, but experts say hold on.", "url": "https://www.cidrap.umn.edu/news-perspective/2022/11/study-masks-vs-n95-respirators-health-workers-spurs-concerns", "urlToImage": "https://www.cidrap.umn.edu/sites/default/files/styles/thumbnail/public/images/news/masks_and_n95s.jpg?itok=he1nYdkg", "publishedAt": "2022-11-29T19:32:44Z", "content": "A study today in the Annals of Internal Medicine suggests that medical masks may offer similar effectiveness as N95 respirators in protecting healthcare workers (HCWs) exposed to COVID-19 patients in… [+13641 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "WATCH: How You Can Protect Your Child From Measles - India Today", "description": "Measles continues to pose a challenge to many children across India. Here’s how you can protect your children from measles#Measles #Rubeola #Health #SocialMe...", "url": "https://www.youtube.com/watch?v=BvvW30fil5Q", "urlToImage": "https://i.ytimg.com/vi/BvvW30fil5Q/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AGUA4AC0AWKAgwIABABGD8gZSg9MA8=&rs=AOn4CLCKQm7eG3w-r6uLcHXCTIaDZHlYoA", "publishedAt": "2022-11-29T19:00:07Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: Retinal cells have potential to protect from diabetic retinopathy - ANI News", "description": "Diabetes mellitus (DM) causes diabetic retinopathy (DR), which is the major cause of blindness in people of working age. DR usually appears after many years of diabetes, and some people do not develop diabetic retinopathy for more than 50 years.", "url": "https://www.aninews.in/news/health/study-retinal-cells-have-potential-to-protect-from-diabetic-retinopathy20221130001038", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221129183734.jpg", "publishedAt": "2022-11-29T18:40:00Z", "content": "Philadelphia [US], November 30 (ANI): Diabetic retinopathy (DR), a primary cause of blindness in working-age people, affects about one-third of diabetic patients. DR usually develops after a long per… [+3714 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Sue Hughes", "title": "Adding Salt to Food Linked to Higher CVD Risk - Medscape", "description": "A lower frequency of adding salt to food is associated with lower risk of cardiovascular disease, particularly heart failure and ischemic heart disease, a new study has found.", "url": "https://www.medscape.com/viewarticle/984718", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_210426_salt_sodium_800x450.jpg", "publishedAt": "2022-11-29T17:50:28Z", "content": "A lower frequency of adding salt to food is associated with lower risk of cardiovascular disease, particularly heart failure and ischemic heart disease, a new study has found.\r\nThe study analyzed the… [+7554 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Meghmala", "title": "Lifesaver! An AI-Based Blood Test that can Detect Liver Cancer - Analytics Insight", "description": "The novel artificial intelligence-based blood testing technology, DELFI successfully detected more than 80 percent of liver cancer through DNA referencing.", "url": "https://www.analyticsinsight.net/lifesaver-an-ai-based-blood-test-that-can-detect-liver-cancer/", "urlToImage": "https://www.analyticsinsight.net/wp-content/uploads/2022/11/AI-Based-Blood-Test.jpg", "publishedAt": "2022-11-29T16:43:11Z", "content": "DELFI functions by identifying alterations in the DNA fragmentation of cancer cells that are lost in circulation. Cell-free DNA is the name for this kind of DNA (cfDNA). Researchers can learn more ab… [+3341 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Lung Cancer Awareness Month Special | NewsX - NewsX", "description": "To Subscribe our YouTube channel \"NewsX\" click on the link below:-https://www.youtube.com/user/newsxlive/Watch More Videos: https://www.youtube.com/user/news...", "url": "https://www.youtube.com/watch?v=yLyn-L0R3AA", "urlToImage": "https://i.ytimg.com/vi/yLyn-L0R3AA/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGH8gEygUMA8=&rs=AOn4CLA5SVdsSO6zBLHGrPUkTD2zsyb-zg", "publishedAt": "2022-11-29T16:36:29Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Universal Flu vaccine could become available soon | FOX 13 Seattle - FOX 13 Seattle", "description": "A universal Flu vaccine, designed to combat all strains and variations of the flu virus, may soon become available in the United States. Dr. Mike Cirigliano ...", "url": "https://www.youtube.com/watch?v=cYhZJb6Q9BM", "urlToImage": "https://i.ytimg.com/vi/cYhZJb6Q9BM/maxresdefault.jpg", "publishedAt": "2022-11-29T16:01:16Z", "content": null}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Higher HbA1c levels and longer duration of Diabetes increase HF risk among Diabetics - Medical Dialogues", "description": "New research found that there is an increased risk of heart failure among diabetic patients who have had diabetes for a long duration and increased HbA1c levels. The study results were published", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/higher-hba1c-levels-and-longer-duration-of-diabetes-increase-hf-risk-among-diabetics-103145", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/29/186585-acute-heart-failure.jpg", "publishedAt": "2022-11-29T16:00:50Z", "content": "New research found that there is an increased risk of heart failure among diabetic patients who have had diabetes for a long duration and increased HbA1c levels. The study results were published in T… [+2301 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds proteins prevent scar formation in brain - ANI News", "description": "Two proteins reduce scar formation in the brain, boosting tissue's ability to recover, according to study.", "url": "https://www.aninews.in/news/science/study-finds-proteins-prevent-scar-formation-in-brain20221129212749", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221129155729.jpg", "publishedAt": "2022-11-29T15:57:00Z", "content": "Munich [Germany], November 29 (ANI): Researchers revealed how two proteins reduce scar formation in the brain, boosting tissue's ability to recover.Whereas cells in most endogenous tissues renew them… [+3272 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Maha Govt Not Serious in Tackling Measles Outbreak: Ex-health Minister Tope - News18", "description": "Tope claimed 14 children have died due to measles in the state so far but the government is not doing enough.", "url": "https://www.news18.com/news/india/maha-govt-not-serious-in-tackling-measles-outbreak-ex-health-minister-tope-6500131.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/nurse-165217000416x9.jpg", "publishedAt": "2022-11-29T15:46:55Z", "content": "Former Maharashtra Health Minister Rajesh Tope on Tuesday alleged the Eknath Shinde-BJP government is not serious in tackling the measles outbreak.\r\nTope claimed 14 children have died due to measles … [+1194 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Time Under 90% Oxygen Saturation and Systemic Hypertension in Patients | NSS - Dove Medical Press", "description": "Time Under 90% Oxygen Saturation and Systemic Hypertension in Patients with Obstructive Sleep Apnea Syndrome", "url": "https://www.dovepress.com/time-under-90-oxygen-saturation-and-systemic-hypertension-in-patients--peer-reviewed-fulltext-article-NSS", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-11-29T15:22:05Z", "content": "Introduction\r\nObstructive sleep apnea(OSA) is a breathing disorder characterized by the disappearance or significant attenuation of oronasal airflow during sleep. It has been estimated that 936 milli… [+25707 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "The Science Advisory Board staff writers", "title": "Novel nanoparticles deliver cancer therapy - The Science Board", "description": "University of Pittsburgh researchers have designed cancer-fighting nanoparticles that co-deliver an existing chemotherapy drug along with a novel immunotherapy that silences an immunosuppression gene.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=5053", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_can/2020_01_08_19_18_8786_Nanoparticle_blood_STOCK_20201006165034.jpeg", "publishedAt": "2022-11-29T14:42:49Z", "content": "Their research, published November 24 in the journal Nature Nanotechnology, found that the therapy shrunk tumors in mice with colon and pancreatic cancer. \r\nResidual cancer cells often cause relapse … [+2149 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Fluticasone Exhalation Delivery System Aids Sinusitis without Polyps - Medical Dialogues", "description": "CHICAGO: Findings from a phase 3 trial published in Annals of Allergy, Asthma & Immunology showed that the exhalation delivery system with fluticasone (EDS-FLU) reduced symptoms and sinus...", "url": "https://medicaldialogues.in/ent/news/fluticasone-exhalation-delivery-system-aids-sinusitis-without-polyps-102756", "urlToImage": "https://medicaldialogues.in/h-upload/2021/02/15/147853-chronic-rhinosinusitis.jpg", "publishedAt": "2022-11-29T14:30:32Z", "content": "CHICAGO: Findings from a phase 3 trial published in Annals of Allergy, Asthma &amp; Immunology showed that the exhalation delivery system with fluticasone (EDS-FLU) reduced symptoms and sinus opacifi… [+2684 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Man Slips Into Coma, Undergoes 30 Surgeries, Amputations After A Mosquito Bite Report - ABP Live", "description": "The 27-yeard-old Sebastian Rotschke was admitted to the ICU and spent four weeks in a coma after he was bitten by an Asian tiger mosquito", "url": "https://news.abplive.com/offbeat/man-slips-into-coma-undergoes-30-surgeries-amputations-after-a-mosquito-bite-report-1566424", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/29/70408a03e223ad7ec514f205372b38791669728295296379_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-11-29T13:26:12Z", "content": "Mosquito bites can transmit several types of diseases like Dengue and Malaria that sometimes prove fatal. Recently, a German man suffered various health issues including having to go through 30 opera… [+1516 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Revive Daily Review 2023 Updated: Does Revive Daily Work? What to Know Before Buying! - The Tribune India", "description": "The primary purpose of Revive Daily is to improve sleep quality. However, it also has a positive impact on the production of growth hormones. The formulation makes use of natural substances to lessen the likelihood of causing injury to the body. At the same t…", "url": "https://www.tribuneindia.com/news/brand-connect/revive-daily-review-2023-updated-does-revive-daily-work-what-to-know-before-buying-455977", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1559274733.png", "publishedAt": "2022-11-29T12:46:00Z", "content": "The primary purpose of Revive Daily is to improve sleep quality. However, it also has a positive impact on the production of growth hormones. The formulation makes use of natural substances to lessen… [+12584 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Responding to malaria, TB as crucial as emerging health threats: Dr Fauci - Morung Express", "description": "New York, November 29 (IANS) The world needs to improve healthcare capabilities to respond to established infectious diseases like malaria and tuberculosis while also responding to emerging threats, the outgoing director of National Institute of Allergy a", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2022/11/41071246_1669723542_836009dd633e2aa414abb615a993c1bc.jpg", "publishedAt": "2022-11-29T12:07:11Z", "content": "New York, November 29 (IANS) The world needs to improve healthcare capabilities to respond to established infectious diseases like malaria and tuberculosis while also responding to emerging threats, … [+1513 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Abhishek Hoshing", "title": "Eye problems in children: 5 signs that indicate your kid needs eyeglasses - Health shots", "description": "How to identify the vision problem in children? Watch out for these 5 symptoms to know if your kid needs eyeglasses or not.", "url": "https://www.healthshots.com/how-to/how-to-identify-the-vision-problem-in-children-here-are-5-symptoms/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/29160343/How-to-identify-the-vision-problem.jpg", "publishedAt": "2022-11-29T12:00:55Z", "content": "Vision problems are quite common in children these days. In fact, according to the Vision 2020 manual, 12-17 per cent of children in India are reported to have eye vision problems. However, one of th… [+4234 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Cutting Edge: How zebra fish holds the key to curing your back pain - The Indian Express", "description": "Pune scientists find protein in zebra fish that promotes disc regeneration and heals the backbone. Since humans also have the protein, the fish model can help us harness it better, says Dr Chinmoy Patra, senior scientist at Agharkar Research Institute.", "url": "https://indianexpress.com/article/lifestyle/health-specials/how-zebra-fish-holds-the-key-to-curing-your-back-pain-8296393/", "urlToImage": "https://images.indianexpress.com/2022/11/IMG_20221128_174138-1.jpg", "publishedAt": "2022-11-29T11:27:47Z", "content": "A protein found in the backbone of a zebra fish that helps it heal itself as it gets older may actually regenerate your backbone too. It can get rid of those terrible back and neck pains caused by de… [+4636 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Simultaneous radiation, immunotherapy beneficial for subset of lung cancer patients - ETHealthWorld", "description": "Adding radiation therapy (RT) to immune checkpoint blockade (ICB) has produced excellent results in a number of studies in animals; however, this combination therapy has not been validated in people. The main clinical question right now is whether and how com…", "url": "https://retail.economictimes.indiatimes.com/news/industry/simultaneous-radiation-immunotherapy-beneficial-for-subset-of-lung-cancer-patients/95855704", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95855704,imgsize-419630,width-1200,height-628,overlay-ethealthworld/simultaneous-radiation-immunotherapy-beneficial-for-subset-of-lung-cancer-patients.jpg", "publishedAt": "2022-11-29T11:15:00Z", "content": "Chicago (US): Cancer cells attempt to survive in many different cancers by avoiding immune system attacks. Immune checkpoints are methods that cancer cells use to deceive the immune system into belie… [+5711 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Dimethyl fumarate halts radiologic progression of multiple sclerosis: Study - Medical Dialogues", "description": "A new study published in Annals of Neurology suggests that the advantage of a disease-modifying treatment in radiologically isolated syndrome (RIS) patients in averting a first acute clinical...", "url": "https://medicaldialogues.in/neurology-neurosurgery/news/dimethyl-fumarate-halts-radiologic-progression-of-multiple-sclerosis-study-103068", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/21/179000-brain.jpg", "publishedAt": "2022-11-29T10:22:31Z", "content": "A new study published in Annals of Neurology suggests that the advantage of a disease-modifying treatment in radiologically isolated syndrome (RIS) patients in averting a first acute clinical episode… [+2190 chars]"}, {"source": {"id": null, "name": "Bqprime.com"}, "author": "PTI", "title": "AstraZeneca India Gets Approval To Market Anti-Diabetes Drug - BQ Prime", "description": "The approval is applicable for both diabetic and non-diabetic CKD patients.", "url": "https://www.bqprime.com/business/astrazeneca-india-gets-approval-to-market-anti-diabetes-drug", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2022-05%2Fbf61ef68-5d30-449e-bfcc-7b0294b15904%2Fchristina_victoria_craft_ZHys6xN7sUE_unsplash.jpg?rect=0%2C429%2C6016%2C3158&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-11-29T09:27:43Z", "content": "Drug firm AstraZeneca India on Tuesday said it has received approval from the country's drug regulator to market anti-diabetes medication Dapagliflozin.\r\nThe company said it has received approval fro… [+1095 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "PTI", "title": "Chemotherapy might make kids and grandkids more susceptible to diseases : Study - CNBCTV18", "description": "The researchers also analyzed the rats' epigenomes, which are molecular processes that are independent of DNA sequence, but influence gene expression, including turning genes on or off, the study said.", "url": "https://www.cnbctv18.com/healthcare/chemotherapy-might-make-kids-and-grandkids-more-susceptible-to-diseases--study-15285471.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/11/cancer-1019x573.jpg", "publishedAt": "2022-11-29T08:46:51Z", "content": "Previous Article\r\nZydus Life to acquire Watson Pharma's API business arm for Rs 46.77 crore"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Rohitha Naraharisetty", "title": "The Great Depression Changed People's DNA, Study Finds - The Swaddle", "description": "Children born during this time of recession showed genetic markers of accelerated aging.", "url": "https://theswaddle.com/the-great-depression-changed-peoples-dna-study-finds/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/11/291122_great-dep-DNA_editorial-1.jpg", "publishedAt": "2022-11-29T08:25:44Z", "content": "People born in the United States between 1929 and 1939 — the period also known as ‘The Great Depression’ — had epigenetic markers of accelerated aging, according to a new study published in PNAS. In … [+5784 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Blood thinning drug to treat recovery from severe COVID-19 is not effective - India Education Diary", "description": "A drug used to reduce the risk of blood clots does not help patients recovering from moderate and severe COVID-19, despite this approach being offered to patients, a UK-wide trial, led by Addenbrooke’s Hospital and the University of Cambridge has fou", "url": "https://indiaeducationdiary.in/university-of-cambridge-blood-thinning-drug-to-treat-recovery-from-severe-covid-19-is-not-effective/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg?fit=400%2C400&ssl=1", "publishedAt": "2022-11-29T08:03:56Z", "content": "A drug used to reduce the risk of blood clots does not help patients recovering from moderate and severe COVID-19, despite this approach being offered to patients, a UK-wide trial, led by Addenbrooke… [+4292 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Type-2 diabetes: Organs that get damaged due to high blood sugar levels - India TV News", "description": "Type-2 diabetes disrupts the normal functioning of the body. It weakens the system and leads to multiple complications. Know how high sugar levels in the body harm your organs and systems.", "url": "https://www.indiatvnews.com/health/type-2-diabetes-organs-that-get-damaged-due-to-high-blood-sugar-levels-2022-11-29-827327", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/11/diabetes-1-1669705614.jpg", "publishedAt": "2022-11-29T07:08:43Z", "content": "Type-2 diabetes: Rising number of diabetes patients has become a concern with type 2 diabetes mellitus becoming prevalent in India. According to Diabetes Atlas 2021 of the International Diabetes Fede… [+2697 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Dr Sachindra Modi explains why Blood Sugar monitoring is essential for Diabetes Management? - Zee News", "description": "The blood sample is collected by pricking the skin, often the tip of the finger, and tested for blood sugar levels. It is put on the designated spot on the glucometer strip connected to the glucometer to know the blood sugar levels.", "url": "https://zeenews.india.com/india/dr-sachindra-modi-explains-why-blood-sugar-monitoring-is-essential-for-diabetes-management-2541169.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/28/1122904-dr.sachindra-modi.jpeg", "publishedAt": "2022-11-29T01:34:48Z", "content": "Blood sugar levels depend on many things, and each person responds differently to the treatment of diabetes. Changes in diet, exercise, medication use, or the presence of other pathological condition… [+3491 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Rogue killer T cells associated with leukemia drive autoimmune diseases - News-Medical.Net", "description": "Gene variants associated with leukemia can produce 'rogue' immune cells that drive autoimmune diseases, according to a new study from the Garvan Institute of Medical Research.", "url": "https://www.news-medical.net/news/20221128/Rogue-killer-T-cells-associated-with-leukemia-drive-autoimmune-diseases.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Leukemia-620x480.jpg", "publishedAt": "2022-11-28T18:14:00Z", "content": "Gene variants associated with leukemia can produce 'rogue' immune cells that drive autoimmune diseases, according to a new study from the Garvan Institute of Medical Research.\r\nScientists had previou… [+4264 chars]"}]}