{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Fat in the fire - Daily Pioneer", "description": "COVID obesity is a stark truth staring us in the face, and the prediction is scary\n\nThe COVID pandemic is giving rise to a second one that is tugging at the waistline of a growing number of adults and children — the obesity pandemic. The World Health Organisa…", "url": "https://www.dailypioneer.com/2022/columnists/fat-in-the-fire-fat-in-the-fire.html", "urlToImage": "https://www.dailypioneer.com/uploads/2022/story/images/big/fat-in-the-fire-2022-05-07.jpg", "publishedAt": "2022-05-06T18:32:39Z", "content": "COVID obesity is a stark truth staring us in the face, and the prediction is scary\r\nThe COVID pandemic is giving rise to a second one that is tugging at the waistline of a growing number of adults an… [+2916 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Probing Deaths Of 5 Children Linked To Mystery Liver Disease - NDTV", "description": "The US Centers for Disease Control and Prevention is investigating 109 childhood cases of a mysterious form of hepatitis, including five reported deaths, the agency said Friday.", "url": "https://www.ndtv.com/world-news/us-says-probing-deaths-of-5-children-linked-to-mystery-liver-disease-hepatitis-2953323", "urlToImage": "https://i.ndtvimg.com/i/2017-09/hepatitis-action-plan-to-come-in-october_650x400_41505196638.jpg", "publishedAt": "2022-05-06T18:05:14Z", "content": "US liver disease: 90% of the cases have involved hospitalization. (Representational)\r\nWashington: The US Centers for Disease Control and Prevention is investigating 109 childhood cases of a mysteriou… [+1683 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Which fruits are good for diabetics? - Verve Times", "description": "If you’ve been wondering which fruits are good for diabetics, you’ve come to the right place. Lots of people think that diabetics need to steer clear of all sugars, even the sugars found in fruit. You may be surprised to learn that this is a myth, an", "url": "https://vervetimes.com/which-fruits-are-good-for-diabetics/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/M7HvMHA6HJumMSxeY6PA76-1200-80.jpg", "publishedAt": "2022-05-06T16:14:38Z", "content": "If youve been wondering which fruits are good for diabetics, youve come to the right place. Lots of people think that diabetics need to steer clear of all sugars, even the sugars found in fruit. You … [+7434 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Everything you need to know about Canada's massive avian flu outbreak | The Big Story Podcast - CityNews", "description": "In today’s Big Story podcast, the virus driving an outbreak that’s spread to almost every province is a variant. It’s a more pathogenic bug that renders the ...", "url": "https://www.youtube.com/watch?v=ng5fa5cZXJ0", "urlToImage": "https://i.ytimg.com/vi/ng5fa5cZXJ0/hqdefault.jpg", "publishedAt": "2022-05-06T15:40:58Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Manchester: New GP blood test could help diagnose ovarian cancer faster and more accurately, according to research funded by Wellbeing of Women - India Education Diary", "description": "A simple blood test that can be given by GPs could help diagnose ovarian cancer faster and more accurately, particularly for women under the age of 50, according to research funded by leading women’s health charity, Wellbeing of Women.The study, unde", "url": "https://indiaeducationdiary.in/university-of-manchester-new-gp-blood-test-could-help-diagnose-ovarian-cancer-faster-and-more-accurately-according-to-research-funded-by-wellbeing-of-women/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/01/﻿The-University-of-Manchester.jpg", "publishedAt": "2022-05-06T15:32:03Z", "content": "A simple blood test that can be given by GPs could help diagnose ovarian cancer faster and more accurately, particularly for women under the age of 50, according to research funded by leading womens … [+3958 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "These post Covid illnesses can kill; doctors on how to avoid them - msnNOW", "description": "Covid survivors face a higher chance of dying than others for up to 6 months. From sudden cardiac arrest to liver damage, here are some deadly post Covid complications listed by experts.", "url": "https://www.hindustantimes.com/lifestyle/health/these-post-covid-illnesses-can-kill-doctors-on-how-to-avoid-them-101651850438643.html?utm_source=microsoft-ht", "urlToImage": "https://static-entertainment-eus-s-msn-com.akamaized.net/sc/c6/519670.jpg", "publishedAt": "2022-05-06T15:28:23Z", "content": "Long after the Covid infection subsides and the life resumes as usual, people may find themselves at risk of death due to an array of post Covid complications that range from respiratory failure, hea… [+4536 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Sebastian Duchene and Ashleigh Porter", "title": "Why are there so many new omicron sub-variants, like BA.4 and BA.5? Will I be reinfected? Is the virus mutating faster? - Medical Xpress", "description": "By now, many of us will be familiar with the omicron variant of SARS-CoV-2, the virus that causes COVID. This variant of concern has changed the course of the pandemic, leading to a dramatic rise in cases around the world.", "url": "https://medicalxpress.com/news/2022-05-omicron-sub-variants-ba4-ba5-reinfected.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/why-are-there-so-many.jpg", "publishedAt": "2022-05-06T15:10:02Z", "content": "By now, many of us will be familiar with the omicron variant of SARS-CoV-2, the virus that causes COVID. This variant of concern has changed the course of the pandemic, leading to a dramatic rise in … [+5848 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Covid Evolving Differently: Experts On How New Waves Will Emerge | Mint - Mint", "description": "Within six months since its emergence, the Omicron coronavirus variant evolved with several subvariants and currently, two new offshoots - BA.4 and BA.5 that are once again driving a surge in COVID-19 cases.", "url": "https://www.livemint.com/news/india/covid-evolving-differently-experts-on-how-new-waves-will-emerge-11651842769391.html", "urlToImage": "https://images.livemint.com/img/2022/05/06/600x338/omicron_symptoms_kids_1642085148236_1651846925470.jpg", "publishedAt": "2022-05-06T14:23:35Z", "content": "If it has been predicted earlier, the Covid virus has started evolving differently. Compared with the first two years of the pandemic when variants seemed to appear out of nowhere, Tulio de Oliveira,… [+2130 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ellen Coughlan", "title": "A student was horrified when heartburn from boozing too much was actually cancer - Daily Mail", "description": "Georgia Ford, 20, from Stroud, Gloucestershire, said she developed a 'choking' cough last April and sickness soon after, but a GP just put this down to the amount of alcohol she was drinking.", "url": "https://www.dailymail.co.uk/femail/article-10789119/A-student-horrified-heartburn-boozing-actually-cancer.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/06/14/57486577-0-image-a-64_1651842037978.jpg", "publishedAt": "2022-05-06T14:10:21Z", "content": "A uni student was horrified to discover her heartburn that doctors told her was from boozing too much was actually 'incurable' cancer.\r\nGeorgia Ford, 20, from Stroud, Gloucestershire, said she develo… [+10225 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "COVID-19 virus 1000 times likely to spread through air than surfaces, study finds - WION", "description": "A recent study, which was published in the Journal of Exposure Science & Environmental Epidemiology, states that people are most likely to contract COVID-19 from air particles.", "url": "https://www.wionews.com/world/covid-19-virus-1000-times-likely-to-spread-through-air-than-surfaces-study-finds-476860", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/04/19/255751-covid-19-in-india.jpg", "publishedAt": "2022-05-06T12:41:22Z", "content": "A recent study, which was published in the Journal of Exposure Science &amp; Environmental Epidemiology, states that people are most likely to contract COVID-19 from air particles.\r\nThe study found t… [+1789 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Researchers identify proteins that render malaria treatments ineffective - News9 LIVE", "description": "The findings brings scientists closer to outsmarting the malaria parasite", "url": "https://www.news9live.com/science/researchers-identify-proteins-that-render-malaria-treatments-ineffective-168734", "urlToImage": "https://media.news9live.com/h-upload/2022/05/06/337281-mosuitocropped.jpg", "publishedAt": "2022-05-06T12:39:48Z", "content": "Researchers have found out why malaria parasites are resistant to some treatments, by characterising two proteins PfMDR1 and PfCRT that transport away drugs from regions where they can exert their ki… [+3057 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Virus detected in pig heart used in human transplant - DNA India", "description": "A Maryland man, 57-year-old David Bennett Sr, died in March, two months after the groundbreaking experimental transplant.", "url": "https://www.dnaindia.com/science/report-virus-detected-in-pig-heart-used-in-human-transplant-maryland-2951052", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/05/06/1743355-1014111-doctor.jpg", "publishedAt": "2022-05-06T12:32:00Z", "content": "Researchers trying to learn what killed the first person to receive a heart transplant from a pig have discovered the organ harboured an animal virus but cannot yet say if it played any role in the m… [+1646 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "6 Exercises For People With Ankylosing Spondylitis - NDTV Doctor", "description": "Suffering from Ankylosing Spondylitis can have numerous effects on the body. Try these exercises to reduce and relieve the symptoms of AS.", "url": "https://doctor.ndtv.com/living-healthy/6-exercises-for-ankylosing-spondylitis-patients-2945619", "urlToImage": "https://c.ndtvimg.com/2020-05/vu08cck_back-pain_625x300_11_May_20.jpg", "publishedAt": "2022-05-06T12:11:48Z", "content": "Ankylosing Spondylitis (AS) is a kind of arthritis that causes pain in your lower back. This happens when the vertebrae in the spinal column merge and become stiff (ankylosis). The main symptoms of A… [+3674 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "‘India too may have acute hepatitis cases… Child specialists must stay alert’ - The Indian Express", "description": "Over the last three weeks, several cases of acute hepatitis or liver inflammation of unknown origin have been reported among children in the US and Europe. At least 17 of them needed a liver transplant and one died of the disease as per the World Health Organ…", "url": "https://indianexpress.com/article/lifestyle/health/hepatitis-child-specialists-must-doctor-explains-7904120/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor.jpg", "publishedAt": "2022-05-06T11:37:34Z", "content": "Why Dr Sarin: Dr Shiv Kumar Sarin is the vice-chancellor of the Institute of Liver and Biliary Sciences, a stand-alone government hospital dedicated to the treatment and research of liver diseases. H… [+5355 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "IANS", "title": "Severe obesity blunts antibody response to Covid vaccines, finds study - Deccan Herald", "description": "Obesity has been a known risk factor for Covid-19 infection. And now a study reveals, that severely obese people may have a significantly weaker immune response to Covid vaccination compared to those with normal weight. Obesity is complicating the course of C…", "url": "https://www.deccanherald.com/science-and-environment/severe-obesity-blunts-antibody-response-to-covid-vaccines-finds-study-1107006.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/06/2022-05-02t133421z161834677rc20zt99q3bwrtrmadp3health-coronavirus-philippines-myanmarjpg-1105866-1651505487-1107006-1651836883.jpg", "publishedAt": "2022-05-06T11:30:15Z", "content": "Obesity has been a known risk factor for Covid-19 infection. And now a study reveals, that severely obese people may have a significantly weaker immune response to Covid vaccination compared to those… [+2656 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Omicron Not Mild As Thought, Latest Study Finds It As Deadly As Delta, Alpha COVID Variants - India.com", "description": "According to the latest study led by the Massachusetts General Hospital and Harvard Medical School, the risks of hospitalisation and mortality, in case of infection from the Omicron variant of COVID-19, were nearly identical between previous waves of Covid-19.", "url": "https://www.india.com/health/covid-4th-wave-omicron-not-mild-as-thought-latest-study-finds-it-as-deadly-as-delta-alpha-covid-variants-5371169/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/04/Omicron.jpg", "publishedAt": "2022-05-06T10:45:38Z", "content": "New York: Coronavirus infection from the Omicron variant is not mild as generally touted, rather is as deadly as Delta, Alpha and other strains of Covid-19 that claimed thousands of lives globally, f… [+2868 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: COVID-19 reinfection can occur sooner than you think; here's why immunity may wane faster - Times of India", "description": "Many researchers have looked into the phenomenon of reinfection and waning immunity. While many agree on COVID immunity lasting upto 90 days and beyond, there are those who have argued it could be shorter.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-covid-19-reinfection-can-occur-sooner-than-you-think-heres-why-immunity-may-wane-faster/photostory/91371363.cms", "urlToImage": "https://static.toiimg.com/photo/91371382.cms", "publishedAt": "2022-05-06T10:30:00Z", "content": "The small case series conducted by the U.S. Centers for Disease Control and Prevention (CDC) looked into 10 cases from four states namely Rhode Island, Vermont, Washington and Wisconsin. The patients… [+992 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Some Rapid Antigen Tests May Be Less Sensitive to Covid Variants: Study - News18", "description": "Chan School of Public Health and Beth Israel Deaconess Medical Center (BIDMC) in the US noted that the rapid tests were developed for use with the original SARS-CoV-2 viral strain that emerged late in 2019", "url": "https://www.news18.com/news/world/some-rapid-antigen-tests-may-be-less-sensitive-to-covid-variants-study-5123089.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/untitled-design-12-1-164155995116x9.png", "publishedAt": "2022-05-06T10:16:20Z", "content": "While the rapid antigen tests remain a useful tool for the detection of COVID-19 infections, some of these diagnostic kits may be less sensitive to the variants of concern, according to a US study. S… [+2256 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Researchers from India, US jointly develop optogenetic tool for neurological disorders - ThePrint", "description": "New Delhi, May 6 (PTI) Researchers at the Jamia Millia Islamia (JMI) here in collaboration with the US National Institutes of Health (NIH) have developed an optogenetic tool which can help understand brain disorders like Alzheimer’s disease, depression and sc…", "url": "https://theprint.in/india/researchers-from-india-us-jointly-develop-optogenetic-tool-for-neurological-disorders/945124/", "urlToImage": null, "publishedAt": "2022-05-06T09:45:52Z", "content": "New Delhi, May 6 (PTI) Researchers at the Jamia Millia Islamia (JMI) here in collaboration with the US National Institutes of Health (NIH) have developed an optogenetic tool which can help understand… [+2550 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Deutsche Welle", "title": "Think 8 hours of sleep is best? Think again! - Hindustan Times", "description": "Are you 38 or older? Then you may want to rethink how much sleep you truly need. A team of international researchers has found that less is more. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/think-8-hours-of-sleep-is-best-think-again-101651829616998.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/06/1600x900/sleep_1651829663776_1651829691538.jpg", "publishedAt": "2022-05-06T09:37:31Z", "content": "Most of us have internalized it as a rule: A full night of sleep means eight hours for adults. But that may no longer be true once people hit a certain age. A team of researchers from the University … [+3539 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritvik Chaturvedi", "title": "Digging Deep: Climate change could mean increased pathogen transmission - The Indian Express", "description": "The number of pathogens jumping from one mammal species to another related species will only increase in the years to come, suggests a new report.", "url": "https://indianexpress.com/article/technology/science/digging-deep-climate-change-could-mean-increased-pathogen-transmission-7904103/", "urlToImage": "https://images.indianexpress.com/2022/05/Pathogen-Pixabay.jpg", "publishedAt": "2022-05-06T09:22:10Z", "content": "Global warming is inevitably going to change biogeography, causing shifts in habitats. Species will come in contact with other species with whom they had no prior contact whatsoever. Mammals and viru… [+5611 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "High Cholesterol: Warning signs that tell your cholesterol level is high and ways to lower it - Times of India", "description": "High cholesterol is associated with major ailments of the body. The buildup of plaques due to the presence of high levels of cholesterol in the body is the main reason behind serious diseases like cardiovascular disease, peripheral arterial disease, coronary …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/high-cholesterol-warning-signs-that-tell-your-cholesterol-level-is-high-and-ways-to-lower-it/photostory/91368522.cms", "urlToImage": "https://static.toiimg.com/photo/91368731.cms", "publishedAt": "2022-05-06T09:05:07Z", "content": "Lifestyle changes are extremely crucial if you have a high level of cholesterol in the body.\r\nDiet, physical activity contribute a lot towards regulating the cholesterol level in a human being.\r\nHere… [+1304 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Cognitive impairment from severe Covid-19 similar to 20 years of ageing: Study - The Indian Express", "description": "Scales measuring anxiety, depression and post-traumatic stress disorder were also assessed. Their data were compared against matched controls.", "url": "https://indianexpress.com/article/lifestyle/health/cognitive-impairment-from-severe-covid-19-similar-to-20-years-of-ageing-study-7902274/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-19.jpg", "publishedAt": "2022-05-06T08:40:43Z", "content": "Cognitive impairment as a result of severe COVID-19 is similar to that sustained with 20 years of ageing, between 50 and 70 years of age, and is the equivalent of losing 10 intelligence quotient (IQ)… [+4387 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Rahul Verma", "title": "Scientists may have found a crappy way to reverse the effects of ageing - Business Insider India", "description": "Scientists have reversed the effects of ageing by putting young mouse poop in old mice. The experiment reversed the key signs of ageing in the guts, eyes,", "url": "https://www.businessinsider.in/science/news/scientists-may-have-found-a-crappy-way-to-reverse-the-effects-of-ageing/articleshow/91369520.cms", "urlToImage": "https://www.businessinsider.in/photo/91369520/scientists-may-have-found-a-crappy-way-to-reverse-the-effects-of-ageing.jpg?imgsize=65002", "publishedAt": "2022-05-06T07:56:00Z", "content": "The scientists from Quadram Institute\r\n have provided evidence from research, that transplanting faecal microbiota from young to old mice can reverse ageing signs in the eyes, gut, and brain of older… [+2579 chars]"}, {"source": {"id": null, "name": "Nagpurtoday.in"}, "author": null, "title": "Can Type-2 diabetes be reversed? - Nagpur News", "description": "Nagpur Today : Nagpur News Featured Can Type-2 diabetes be reversed?", "url": "https://www.nagpurtoday.in/can-type-2-diabetes-be-reversed/05061306", "urlToImage": "https://www.nagpurtoday.in/wp-content/uploads/2022/05/Type-2-Diabetes.jpg", "publishedAt": "2022-05-06T07:38:15Z", "content": "Type-2 diabetes is also known by the acronym T2D. It refers to a condition in a person whose glucose assimilation in the body remains unregulated because of impaired insulin production or acceptance.… [+5198 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "Gut bacteria may affect brain health, make you vulnerable to certain brain diseases: Harvard research - Times Now", "description": "You know tension can give you a headache, and a stomach ache. Stress can cause loosies and trigger IBS (Irritable Bowel Syndrome). A Harvard doctor explains how the microbes in your intestine can govern your mental health as well.", "url": "https://www.timesnownews.com/health/gut-bacteria-may-affect-brain-health-make-you-vulnerable-to-certain-brain-diseases-harvard-research-article-91367517", "urlToImage": "https://static.tnn.in/thumb/msid-91367517,imgsize-100,width-1280,height-720,resizemode-75/91367517.jpg", "publishedAt": "2022-05-06T06:57:51Z", "content": "Samantha Ruth Prabhu stuns in hot pink plunging neckline dress, estranged husband Naga Chaitanya's cousin approves"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Tracing a cancer’s family tree to its roots reveals how tumors grow - India Education Diary", "description": "Over time, cancer cells can evolve to become resistant to treatment, more aggressive, and metastatic — capable of spreading to additional sites in the body and forming new tumors. The more of these traits that a cancer evolves, the more deadly it bec", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-tracing-a-cancers-family-tree-to-its-roots-reveals-how-tumors-grow/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg", "publishedAt": "2022-05-06T06:50:24Z", "content": "Over time, cancer cells can evolve to become resistant to treatment, more aggressive, and metastatic capable of spreading to additional sites in the body and forming new tumors. The more of these tra… [+7543 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus symptoms: The most bizarre COVID symptoms seen so far - Times of India", "description": "COVID has posed new threats before us every single day since the pandemic started. New symptoms, new methods of testing, new medicines, new vaccines and a lot many things have come into our lives in these two years.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-symptoms-the-most-bizarre-covid-symptoms-seen-so-far/photostory/91364584.cms", "urlToImage": "https://static.toiimg.com/photo/91364848.cms", "publishedAt": "2022-05-06T05:30:00Z", "content": "COVID has posed new threats before us every single day since the pandemic started. New symptoms, new methods of testing, new medicines, new vaccines and a lot many things have come into our lives in … [+719 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "Coronavirus infection spurs antibodies against common colds: Study - Times of India", "description": "Scientists at Scripps Research in California have characterised coronavirus antibodies isolated from 11 people to r", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-infection-spurs-antibodies-against-common-colds-study/articleshow/91364939.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91366266,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-103674/91366266.jpg", "publishedAt": "2022-05-06T05:07:00Z", "content": "Getting sick with a common cold doesn't make you immune to Covid-19, but a Covid infection might, at least temporarily, boost the number of antibodies you have against common cold-causing coronavirus… [+2353 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Master gene that can restore hearing loss discovered - The Statesman", "description": "In a breakthrough, US scientists have discovered a single master gene that programs ear hair cells into either outer or inner ones, overcoming a major hurdle that had prevented the development of these cells to restore hearing.", "url": "https://www.thestatesman.com/technology/science/master-gene-can-restore-hearing-loss-discovered-1503068640.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/04/WhatsApp-Image-2022-04-19-at-13.22.14.jpeg", "publishedAt": "2022-05-06T04:30:01Z", "content": "In a breakthrough, US scientists have discovered a single master gene that programs ear hair cells into either outer or inner ones, overcoming a major hurdle that had prevented the development of the… [+2512 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Is the global increase in measles cases driven by COVID pandemic? - EastMojo", "description": "A report by the World Health Organization (WHO) and UNICEF warns that there could be a significant increase in the number of measles cases around the", "url": "http://www.eastmojo.com/health/2022/05/06/is-the-global-increase-in-measles-cases-driven-by-covid-pandemic/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/07/covid-19-5665811_1280-1.jpg?fit=1280%2C853&ssl=1", "publishedAt": "2022-05-06T03:50:00Z", "content": "A report by the World Health Organization (WHO) and UNICEF warns that there could be a significant increase in the number of measles cases around the world. More than 17,000 cases have already been r… [+5150 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Variolation - Face masks might reduce COVID-19 severity - News-Medical.Net", "description": "In a recent study published in the Journal of the Royal Society Interface, researchers developed an epidemiological model to demonstrate that mask-induced variolation causes milder severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection.", "url": "https://www.news-medical.net/news/20220505/Variolation-Face-masks-might-reduce-COVID-19-severity.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_712884_16518086223495033.jpg", "publishedAt": "2022-05-06T03:45:00Z", "content": "In a recent study published in the Journal of the Royal Society Interface, researchers developed an epidemiological model to demonstrate that mask-induced variolation causes milder severe acute respi… [+5315 chars]"}, {"source": {"id": null, "name": "Womenlovetech.com"}, "author": null, "title": "Why It’s Time For Women To Advocate For Their Health - Women Love Tech ", "description": "Research shows that gender biases persist in the healthcare system, significantly undermining the quality of medical care that women receive.", "url": "https://womenlovetech.com/why-its-time-for-women-to-advocate-for-their-health/", "urlToImage": "https://womenlovetech.com/wp-content/uploads/2022/05/pexels-shvets-production-7176317-scaled.jpg", "publishedAt": "2022-05-06T03:43:16Z", "content": "Good health may well be the greatest gift that life has to offer, but its often a gift that many of us take for granted until its gone. Indeed, youre perhaps never more vulnerable than when you find … [+4630 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New technique can accurately detect viruses in tumors from clinical next-generation sequencing - News-Medical.Net", "description": "Researchers have developed a method to accurately detect viruses from clinical next-generation sequencing and describe novel associations between specific tumors and viruses that warrant further investigation.", "url": "https://www.news-medical.net/news/20220505/New-technique-can-accurately-detect-viruses-in-tumors-from-clinical-next-generation-sequencing.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/8/By_Juan_Gaertner_2e3ffe20f38f40049d48d5240ee9a735-620x480.jpg", "publishedAt": "2022-05-06T03:05:00Z", "content": "Researchers have developed a method to accurately detect viruses from clinical next-generation sequencing and describe novel associations between specific tumors and viruses that warrant further inve… [+3777 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Ibuprofen administration with RAS inhibitors and diuretics linked to AKI - Medical Dialogues", "description": "Anyone who is taking a diuretic and a renin-angiotensin system (RSA) inhibitor for high blood...", "url": "https://medicaldialogues.in/nephrology/news/ibuprofen-administration-with-ras-inhibitors-and-diuretics-linked-to-aki-92509", "urlToImage": "https://medicaldialogues.in/h-upload/2022/05/06/175714-kidney.jpg", "publishedAt": "2022-05-06T02:30:00Z", "content": "Anyone who is taking a diuretic and a renin-angiotensin system (RSA) inhibitor for high blood pressure should be cautious about also taking ibuprofen, according to new research. \r\nDiuretics and RSA i… [+1624 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Is your sunscreen doing its job? - 10 Tampa Bay", "description": "Florida ranks second in the country for new cases of skin cancer.  We rely on sunscreen to protect us from harmful UV rays, but the nonprofit Environmental W...", "url": "https://www.youtube.com/watch?v=c3GUuj3TNWw", "urlToImage": "https://i.ytimg.com/vi/c3GUuj3TNWw/maxresdefault.jpg", "publishedAt": "2022-05-06T00:47:47Z", "content": null}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "How much extra Vitamin C is essential for good health? - IANS", "description": "Research at New University of Otago, Christchurch in New Zealand has identified, for the first time, exactly how much extra Vitamin C humans need to ingest, relative to their body weight, to maximise their immune health.Vita", "url": "https://ianslive.in/news/how_much_extra_vitamin_c_is_essential_for_good_health_-870202/LatestNews/0", "urlToImage": "https://ianslive.in/upload/2022/May/05/r-1651744140202205051519001561_l.jpg", "publishedAt": "2022-05-05T23:41:47Z", "content": "Photo Credit: IANS\r\nIANSLive\r\nWellington, May 5 (IANS) The pandemic is largely responsible for advocating the idea of proper intake of Vitamin C, known as an important immune-support nutrient and vit… [+2335 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Cutting Calories and Eating at the Right Time of Day Leads to Longer Life in Mice - Neuroscience News", "description": "Restricting calories and eating only during the most active part of the day helped extend the lifespan of mice.", "url": "https://neurosciencenews.com/diet-longevity-20531/", "urlToImage": "https://neurosciencenews.com/files/2022/05/food-time-longevity-neurosinces.jpg", "publishedAt": "2022-05-05T23:35:06Z", "content": "Summary: Restricting calories and eating only during the most active part of the day helped extend the lifespan of mice.\r\nSource: HHMI\r\nOne recipe for longevity is simple, if not easy to follow: eat … [+6191 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "COVID-19: the next phase and beyond - The Lancet", "description": "After living for more than 2 years with COVID-19—with over 6·2 million confirmed deaths\n(but probably many more, with an estimated 20 million excess deaths) and over 510\nmillion confirmed cases—the world is at a critical point. The omicron wave, with its\nhigh…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00817-0/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/1548e9b1-4802-4bd3-b06e-5aa7c6c67b93/fx1.jpg", "publishedAt": "2022-05-05T22:31:58Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 presence grows again in Mecklenburg County - WCNC", "description": "Mecklenburg County health officials are asking people to get up-to-date on COVID-19 vaccinations and take other precautions as the virus shows new signs of r...", "url": "https://www.youtube.com/watch?v=WKJcL4Jmd4Q", "urlToImage": "https://i.ytimg.com/vi/WKJcL4Jmd4Q/hqdefault.jpg", "publishedAt": "2022-05-05T22:01:37Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Beccy Corkill", "title": "How Do Mosquitoes Locate Their Human Meals? New Research Has An Answer - IFLScience", "description": "Mosquitoes are a buzzing and biting nuisance, but are also the deadliest animals to humans, due to the transmission of different viruses and parasites. Som", "url": "https://www.iflscience.com/plants-and-animals/how-do-mosquitoes-locate-their-human-meals-new-research-has-an-answer/", "urlToImage": "https://cdn.iflscience.com/images/14080556-f04a-5321-a384-98527f21ec04/default-1651757968-aedes-aegypti-mosquito-the-vector-of-many-viruses.jpg", "publishedAt": "2022-05-05T15:43:00Z", "content": "Mosquitoes are a buzzing and biting nuisance, but are also the deadliest animals to humans, due to the transmission of different viruses and parasites. Some species of these flying killing machines f… [+3263 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Andrew E. Budson", "title": "LATE: A common but largely unknown cause of dementia - Medical Xpress", "description": "If dementia is a general term that means thinking and memory has deteriorated to the point that it interferes with day-to-day function, what are the top three disorders that cause dementia in older individuals?", "url": "https://medicalxpress.com/news/2022-05-late-common-largely-unknown-dementia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/dementia.jpg", "publishedAt": "2022-05-05T15:03:27Z", "content": "If dementia is a general term that means thinking and memory has deteriorated to the point that it interferes with day-to-day function, what are the top three disorders that cause dementia in older i… [+4305 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Low-cost handheld device could cut the rate of unnecessary skin biopsies - News-Medical.Net", "description": "Skin biopsies are no fun: doctors carve away small lumps of tissue for laboratory testing, leaving patients with painful wounds that can take weeks to heal.", "url": "https://www.news-medical.net/news/20220505/Low-cost-handheld-device-could-cut-the-rate-of-unnecessary-skin-biopsies.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Skin_Cancer-620x480.jpg", "publishedAt": "2022-05-05T14:51:00Z", "content": "Skin biopsies are no fun: doctors carve away small lumps of tissue for laboratory testing, leaving patients with painful wounds that can take weeks to heal. That's a price worth paying if it enables … [+3823 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Overweight Men More Likely To Die From Prostate Cancer: Study - NDTV", "description": "Every 10 centimetres on a man's waist increases his risk of dying from prostate cancer by seven percent, according to a new study on Thursday -- the largest ever conducted on a possible link between obesity and the disease.", "url": "https://www.ndtv.com/world-news/overweight-men-more-likely-to-die-from-prostate-cancer-world-health-organization-study-2949427", "urlToImage": "https://c.ndtvimg.com/2018-10/129b94c_weight-gain_625x300_26_October_18.jpg", "publishedAt": "2022-05-05T14:49:24Z", "content": "Prostate cancer is the second most commonly diagnosed cancer in men and the fourth most common overall.\r\nParis: Every 10 centimetres on a man's waist increases his risk of dying from prostate cancer … [+2453 chars]"}, {"source": {"id": null, "name": "Amp.dev"}, "author": null, "title": "Experts recommend additional cholesterol-lowering medications for adults at high risk of heart disease - PTC News", "description": "According to an international team of experts, additional cholesterol-lowering drugs should be offered to patients with \"bad\" cholesterol (LDL) levels (70 mg/dl or more) and those at high risk of heart disease.", "url": "https://amp.dev/documentation/guides-and-tutorials/start/create/basic_markup/", "urlToImage": "https://ptcnews-wp.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/05/What-people-with-high-risk-of-heart-disease-should-consume-1.jpg", "publishedAt": "2022-05-05T13:14:18Z", "content": "Washington [US], May 5: According to an international team of experts, additional cholesterol-lowering drugs should be offered to patients with \"bad\" cholesterol (LDL) levels (70 mg/dl or more) and t… [+2149 chars]"}, {"source": {"id": null, "name": "Factly.in"}, "author": "Akhil Reddy", "title": "Not just men, a significant number of women also die of heart attacks - Factly", "description": "It is not true that only men die of heart diseases. A significant number of women also suffer from heart diseases.", "url": "https://factly.in/not-just-men-a-significant-number-of-women-also-die-of-heart-attacks/", "urlToImage": "https://factly.in/wp-content/uploads//2022/05/Female-heart-attacks-Thumbnail.jpg", "publishedAt": "2022-05-05T12:15:46Z", "content": "A video is being shared widely on social media in which a voice can be heard saying that very few women die of heart attacks. Also, it is mentioned that only men die of heart attacks. Lets fact-check… [+2430 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Devrupa Rakshit", "title": "Why 'Sleep on It' Is Good Advice For Stressful Situations - The Swaddle", "description": "\"Sleep... help[s] us solve problems by accessing information that is remote to the initial problem [and] may not be initially brought to mind.\"", "url": "https://theswaddle.com/why-sleep-on-it-is-good-advice-for-stressful-situations/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/05/Sleep-on-It-Editorials-min.png", "publishedAt": "2022-05-05T11:30:37Z", "content": "If there is one undisputed common wisdom in this day and time, it is that of “sleeping on something” that perturbs us. Tired after a long day at work? Fought with a friend? Vexed about a major decisi… [+3657 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Real Health: Top Tips for Effective Weight Loss - Independent.ie", "description": "On this week’s episode of Real Health, I’m bringing you my top tips for weight loss. Weight loss is about more than simply wanting to change how you look. We...", "url": "https://www.youtube.com/watch?v=gXWauDc8gVI", "urlToImage": "https://i.ytimg.com/vi/gXWauDc8gVI/hqdefault.jpg", "publishedAt": "2022-05-05T11:00:17Z", "content": null}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sneha Das", "title": "Avoid these foods for a healthy heart - NewsBytes", "description": "If you want to maintain the health of your heart and cardiovascular system, then start now and make a few diet changes to live healthy and long", "url": "https://www.newsbytesapp.com/news/lifestyle/foods-to-avoid-for-a-healthy-heart/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l71320220505152546.jpeg", "publishedAt": "2022-05-05T09:57:16Z", "content": "Avoid these foods for a healthy heart\r\nExpert opinion byDr Akanksha Saxena\r\nMay 05, 2022, 03:27 pm3 min read\r\nIf you want to maintain the health of your heart and cardiovascular system, then start no… [+2781 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Your child has the right to B12, do not ignore it - Ahmedabad Mirror", "description": "#LONDON\nVitamin B12 deficiency in infants leads to poor motor development and anaemia, according to a study which stated that its deficiency is an enormous yet overlooked problem.\nFor many years, there has been a focus on vitamin A, zinc and iron deficiencies…", "url": "https://www.ahmedabadmirror.com/your-child-has-the-right-to-b12-do-not-ignore-it/81830760.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1651687620346.jpg-org", "publishedAt": "2022-05-05T08:39:25Z", "content": "#LONDONVitamin B12 deficiency in infants leads to poor motor development and anaemia, according to a study which stated that its deficiency is an enormous yet overlooked problem.For many years, there… [+2476 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Glasgow: Krill Oil MAay Be Beneficial To Muscle Function And Size, In People Over 65 - India Education Diary", "description": "Krill oil may be beneficial to muscle function and size in healthy people over the age of 65, according to new research.The study – led by the University of Glasgow’s Institute of Cardiovascular and Medical Sciences (ICAMS) and published in Clinical", "url": "https://indiaeducationdiary.in/university-of-glasgow-krill-oil-maay-be-beneficial-to-muscle-function-and-size-in-people-over-65/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-8-1.jpg", "publishedAt": "2022-05-05T08:03:20Z", "content": "Krill oil may be beneficial to muscle function and size in healthy people over the age of 65, according to new research.\r\nThe study led by the University of Glasgows Institute of Cardiovascular and M… [+2807 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Copenhagen: Thousands of intestinal viruses have now been mapped. And they can be used to fight antibiotic resistance - India Education Diary", "description": "A new method developed at the University of Copenhagen has been used to identify more than 1,000 different types of bactericidal viruses in the human intestines. The researchers behind the new study believe the discovery may help fight antibiotic res", "url": "https://indiaeducationdiary.in/university-of-copenhagen-thousands-of-intestinal-viruses-have-now-been-mapped-and-they-can-be-used-to-fight-antibiotic-resistance/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-13-1.png", "publishedAt": "2022-05-05T07:50:31Z", "content": "A new method developed at the University of Copenhagen has been used to identify more than 1,000 different types of bactericidal viruses in the human intestines. The researchers behind the new study … [+4505 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Research reveals how MRI could revolutionize the diagnosis of heart failure - Devdiscourse", "description": "According to a new study from the University of East Anglia and the University of Sheffield, magnetic resonance imaging (MRI) is superior to echocardiography in diagnosing heart failure and is a powerful tool for predicting patient outcomes, including death.", "url": "https://www.devdiscourse.com/article/science-environment/2026101-research-reveals-how-mri-could-revolutionize-the-diagnosis-of-heart-failure", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/05_05_2022_07_36_30_5505794.jpg?width=920&format=jpeg", "publishedAt": "2022-05-05T07:36:31Z", "content": "According to a new study from the University of East Anglia and the University of Sheffield, magnetic resonance imaging (MRI) is superior to echocardiography in diagnosing heart failure and is a powe… [+2733 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Brand Studio", "title": "Is your child flu-safe this summer? - Hindustan Times", "description": "The latest session of HT Spotlight titled ‘VaxTalk: Getting your child summer ready’ saw Dr Pramod Jog, Former President of the Indian Academy of Pediatrics and Professor of Pediatrics at the DY Patil Medical College, Pune, talk about how we can safeguard our…", "url": "https://www.hindustantimes.com/brand-stories/is-your-child-flu-safe-this-summer-101651735000289.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/05/1600x900/WhatsApp_Image_2022-05-05_at_1.25.14_PM_1651737400239_1651737417666.jpeg", "publishedAt": "2022-05-05T07:20:14Z", "content": "After two long years of school closures, children are finally back to their routines. But, with this, the instances of infections and illnesses have also seen a spike. Naturally, parents are worried … [+4819 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Mental illness interferes with the body’s blood pressure and heart rate, study shows - News-Medical.Net", "description": "University of South Australia scientists have uncovered another reason why society should be paying more attention to mental health: it is closely aligned to blood pressure and heart rate variations.", "url": "https://www.news-medical.net/news/20220505/Mental-illness-interferes-with-the-bodye28099s-blood-pressure-and-heart-rate-study-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_712767_16517307474869119.jpg", "publishedAt": "2022-05-05T06:07:00Z", "content": "University of South Australia scientists have uncovered another reason why society should be paying more attention to mental health: it is closely aligned to blood pressure and heart rate variations.… [+2900 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Covid aggravates asthma in children - The Tribune India", "description": "Asthma in children is likely to get worse after a Covid-19 infection, finds a large-scale nationwide study in the US. Six months after a Covid infection, asthmatic children showed significant increases in emergency department visits, hospitalisations, emergen…", "url": "https://www.tribuneindia.com/news/schools/covid-aggravates-asthma-in-children-392033", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_1652811995.jpg", "publishedAt": "2022-05-05T06:07:00Z", "content": "New York, May 4\r\nAsthma in children is likely to get worse after a Covid-19 infection, finds a large-scale nationwide study in the US. Six months after a Covid infection, asthmatic children showed si… [+862 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Business News | IDEA CLINICS to Expand to 20 Cities by the End of 2025 - LatestLY", "description": "Get latest articles and stories on Business at LatestLY. IDEA CLINICS (Institute Of Diabetes, Endocrinology &amp; Adiposity Pvt Ltd), healthcare outside hospital is home to India's largest group of Endocrinologists, aims to expand to 20 cities with a strength…", "url": "https://www.latestly.com/agency-news/business-news-idea-clinics-to-expand-to-20-cities-by-the-end-of-2025-3670889.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/05/image_502022050505033020220505053624-588x441.jpg", "publishedAt": "2022-05-05T05:48:24Z", "content": "New Delhi [India], May 5 (ANI/PNN): IDEA CLINICS (Institute Of Diabetes, Endocrinology &amp; Adiposity Pvt Ltd), healthcare outside hospital is home to India's largest group of Endocrinologists, aims… [+6220 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "From vaccines to vaccinations. Join UNICEF to end the pandemic - UNICEF", "description": "The race against the pandemic is not over yet and more help is needed to turn vaccines into vaccinations, saving lives, preventing new variants, and strength...", "url": "https://www.youtube.com/watch?v=Yybxx8YOtwY", "urlToImage": "https://i.ytimg.com/vi/Yybxx8YOtwY/maxresdefault.jpg", "publishedAt": "2022-05-04T20:49:21Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Children with different diets have similar growth, nutrition but weight can be impacted | FOX 7 Aust - FOX 7 Austin", "description": "A new study finds children who follow a vegetarian or vegan diet have similar growth and nutrition as children who eat meat but it can have an impact on thei...", "url": "https://www.youtube.com/watch?v=lHdu5kZgJpk", "urlToImage": "https://i.ytimg.com/vi/lHdu5kZgJpk/hqdefault.jpg", "publishedAt": "2022-05-04T18:56:50Z", "content": null}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "We've pinpointed blood proteins activated in the most severe cases of COVID in children - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "Melbourne, May 4: In the majority of cases, children who catch COVID won’t end up suffering serious illness. Kids have fewer symptoms, less severe disease, and tend to recover faster than adults. The best case scenario for children sees them having relatively…", "url": "https://www.dailyexcelsior.com/weve-pinpointed-blood-proteins-activated-in-the-most-severe-cases-of-covid-in-children/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/05/download-3-4.jpg", "publishedAt": "2022-05-04T18:31:43Z", "content": "Melbourne, May 4: In the majority of cases, children who catch COVID won’t end up suffering serious illness. Kids have fewer symptoms, less severe disease, and tend to recover faster than adults.The … [+3836 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Acute Sleep Loss Can Alter How We See Others: Research - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. Young adults when sleep-deprived evaluate angry faces as less trustworthy and healthy-looking. Furthermore, neutral and fearful faces appear less attractive following sleep loss, suggests the findings of…", "url": "https://www.latestly.com/agency-news/science-news-acute-sleep-loss-can-alter-how-we-see-others-research-3669880.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/05/sleeplossaug2420220504175753-588x441.jpg", "publishedAt": "2022-05-04T18:28:23Z", "content": "Washington [US], May 4 (ANI): Young adults when sleep-deprived evaluate angry faces as less trustworthy and healthy-looking. Furthermore, neutral and fearful faces appear less attractive following sl… [+2214 chars]"}]}