{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "DASH diet effectively reduces risk of MI and stroke among high BP patients - Medical Dialogues", "description": "Among several lifestyle changes that may reduce cardiovascular disease, adopting the DASH (Dietary Approaches to Stop Hypertension) diet may have the greatest impact for young and middle-aged...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/dash-diet-effectively-reduces-risk-of-mi-and-stroke-among-high-bp-patients-103445", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/08/185169-hypertension.jpg", "publishedAt": "2022-12-03T13:00:45Z", "content": "Among several lifestyle changes that may reduce cardiovascular disease, adopting the DASH (Dietary Approaches to Stop Hypertension) diet may have the greatest impact for young and middle-aged adults … [+5060 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Let's address inequalities that fuel and fodder HIV/AIDS - Morung Express", "description": "<h2><strong><span style=\"font-size:11pt\"><span style=\"line-height:115%\"><span style=\"font-family:Calibri,&quot;sans-serif&quot;\">Latest India News, Breaking News, Nagaland News and World News -The Morung Express provides the latest news from India, Northeast,…", "url": "https://www.morungexpress.com/", "urlToImage": "https://www.morungexpress.com/public/front/images/morung_logo2017.png", "publishedAt": "2022-12-03T12:33:48Z", "content": "The Morung Express\r\nThe Morung Express is a people-oriented alternative newspaper based in Nagaland that was conceived from the Naga peoples historical realities and is guided by their voices and exp… [+277 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Influenza to pneumonia; symptoms of winter illnesses that are fast spreading - Hindustan Times", "description": "Winter season has a pleasant vibe to it but also comes with a host of illnesses. Here are some common winter illnesses and their symptoms. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/influenza-to-pneumonia-symptoms-of-common-winter-illnesses-that-are-fast-spreading-101670067358601.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/03/1600x900/_bc1eb434-4f23-11eb-983b-26bf3b8bba69_1670067411484_1670067411484.jpg", "publishedAt": "2022-12-03T11:42:35Z", "content": "Rise in influenza cases in United States and many countries in Europe has become a cause of concern for health authorities. There has also been increase in hospitalisation cases due to the spread of … [+3247 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study: Positively charged nanomaterials treat obesity anywhere you want - ETHealthWorld", "description": "Two new studies from researchers at Columbia Engineering and Columbia University Irving Medical Center (CUIMC) may have the answer to targeting fat cells depot-specifically and healthily. The papers demonstrate a new method to treat obesity by using cationic …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-positively-charged-nanomaterials-treat-obesity-anywhere-you-want/95960969", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95960969,imgsize-55526,width-1200,height-628,overlay-ethealthworld/study-positively-charged-nanomaterials-treat-obesity-anywhere-you-want.jpg", "publishedAt": "2022-12-03T11:00:00Z", "content": "Washington: Researchers have long been working on how to treat obesity, a serious condition that can lead to hypertension, diabetes, chronic inflammation, and cardiovascular diseases. Studies have al… [+2753 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Research: Laser therapy helps improve short term memory problems - ETHealthWorld", "description": "The right prefrontal cortex of the brain receives the treatment, known as transcranial photobiomodulation (tPBM). It is generally acknowledged that this region is crucial for working memory. The team's experiment demonstrated how, following several minutes of…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/research-laser-therapy-helps-improve-short-term-memory-problems/95960726", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95960726,imgsize-47322,width-1200,height-628,overlay-ethealthworld/research-laser-therapy-helps-improve-short-term-memory-problems.jpg", "publishedAt": "2022-12-03T10:30:00Z", "content": "Birmingham: UK: In a study that was recently published in Science Advances, laser light therapy was found to be successful in enhancing short-term memory.Researchers from Beijing Normal University an… [+3224 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Super Slim Keto Gummies Review 2023: Does Super Slim Keto Work? Or Is It A Scam? Updated Canada & US Report! - The Tribune India", "description": "Super Slim Keto is a nutritional supplement. This is a supplement for the ketogenic diet, and this product, available as gummies, includes keto-friendly components. According to reports, these gummies facilitate rapid fat loss.", "url": "https://www.tribuneindia.com/news/brand-connect/super-slim-keto-gummies-review-2023-does-super-slim-keto-work-or-is-it-a-scam-updated-canada-us-report-457374", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1419502479.jpg", "publishedAt": "2022-12-03T10:24:00Z", "content": "Super Slim Keto is a nutritional supplement. This is a supplement for the ketogenic diet, and this product, available as gummies, includes keto-friendly components. According to reports, these gummie… [+9869 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Turbotest Review: Is Turbo Test Worth It? My Experience on Turbotest Testosterone Booster - The Tribune India", "description": "The past half-century has seen a startling decline in the amount of testosterone found in men. Researchers have established a connection between these drops in testosterone levels and exposure to a variety of toxic pollutants that are becoming increasingly wi…", "url": "https://www.tribuneindia.com/news/brand-connect/turbotest-review-is-turbo-test-worth-it-my-experience-on-turbotest-testosterone-booster-457373", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_575889751.jpg", "publishedAt": "2022-12-03T10:22:00Z", "content": "The past half-century has seen a startling decline in the amount of testosterone found in men. Researchers have established a connection between these drops in testosterone levels and exposure to a v… [+10019 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: 7 healthy dates or khajoor recipes for people with diabetes - Hindustan Times", "description": "Diabetics should try combining dates with a source of complex proteins to manage blood sugar levels. Here are some healthy khajoor recipes.", "url": "https://www.hindustantimes.com/lifestyle/recipe/diabetes-7-healthy-dates-or-khajoor-recipes-for-people-with-diabetes-101670059860613.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/03/1600x900/dates_recipes_1670060041502_1670060048971_1670060048971.jpg", "publishedAt": "2022-12-03T09:40:46Z", "content": "If you are a diabetic with a sweet tooth, eating dates or khajoor in moderation can be a healthy choice for you to satisfy your sugar cravings. High on fructose but highly nutritious, dates are a sto… [+4062 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Find out what triggers Crohn's disease - ANI News", "description": "Changes in a single gene open the door for harmful gut bacteria to set off the inflammation that drives Crohn's disease, according to a new study led by Weill Cornell Medicine and NewYork-Presbyterian investigators. These findings could one day help doctors b…", "url": "https://www.aninews.in/news/health/find-out-what-triggers-crohns-disease20221203150859", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221203093822.jpg", "publishedAt": "2022-12-03T09:38:00Z", "content": "New York [US], December 3 (ANI): According to a recent study headed by Weill Cornell Medicine and NewYork-Presbyterian researchers, changes in a single gene allow dangerous gut bacteria to trigger th… [+4289 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Miami: A healthy gut is key to a healthy life - India Education Diary", "description": "You are sluggish, cannot focus on your work. You are in a bad mood. It could be your gut. The gut—the gastrointestinal system that extends from our mouth to our anus—is not only there to digest food, it has a direct link to the brain through a series", "url": "https://indiaeducationdiary.in/university-of-miami-a-healthy-gut-is-key-to-a-healthy-life/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/08/University-of-Miami.jpg?fit=1024%2C454&ssl=1", "publishedAt": "2022-12-03T08:46:59Z", "content": "You are sluggish, cannot focus on your work. You are in a bad mood. \r\nIt could be your gut. \r\nThe gutthe gastrointestinal system that extends from our mouth to our anusis not only there to digest foo… [+3296 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "Cholesterol control: Reduce bad cholesterol, improve your heart health - check 5 tips - Zee News", "description": "Secrets of a LONG life revealed! Want to live for 90 years?  Tips to follow 3. Take a Krill Oil rich Omega 3 supplement The right kind of Omega-3 supplement is one that is quickly absorbed by the body.", "url": "https://zeenews.india.com/health/cholesterol-control-reduce-bad-cholesterol-improve-your-heart-health-check-5-tips-2543363", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/12/03/1124969-heart-attack-pain-pixabay.jpg", "publishedAt": "2022-12-03T08:20:59Z", "content": "Cholesterol is an essential component of proper metabolic functioning in the body. It is necessary for producing hormones and for the flexibility of the cellular walls in the body. However, there are… [+3151 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "New Treatment By Delhi Doctors Treats Carpal Tunnel Syndrome Without Surgery - Indiatimes.com", "description": "A minimally-invasive treatment for carpal tunnel syndrome that offers effective long-term relief to patients without requiring further surgeries was recently presented by Dr Anindita Bose, senior resident at the University College of Medical Sciences and Guru…", "url": "https://www.indiatimes.com/technology/science-and-future/new-treatment-by-delhi-doctors-treats-carpal-tunnel-syndrome-without-surgery-586344.html", "urlToImage": "https://im.indiatimes.in/content/2022/Nov/Facebook-Image---2022-11-30T181441167_638751d92166e.jpg", "publishedAt": "2022-12-03T08:17:31Z", "content": "A minimally-invasive treatment for carpal tunnel syndrome that offers effective long-term relief to patients without requiring further surgeries was recently presented by Dr Anindita Bose, senior res… [+3006 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "All types of alcohol up cancer risk - Ahmedabad Mirror", "description": "All types of alcohol up cancer risk", "url": "https://ahmedabadmirror.com/all-types-of-alcohol-up-cancer-risk/81848333.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1670002781684.jpg-org", "publishedAt": "2022-12-03T08:03:45Z", "content": "Despite risks, people have low awareness, think alcohol has benefits, reveals study\r\nAll types of alcoholic beverages, including wine, increase cancer risk, but people have low awareness about it, an… [+1747 chars]"}, {"source": {"id": null, "name": "Inventiva"}, "author": "rishav", "title": "One Step Closer To A Universal Flu Vaccine: What A New Study Says? - Inventiva", "description": "One step closer to a universal flu vaccine: what a new study says? The vaccine would protect against serious illness and death from potential pandemic threats, but it would not replace annual flu shot", "url": "https://www.inventiva.co.in/trends/one-step-closer-to-a-universal-flu-vaccine-what-a-new-study-says/", "urlToImage": "https://th-i.thgim.com/public/incoming/s7vie6/article66182542.ece/alternates/FREE_1200/Flu_Season_95660.jpg", "publishedAt": "2022-12-03T07:29:32Z", "content": "One step closer to a universal flu vaccine: what a new study says? The vaccine would protect against serious illness and death from potential pandemic threats, but it would not replace annual flu sho… [+9914 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brains Of US Teens Aged Faster Than Normal During Covid-19: Study - NDTV", "description": "According to a recent study, the Covid-19 pandemic had a significant negative impact on teens' mental health.", "url": "https://www.ndtv.com/world-news/brains-of-us-teens-aged-faster-than-normal-during-covid-19-study-3574347", "urlToImage": "https://c.ndtvimg.com/2021-01/0qdvfaig_depression_625x300_08_January_21.jpg", "publishedAt": "2022-12-03T06:35:12Z", "content": "The study showed that teen brains had aged at least three years during that time.\r\nThe devastating Covid-19 pandemic has had an impact on every aspect of people's lives, including their health, jobs,… [+2189 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Structural Changes in Brain Magnetic Resonance Imaging Associated With Psychogenic Non-epileptic Seizures: An Analytical Cross-Sectional Study - Cureus", "description": "Background\r\n\r\nPsychogenic non-epileptic seizures (PNES) are often seen as indicators of poor motor and sensory function caused by psychological responses to stressful experiences. A seizure might trigger these reactions. The aim of our study was to assess the…", "url": "https://www.cureus.com/articles/126098-structural-changes-in-brain-magnetic-resonance-imaging-associated-with-psychogenic-non-epileptic-seizures-an-analytical-cross-sectional-study", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_3.png", "publishedAt": "2022-12-03T04:39:10Z", "content": "Background\r\nPsychogenic non-epileptic seizures (PNES) are often seen as indicators of poor motor and sensory function caused by psychological responses to stressful experiences. A seizure might trigg… [+26634 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Indranil Biswas", "title": "6 Metabolism-boosting Foods to Lose Belly Fat Fast - Sportskeeda", "description": "Metabolism-boosting foods are ones that provide adequate nutrients required for various functions in the body.", "url": "https://www.sportskeeda.com/health-and-fitness/6-metabolism-boosting-foods-lose-belly-fat-fast", "urlToImage": "https://staticc.sportskeeda.com/editor/2022/12/2365e-16700174614481-1920.jpg", "publishedAt": "2022-12-03T04:14:36Z", "content": "Metabolism-boosting foods are ones that provide adequate nutrients required for various functions in the body. Foods rich in vitamins, minerals, and antioxidants can increase the metabolic rate of th… [+4258 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Alka Jain", "title": "Pune man tests positive for Zika virus. Here's what symptoms he faced | Mint - Mint", "description": "The patient came to Jahangir Hospital with fever, cough, joint pain, and fatigue on November 16.", "url": "https://www.livemint.com/news/india/pune-man-tests-positive-for-zika-virus-here-s-what-symptoms-he-faced-11670039497716.html", "urlToImage": "https://images.livemint.com/img/2022/12/03/600x338/zika_virus_1670040526525_1670040526670_1670040526670.jpg", "publishedAt": "2022-12-03T04:14:32Z", "content": "A 67-year-old man was found positive for the Zika virus in the Bavdhan area of Maharashtra's Pune district, said the health department on Friday. The infected man is a resident of Nashik and had come… [+1806 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Staff Reporter", "title": "Mumbai: HIV tests at major railway stations for World AIDS Day - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/mumbai-hiv-tests-at-major-railway-stations-for-world-aids-day", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2021-11/d0fd57b8-d6a7-4dc2-87d0-17663ca8a68a/AIDS_day.jpeg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-12-03T04:07:34Z", "content": "The Mumbai Districts AIDS Control Society (MDACS) an autonomous body of the MCGM is implementingthe National AIDS Control Program(NACP)under the guidance of the National AIDS Control Organisation (NA… [+716 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Expression of estrogen-related gene can impact post-menopausal breast cancer risk - Medical Dialogues", "description": "In a study using a first-of-its kind mouse model of aging  that mimics breast cancer development in estrogen receptor-positive  post-menopausal women, investigators have determined that...", "url": "https://medicaldialogues.in/mdtv/obstetrics-gynaecology/videos/expression-of-estrogen-related-gene-can-impact-post-menopausal-breast-cancer-risk-103379", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/02/192795-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-9.jpg", "publishedAt": "2022-12-03T03:45:39Z", "content": "In a study using a first-of-its kind mouse model of aging that mimics breast cancer development in estrogen receptor-positive post-menopausal women, investigators have determined that over-expression… [+1468 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Traffic Pollution Has Been Associated With an Increased Risk of Dementia - SciTechDaily", "description": "The meta-analysis reviewed 17 studies studying traffic-related air pollution. According to a meta-analysis recently published in Neurology, the medical journal of the American Academy of Neurology, higher exposure to a certain type of traffic-related air poll…", "url": "https://scitechdaily.com/traffic-pollution-has-been-associated-with-an-increased-risk-of-dementia/", "urlToImage": "https://scitechdaily.com/images/Traffic-Jam.jpg", "publishedAt": "2022-12-03T01:13:51Z", "content": "Dementia is a general term referring to the impaired ability to remember, think, or make decisions, which interferes with doing everyday activities.\r\nThe meta-analysis reviewed 17 studies studying tr… [+3119 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Nick Paul Taylor, The Science Advisory Board contributing writer", "title": "Senescent neuron discovery in brains opens path for Alzheimer's drug development - The Science Board", "description": "Scientists at the Salk Institute for Biological Studies have found that neurons from people with Alzheimer's disease show deterioration and undergo a late-life stress process called cellular senescence, while senescent cells could be a way to slow neuroinflam…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=5070", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_cell/2022_08_10_18_33_2953_microglia_neuron_Alzheimers_social.jpg", "publishedAt": "2022-12-02T22:01:40Z", "content": "Alzheimer's patients have significantly higher proportions of neurons that express markers of age-related deterioration, according to the research team's paper published December 1 in the journal Cel… [+2793 chars]"}, {"source": {"id": null, "name": "Publicradiotulsa.org"}, "author": "Max Barnhart", "title": "With one dose, new drug may cure sleeping sickness. Could it also wipe it out? - Public Radio Tulsa", "description": "This often fatal disease found in many African countries is painful and lengthy to treat. But a single oral dose proved incredibly effective in a clinical trial, raising hopes of eradication.", "url": "https://www.publicradiotulsa.org/npr-national-news/npr-national-news/2022-12-02/with-one-dose-new-drug-may-cure-sleeping-sickness-could-it-also-wipe-it-out", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/0192d4c/2147483647/strip/true/crop/1763x926+0+73/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2022%2F12%2F02%2Fhat-drc-fexifilm-june2018_158_toned_custom-a0c027706722ebcc41a461d977accecc8ae49b1a.jpg", "publishedAt": "2022-12-02T20:44:34Z", "content": "In 2004, when physician Dr. Wilfried Mutombo began treating patients diagnosed with sleeping sickness, the available treatments were themselves horrific and sometimes deadly.\r\n\"The widely available t… [+5848 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Gabby Landsverk", "title": "A 'green' Mediterranean diet burns visceral fat faster than a classic Med diet, reducing risks of heart diseas - Business Insider India", "description": "A Mediterranean-style diet with added plant foods may help burn fat faster, a new study suggests. The nutrient-dense eating plan may help reduce a type of", "url": "https://www.businessinsider.in/science/health/news/a-green-mediterranean-diet-burns-visceral-fat-faster-than-a-classic-med-diet-reducing-risks-of-heart-disease-and-cancer-study-finds/articleshow/95947854.cms", "urlToImage": "https://www.businessinsider.in/photo/95947854/a-green-mediterranean-diet-burns-visceral-fat-faster-than-a-classic-med-diet-reducing-risks-of-heart-disease-and-cancer-study-finds.jpg?imgsize=77132", "publishedAt": "2022-12-02T20:35:00Z", "content": "A Mediterranean diet with extra nutrients could help reduce a risky type of body fat linked to cancer and heart disease, new research suggests. \r\nThe eating plan — known as a \"green\" Mediterranean di… [+3394 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Ikaria Lean Belly Juice Reviews UNTOLD TRUTH Read Before Buying - The Tribune India", "description": "It is difficult to reduce weight and get rid of stubborn belly fat, that much is true. This is especially true if your metabolism is slow. What's worst? Today, we lead hectic and demanding lives. Therefore, concentrating all of our efforts on decreasing weigh…", "url": "https://www.tribuneindia.com/news/brand-connect/ikaria-lean-belly-juice-reviews-untold-truth-read-before-buying-457066", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1031531660.jpg", "publishedAt": "2022-12-02T19:48:00Z", "content": "It is difficult to reduce weight and get rid of stubborn belly fat, that much is true. This is especially true if your metabolism is slow. What's worst? Today, we lead hectic and demanding lives. The… [+13332 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Diabetes Freedom Reviews - Legit Program Results or Fake Customer Hype? - The Tribune India", "description": "Do you want to add decades to your life by reversing type 2 diabetes? George Reilly's innovative type 2 diabetes reversal program, Diabetes Freedom, may help you manage your symptoms better and allow you to live a healthier, more active life.", "url": "https://www.tribuneindia.com/news/impact-feature/diabetes-freedom-reviews-legit-program-results-or-fake-customer-hype-457057", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1919707400.jpg", "publishedAt": "2022-12-02T19:15:00Z", "content": "Do you want to add decades to your life by reversing type 2 diabetes? George Reilly's innovative type 2 diabetes reversal program, Diabetes Freedom, may help you manage your symptoms better and allow… [+6723 chars]"}, {"source": {"id": null, "name": "Managedhealthcareexecutive.com"}, "author": "Keith Loria", "title": "Study Looks at How an HIV Protein Can Alter Immune Cells and Fuel Chronic Inflammation - Managed Healthcare Executive", "description": "The findings of research results published in Cells Reports implicate the Nef protein as a possible cause of disease-causing inflammation that persists even when an HIV infection is controlled.", "url": "https://www.managedhealthcareexecutive.com/view/study-looks-at-how-an-hiv-protein-can-alter-immune-cells-and-fuel-chronic-inflammation", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/mhe/6ca5a20bc919a2a4cf6a5be924b8f807aed84e83-4000x2400.jpg?fit=crop&auto=format", "publishedAt": "2022-12-02T17:31:21Z", "content": "In the era of effective antiretroviral treatment, HIV-infected people live a practically normal life. Unfortunately, they are at high risk of developing diseases seemingly not associated with HIV, in… [+3643 chars]"}, {"source": {"id": null, "name": "Infectiousdiseaseadvisor.com"}, "author": "Maria Arini Lopez, PT, DPT, CSCS, CMTPT", "title": "Molnupiravir May Be Effective Against COVID-19 in Vaccinated, Unvaccinated Adults - Infectious Disease Advisor", "description": "Researchers evaluated the antiviral efficacy of molnupiravir among vaccinated and unvaccinated patients infected with a broad range of COVID-19 variants.", "url": "https://www.infectiousdiseaseadvisor.com/home/topics/covid19/molnupiravir-shows-moderate-antiviral-activity-against-range-of-covid19-variants/", "urlToImage": null, "publishedAt": "2022-12-02T16:55:00Z", "content": "Molnupiravir may have antiviral activity against COVID-19 infection among both vaccinated and unvaccinated adults infected with a variety of SARS-CoV-2 variants, according to study findings published… [+2942 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Anwesha Mitra", "title": "Explained: What is a 'zombie virus' and should you be worried about the revival of a 48,500 year old pathogen? - Times Now", "description": "Pandoravirus yedoma is among one of 13 viruses described in the yet-to-be-peer-reviewed study and sets a new record age for a frozen virus returning to a form where it may infect other creatures.", "url": "https://www.timesnownews.com/explainer/explained-what-is-a-zombie-virus-and-should-you-be-worried-about-the-revival-of-a-48500-year-old-pathogen-article-95939235", "urlToImage": "https://static.tnn.in/thumb/msid-95939235,imgsize-100,width-1280,height-720,resizemode-75/95939235.jpg", "publishedAt": "2022-12-02T16:33:12Z", "content": "Deepak Chahar claims Malaysian Airlines misplaced his luggage, alleges food not served during travel"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Fatty liver disease conditions 'change the healthy heart to a failing heart' - Healio", "description": "CVD risk increases with the severity of nonalcoholic fatty liver disease, and both CV and liver events are &ldquo;highly related&rdquo; to the degree of hepatic fibrosis present, according to a speaker.CVD remains the leading cause of death in adults with non…", "url": "https://www.healio.com/news/cardiology/20221202/fatty-liver-disease-conditions-change-the-healthy-heart-to-a-failing-heart", "urlToImage": "https://www.healio.com/~/media/slack-news/gastroenterology/misc/gastro-stock-images/liver2_adobe.jpg", "publishedAt": "2022-12-02T16:32:38Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nCVD risk increases with the severity of … [+5375 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FP News Service", "title": "Madhya Pradesh: Trident Group makes staffers aware about AIDS - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/bhopal/madhya-pradesh-trident-group-makes-staffers-aware-about-aids", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-12/7eebfa28-63f5-44eb-9bdf-f5649f69651e/Narmadapuram_01.JPG?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-12-02T16:20:05Z", "content": "Narmadapuram (Madhya Pradesh): Trident Limited organised an AIDS awareness camp on the occasion of World AIDS Day on Thursday. \r\nThe camp was held under the banner of Swabhiman Ki Muskan. Director of… [+1295 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Having difficulty sleeping? You might be at risk of type 2 diabetes - ThePrint", "description": "Washington [US], December 2 (ANI): As the Christmas season approaches, University of South Australia researchers are encouraging people to prioritize a good night’s sleep, as new research indicates that poor sleep may be connected with risk factors for type 2…", "url": "https://theprint.in/health/having-difficulty-sleeping-you-might-be-at-risk-of-type-2-diabetes/1246344/", "urlToImage": null, "publishedAt": "2022-12-02T16:14:36Z", "content": "Washington [US], December 2 (ANI): As the Christmas season approaches, University of South Australia researchers are encouraging people to prioritize a good night’s sleep, as new research indicates t… [+1911 chars]"}, {"source": {"id": null, "name": "Mcmaster.ca"}, "author": null, "title": "Researchers discover gut mechanism that triggers innate immunity against respiratory infections - Brighter World", "description": "McMaster scientists found a common tuberculosis vaccine triggers an immune-communicating mechanism from the gut that offers broad protection against respiratory pathogens in the lung.", "url": "https://brighterworld.mcmaster.ca/articles/immune-communicating-gut-mechanism-innate-immunity-in-lung/", "urlToImage": "https://brighterworld.mcmaster.ca/wp-content/uploads/sites/2/2022/12/Xing-Jeyanathan-768x455.png", "publishedAt": "2022-12-02T16:04:31Z", "content": "A common tuberculosis vaccine triggers an immune-communicating mechanism from the gut that offers broad protection against respiratory pathogens in the lung, a research team led by McMaster scientist… [+3223 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "S.Venkateshwari", "title": "Tips for Preventing Hair Loss at Home... - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "beauty : Tips for Preventing Hair Loss at Home...\nHair fall has now become like a disease. Anyway, hair falls more in cold and it has become a problem", "url": "https://www.indiaherald.com/Beauty/Read/994556288/Tips-for-Preventing-Hair-Loss-at-Home", "urlToImage": "https://www.indiaherald.com/imagestore/images/beauty/sagittarius_sagittarius/tips-for-preventing-hair-loss-at-home70108026-08c8-4c7f-9a84-e15bf0280827-415x250-IndiaHerald.jpg", "publishedAt": "2022-12-02T15:54:07Z", "content": "Tips for Preventing Hair Loss at Home...\r\nHair fall has now become like a disease. Anyway, hair falls more in cold and it has become a problem for twelve months in Covid infected. The problem of hair… [+1385 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Hospitalization during COVID-19 damages lungs: Study - Hindustan Times", "description": "COVID-19 often leads to a number of health issues as side-effects even after one recovers from it. According to a study by American Thoracic Society, a number of COVID-19 patients suffer from lung disease after being discharged from hospitals. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/hospitalization-during-covid-19-damages-lungs-study-101669994526511.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/02/1600x900/omicron_1658237199099_1669994631142_1669994631142.jpg", "publishedAt": "2022-12-02T15:27:05Z", "content": "Interstitial lung disease is known to cause severe lung damage. And as per a study published in the American Journal of Respiratory and Critical Care Medicine, a significant percentage of COVID-19 pa… [+4367 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "ACE Inhibitors reduce CV, renal, and mortality events independent of associated hyperkalemia - Medical Dialogues", "description": "A new study published in Clinical Journal of American Society of Nephrology suggests that regardless of short-term changes in serum potassium levels, continuing angiotensin-converting enzyme (ACE)...", "url": "https://medicaldialogues.in/nephrology/news/ace-inhibitors-reduce-cv-renal-and-mortality-events-independent-of-associated-hyperkalemia-103237", "urlToImage": "https://medicaldialogues.in/h-upload/2022/05/31/177591-4559-pills-1296x728-header.jpg", "publishedAt": "2022-12-02T15:00:00Z", "content": "A new study published in Clinical Journal of American Society of Nephrology suggests that regardless of short-term changes in serum potassium levels, continuing angiotensin-converting enzyme (ACE) in… [+3033 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Neutrophil gelatinase-associated lipocalin and Hs CRP may detect AKI in diabetic children - Medical Dialogues", "description": "A recent study found that levels of Neutrophil gelatinase-associated lipocalin and highly sensitive C reactive protein can be used to detect early acute kidney injury in children with type 1...", "url": "https://medicaldialogues.in/pediatrics-neonatology/news/neutrophil-gelatinase-associated-lipocalin-and-hs-crp-may-detect-aki-in-diabetic-children-103171", "urlToImage": "https://medicaldialogues.in/h-upload/2021/01/25/146591-type-1-diabetes.jpg", "publishedAt": "2022-12-02T14:30:35Z", "content": "A recent study found that levels of Neutrophil gelatinase-associated lipocalin and highly sensitive C reactive protein can be used to detect early acute kidney injury in children with type 1 diabetes… [+2397 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Nanotech Strategy Could Suppress Genetic Arthritis in Mice, Suggests New Study - AZoNano", "description": "A team of researchers at Scripps Research announce successful preliminary tests of a new, nanotechnology-based approach against autoimmune diseases in the November 23rd, 2022, issue of ACS Nano.", "url": "https://www.azonano.com/news.aspx?newsID=39951", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39951_16699896248079405.jpg", "publishedAt": "2022-12-02T14:08:00Z", "content": "Dec 2 2022Reviewed by Alex Smith\r\nA team of researchers at Scripps Research announce successful preliminary tests of a new, nanotechnology-based approach against autoimmune diseases in the November 2… [+4922 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "Mahender", "title": "Diagnosis and Treatment for Ewing Sarcoma: A rare type of bone malignancy in children - NewsPatrolling", "description": "Dr. Sushant Ikhar, Consultant Medical Oncologist, HCG Cancer Centre Nagpur Childhood is a critical period for the development of strong, healthy bones. Among children, any complications in the bones will be a life-changing period and can also alter the course…", "url": "https://newspatrolling.com/diagnosis-and-treatment-for-ewing-sarcoma-a-rare-type-of-bone-malignancy-in-children/", "urlToImage": "https://newspatrolling.com/wp-content/uploads/2022/01/health-2.jpg", "publishedAt": "2022-12-02T13:05:28Z", "content": "Dr. Sushant Ikhar, Consultant Medical Oncologist, HCG Cancer Centre Nagpur\r\nChildhood is a critical period for the development of strong, healthy bones. Among children, any complications in the bones… [+4243 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Vitamin D Deficiency can Lead to Early Osteoporosis: Advice by Top10 Bones Specialists - mid-day.com", "description": "", "url": "https://www.mid-day.com/brand-media/article/vitamin-d-deficiency-can-lead-to-early-osteoporosis-advice-by-top10-bones-specialists-23258632", "urlToImage": "https://images.mid-day.com/images/images/2022/dec/Osteoporosis12_d.jpg", "publishedAt": "2022-12-02T12:25:00Z", "content": "1. Dr. Sushrut Babhulkar,\r\nMS (Orth), MCH (Orth) (UK),\r\nSushrut Institute of Medical Sciences, Nagpur.\r\nOsteoporosis is a fairly common problem that makes the bones weak and fractures easily. An opti… [+8505 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Grace Browne", "title": "A Proactive Way to Detect Cancer at Its Earliest Stages - WIRED", "description": "Medtech firm Earli is working on a way to make tumors announce themselves as they appear—and even provide directions to where they are in the body.", "url": "https://www.wired.com/story/making-cancer-reveal-itself/", "urlToImage": "https://media.wired.com/photos/63894dd37c1b7d0edd58fdd5/191:100/w_1280,c_limit/cancer_detection_science_GettyImages-72084578.jpg", "publishedAt": "2022-12-02T12:00:00Z", "content": "In November 2016, German-American entrepreneur Cyriac Roeding read a profile of Sam Gambhir, a physician and scientist at Stanford University School of Medicine, in a magazine. In the article, Gambhi… [+2868 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "4 spices that are great for fighting off cold and cough in winter - Northeast Now", "description": "To stay in good health in these winter months of December, January and February, you should incorporate these five spices in your diet-", "url": "http://nenow.in/health/4-spices-that-are-great-for-fighting-off-cold-and-cough-in-winter.html", "urlToImage": "https://nenow.in/wp-content/uploads/2022/12/4-spices-fighting-off-cold-and-cough-in-winter.png", "publishedAt": "2022-12-02T11:37:06Z", "content": "The season of winter has fully set in now with the arrival of December and some common illnesses such as cough and cold often keeps us away from enjoying nature in its full glory.\r\nWhile medicines ca… [+3324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ankita Upadhyay", "title": "Why taking a flu shot may prevent you from winter heart attacks - The Indian Express", "description": "The uptake of the vaccine is not very high and studies from India show that only one to two per cent of eligible heart patients take vaccines, says Dr Ambuj Roy, AIIMS", "url": "https://indianexpress.com/article/lifestyle/health-specials/flu-shot-winter-heart-attacks-8302630/", "urlToImage": "https://images.indianexpress.com/2022/12/pixabay-vaccination-1200.jpg", "publishedAt": "2022-12-02T11:19:05Z", "content": "Giving flu vaccines to heart patients may help reduce vascular events. A study published in Lancet Global Health Research has shown how influenza increases the risk of cardiovascular events and death… [+3217 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amla Health Benefits: From Healthy Liver To Hair Growth, 4 Notable Benefits Of Indian Gooseberry - NDTV", "description": "\"The Indian gooseberry is just the magic pill you need to boost your overall health.\" says nutritionist Lovneet Batra", "url": "https://www.ndtv.com/health/amla-health-benefit-healthy-liver-to-hair-growth-4-notable-benefits-of-indian-gooseberry-3570275", "urlToImage": "https://c.ndtvimg.com/2022-03/2vsju8l8_amla_625x300_23_March_22.jpg", "publishedAt": "2022-12-02T09:59:00Z", "content": "Amla provides us with numerous benefits such as better digestion, diabetes control, hair growth and more\r\nAmla berries include antioxidants and vitamins that have a number of health advantages. Amla … [+2133 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "HGH for Sale Online – How to Buy Best HGH Injections for Men - Deccan Herald", "description": "“To control your hormones is to control your life.” – Dr. Barry Sears The levels of the dozens of hormones in our bodies fluctuate throughout the day, running the complex mechanism that is the human body. Although their impact is significant, you cannot see o…", "url": "https://www.deccanherald.com/brandspot/pr-spot/hgh-for-sale-online-how-to-buy-best-hgh-injections-for-men-1167744.html", "urlToImage": null, "publishedAt": "2022-12-02T09:56:09Z", "content": "To control your hormones is to control your life. Dr. Barry Sears\r\nThe levels of the dozens of hormones in our bodies fluctuate throughout the day, running the complex mechanism that is the human bod… [+14088 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "WORLD AIDS DAY: 89979 HIV+ registered in Punjab; Minister appeals to people to shed stigma related to AIDS - Daily Pioneer", "description": "No less than 89,979 HIV-positive cases were registered in Punjab till date, amongst about 24.1 lakh in India. Sharing the figures, the state Health and Family Welfare Minister Chetan Singh Jauramajra on Thursday said that these patients were treated at 19 Ant…", "url": "https://www.dailypioneer.com/2022/state-editions/world-aids-day---89-979-hiv--registered-in-punjab--minister-appeals-to-people-to-shed-stigma-related-to-aids.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-12-02T08:25:25Z", "content": "No less than 89,979 HIV-positive cases were registered in Punjab till date, amongst about 24.1 lakh in India. Sharing the figures, the state Health and Family Welfare Minister Chetan Singh Jauramajra… [+2320 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Amit Srivastava", "title": "Navi Mumbai: NMMC identifies four measles-affected areas - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/navi-mumbai-nmmc-identifies-four-measles-affected-areas", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-12/abd362a7-9766-4cbc-b261-4b3ce3bbeb71/measles_su19.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-12-02T08:25:03Z", "content": "Navi Mumbai: The Navi Mumbai Municipal Corporation (NMMC) has identified four measles-affected areas in the city and the civic body will administer an additional dose of vaccinations between 6 months… [+1842 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Artificial sweeteners not only shoots up blood sugar levels, but trigger other diseases - Health shots", "description": "Artificial sweeteners are loaded with a lot of side effects, and worsening blood sugar is one of them. Read on understand the link between the two.", "url": "https://www.healthshots.com/healthy-eating/nutrition/artificial-sweeteners-and-their-effect-on-blood-sugar/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/28140508/sweetener.jpg", "publishedAt": "2022-12-02T07:12:33Z", "content": "Cutting down our intake of sugar is one of the first things that we do when we wish to lose weight. Those suffering from diabetes also look for sugar substitutes and often turn to artificial sweetene… [+3233 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Can AIDS Patients Stop The Weakening Of Their Immune Systems? - News18", "description": "HIV is a virus that attacks your body's immune system. When not properly treated or managed, HIV can develop into acquired immunodeficiency syndrome (AIDS)", "url": "https://www.news18.com/news/lifestyle/how-can-aids-patients-stop-the-weakening-of-their-immune-systems-6519175.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/hiv-positive-166979123716x9.jpg", "publishedAt": "2022-12-02T06:56:13Z", "content": "Many misinformation and misconceptions surround the human immunodeficiency virus, otherwise known as HIV. But first, let us understand the difference between HIV and Aids:\r\nHIV is a virus that attack… [+5481 chars]"}, {"source": {"id": null, "name": "Nebusinessmirror.com"}, "author": "", "title": "Air pollution is the leading cause of lung cancer in India: Health experts - North East Business Mirror - North East Business Mirror", "description": "According to a conference organized by the Associated Chambers of Commerce and Industry of India (ASSPCHAM), 'Lung Cancer-Awareness, Prevention, Challenges", "url": "https://nebusinessmirror.com/air-pollution-is-the-leading-cause-of-lung-cancer-in-india-health-experts/", "urlToImage": "https://nebusinessmirror.com/wp-content/uploads/2022/12/WhatsApp-Image-2022-12-02-at-12.06.55-PM.jpeg", "publishedAt": "2022-12-02T06:46:45Z", "content": "According to a conference organized by the Associated Chambers of Commerce and Industry of India (ASSPCHAM), ‘Lung Cancer-Awareness, Prevention, Challenges and Treatment’, air pollution is the main c… [+1637 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "2-dose vaccine offers long-term protection against severe Covid in kids - Daijiworld.com", "description": "New York, Dec 2 (IANS): A two-dose experimental vaccine can provide protection against severe Covid even one year even after the jabs, researchers report.\r\nThe results may reduce the need for frequent boosters and protect special populations that don't have f…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1025342", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-12-02T06:29:17Z", "content": "New York, Dec 2 (IANS): A two-dose experimental vaccine can provide protection against severe Covid even one year even after the jabs, researchers report.\r\nThe results may reduce the need for frequen… [+2055 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "PTI", "title": "Experimental Alzheimer’s drug shows promise - but there are many hurdles still to overcome - ThePrint", "description": "London, Dec 2 (The Conversation) The first drug that can slow the rate of decline in Alzheimer’s patients has been found. The experimental drug, called lecanemab, is an antibody that targets the toxic clumps of amyloid protein associated with the mind-robbing…", "url": "https://theprint.in/world/experimental-alzheimers-drug-shows-promise-but-there-are-many-hurdles-still-to-overcome/1245265/", "urlToImage": null, "publishedAt": "2022-12-02T06:02:04Z", "content": "London, Dec 2 (The Conversation) The first drug that can slow the rate of decline in Alzheimers patients has been found. The experimental drug, called lecanemab, is an antibody that targets the toxic… [+5015 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "4th Gen Rapid Tests detect more acute HIV infections - BSA bureau", "description": "4th generation testing, equipped with high sensitivity and specificity", "url": "https://www.biospectrumasia.com/news/30/21524/4th-gen-rapid-tests-detect-more-acute-hiv-infections.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/hiv-21524.jpg", "publishedAt": "2022-12-02T05:38:14Z", "content": "Bridging India’s testing gap is essential to strengthen the nation’s infection response and help meet the UNAIDS’ first goal – to diagnose 95 per cent of all HIV-positive patients, which can lead to … [+2443 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "New mRNA vaccines highly effective in reducing malaria infection, transmission: Study - EastMojo", "description": "Washington: Scientists have developed two mRNA vaccine candidates that were highly effective in reducing both malaria infection and transmission in animal", "url": "http://www.eastmojo.com/world/2022/12/02/new-mrna-vaccines-highly-effective-in-reducing-malaria-infection-transmission-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/12/Untitled-design-41.png?fit=1200%2C675&ssl=1", "publishedAt": "2022-12-02T04:50:00Z", "content": "Washington: Scientists have developed two mRNA vaccine candidates that were highly effective in reducing both malaria infection and transmission in animal studies.\r\nThe team from George Washington Un… [+3332 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Padmashree Pande", "title": "When You Struggle To Breathe Every Day: Life With Allergic Rhinitis - The Quint FIT", "description": "Imagine living your life on a timer, to have every minute of your routine mapped down to one task alone – cleaning your nose. As ‘ugh’ as it sounds, welcome to my life. No matter what the weather is, my nose is perennially blocked.", "url": "https://www.thequint.com/fit/when-you-struggle-to-breathe-every-day-life-with-allergic-rhinitis-2", "urlToImage": "https://images.thequint.com/thequint%2F2022-12%2F05891a6f-2a8a-4ce7-97f0-b714fd2e26c8%2F5.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-12-02T04:32:16Z", "content": "In 2020 February, I was on vacation with my cousins in Dubai, UAE. On this particular day on our trip, I remember, we were going to board a ferry to take us to the old city.\r\nBut, from our house in t… [+644 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "New genetic mutation behind childhood glaucoma identified - Hindustan Times", "description": "This increase in pressure not only damages the optic nerve but can also affect other structures in a child's eye like the cornea. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/new-genetic-mutation-behind-childhood-glaucoma-identified-101669954231265.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/02/1600x900/eye_1_1644416939593_1669954327425_1669954327425.jpg", "publishedAt": "2022-12-02T04:13:42Z", "content": "An international team of researchers led by Mass Eye and Ear, a member of Mass General Brigham and Boston Children's Hospital, has discovered a new genetic mutation that could be the root cause of se… [+6444 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Lack Of Specialised Centres, Social Stigma Weigh On HIV/AIDS... - MENAFN.COM", "description": "(MENAFN - Jordan Times)  AMMAN — Calls are growing to expand psychological and social support for people living with HIV/AIDS in Jordan.The", "url": "https://menafn.com/1105257408/Lack-Of-Specialised-Centres-Social-Stigma-Weigh-On-HIVAIDS-Patients", "urlToImage": "https://menafn.com/updates/pr/2022-12/01/JT_fc9dcimage_story.png", "publishedAt": "2022-12-02T04:07:05Z", "content": "(MENAFN- Jordan Times) AMMAN Calls are growing to expand psychological and social support for people living with HIV/AIDS in Jordan.\r\nThe human immunodeficiency virus (HIV) targets a host's immune sy… [+2599 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Evaluation of glycemic control, arterial stiffness, and hypertension improves risk of macrovascular... - Medical Dialogues", "description": "China: A recent study published in Cardiovascular Diabetology has indicated the clinical importance of the combined evaluation of glycemic and hypertension control and arterial stiffness to", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/evaluation-of-glycemic-control-arterial-stiffness-and-hypertension-improves-risk-of-macrovascular-complications-103314", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/01/192616-diabetes-complications.jpg", "publishedAt": "2022-12-02T04:00:05Z", "content": "China: A recent study published in Cardiovascular Diabetology has indicated the clinical importance of the combined evaluation of glycemic and hypertension control and arterial stiffness to improve t… [+2807 chars]"}, {"source": {"id": null, "name": "Mathrubhumi.com"}, "author": "Mathrubhumi", "title": "Measles outbreak: Panic in Malappuram as fresh cases soar - Mathrubhumi English", "description": "Malappuram: As fears of Measles grip Malappuram, the condition has worsened with 35 fresh cases reported in the district on Thursday. At least 20 Measles cases were recorded on Wednesday. By this, the total number of infected persons touched 239 in Malappuram…", "url": "https://english.mathrubhumi.com/news/kerala/measles-outbreak-panic-in-malappuram-as-fresh-cases-soar-1.8097946", "urlToImage": "https://english.mathrubhumi.com/image/contentid/policy:1.8097947:1669952088/vaccination%20(1).jpg?$p=a362ddd&f=16x9&w=1080&q=0.8", "publishedAt": "2022-12-02T03:38:06Z", "content": "Malappuram: As fears of Measles grip Malappuram, the condition has worsened with 35 fresh cases reported in the district on Thursday. At least 20 Measles cases were recorded on Wednesday. By this, th… [+874 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Diabetes in Down Syndrome children: Causes, factors that can increase prevalence - Hindustan Times", "description": "Is down syndrome the reason why we tend to see a rise in diabetes in children? Here's what expert has to say about the causes of diabetes in Down Syndrome children and factors can increase the prevalence of type 2 diabetes in kids | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-in-down-syndrome-children-causes-factors-that-can-increase-prevalence-of-type-2-diabetes-in-kids-101669949120957.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/02/1600x900/pexels-nicola-barts-7943472_1669949379656_1669949406676_1669949406676.jpg", "publishedAt": "2022-12-02T03:38:05Z", "content": "According to health experts, people with Down Syndrome are often diagnosed with diabetes significantly earlier where the average age of diagnosis was 38 compared to 53 in those without Down Syndrome.… [+2740 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Prachi Shah", "title": "Make Singhara a part of your winter diet for these 5 reasons! - Health shots", "description": "Read on to learn about the health benefits of singhara, as well as 5 reasons why you should include this superfood in your winter diet.", "url": "https://www.healthshots.com/healthy-eating/superfoods/water-chestnut-5-health-benefits-of-singhara-during-winter/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/12/01175022/singhara-.jpg", "publishedAt": "2022-12-02T03:29:38Z", "content": "Singhara, also called water chestnut, is a fruit known for being a natural coolant and has a high content of antioxidant properties. This fruit is quite starchy and contains a good amount of fibre. W… [+2698 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Intravenous drug users vulnerable to AIDS - The Tribune India", "description": "The increasing use of intravenous drugs by addicts in Himachal makes them vulnerable to AIDS. It has become a cause for concern though the AIDS prevalence rate in Himachal is relatively low as compared to the national rate.", "url": "https://www.tribuneindia.com/news/himachal/intravenous-drug-users-vulnerable-to-aids-456756", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1178236348.jpg", "publishedAt": "2022-12-02T01:56:00Z", "content": "Tribune News Service\r\nShimla, December 1\r\nThe increasing use of intravenous drugs by addicts in Himachal makes them vulnerable to AIDS. It has become a cause for concern though the AIDS prevalence ra… [+1282 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop 3D organoid model to advance understanding of gastroesophageal junction cancer - News-Medical.Net", "description": "Researchers at Johns Hopkins Medicine say they have created a laboratory-grown three-dimensional \"organoid\" model that is derived from human tissue and designed to advance understanding about how early stages of cancer develop at the gastroesophageal junction…", "url": "https://www.news-medical.net/news/20221201/Researchers-develop-3D-organoid-model-to-advance-understanding-of-gastroesophageal-junction-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-12-01T22:26:00Z", "content": "Researchers at Johns Hopkins Medicine say they have created a laboratory-grown three-dimensional \"organoid\" model that is derived from human tissue and designed to advance understanding about how ear… [+3583 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Don Rauf", "title": "Monkeypox Is Renamed 'Mpox' to Reduce Stigma - Everyday Health", "description": "Monkeypox will now be officially referred to a “mpox,” according to an announcement by the World Health Organization (WHO) on Monday. Both names will be used simultaneously for one year while “monkeypox” is phased out.", "url": "https://www.everydayhealth.com/infectious-diseases/monkeypox-is-renamed-mpox-to-reduce-stigma/", "urlToImage": "https://images.everydayhealth.com/images/monkeypox-is-renamed-mpox-to-reduce-stigma-1440x810.jpg?sfvrsn=be59a73_1", "publishedAt": "2022-12-01T22:03:02Z", "content": "Monkeypox will now be officially referred to as mpox, according to an announcement by the World Health Organization (WHO) on Monday. Both names will be used simultaneously for one year while monkeypo… [+2767 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "5,580 AIDS patients currently registered in Uttarakhand: Health Min - The Siasat Daily", "description": "Dehradun: There are 5,580 AIDS patients registered in Uttarakhand at present and the HIV infection rate in the state has been reduced to 0.24 per cent, Health Minister Dhan Singh Rawat said on Thursday. He was speaking at an awareness rally at the Gandhi Park…", "url": "https://www.siasat.com/5580-aids-patients-currently-registered-in-uttarakhand-health-min-2470173/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/12/Dhan.jpg", "publishedAt": "2022-12-01T16:10:00Z", "content": "Dehradun: There are 5,580 AIDS patients registered in Uttarakhand at present and the HIV infection rate in the state has been reduced to 0.24 per cent, Health Minister Dhan Singh Rawat said on Thursd… [+863 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Alpilean Reviews 2022: Is It A Legit Weight Loss Pill? [Medical Facts and Proof] - DNA India", "description": "Alpilean is a unique combination of the best herbs and organic ingredients", "url": "https://www.dnaindia.com/india/report-alpilean-reviews-2022-is-it-a-legit-weight-loss-pill-medical-facts-and-proof-3007137", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/12/01/2557988-screenshot2022-12-01-10-13-02-494-editcom.microsoft.office.word.jpg", "publishedAt": "2022-12-01T16:08:08Z", "content": "Hey guys! What's up? Thank You for coming to this article about alpileanreviews. Let me ask you a simple question. Do you need to remove excess weight? And nothing is helping you out. Then the alpile… [+17340 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Scientists link rare genetic phenomenon to neuron function, schizophrenia - TheNewsMill", "description": "Using state-of-the-art whole-genome sequencing and machine learning techniques, researchers conducted one of the first and the largest investigations of tandem repeats in schizophrenia\">schizophrenia, elucidating their contribution to the development of this …", "url": "https://thenewsmill.com/2022/12/scientists-link-rare-genetic-phenomenon-to-neuron-function-schizophrenia/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=54847&object_id=54847&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2022%252F12%252Fscientists-link-rare-genetic-phenomenon-to-neuron-function-schizophrenia.jpg", "publishedAt": "2022-12-01T15:31:46Z", "content": "Using state-of-the-art whole-genome sequencing and machine learning techniques, researchers conducted one of the first and the largest investigations of tandem repeats in schizophrenia”&gt;schizophre… [+3903 chars]"}]}