{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "What does the ‘+F’ logo on certain foods mean? Should they be consumed? - The Indian Express", "description": "\"When shopping for wheat flour, rice, salt, oil and milk look out for +F logo. Fortified Foods contains added micronutrients to improve quality of diet and provide health benefits,\" noted FSSAI.", "url": "https://indianexpress.com/article/lifestyle/fortified-foods-fssai-benefits-cons-awareness-micronutrient-deficiencies-vitamin-iron-8384494/", "urlToImage": "https://images.indianexpress.com/2023/01/oils_200_getty.jpg", "publishedAt": "2023-01-24T03:40:51Z", "content": "In keeping with the growing push towards better health and well-being, the Government is looking to create more awareness around foods that contain “added micronutrients to improve quality of diet”. … [+3246 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Rujuta Thete", "title": "Is Cervical Cancer Preventable? Experts Debunk Some Myths Around It - The Quint", "description": "January is cervical cancer awareness month which aims at spreading awareness about the disease. We bust some of the common myths around cervical cancer by talking to the experts.", "url": "https://www.thequint.com/news/webqoof/cervical-cancer-awareness-month-myths-about-cervical-cancer-busted", "urlToImage": "https://images.thequint.com/thequint%2F2023-01%2Fc75d8861-e082-4d66-b372-df05e1554144%2FMYTHS_VS_FACTS.png?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-01-24T03:30:00Z", "content": "According to Centre for Disease Control and Prevention (CDC), 93 percent of cervical cancers could be prevented by screening and vaccination against Human Papillomavirus or HPV the virus responsible … [+502 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Do You Suffer From Back Pain In Winters? Try These 5 Yoga Asanas - News18", "description": "Yoga includes a series of poses, also known as postures, that help to stretch and strengthen back muscles", "url": "https://www.news18.com/news/lifestyle/do-you-suffer-from-back-pain-in-winters-try-these-5-yoga-asanas-6898051.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/young-woman-cow-pose-167448788116x9.jpg", "publishedAt": "2023-01-24T02:26:11Z", "content": "Winter season can be a tough time for those suffering from back pain. Cold weather and less sunlight usually make it difficult to stay active or motivated to exercise. However, yoga is one of the met… [+2340 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Oncoscience | A murine model for human early/immature T-cell precursor acute lymphoblastic leukemia (EITP ALL) - EurekAlert", "description": "On October 24, 2022, Oncoscience published a new research perspective entitled, “A murine model for human early/immature T-cell precursor acute lymphoblastic leukemia (EITP ALL).”", "url": "https://www.eurekalert.org/news-releases/977434", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/31d89385-3ad9-45d5-8a5a-26ae1ec0096b/Rendition/thumbnail/Content/Public", "publishedAt": "2023-01-24T02:02:14Z", "content": "“As anticipated, we found that the onset of leukemia was significantly accelerated in Idh2R140Q/NHD13 double transgenic mice [...]”\r\nBUFFALO, NY- January 23, 2023 – A new research perspective was pub… [+2421 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ty Roush", "title": "Kids Who Exercise More Are Less Likely To Get Respiratory Infections, Study Suggests - Forbes", "description": "Researchers gathered data from over 100 children between 2018 and 2019.", "url": "https://www.forbes.com/sites/tylerroush/2023/01/23/kids-who-exercise-more-are-less-likely-to-get-respiratory-infections-study-suggests/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63cea7cc64122f8e036e3ae4/0x0.jpg?format=jpg&crop=3270,1840,x0,y0,safe&width=1200", "publishedAt": "2023-01-24T01:00:58Z", "content": "Children who are more physically active could be less susceptible to respiratory tract infections like the common cold, according to a study published in Pediatric Research Monday, as less than one-q… [+2732 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Kartikeya Kohli", "title": "Exercise-related hypoglycaemia may increase QTc interval in type 1 diabetes patients - Medical Dialogues", "description": "Dr Per Hagelqvist and team have found in a new study that in people with type 1 diabetes, both hypoglycemia brought on by exercise and hypoglycemia generated while at rest can lengthen both the", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/exercise-related-hypoglycaemia-may-increase-qtc-interval-in-type-1-diabetes-patients-106057", "urlToImage": "https://medicaldialogues.in/h-upload/2021/12/22/166571-ecg.jpg", "publishedAt": "2023-01-24T00:28:48Z", "content": "Dr Per Hagelqvist and team have found in a new study that in people with type 1 diabetes, both hypoglycemia brought on by exercise and hypoglycemia generated while at rest can lengthen both the QTc a… [+3037 chars]"}, {"source": {"id": null, "name": "Koreabiomed.com"}, "author": "Kim Kyung-won", "title": "‘In children with leukemia, start treatment with fewer side effects’ - KBR", "description": "Children usually do not get cancer. Of all cancers, pediatric cancers under the age of 14 account for only about 1 percent of all cancers. The most common cancer in children is leukemia. Leukemia takes up about 30 percent of all childhood cancers. Pediatric l…", "url": "https://www.koreabiomed.com/news/articleView.html?idxno=20288", "urlToImage": "https://cdn.koreabiomed.com/news/thumbnail/202301/20288_20322_5949_v150.jpg", "publishedAt": "2023-01-23T23:19:16Z", "content": "Children usually do not get cancer. Of all cancers, pediatric cancers under the age of 14 account for only about 1 percent of all cancers. The most common cancer in children is leukemia. Leukemia tak… [+9785 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers reveal how vortex ultrasound breaks down blood clots in brain - ANI News", "description": "Researchers have created a new tool and technique that uses \"vortex ultrasound\" - a type of ultrasonic tornado - to break down blood clots in the brain.", "url": "https://www.aninews.in/news/health/researchers-reveal-how-vortex-ultrasound-breaks-down-blood-clots-in-brain20230124043807", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230123230730.jpg", "publishedAt": "2023-01-23T23:08:00Z", "content": "North Carolina [US], January 24 (ANI): Researchers have created a new tool and technique that uses \"vortex ultrasound\" - a type of ultrasonic tornado - to break down blood clots in the brain.The new … [+3302 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Jake Remaly", "title": "'Very Doable' Low-Dose Workout Enough to Treat Knee OA - Medscape", "description": "Exercise helps patients with knee osteoarthritis, but more isn't necessarily better, a new study found.", "url": "https://www.medscape.com/viewarticle/987374", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_190605_seniors_exercise_bicycle_gym_800x450.jpg", "publishedAt": "2023-01-23T22:04:28Z", "content": "Exercise helps patients with knee osteoarthritis (OA), but more isn't necessarily better, new research shows.\r\nA low-dose exercise regimen helped patients with knee OA about as much as a more intense… [+3348 chars]"}, {"source": {"id": null, "name": "Diagnostic Imaging"}, "author": "Jeff Hall", "title": "New Mammography Study Reveals Mixed Awareness on Breast Cancer Risks - Diagnostic Imaging", "description": "In a new survey that examined perceptions of breast cancer risk among more than 1,800 women who had a recent mammogram, 65 percent noted that being overweight or obese was a greater risk factor than breast density, and over a quarter of those interviewed note…", "url": "https://www.diagnosticimaging.com/view/new-mammography-study-reveals-mixed-awareness-on-breast-cancer-risks", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/diag_imaging/8da84b7ba7d07913e389d903061b6b2627ad3aff-5616x3744.png?fit=crop&auto=format", "publishedAt": "2023-01-23T21:07:03Z", "content": "Mixed perceptions and awareness about breast cancer risk factors such as family history, breast density and whether one could reduce breast cancer risk were some of the findings from a new study look… [+3393 chars]"}, {"source": {"id": null, "name": "Paulick Report"}, "author": "Press Release", "title": "Managing Osteoarthritis During Cold Weather - Horse Racing News - Paulick Report", "description": "Freezing temperatures, deep snow and slick ice are challenges that horse owners often face during the winter months. For horse owners whose horses suffer from osteoarthritis (OA), these winter elements can make the disease more difficult to manage. A horse wi…", "url": "https://paulickreport.com/horse-care-category/managing-osteoarthritis-during-cold-weather/", "urlToImage": "https://paulickreport.com/wp-content/uploads/2022/01/Hooves_Snow.jpg", "publishedAt": "2023-01-23T20:58:59Z", "content": "Freezing temperatures, deep snow and slick ice are challenges that horse owners often face during the winter months. For horse owners whose horses suffer from osteoarthritis (OA), these winter elemen… [+3335 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19 - make sure your vaccination is up to date - World Health Organization (WHO)", "description": "#COVID19 vaccines save lives. Make sure your vaccination is up to date. Dr Maria Van Kerkhove, WHO's COVID-19 Technical Lead and Dr Mike Ryan, WHO Executive ...", "url": "https://www.youtube.com/watch?v=kfLgjw6aEsw", "urlToImage": "https://i.ytimg.com/vi/kfLgjw6aEsw/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AHOBYAC0AWKAgwIABABGHIgXihFMA8=&rs=AOn4CLDaGdHzP1wO58L_NDQW80jLs-w9bg", "publishedAt": "2023-01-23T18:43:09Z", "content": null}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "'Antidepressants sans prescription leave you feeling emotionally blunted' - Daily Pioneer", "description": "If you have the habit of gulping down the commonly available antidepressants without proper prescription, chances are that they may leave you feeling emotionally 'blunted' in the long run, as researchers have found in a study published in the journal Neuropsy…", "url": "https://www.dailypioneer.com/2023/india/---antidepressants-sans-prescription--leave-you-feeling-emotionally-blunted---.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2023-01-23T18:41:09Z", "content": "If you have the habit of gulping down the commonly available antidepressants without proper prescription, chances are that they may leave you feeling emotionally 'blunted' in the long run, as researc… [+2765 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Childhood trauma may be linked to civic environmental engagement later in life: Research - ThePrint", "description": "Washington [US], January 23 (ANI): According to new research published in Scientific Reports, childhood trauma might lead an individual to volunteer, donate money, or contact their elected officials about environmental issues later in life. The CU Boulder and…", "url": "https://theprint.in/health/childhood-trauma-may-be-linked-to-civic-environmental-engagement-later-in-life-research/1331286/", "urlToImage": null, "publishedAt": "2023-01-23T18:15:50Z", "content": "Washington [US], January 23 (ANI): According to new research published in Scientific Reports, childhood trauma might lead an individual to volunteer, donate money, or contact their elected officials … [+5754 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Using a seaweed sugar to trigger immune responses that suppress melanomas - Science Daily", "description": "Researchers have identified a relatively natural way to increase the numbers and antitumor activities of TILs. A team demonstrates how L-fucose, a nontoxic dietary plant sugar that is enriched in red and brown seaweeds, can increase TILs, promote antitumor im…", "url": "https://www.sciencedaily.com/releases/2023/01/230123123243.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-23T18:10:46Z", "content": "Immunotherapies have improved outcomes of many patients with cancer, including melanoma. But these therapies work for only a subset of patients. Numerous studies are looking at improving responses, i… [+4677 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cryo-electron microscopy captures the first 3D structure of SPOP protein that drives cancer - News-Medical.Net", "description": "SPOP is the most mutated protein in prostate cancer and plays a role in endometrial, uterine and other cancers. Despite this importance, how SPOP mutations drive cancer has been incompletely understood.", "url": "https://www.news-medical.net/news/20230123/Cryo-electron-microscopy-captures-the-first-3D-structure-of-SPOP-protein-that-drives-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2023-01-23T17:37:00Z", "content": "SPOP is the most mutated protein in prostate cancer and plays a role in endometrial, uterine and other cancers. Despite this importance, how SPOP mutations drive cancer has been incompletely understo… [+3847 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: Regulating immunological memory might help immune system fight disease - ANI News", "description": "Scientists have long worked to better understand the immunological responses of the human body throughout various diseases, such as cancer and inflammatory diseases.", "url": "https://www.aninews.in/news/health/study-regulating-immunological-memory-might-help-immune-system-fight-disease20230123225959", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230123172406.jpg", "publishedAt": "2023-01-23T17:29:00Z", "content": "Missouri [US], January 23 (ANI): Scientists have long worked to better understand the immunological responses of the human body throughout various diseases, such as cancer and inflammatory diseases.I… [+2857 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Research: Anti-ageing gene shown to rewind heart age by 10 years - ThePrint", "description": "Bristol [England], January 23 (ANI): An anti-ageing gene discovered in a centenarian population has been proven to reduce the biological age of the heart by ten years. The discovery, which was spearheaded by academics at the University of Bristol and the Mult…", "url": "https://theprint.in/science/research-anti-ageing-gene-shown-to-rewind-heart-age-by-10-years/1331167/", "urlToImage": null, "publishedAt": "2023-01-23T17:15:22Z", "content": "Bristol [England], January 23 (ANI): An anti-ageing gene discovered in a centenarian population has been proven to reduce the biological age of the heart by ten years. The discovery, which was spearh… [+5494 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "COVID new variant: When to get tested amid fears of XBB.1.5 and Omicron BF.7? | Mint - Mint", "description": "If you have the symptoms like sore throat, fever, runny nose etc., get tested immediately", "url": "https://www.livemint.com/news/india/covid-new-variant-when-to-get-tested-amid-fears-of-xbb-1-5-and-omicron-bf7-11674487756614.html", "urlToImage": "https://images.livemint.com/img/2023/01/23/600x338/COVID_1674491250008_1674491250234_1674491250234.jpg", "publishedAt": "2023-01-23T16:31:03Z", "content": "COVID is not over yet. Even though the symptoms related to coronavirus are much less severe now, the virus still continues to create havoc the world over. Two new variants - Omicron BF.7 and Omicron … [+2148 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "WHO’s 14th situation report for the multi-country outbreak of mpox overviews the clinical and public health links between HIV and mpox - News-Medical.Net", "description": "In the present report, researchers reported the most recent findings of MPXV infections.", "url": "https://www.news-medical.net/news/20230123/WHOe28099s-14th-situation-report-for-the-multi-country-outbreak-of-mpox-overviews-the-clinical-and-public-health-links-between-HIV-and-mpox.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736509_16744882783486569.jpg", "publishedAt": "2023-01-23T16:19:00Z", "content": "In a recent report published by the World Health Organization, researchers presented an update on monkeypox (MPX).\r\nStudy: Multi-country outbreak of mpox, External situation report#14- 19 January 202… [+5809 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Association for Research in Vision and Ophthalmology (ARVO)", "title": "ARVO Foundation Announces Recipients of 2023 Pfizer Ophthalmics Carl Camras Translational Research Award - Newswise", "description": "The Association for Research in Vision and Ophthalmology (ARVO) Foundation announced today the recipients of the 2023 Pfizer Ophthalmics Carl Camras Translation", "url": "https://www.newswise.com/articles/arvo-foundation-announces-recipients-of-2023-pfizer-ophthalmics-carl-camras-translational-research-award", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-01-23T16:05:00Z", "content": "Newswise — Rockville, Md.—The Association for Research in Vision and Ophthalmology (ARVO) Foundation announced today the recipients of the 2023 Pfizer Ophthalmics Carl Camras Translational Research A… [+4031 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology researchers technology that reveal cross-cutting breakdowns in Alzheimer’s disease - India Education Diary", "description": "After decades of fundamental scientific and drug discovery research, Alzheimer’s disease has remained inscrutable and incurable, with a bare minimum of therapeutic progress. But in a new review article in Nature Neuroscience, MIT scientists write tha", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-researchers-technology-that-reveal-cross-cutting-breakdowns-in-alzheimers-disease/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/rna-00_0.jpeg?fit=900%2C600&ssl=1", "publishedAt": "2023-01-23T16:00:24Z", "content": "After decades of fundamental scientific and drug discovery research, Alzheimers disease has remained inscrutable and incurable, with a bare minimum of therapeutic progress. But in a new review articl… [+4794 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Keravita Pro Reviews UNCOVERING the Truth Behind the Hype - The Tribune India", "description": "Keravita Pro is a novel dietary formulation created to help people restore nail and hair health. This nail support complex consists of all-natural ingredients that are naturally obtained and added in the right proportions. According to the research team behin…", "url": "https://www.tribuneindia.com/news/brand-connect/keravita-pro-reviews-uncovering-the-truth-behind-the-hype-473055", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_922425275.jpg", "publishedAt": "2023-01-23T15:52:00Z", "content": "Keravita Pro is a novel dietary formulation created to help people restore nail and hair health. This nail support complex consists of all-natural ingredients that are naturally obtained and added in… [+14941 chars]"}, {"source": {"id": null, "name": "Understandinganimalresearch.org.uk"}, "author": null, "title": "Studying liver disease in animals - Understanding Animal Research", "description": "", "url": "https://www.understandinganimalresearch.org.uk/news/studying-liver-disease-in-animals", "urlToImage": "https://www.understandinganimalresearch.org.uk/application/files/thumbnails/page/1316/7448/0777/UAR_Article_11_1.png", "publishedAt": "2023-01-23T15:35:12Z", "content": "This January, we are observing Love Your Liver Month which was created by the British Liver Trust. Love Your Liver Month was created to increase awareness on the more than 100 different liver disease… [+2247 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "AI model developed at Massachusetts Institute of Technology to detect future lung cancer risk - India Education Diary", "description": "The name Sybil has its origins in the oracles of Ancient Greece, also known as sibyls: feminine figures who were relied upon to relay divine knowledge of the unseen and the omnipotent past, present, and future. Now, the name has been excavated from a", "url": "https://indiaeducationdiary.in/ai-model-developed-at-massachusetts-institute-of-technology-to-detect-future-lung-cancer-risk/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/20230110_MITMGB_Sybil.jpg?fit=900%2C599&ssl=1", "publishedAt": "2023-01-23T15:32:47Z", "content": "The name Sybil has its origins in the oracles of Ancient Greece, also known as sibyls: feminine figures who were relied upon to relay divine knowledge of the unseen and the omnipotent past, present, … [+7059 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "ANI", "title": "Study finds older adults with asthama are at higher risk of depression - The Statesman", "description": "A recent prospective study of about 2,000 Canadian older individuals published online in the journal Respiratory Medicine discovered that older adults with asthma were at higher risk for depression during the COVID-19 pandemic.", "url": "https://www.thestatesman.com/lifestyle/study-finds-older-adults-with-asthama-are-at-higher-risk-of-depression-1503149333.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2018/07/Asthama.jpg", "publishedAt": "2023-01-23T15:06:00Z", "content": "A recent prospective study of about 2,000 Canadian older individuals published online in the journal Respiratory Medicine discovered that older adults with asthma were at higher risk for depression d… [+4735 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "In silico study suggests SARS-CoV-2 Omicron XBB.1.5 strain to be more infective than previous strains - News-Medical.Net", "description": "Researchers performed an in silico analysis to estimate the relative risks of recently emerged severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) variants.", "url": "https://www.news-medical.net/news/20230123/In-silico-study-suggests-SARS-CoV-2-Omicron-XBB15-strain-to-be-more-infective-than-previous-strains.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736489_16744842802834855.jpg", "publishedAt": "2023-01-23T14:36:00Z", "content": "In a recent study posted to the bioRxiv* preprint server, researchers performed an in silico analysis to estimate the relative risks of recently emerged severe acute respiratory syndrome coronavirus … [+5283 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Study finds monotonic relationship between systolic blood pressure and risk of CV outcomes in diabetes... - Medical Dialogues", "description": "UK: In a recent study published in the journal Hypertension, researchers from the UK, using deep learning modeling, have found a monotonic relationship between systolic blood pressure (SBP) and", "url": "https://medicaldialogues.in/cardiology-ctvs/news/study-finds-monotonic-relationship-between-systolic-blood-pressure-and-risk-of-cv-outcomes-in-diabetes-patients-105844", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/21/194377-blood-pressure.jpg", "publishedAt": "2023-01-23T14:30:40Z", "content": null}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "5 Reasons Why You Can't Lose Weight - Nation World News", "description": "You have offered to try again. He's done it a few times now, all of them with no success or questionable results, but this time you're pretty sure you can do", "url": "https://nationworldnews.com/5-reasons-why-you-cant-lose-weight/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/5-Reasons-Why-You-Cant-Lose-Weight.jpeg", "publishedAt": "2023-01-23T14:30:30Z", "content": "You have offered to try again. He’s done it a few times now, all of them with no success or questionable results, but this time you’re pretty sure you can do it. Those extra kilos are numbered days. … [+3029 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "SAVR or TAVI, which gives better outcomes in patients with severe aortic stenosis? Meta-analysis provides ... - Medical Dialogues", "description": "USA: Transcatheter aortic valve implantation (TAVI) versus surgical aortic valve replacement (SAVR) has an early advantage concerning disabling stroke and death for patients with symptomatic", "url": "https://medicaldialogues.in/cardiology-ctvs/news/savr-or-tavi-which-gives-better-outcomes-in-patients-with-severe-aortic-stenosis-meta-analysis-provides-insights-106012", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/21/199176-aortic-valve-replacement-2.jpg", "publishedAt": "2023-01-23T14:30:25Z", "content": "USA: Transcatheter aortic valve implantation (TAVI) versus surgical aortic valve replacement (SAVR) has an early advantage concerning disabling stroke and death for patients with symptomatic severe a… [+2928 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Intensive BP control can delay kidney replacement therapy in Stage 4/5 CKD - Medical Dialogues", "description": "Recent research found that intensive blood pressure control has a beneficial effect of delaying kidney replacement therapy in stage 4 and 5 chronic kidney disease patients. The study results were...", "url": "https://medicaldialogues.in/nephrology/news/intensive-bp-control-can-delay-kidney-replacement-therapy-in-stage-45-ckd-105959", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/05/190033-chronic-kidney-disease.jpg", "publishedAt": "2023-01-23T14:30:14Z", "content": "Recent research found that intensive blood pressure control has a beneficial effect of delaying kidney replacement therapy in stage 4 and 5 chronic kidney disease patients. The study results were pub… [+2171 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Metformin adherence lowers dementia risk in patients with type 2 diabetes - Medical Dialogues", "description": "Taiwan: Metformin provides further benefits in lowering dementia risk, and beyond conventional blood sugar control despite the launch of several new oral anti-glycemic agents, a recent study has...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/metformin-adherence-lowers-dementia-risk-in-patients-with-type-2-diabetes-106014", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/26/194989-metformin.jpg", "publishedAt": "2023-01-23T14:30:13Z", "content": "Taiwan: Metformin provides further benefits in lowering dementia risk, and beyond conventional blood sugar control despite the launch of several new oral anti-glycemic agents, a recent study has stat… [+2792 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Gardening and the exercise it involves reduce disease risk factors: study - The Washington Post", "description": "Those who garden look forward to the season of seed packets, plantings and abundant harvests. But research indicates another reason to eagerly anticipate a return to gardening: better health.", "url": "https://www.washingtonpost.com/health/2023/01/23/gardening-health-disease-reduction/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V5IUESGCYPJ7VMBZM65PJ6VRBM.jpg&w=1440", "publishedAt": "2023-01-23T14:22:36Z", "content": "Comment on this story\r\nThose who garden look forward to the season of seed packets and plantings, careful tending and abundant harvests. But research indicates another reason to eagerly anticipate ga… [+2982 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the association between COVID-19, cardiovascular disease, and mortality? - News-Medical.Net", "description": "In a new study, researchers evaluated the association between COVID-19 (coronavirus disease 2019) and CVD (cardiovascular disease) and/or death.", "url": "https://www.news-medical.net/news/20230123/What-is-the-association-between-COVID-19-cardiovascular-disease-and-mortality.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736480_16744816569686965.jpg", "publishedAt": "2023-01-23T13:56:00Z", "content": "In a recent study published in Cardiovascular Research, researchers evaluated the association between COVID-19 (coronavirus disease 2019) and CVD (cardiovascular disease) and/or death.\r\nStudy: Associ… [+5535 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Burn XT Thermogenic Fat Burner [Women and Men] Foods That Increase Metabolism and Burn Fat - Deccan Herald", "description": "From a variety of options for weight loss belly xt thermogenic fat burners are an actual thing. Many people are trying to benefit from these pills to reduce belly fat. Effective belly xt thermogenic fat burners can enable you to keep an even stomach by implem…", "url": "https://www.deccanherald.com/brandspot/pr-spot/burn-xt-thermogenic-fat-burner-women-and-men-foods-that-increase-metabolism-and-burn-fat-1183832.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p7-1183832-1674478906.png", "publishedAt": "2023-01-23T13:01:46Z", "content": "From a variety of options for weight loss belly xt thermogenic fat burners are an actual thing. Many people are trying to benefit from these pills to reduce belly fat.\r\nEffective belly xt thermogenic… [+28929 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "India's plan to eradicate measles, rubella - INSIGHTSIAS - Insights IAS", "description": "GS Paper 2 Syllabus: Issues Relating to Development and Management of Social Sector/Services relating to Health   Source: TH   Direction: The article highlights what needs to be done as well as the efforts made by India to eradicate measles and rubella.   Con…", "url": "https://www.insightsonindia.com/2023/01/23/indias-plan-to-eradicate-measles-rubella/", "urlToImage": "https://www.insightsonindia.com/wp-content/uploads/2023/01/measles_1.png", "publishedAt": "2023-01-23T12:53:12Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New research evaluates clinical trials investigating post-acute COVID-19 syndrome treatment - News-Medical.Net", "description": "In a recent article published in Clinical Microbiology and Infection, researchers reviewed all registered trials currently investigating potential treatment options for post-acute coronavirus disease 2019 (COVID-19) syndrome (PACS).", "url": "https://www.news-medical.net/news/20230123/New-research-evaluates-clinical-trials-investigating-post-acute-COVID-19-syndrome-treatment.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736462_16744778784456708.jpg", "publishedAt": "2023-01-23T12:53:00Z", "content": "In a recent article published in Clinical Microbiology and Infection, researchers reviewed all registered trials currently investigating potential treatment options for post-acute coronavirus disease… [+7181 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "Cutting Sugar From Your Diet? Keep These Pointers In Mind - Slurrp", "description": "The no-sugar diet has become popular amongst fitness freaks, wherein you cut the sweetener from your diet and use alternatives instead.", "url": "https://www.slurrp.com/web-stories/cutting-sugar-from-your-diet-keep-these-pointers-in-mind/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2022/12/23175940/cropped-jam-5.jpg", "publishedAt": "2023-01-23T12:41:34Z", "content": "The no-sugar diet has become popular amongst fitness freaks, wherein you cut the sweetener from your diet and use alternatives instead.Here are some things to keep in mind while you are cutting sugar… [+42 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "Researchers are now working on an oral Covid-19 vaccine that people can 'drink' - Business Insider India", "description": "Researchers are working on a Covid-19 vaccine that people may drink instead of receiving with a needle, expanding their focus onto mucosal vaccines, which", "url": "https://www.businessinsider.in/science/health/news/researchers-are-now-working-on-an-oral-covid-19-vaccine-that-people-can-drink/articleshow/97254773.cms", "urlToImage": "https://www.businessinsider.in/photo/97254773/researchers-are-now-working-on-an-oral-covid-19-vaccine-that-people-can-drink.jpg?imgsize=18246", "publishedAt": "2023-01-23T12:39:00Z", "content": "Researchers are working on a Covid-19 vaccine that people may drink instead of receiving with a needle, expanding their focus onto mucosal vaccines, which include nasal vaccines as well as \"swish and… [+1745 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Editorial", "title": "The 10 Most Nutrient-Dense Foods In The World - Slurrp", "description": "It also has a surprising amount of protein: one medium avocado packs 3 grams of protein, or a little under what a medium-sized egg white provides. Avocados are also a good source of vitamins B2, B3, B5, B6, C, E, and K. They also double as a good source of fo…", "url": "https://www.slurrp.com/article/the-10-most-nutrient-dense-foods-in-the-world-1674474349536", "urlToImage": "https://images.slurrp.com/prodarticles/0deliom81jx6.webp", "publishedAt": "2023-01-23T12:01:36Z", "content": "Food, or more specifically, our diet, requires proper planning. The main reason is that while some nutrients are easy to get, some other vital nutrients are difficult to get through commonly availabl… [+7808 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How To Make Dry Fruit Milk For Winter Health And Immunity - Expert Reveals - NDTV Food", "description": "A well-known nutritionist took to Instagram Reels to share her recipe for special dry fruit milk that can be consumed for winter health and immunity.", "url": "https://food.ndtv.com/health/how-to-make-dry-fruit-milk-for-winter-health-and-immunity-expert-reveals-3716920", "urlToImage": "https://c.ndtvimg.com/2022-12/teqk715_kesar-doodh_625x300_05_December_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-01-23T11:44:42Z", "content": "When it comes to health advice, sometimes the wisdom passed onto us through our grandmothers and mothers proves to be the most useful. We have often heard them recommending drinks like haldi doodh an… [+3021 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "Health Benefits of Including Spinach in Your Diet - The Quint FIT", "description": "Spinach is among the super foods when talked about vegetables. It is also versatile and can be cooked in various ways. Know how can it be beneficial for your eyes, brain, and overall health.", "url": "https://www.thequint.com/fit/health-benefits-of-including-spinach-in-your-diet", "urlToImage": "https://images.thequint.com/thequint%2F2023-01%2F4b7f6541-e9cd-4ec5-b6db-b07d878628b1%2Fspinach_jpg_s_1024x1024_w_is_k_20_c_Aa0Z3n0PFOE_wqgmtsQfodfNBhtbAiUu1sxgrudBoiI_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-01-23T11:08:13Z", "content": "Spinach is rich in various vitamins and minerals, especially antioxidants which are known for their anti-inflammatory properties and potential to protect against diseases. \r\nSome antioxidants in spin… [+644 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "High blood sugar management: 8 daily routine methods to lower blood sugar levels naturally - Zee News", "description": "Whether you suffer from diabetes, prediabetes, or merely predisposing factors of uncontrolled blood sugar spikes, individuals want to know what methods are most effective for controlling their blood glucose levels.", "url": "https://zeenews.india.com/health/high-blood-sugar-management-8-daily-routine-methods-to-lower-blood-sugar-levels-naturally-2564922", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/23/1144850-high-blood-sugar.jpg", "publishedAt": "2023-01-23T10:45:15Z", "content": "High blood sugar: Whether you suffer from diabetes, prediabetes, or merely predisposing factors of uncontrolled blood sugar spikes, individuals want to know what methods are most effective for contro… [+3283 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Hyaluronic acid, your skin’s best friend in winter - OrissaPOST", "description": "Our skin sensitivity increases when the temperatures start to fall. Your complexion might suffer in the winter, especially if you are sensitive. Skin can become dry, flaky, itchy, and cracked from cold wind, a decline in humidity, and turning up the central h…", "url": "https://www.orissapost.com/hyaluronic-acid-your-skins-best-friend-in-winter/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2021/07/Reasons-Your-Skin-Feels-Sticky-Hero-scd-011321.jpg", "publishedAt": "2023-01-23T10:35:21Z", "content": "New Delhi: Our skin sensitivity increases when the temperatures start to fall. Your complexion might suffer in the winter, especially if you are sensitive. Skin can become dry, flaky, itchy, and crac… [+3298 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Keto Excel Keto Gummies Australia Review (Scam or Legit) Keto Excel Gummies Where to Buy in The Australia Ingredients, Cost & Phone Number Exposed - Deccan Herald", "description": "Keto Excel Keto Gummies Australia: A ketogenic diet is a high-fat, low-carbohydrate diet that can be used to treat certain medical conditions. It is typically used as a treatment for epilepsy, but it may also have benefits for weight loss, diabetes, and other…", "url": "https://www.deccanherald.com/brandspot/pr-spot/keto-excel-keto-gummies-australia-review-scam-or-legit-keto-excel-gummies-where-to-buy-in-the-australia-ingredients-cost-phone-number-exposed-1183770.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1183770-1674470028.png", "publishedAt": "2023-01-23T10:33:48Z", "content": "Keto Excel Keto Gummies Australia: A ketogenic diet is a high-fat, low-carbohydrate diet that can be used to treat certain medical conditions. It is typically used as a treatment for epilepsy, but it… [+14069 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Influence of variability in the cyclooxygenase pathway on cardiovascular outcomes of nephrosclerosis patients | Scientific Reports - Nature.com", "description": "Scientific Reports - Influence of variability in the cyclooxygenase pathway on cardiovascular outcomes of nephrosclerosis patients", "url": "https://www.nature.com/articles/s41598-022-27343-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-27343-z/MediaObjects/41598_2022_27343_Fig1_HTML.png", "publishedAt": "2023-01-23T10:18:30Z", "content": "Median age and interquartile range (IQR) of patients and controls were, respectively, 66 (12) and 60 (17) years, whilst the percentage of males in the same groups were 50.2% and 67.7%. The percentage… [+8502 chars]"}, {"source": {"id": null, "name": "Kalinga TV"}, "author": "KalingaTV Bureau", "title": "Binge drinking may affect heart health; Know more - Kalinga TV", "description": "The vast majority of individuals believe that binge drinking is safe, and many even think that it is essential to having fun. Others don't view alcohol as a narcotic and even think that binge drinking is beneficial to our hearts. Alcohol consumption,", "url": "https://kalingatv.com/health/binge-drinking-may-affect-heart-health-know-more/", "urlToImage": "https://kalingatv.com/wp-content/uploads/2023/01/drinking.jpg", "publishedAt": "2023-01-23T08:58:28Z", "content": "The vast majority of individuals believe that binge drinking is safe, and many even think that it is essential to having fun. Others don’t view alcohol as a narcotic and even think that binge drinkin… [+5903 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Do Stress Hormones' Influence on Male and Female Hearts Differ? | Weather.com - The Weather Channel", "description": "This study could have implications for human heart disorders such as arrhythmias and heart failure and how different sexes respond to medications.", "url": "https://weather.com/en-IN/india/health/news/2023-01-23-stress-hormones-influence-on-male-and-female-hearts-differ", "urlToImage": "https://s.w-x.co/in-heart_2.jpg", "publishedAt": "2023-01-23T08:57:26Z", "content": "If you've ever gotten into trouble at school and had your parents called in for disciplinary action, you must remember how differently your parents dealt with the situation. Your father could've been… [+2474 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "The best exercises to lose weight - msnNOW", "description": "The best exercises to lose weight", "url": "https://www.msn.com/en-in/health/fitness/the-best-exercises-to-lose-weight/ss-AA16DtbO?li=AAgfYGb", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA16DyKx.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=433&y=273", "publishedAt": "2023-01-23T08:41:05Z", "content": "Besides the weight loss, the Harvard study points out that doing these exercises regularly will also boost your mood, improve your ability to fight off infection and lower your risk of heart disease,… [+111 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by PTI", "title": "Hybrid immunity offers more protection against severe Covid than infection alone, says study - India TV News", "description": "COVID: Against reinfection, the effectiveness of hybrid immunity following primary series vaccination waned to 41.8 per cent at 12 months, while the effectiveness of hybrid immunity following first booster vaccination waned to 46.5 per cent at 6 months, the s…", "url": "https://www.indiatvnews.com/health/hybrid-immunity-offers-more-protection-against-severe-covid-than-infection-alone-says-study-2023-01-21-841018", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/covd-1-1674290730.jpg", "publishedAt": "2023-01-23T08:30:01Z", "content": "Individuals with hybrid immunity had the highest magnitude and durability of protection, and may be able to extend the period before booster vaccinations are needed compared to individuals who have n… [+3456 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can dieting cause hair loss? - The Indian Express", "description": "In case you are dieting and have any side effects such as hair fall or even headache, nausea or vomiting, then report them to the doctor without any delay,\" said Dr Rinky Kapoor, consultant dermatologist, cosmetic dermatologist and dermato-surgeon, The Esthet…", "url": "https://indianexpress.com/article/lifestyle/health/dieting-causing-hair-loss-tips-to-lose-weight-without-losing-hair-also-check-list-of-food-items-to-prevent-hair-fall-8394423/", "urlToImage": "https://images.indianexpress.com/2023/01/getty-hair_loss_1200_hair_loss.jpg", "publishedAt": "2023-01-23T07:50:00Z", "content": "On their weight loss journeys, many people skip certain foods and include many others in their diets. While these modifications may yield results when it comes to losing extra kilos, do they also hav… [+3289 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Pine Nut Benefits: Consume This Seed To Keep Diabetes And Heart Problems At Bay - News18", "description": "Pine nuts or chilgoza are very small seeds, which contain anti-diabetic properties and store a bulk of nutrients like vitamins and minerals.", "url": "https://www.news18.com/news/lifestyle/pine-nut-benefits-consume-this-seed-to-keep-diabetes-and-heart-problems-at-bay-6895435.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-1-243-167445921616x9.jpg", "publishedAt": "2023-01-23T07:34:11Z", "content": "Pine nuts, also known as chilgoza, are superfoods and full of nutrients. A study suggests that the amount of insulin in the body can be increased by consuming chilgoza. This can play an important rol… [+1973 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "With Winter Diseases In Full Swing, Add These Immunity Boosting Foods To Your Routine - NDTV", "description": "Here are some delicious and immunity-boosting foods you must add to your winter diet.", "url": "https://www.ndtv.com/health/immunity-with-winter-diseases-in-full-swing-add-these-immunity-boosting-recipes-to-your-routine-3710047", "urlToImage": "https://c.ndtvimg.com/2023-01/3t3tc6oo_-ajwain-kadha-for-health_625x300_10_January_23.jpg", "publishedAt": "2023-01-23T06:24:00Z", "content": "Kadha is immunity-boosting drink prepared by combining a lot of beneficial herbs and spices\r\nOur eating tastes also have a tendency to change as winter approaches. We are more likely to eat deep-frie… [+3500 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Richa Barua", "title": "Planning for pregnancy? Check out your thyroid and hormone's health before trying - Asianet Newsable ", "description": "We spoke to Dr. Sangeeta, Consultant - Obstetrician & Gynaecologist, Motherhood Hospitals, Sarjapur, Bangalore, who told gave some important advice before planning for a baby", "url": "https://newsable.asianetnews.com/lifestyle/planning-for-pregnancy-check-out-your-thyroid-and-hormone-s-health-before-trying-rba-roxcec", "urlToImage": "https://static-ai.asianetnews.com/images/01gqejfh6fn874ej2xm3zcha0p/whatsapp-image-2023-01-23-at-11-10-39-am_1200x630xt.jpg", "publishedAt": "2023-01-23T05:54:13Z", "content": "We spoke to Dr. Sangeeta, Consultant - Obstetrician &amp; Gynaecologist, Motherhood Hospitals, Sarjapur, Bangalore, who told gave some important advice before planning for a babySeveral pregnancy-rel… [+4189 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Artemis Hospital introduces CUVIS Joint Robotic System for total knee replacement - Express Healthcare", "description": "The system is simple to operate and offers flexibility to the surgeons with a range of cutting options", "url": "https://www.expresshealthcare.in/news/artemis-hospital-introduces-cuvis-joint-robotic-system-for-total-knee-replacement/437810/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2023/01/New-Project-7-1.jpg", "publishedAt": "2023-01-23T05:32:29Z", "content": "The system is simple to operate and offers flexibility to the surgeons with a range of cutting options\r\nKnee problems are seen increasing rapidly nowadays in the age group of 45-50-year-old middle ag… [+2857 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Study reveals how gene signaling rewires tumors after immunotherapy - TheNewsMill", "description": "A mechanism has been identified by researchers from the University of Michigan Rogel Cancer Center that explains why some patients' cancers grow in response to immunotherapy rather than shrinking.Although immunotherapy has significantly improved cancer treatm…", "url": "https://thenewsmill.com/2023/01/study-reveals-how-gene-signaling-rewires-tumors-after-immunotherapy/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=66780&object_id=66780&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F01%252Fstudy-reveals-how-gene-signaling-rewires-tumors-after-immunotherapy.jpg", "publishedAt": "2023-01-23T03:32:07Z", "content": "A mechanism has been identified by researchers from the University of Michigan Rogel Cancer Center that explains why some patients’ cancers grow in response to immunotherapy rather than shrinking.Alt… [+3053 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "18 rich sources of vitamin C to add to your daily diet - Recipes", "description": "Vitamin C is an important nutrient that plays a major role in immune function and also helps in fighting against iron deficiency. Tap next to learn about 18 rich sources of vitamin C that you can add to your daily diet.", "url": "https://recipes.timesofindia.com/web-stories/18-rich-sources-of-vitamin-c-to-add-to-your-daily-diet/photostory/97239640.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97239648,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-01-23T03:13:49Z", "content": "Vitamin C is an important nutrient that plays a major role in immune function and also helps in fighting against iron deficiency. Tap next to learn about 18 rich sources of vitamin C that you can add… [+19 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Trichosporon Endophthalmitis Following Cataract Surgery: A Case Report - Cureus", "description": "Fungal infections always pose a predicament to management and prognosis. The saprophytic fungus, Trichosporon inkin commonly causes endogenous infection in immunocompromised individuals. We report a case of exogenous T. inkin endophthalmitis successfully trea…", "url": "https://www.cureus.com/articles/123330-trichosporon-endophthalmitis-following-cataract-surgery-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/484050/article_river_9edefbb051fe11edb15cf5abc7e6beb8-2a.1.png", "publishedAt": "2023-01-23T03:05:22Z", "content": "Fungal infections always pose a predicament to management and prognosis. The saprophytic fungus, Trichosporon inkin commonly causes endogenous infection in immunocompromised individuals. We report a … [+9823 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "India to be hit as pharma giant pulls plug on AIDS vaccine - mid-day.com", "description": "Mosaico trial, which began in 2019, failed to yield desired results", "url": "https://www.mid-day.com/mumbai/mumbai-news/article/india-to-be-hit-as-pharma-giant-pulls-plug-on-aids-vaccine-23266797", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/ind-aids_d.jpg", "publishedAt": "2023-01-23T02:44:00Z", "content": "Mosaico trial, which began in 2019, failed to yield desired results\r\nAccording to the report, 2.2 million people are living with HIV/AIDS in the country and more than 1 lakh new infections are seen e… [+5059 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Himani Chandna", "title": "Covid May Trigger Diabetes Even If You Were Not Supposed to Have It: Lancet Article - News18", "description": "Findings suggested that compared with both the contemporary and historical controls, people with SARS-CoV-2 had an increased risk of incident diabetes and incident use of anti-diabetic medications in the long term", "url": "https://www.news18.com/news/india/covid-may-trigger-diabetes-even-if-you-were-not-supposed-to-have-it-lancet-article-6891247.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/covid-hospital-patient-166287479716x9.jpg", "publishedAt": "2023-01-23T02:30:53Z", "content": "Covid-19 could cause diabetes in people who may not have otherwise developed the disease, said an analysis published in a medical journal, The Lancet. \r\nThe author of the analysis also found that Cov… [+4665 chars]"}, {"source": {"id": null, "name": "Nutraingredients-asia.com"}, "author": "nutraingredients-asia.com", "title": "Black tea may have preventive effect on ovarian cancer – new Chinese meta-analysis - NutraIngredients-Asia", "description": "The consumption of black tea may lower the risk of ovarian cancer, according to Chinese researchers, although no significant correlation with endometrial cancer and cervical cancer was found.", "url": "https://www.nutraingredients-asia.com/Article/2023/01/23/black-tea-may-have-preventive-effect-on-ovarian-cancer2", "urlToImage": "https://www.nutraingredients-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-asia.com/news/research/black-tea-may-have-preventive-effect-on-ovarian-cancer/16090388-1-eng-GB/Black-tea-may-have-preventive-effect-on-ovarian-cancer.jpg", "publishedAt": "2023-01-23T00:34:40Z", "content": "Previous studies investigating the correlation between tea intake and incidence of gynaecologic cancers have produced conflicting results.\r\nTo evaluate this association, a meta-analysis based on 19 c… [+3484 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Post-traumatic stress disorder: definition, symptoms and treatment - Emergency Live International", "description": "According to the DSM-IV-TR (APA, 2000), Post Traumatic Stress Disorder develops following exposure to a stressful and traumatic event that", "url": "https://www.emergency-live.com/health-and-safety/post-traumatic-stress-disorder-definition-symptoms-diagnosis-and-treatment/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2021/02/paramedic-ambulance-women-scarred-with-acid-rescuer.jpg", "publishedAt": "2023-01-22T19:31:58Z", "content": "The person’s response to the event involves intense fear, a sense of helplessness and/or horror.\r\nIt is a condition that is rapidly spreading among both emergency responders and emergency patients, s… [+3970 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "High blood sugar: THESE warning signs indicate the symptoms of hyperglycemia - Zee News", "description": "When there is too much sugar in the blood, it results in hyperglycemia or high blood glucose. This occurs if your body cant properly absorb insulin or if there is insufficient insulin in your system (insulin is the hormone that carries glucose into the blood).", "url": "https://zeenews.india.com/health/high-blood-sugar-these-warning-signs-indicate-the-symptoms-of-hyperglycemia-2564616", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/22/1144611-high-blood-sugar.jpg", "publishedAt": "2023-01-22T18:25:23Z", "content": "High blood sugar symptoms: When there is too much sugar in the blood, it results in hyperglycemia or high blood glucose. This occurs if your body can't properly absorb insulin or if there is insuffic… [+2543 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Flavo Trim Reviews - Will Clarity Nutrition FlavoTrim Supplement Work For You? - The Tribune India", "description": "Obesity is a medical problem affecting millions of adults and children. Experts warn that diet, lifestyle habits, age, and genetics increase the probability of you gaining weight.", "url": "https://www.tribuneindia.com/news/brand-connect/flavo-trim-reviews-will-clarity-nutrition-flavotrim-supplement-work-for-you-472763", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_2119909653.jpg", "publishedAt": "2023-01-22T13:49:00Z", "content": "Obesity is a medical problem affecting millions of adults and children. Experts warn that diet, lifestyle habits, age, and genetics increase the probability of you gaining weight.\r\nPreviously, most p… [+10473 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "Belly fat in women: 6 ways to reduce fat around your stomach - Health shots", "description": "Is the fat around the stomach giving you a hard time? Here are six easy and effective ways to get rid of belly fat in women.", "url": "https://www.healthshots.com/how-to/reduce-belly-fat-with-these-quick-and-easy-ways/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/22121445/belly-fat-woman.jpg", "publishedAt": "2023-01-22T09:30:17Z", "content": "Oh God, belly fat! We have all been there and it’s not a good sight. The fat around the stomach is one of the worst fats to deal with – it’s stubborn and does not budge! While we are all about body p… [+3069 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "PCOS: Signs to watch out for in your face - Indiatimes.com", "description": "Polycystic ovary syndrome (PCOS) is a common condition that affects approximately 116 million women around the world, reports the World Health Organization (WHO). It is a hormonal condition that affects women's ovaries. According to the UK National Health Ser…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/pcos-signs-to-watch-out-for-in-your-face/photostory/97173207.cms", "urlToImage": "https://static.toiimg.com/photo/97173232.cms", "publishedAt": "2023-01-22T05:30:00Z", "content": "According to the NHS, PCOS is one of the most common causes of female infertility. \"Many women discover they have PCOS when they're having difficulty getting pregnant,\" the UK health body reports. \r\n… [+361 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "UNC Charlotte's research leads discussion in COVID-19 booster schedules - WCNC", "description": "A researcher at UNC Charlotte helped lead a research study into the most effective schedule for COVID-19 booster shots.This comes as Mecklenburg County shift...", "url": "https://www.youtube.com/watch?v=PFkBXIxXD00", "urlToImage": "https://i.ytimg.com/vi/PFkBXIxXD00/hqdefault.jpg", "publishedAt": "2023-01-22T04:23:31Z", "content": null}]}