{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Key Anti-Inflammatories That Decline in the Aging Brain Identified - Technology Networks", "description": "According to research, a class of lipids called SGDGs decline in the brain with age and may have anti-inflammatory effects.", "url": "https://www.technologynetworks.com/neuroscience/news/key-anti-inflammatories-that-decline-in-the-aging-brain-identified-367156", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367156/key-anti-inflammatories-that-decline-in-the-aging-brain-identified-367156-640x360.jpg?cb=20221101", "publishedAt": "2022-11-01T10:08:50Z", "content": "Aging involves complicated plot twists and a large cast of characters: inflammation, stress, metabolism changes, and many others. Now, a team of Salk Institute and UC San Diego scientists reveal anot… [+3903 chars]"}, {"source": {"id": null, "name": "Morningstar.com"}, "author": null, "title": "Want to slow, delay or reverse dementia? Try this classic game. - Morningstar", "description": "", "url": "https://www.morningstar.com/news/marketwatch/2022110133/want-to-slow-delay-or-reverse-dementia-try-this-classic-game", "urlToImage": "/assets/img/marketwatch.dad5abb.png", "publishedAt": "2022-11-01T10:05:00Z", "content": "By Brett Arends \r\nA couple of years ago I bought a big book of crosswords and started doing one every day. I found something peculiar. With each crossword, I would initially get stuck on many of the … [+5268 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "ProDentim Probiotics Healthy Teeth Ingredients and Side Effects Report Exposes - The Tribune India", "description": "After reading many research studies on how each ProDentim ingredient might impact oral hygiene, I only used the supplement. Many people have written reviews about organic supplements. ProDentim supplement does more than provide a probiotic candy. It also trac…", "url": "https://www.tribuneindia.com/news/brand-connect/prodentim-probiotics-healthy-teeth-ingredients-and-side-effects-report-exposes-446553", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_974704669.jpg", "publishedAt": "2022-11-01T09:54:00Z", "content": "After reading many research studies on how each ProDentim ingredient might impact oral hygiene, I only used the supplement. Many people have written reviews about organic supplements. ProDentim suppl… [+14746 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Monoclonal Antibody Protects Against Malaria Infection in Mali Clinical Trial - Technology Networks", "description": "In a clinical trial, a monoclonal antibody safely protected healthy, non-pregnant adults from malaria infection during an intense six-month malaria season in Mali, Africa.", "url": "https://www.technologynetworks.com/biopharma/news/monoclonal-antibody-protects-against-malaria-infection-in-mali-clinical-trial-367144", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367144/monoclonal-antibody-protects-against-malaria-infection-in-mali-clinical-trial-367144-640x360.jpg?cb=20221101", "publishedAt": "2022-11-01T09:36:32Z", "content": "One dose of an antibody drug safely protected healthy, non-pregnant adults from malaria infection during an intense six-month malaria season in Mali, Africa, a National Institutes of Health clinical … [+6889 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Covid virus shown to trigger inflammation in brain like Parkinsons: Report - Business Standard", "description": "Research led by the University of Queensland UQ has found that Covid19 activates the same inflammatory response in the brain as Parkinsons disease", "url": "https://www.business-standard.com/article/international/covid-virus-shown-to-trigger-inflammation-in-brain-like-parkinson-s-report-122110100666_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-04/12/full/1649747414-57.jpg", "publishedAt": "2022-11-01T08:57:00Z", "content": "Research led by the University of Queensland (UQ) has found that Covid-19 activates the same inflammatory response in the brain as Parkinson's disease.\r\nThe discovery identified a potential future ri… [+2433 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Ananya Singh", "title": "'Smart' Red Blood Cells Could Address The Antibiotic Resistance Crisis, Scientists Say - The Swaddle", "description": "Scientists conceal antibiotics within red blood cells for targeted treatment -- a finding that could help tackle drug-resistant bacteria with fewer side effects.", "url": "https://theswaddle.com/smart-red-blood-cells-could-address-the-antibiotic-resistance-crisis-scientists-say/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/11/Red-Blood-Cells_Editorial.jpg", "publishedAt": "2022-11-01T08:39:51Z", "content": "Physicists at McMaster University recently modified red blood cells and tested their potential as drug carriers. They found that these smart red blood cells can safely carry potent antibiotics to sel… [+5512 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Western Australia: Australian scientists develop world-first map showing gene activity changes in diverse human brain cell types from pre-birth to adulthood - India Education Diary", "description": "A world-first map of the gene activity changes that occur in the diverse cells of the brain during development from before birth through to adulthood has been developed by a team of Perth researchers at The University of Western Australia and the Har", "url": "https://indiaeducationdiary.in/university-of-western-australia-australian-scientists-develop-world-first-map-showing-gene-activity-changes-in-diverse-human-brain-cell-types-from-pre-birth-to-adulthood/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/download-11-3.png?fit=301%2C167&ssl=1", "publishedAt": "2022-11-01T08:29:23Z", "content": "A world-first map of the gene activity changes that occur in the diverse cells of the brain during development from before birth through to adulthood has been developed by a team of Perth researchers… [+4075 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "Worried about stroke? Here's how you can reduce its risk if you are diabetic - India Today", "description": "People with diabetes are twice more likely to have a stroke. However, there are ways in which you can keep your heart and brain healthy.", "url": "https://www.indiatoday.in/health/story/worried-about-stroke-heres-how-you-can-reduce-its-risk-if-you-are-diabetic-2291845-2022-11-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/untitled_design_-_2022-11-01t131258.831_0-sixteen_nine.png?VersionId=Ek7eT0MzPnwsE9FLzXxbntp7xTK.47nZ", "publishedAt": "2022-11-01T08:16:52Z", "content": "By Daphne Clarance: Diabetes and hypertension are among the highest risk factors for causing a stroke. \r\n\"People with diabetes tend to develop heart disease or have a stroke at an earlier age than pe… [+3300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Does eating 46 almonds a day boost gut health? Well, in India 20 should be good enough, says expert - The Indian Express", "description": "No matter what studies say, the question of how many almonds one should have is subjective as the quantity may vary due to the environment, climate conditions, individual exercise routine and ongoing dietary intake. Raw almonds are known to produce heat, espe…", "url": "https://indianexpress.com/article/lifestyle/health-specials/eating-almonds-health-special-experts-8242397/", "urlToImage": "https://images.indianexpress.com/2022/11/getty_almonds_1200.jpg", "publishedAt": "2022-11-01T08:01:05Z", "content": "We know that almonds are nutrient-rich and a healthy substitute for snacking. Now a new study finds that eating 56 grams of almonds daily the equivalent of approximately 46 almonds can improve gut he… [+5232 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Chrissy Metz Keto Gummies SHARK TANK REVIEWS EXPOSED SIDE EFFECTS - The Tribune India", "description": "Chrissy Metz Keto Gummies are scientifically studied and analyzed under tight scrutiny. These gummies are tested and approved by a third-party lab and medical experts for their effectiveness in bringing about the desired results. ORDERING Chrissy Metz Keto Gu…", "url": "https://www.tribuneindia.com/news/brand-connect/chrissy-metz-keto-gummies-shark-tank-reviews-exposed-side-effects-446532", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_984386482.jpg", "publishedAt": "2022-11-01T07:13:00Z", "content": "What are Chrissy Metz Keto Gummies?\r\nChrissy Metz Keto Gummies are scientifically studied and analyzed under tight scrutiny. These gummies are tested and approved by a third-party lab and medical exp… [+8550 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Make These Necessary Lifestyle Changes To Manage High Blood Pressure - News18", "description": "Hypertension can have adverse health effects and it is highly advisable that one needs to keep it under constant check.", "url": "https://www.news18.com/news/lifestyle/make-these-necessary-lifestyle-changes-to-manage-high-blood-pressure-6261349.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/untitled-design-33-8-166728619116x9.png", "publishedAt": "2022-11-01T07:05:29Z", "content": "High blood pressure (BP) or hypertension is often referred to as the silent killer as it has no symptoms but poses a major risk for heart disease and stroke. It can also seriously damage organs like … [+2179 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Clinical Genomics: Career Opportunities and Skill-sets - BSI bureau", "description": "We are in the Genomics era, cherished by Nobel winners like Dr Jennifer A. Doudna and Dr Emmanuelle Charpentier at 2020 for Genome editing CRISPR technology and Dr Svante Paabo in 2022  for paleogenomics. The 13 years of Human Genome Sequencing project gave h…", "url": "https://www.biospectrumindia.com/views/17/22172/clinical-genomics-career-opportunities-and-skill-sets.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/6-22172.png", "publishedAt": "2022-11-01T06:46:40Z", "content": "We are in the Genomics era, cherished by Nobel Prize winners like Dr Jennifer A. Doudna and Dr Emmanuelle Charpentier in 2020 for Genome editing CRISPR technology and Dr Svante Paabo in 2022 for pale… [+2434 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Starting cancer treatment? You should discuss fertility first - The Indian Express", "description": "It takes time to plan and perform fertility preservation (for example, eggs may take around 14 days to grow and collect for freezing) so promptness is important to prevent delays in cancer treatment.", "url": "https://indianexpress.com/article/lifestyle/health/starting-cancer-treatment-you-should-discuss-fertility-first-8239951/", "urlToImage": "https://images.indianexpress.com/2022/11/fertility_cancer_200_getty.jpg", "publishedAt": "2022-11-01T06:30:47Z", "content": "In 2022, it is predicted more than 8,200 Australians under 40 in their reproductive years will be diagnosed with cancer. This is more than double the rate in the 1980s.\r\nThe good news is more men, wo… [+5601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "These foods can be eaten in more quantities than others without any adverse health effects - The Indian Express", "description": "\"The idea of having to eat something when you want to, is fine, but limitlessly consuming it is a no-no. It could be a sign of an eating disorder,\" says an expert", "url": "https://indianexpress.com/article/lifestyle/health/foods-limitlessly-adverse-health-effects-unrestricted-consumption-8183286/", "urlToImage": "https://images.indianexpress.com/2022/09/GettyImages-healthy-eating-berries-1200.jpg", "publishedAt": "2022-11-01T06:00:56Z", "content": "Many people, who have embarked on a weight loss journey, limit their consumption of food so as to shed excess weight. It can be almost punishing; experts say that it is important to listen to your bo… [+2789 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Haircare: Your Hair Needs Nourishment From Food, Follow These Tips - NDTV", "description": "The nutrition says, \"Like our skin, our hair is a result of our internal health. Each strand of our hair requires a steady supply of essential nutrients.\"", "url": "https://www.ndtv.com/health/haircare-your-hair-needs-nourishment-from-food-follow-these-tips-3479012", "urlToImage": "https://c.ndtvimg.com/2021-05/o7hvv2l8_protein-_625x300_07_May_21.jpg", "publishedAt": "2022-11-01T05:50:44Z", "content": "Haircare: Increase your intake of protein-packed food items like eggs, veggies, soybean, fish, etc.\r\nHair problems are drastically increasing among adults these days. From hair fall to patchiness and… [+2652 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Side-Effects of Breakfast Cereals: 5 Reasons Why You Should NOT Consume Cornflakes Daily - India.com", "description": "Breakfast cereals are prepared from refined grains and are highly processed, with many components added. Common food pairings include milk, yoghurt, fruit, and almonds.", "url": "https://www.india.com/health/side-effects-of-breakfast-cereals-5-reasons-why-you-should-not-consume-cornflakes-daily-5716711/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/11/Side-effects-of-breakfast-cereal.jpg", "publishedAt": "2022-11-01T05:22:02Z", "content": "Side Effects of Breakfast Cereals: These days, ready-to-eat breakfast cereals are a common choice. They come in a variety of delectable flavours and are quick, adaptable, and delicious. Since cornfla… [+1659 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Research finds vaping to cause poor cardiovascular function in even young adults - Medical Dialogues", "description": "Adults who regularly used electronic nicotine  delivery devices, or e-cigarettes, displayed worrisome changes in heart and  blood vessel function and performed significantly worse on exercise stress...", "url": "https://medicaldialogues.in/mdtv/cardiology/videos/research-finds-vaping-to-cause-poor-cardiovascular-function-in-even-young-adults-101544", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/01/189524-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-1.jpg", "publishedAt": "2022-11-01T03:45:59Z", "content": "Adults who regularly used electronic nicotine delivery devices, or e-cigarettes, displayed worrisome changes in heart and blood vessel function and performed significantly worse on exercise stress te… [+9867 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Same facial expression might represent various things to different people: Study - Zee News", "description": "Our study proves that we cant assume that there is a common understanding of what emotions different facial expressions reflect.", "url": "https://zeenews.india.com/relationships/same-facial-expression-might-represent-various-things-to-different-people-study-2529324.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/01/1110839-emoji-faces.jpg", "publishedAt": "2022-11-01T02:22:07Z", "content": "Researchers utilised an algorithm to allow users to modify their ideas about what a certain emotion's facial expression should look like. The findings revealed significant individual variability, imp… [+2102 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 pandemic increased deaths and disease caused by tuberculosis - News-Medical.Net", "description": "A new report published by the World Health Organization indicated a decrease in global spending on essential TB services from US$6 billion in 2019 to US$5.4 billion in 2021.", "url": "https://www.news-medical.net/news/20221031/COVID-19-pandemic-increased-deaths-and-disease-caused-by-tuberculosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729608_16672691906096735.jpg", "publishedAt": "2022-11-01T02:22:00Z", "content": "Approximately 10 million people fall ill with tuberculosis (TB) each year. Even though TB is preventable and curable, over 1.5 million people die from it every year. The bacteria, Mycobacterium tuber… [+5529 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Yoga and Pranayama can help Alzheimers patients: Research - Sentinelassam - The Sentinel Assam", "description": "Alzheimers disease is the most common cause of dementia that affects about 5-6% of people in the age ...", "url": "https://www.sentinelassam.com/topheadlines/yoga-and-pranayama-can-help-alzheimers-patients-research-621049", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/10/31/408087-yiga.jpg", "publishedAt": "2022-11-01T01:45:37Z", "content": "NEW DELHI: Alzheimer's disease is the most common cause of dementia that affects about 5-6% of people in the age group of 65-70 years in India. Research reveals that as the population of India ages, … [+4973 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Supreeth  D R", "title": "Selective and non-selective NSAIDs equally effective for preventing heterotopic ossification after THA - Medical Dialogues", "description": "Some patients have demonstrated evidence of heterotopic ossification (HO) following total hip arthroplasty (THA). Selective and non-selective non-steroidal anti-inflammatory drugs (NSAIDs) are used...", "url": "https://medicaldialogues.in/orthopaedics/news/selective-and-non-selective-nsaids-equally-effective-for-preventing-heterotopic-ossification-after-tha-101556", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/25/188958-nsaid.jpg", "publishedAt": "2022-11-01T01:15:30Z", "content": "Some patients have demonstrated evidence of heterotopic ossification (HO) following total hip arthroplasty (THA). Selective and non-selective non-steroidal anti-inflammatory drugs (NSAIDs) are used a… [+2527 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "A dog parasite could help fight incurable cancers – what our immunotherapy research revealed - EastMojo", "description": "Cancers are the second leading cause of death in the world, after cardiovascular diseases. Their seriousness lies in their diversity – some can be", "url": "http://www.eastmojo.com/world/2022/11/01/a-dog-parasite-could-help-fight-incurable-cancers-what-our-immunotherapy-research-revealed/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2020/08/dog_killed.jpg?fit=1920%2C1280&ssl=1", "publishedAt": "2022-11-01T01:00:00Z", "content": "Cancers are the second leading cause of death in the world, after cardiovascular diseases. Their seriousness lies in their diversity some can be effectively treated with surgery, chemotherapy and rad… [+6567 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Self Healing and the Management of Musculoskeletal Pain | JPR - Dove Medical Press", "description": "“Self-Healing” as a new concept for MSK pain management and reinforcing the potential for integrating multi-modal medicine into current care. Click for more...", "url": "https://www.dovepress.com/self-healing-a-novel-and-integrated-multimodal-concept-for-the-managem-peer-reviewed-fulltext-article-JPR", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-11-01T00:27:43Z", "content": "Commentary\r\nAccording to the World Health Organization (WHO) more than 1.7 billion people suffer from musculoskeletal (MSK) conditions.1,2 MSK conditions are the leading contributor to disability wor… [+10311 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New COVID-19 vaccine trial in San Antonio could eliminate need for boosters in future - KSAT 12", "description": "Groundbreaking research to create an entirely new type of COVID-19 vaccine is happening here in San Antonio, and the lead doctor is looking for locals to get...", "url": "https://www.youtube.com/watch?v=aIWUBZ2ByWg", "urlToImage": "https://i.ytimg.com/vi/aIWUBZ2ByWg/maxresdefault.jpg", "publishedAt": "2022-10-31T23:24:08Z", "content": null}, {"source": {"id": null, "name": "Jordannews.jo"}, "author": "New York Times", "title": "WHO lists top fungal health threats... - Jordan News", "description": "The World Health Organization has released a ranking of fungi that threaten human health, in its most ambitious effort to draw attention to a constellation of pathogens that are largely overlooked, even as they have become increasingly widespread, resistant t…", "url": "https://www.jordannews.jo/Section-122/Health/WHO-lists-top-fungal-health-threats-23925", "urlToImage": "https://imgy.pro/jordannews/993x560/1020223119813511188840.jpg", "publishedAt": "2022-10-31T22:36:32Z", "content": "The World Health Organization has released a ranking of fungi that threaten human health,\r\nin its most ambitious effort to draw attention to a constellation of pathogens\r\nthat are largely overlooked,… [+4074 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Anujj Trehaan", "title": "Ever heard of breadfruit? Check out its health benefits - NewsBytes", "description": "Breadfruit belongs to the same family as jackfruit and is grown heavily in regions including Southeast Asia, the Caribbean, and the Pacific islands", "url": "https://www.newsbytesapp.com/news/lifestyle/5-health-benefits-of-breadfruit/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l57620221031121406.jpeg", "publishedAt": "2022-10-31T21:55:02Z", "content": "Ever heard of breadfruit? Check out its health benefits\r\nNov 01, 2022, 03:25 am2 min read\r\nHere's a lesser-known fruit with magical healing properties!\r\n Breadfruit belongs to the same family as jack… [+2144 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Apixaban associated with lower risk of GI bleeding compared to all DOACs - Medical Dialogues", "description": "A multinational cohort study of persons with atrial fibrillation (AF) found that compared with all direct oral anticoagulants (DOACs), apixaban was associated with lower rates of gastrointestinal...", "url": "https://medicaldialogues.in/medicine/news/apixaban-associated-with-lower-risk-of-gi-bleeding-compared-to-all-doacs-101264", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/27/189037-medi.jpg", "publishedAt": "2022-10-31T21:15:17Z", "content": "A multinational cohort study of persons with atrial fibrillation (AF) found that compared with all direct oral anticoagulants (DOACs), apixaban was associated with lower rates of gastrointestinal (GI… [+1625 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Donavyn Coffey", "title": "Simple Urine Test Could Improve Cystic Fibrosis Treatment - Medscape", "description": "A measure of bicarbonate in urine was associated with both disease severity and response to treatment in a new study.", "url": "https://www.medscape.com/viewarticle/983312", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_221031_cystic_fibrosis_doctor_800x450.jpg", "publishedAt": "2022-10-31T21:05:27Z", "content": "An easy-to-administer electrolyte test could offer new insight into response to treatment and disease progression for patients with cystic fibrosis.\r\nIn a new study, researchers found that urine bica… [+5612 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Indranil Biswas", "title": "What is the Nutritional Value of Green Olives? - Sportskeeda", "description": "Green olives belong to a group of fruits called stone fruits.", "url": "https://www.sportskeeda.com/health-and-fitness/what-nutritional-value-green-olives", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/10/e45d2-16672006219205-1920.jpg", "publishedAt": "2022-10-31T18:27:22Z", "content": "Green olives belong to a group of fruits called stone fruits. They are biologically related to mangoes, cherries, peaches, almonds, and pistachios and are known to be high in antioxidants and are ben… [+4240 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Yash Lakhan", "title": "Everything You Need To Know About Sucrose Fructose And Glucose - Slurrp", "description": "Despite the fact that sucrose, glucose, and fructose are all-natural sugars that taste sweet to our lips, the way they are metabolised in our bodies differs substantially.", "url": "https://www.slurrp.com/article/everything-you-need-to-know-about-sucrose-fructose-and-glucose-1667239953466", "urlToImage": "https://images.slurrp.com/prodarticles/b10vvxhgy24.webp", "publishedAt": "2022-10-31T18:21:58Z", "content": "Sucrose, glucose, and fructose are examples of simple carbohydrates, sometimes known as simple sugars. Glucose and fructose are forms of monosaccharides, which are single sugar molecules. Sucrose is … [+5155 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Melanoma survivors might be identified using an artificial intelligence technique: Study - ThePrint", "description": "Boston [US], October 31 (ANI): According to a study, the majority of melanoma-related deaths occur in people who had an early-stage diagnosis of the most deadly kind of skin cancer and later suffered a recurrence that was often not noticed until it had spread…", "url": "https://theprint.in/health/melanoma-survivors-might-be-identified-using-an-artificial-intelligence-technique-study/1190131/", "urlToImage": null, "publishedAt": "2022-10-31T18:15:05Z", "content": "Boston [US], October 31 (ANI): According to a study, the majority of melanoma-related deaths occur in people who had an early-stage diagnosis of the most deadly kind of skin cancer and later suffered… [+3088 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Anuradha Varanasi", "title": "Walkable Neighborhoods Could Lower Cardiovascular Disease Risk - Forbes", "description": "According to the American Heart Association, cardiovascular disease is the leading cause of death not only in the U.S. but also globally.", "url": "https://www.forbes.com/sites/anuradhavaranasi/2022/10/31/walkable-neighborhoods-could-lower-cardiovascular-disease-risk/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/635f51a7b6b2f2579d08fd14/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-10-31T18:00:50Z", "content": "(HR) People walk across the bridge near Little Raven Court in downtown Denver. Realtors in and ... [+] around the Denver metro area are marketing real estate on a walkability rating meaning how walka… [+4895 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Heart disease death rates up during Covid pandemic, young adults at most risk: US CDC - The Tribune India", "description": "Prior to 2020, death rates from heart disease had been declining among adults for decades in the US but the increases in death rates from heart disease, particularly high among younger adults, spiked during the Covid pandemic, erasing years of progress, an ep…", "url": "https://www.tribuneindia.com/news/health/heart-disease-death-rates-up-during-covid-pandemic-young-adults-at-most-risk-us-cdc-446241", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1877200420.jpg", "publishedAt": "2022-10-31T16:51:00Z", "content": "IANS\r\nNew York, October 31\r\nPrior to 2020, death rates from heart disease had been declining among adults for decades in the US but the increases in death rates from heart disease, particularly high … [+2786 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "South Carolina hospitals give patient update on number of RSV, flu, COVID-19 cases - WYFF News 4", "description": "Hospital across the country are reporting an uptick in patients with RSV, flu and COVID-19, including in South Carolina.Subscribe to WYFF on YouTube now for ...", "url": "https://www.youtube.com/watch?v=ovi8N4Qk3yg", "urlToImage": "https://i.ytimg.com/vi/ovi8N4Qk3yg/maxresdefault.jpg", "publishedAt": "2022-10-31T16:47:17Z", "content": null}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Cat Parasite Hijacks The Identity Of Immune Cells To Spread Inside The Human Body, Study Finds - ABP Live", "description": "The cat parasite Toxoplasma infects immune cells and hijacks their identity to spread inside the host.", "url": "https://news.abplive.com/science/cat-parasite-hijacks-the-identity-of-immune-cells-to-spread-in-the-body-of-humans-study-finds-1560825", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/10/31/e69d8f95eb7326b8e6873f2c806192a91667228394805324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-10-31T16:16:04Z", "content": "Did you know that cats and other felines are the only hosts in which the parasite Toxoplasma gondii can undergo sexual reproduction? A large portion of the human population carries the cat parasite T… [+4310 chars]"}, {"source": {"id": null, "name": "Pulmonologyadvisor.com"}, "author": "melissaalvarez", "title": "Catabolic Phase of COVID-19 and Its Association With Outcome - Pulmonology Advisor", "description": "In patients critically ill with COVID-19, what are the determinants of nitrogen balance and what is the association between nitrogen balance trajectories and outcomes?", "url": "https://www.pulmonologyadvisor.com/home/topics/critical-care/catabolic-phase-of-covid-19-and-its-association-with-outcome/", "urlToImage": null, "publishedAt": "2022-10-31T16:14:00Z", "content": "Individuals who did not survive COVID-19 had a more prolonged and seemingly more pronounced catabolic state than those who survived, according to a study published in Clinical Nutrition.\r\nIn patients… [+3616 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "People who need fitness watches may use them the least: PIO scientist - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/people-who-need-fitness-watches-may-use-them-the-least-pio-scientist-3397882", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/cc71e3da53b4e091ec27230f8fb13479_w_800_h_450.jpg", "publishedAt": "2022-10-31T14:19:10Z", "content": "New York, Oct 31 (IANS) People at risk of cardiovascular disease are less likely to use wearable health devices, like smartwatches and fitness bands, a study led by an Indian-American scientist has f… [+2501 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dengue Cases Tally Crosses 2000-Mark In Delhi, Over 1200 Cases In October - NDTV", "description": "Over 1,200 cases of dengue have been reported in the national capital in October, taking the infection tally of the vector-borne disease beyond the 2,000-mark so far this year.", "url": "https://www.ndtv.com/india-news/dengue-cases-tally-crosses-2000-mark-in-delhi-over-1200-cases-in-october-3477572", "urlToImage": "https://c.ndtvimg.com/2022-09/ha7jqn5o_dengue-mosquito-generic_625x300_19_September_22.jpg", "publishedAt": "2022-10-31T14:14:29Z", "content": "Delhi also recorded 200 cases of malaria and 40 cases of chikungunya this year. (Reoresentational)\r\nNew Delhi: Over 1,200 cases of dengue have been reported in the national capital in October, taking… [+2796 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "As Dengue Cases Rise, Biggest Myths around The Disease Busted - ABP Live", "description": "People fall into many myths and misconceptions, which can not only make them vulnerable to this serious disease but can also give a frightening look to the disease.", "url": "https://news.abplive.com/health/dengue-cases-hike-in-delhi-up-west-bengal-punjab-top-myths-around-dengue-busted-1560800", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/10/31/d7b853e962d06d3919da7121b2c37d261667219758865575_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-10-31T14:03:55Z", "content": "New Delhi: A number of states are facing a Dengue outbreak in their cities. UP, West Bengal, Delhi, and Punjab are the worst-hit states. More than 5000 cases have been recorded in Delhi in the curren… [+4121 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "What foods are good for mental health? - Firstpost", "description": "Turmeric is very beneficial for our health. Turmeric is the main ingredient in curry powder and is very good for the brain.", "url": "https://www.firstpost.com/living/5-foods-that-are-good-for-mental-health-11546451.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/07/kevin-bhagat-q8rU7NosfdY-unsplash.jpg", "publishedAt": "2022-10-31T13:30:55Z", "content": "A healthy diet is not only required for weight loss but also for overall health. Brain is the control centre of your body, it helps to keep your heart beating and lungs breathing and even allows you … [+1929 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Consumption of vitamin B6 and folate protects against CVD in type 2 diabetes patients - Medical Dialogues", "description": "China: Greater consumption of vitamin B6 and folate, but not of vitamin B12, is associated with low cardiovascular disease (CVD) risk in type 2 diabetes patients, a recent study has revealed.The...", "url": "https://medicaldialogues.in/medicine/news/consumption-of-vitamin-b6-and-folate-protects-against-cvd-in-type-2-diabetes-patients-101525", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/15/188043-vitamin-b.jpg", "publishedAt": "2022-10-31T12:30:49Z", "content": "China: Greater consumption of vitamin B6 and folate, but not of vitamin B12, is associated with low cardiovascular disease (CVD) risk in type 2 diabetes patients, a recent study has revealed.The find… [+4533 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Best Strong Legal Stimulants And Energy Pills Like Speed - NDTV", "description": "The nootropics used inVyvamindimprove norepinephrine and dopamine levels in the brain. Here's everything else you need to know before buying Vyvamind.", "url": "https://www.ndtv.com/health/best-strong-legal-stimulants-and-energy-pills-like-speed-3477094", "urlToImage": "https://c.ndtvimg.com/2022-10/obk7r20o_vyvamind_625x300_31_October_22.jpg", "publishedAt": "2022-10-31T12:22:00Z", "content": "Vyvamind helps boost your energy levels\r\nThere are a few different types of Energy Pills. Some are stronger than others. One of the strongest is called Vyvamind. This pill is a stimulant that boosts … [+14312 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Biliary atresia disease in kids: Signs, symptoms and everything else you need to know - The Indian Express", "description": "Biliary atresia can start around birth to up to 2-3 months of age. The key symptoms children may experience can be pale/light colour/clay stools, jaundice, and dark yellow urine", "url": "https://indianexpress.com/article/lifestyle/health/biliary-atresia-disease-kids-signs-symptoms-8235483/", "urlToImage": "https://images.indianexpress.com/2022/10/GettyImages-children-liver-health-1200.jpg", "publishedAt": "2022-10-31T12:00:33Z", "content": "Parents often worry about the health and well-being of their children, especially new and first-time parents. And while there are many health issues that are seen in the formative years, biliary atre… [+3183 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "UK Study finds that young working professionals are at high risk of stroke - mid-day.com", "description": "The findings from the study published in the journal JAMA on the 'World Stroke Day 2022', reflect emerging evidence that young stroke is a growing problem in high-income countries", "url": "http://www.mid-day.com/lifestyle/health-and-fitness/article/uk-study-finds-that-young-working-professionals-are-at-high-risk-of-stroke-23253100", "urlToImage": "https://images.mid-day.com/images/images/2022/oct/working-uspet_d.jpg", "publishedAt": "2022-10-31T11:28:00Z", "content": "The findings from the study published in the journal JAMA on the 'World Stroke Day 2022', reflect emerging evidence that young stroke is a growing problem in high-income countries\r\nRepresentational i… [+3404 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Shyla Jovitha Abraham", "title": "Health benefits of meditation/yoga - The Week", "description": "TWO new studies explain the health benefits of mind-body practices such as yoga and", "url": "https://www.theweek.in/health/quickscan/2022/10/28/health-benefits-of-meditation-yoga.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/quickscan/images/2022/10/28/8-Health-benefits-of-meditation-yoga.jpg", "publishedAt": "2022-10-31T11:23:00Z", "content": "TWO new studies explain the health benefits of mind-body practices such as yoga and meditation.\r\nAccording to the first study published in the Journal of Integrative and Complementary Medicine, mind-… [+10963 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Is intermittent fasting effective for women? - Mint Lounge", "description": "It depends. While intermittent fasting has been proven to be a successful weight-loss method, it could also affect female reproductive hormones", "url": "https://lifestyle.livemint.com/health/wellness/is-intermittent-fasting-effective-for-women-111667213055990.html", "urlToImage": "https://images.livemint.com/img/2022/10/31/1140x641/Coffee_1667213526250_1667213540214_1667213540214.jpg", "publishedAt": "2022-10-31T10:58:58Z", "content": "A study has found that intermittent fasting can affect women's reproductive hormones.\r\nThe study was published in the journal, Obesity.\r\nEight weeks were spent monitoring a group of pre- and post-men… [+3427 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Non Stimulant Appetite Suppressant [#Exposed] of 2022 Updated - Deccan Herald", "description": "An Overview Having a slim body is a dream for many people. People put in lots of effort, they go to gyms and suppress their eating habits but they still find difficulty getting into a fit body. This happens because your own body doesn't support you. After all…", "url": "https://www.deccanherald.com/brandspot/pr-spot/non-stimulant-appetite-suppressant-exposed-of-2022-updated-1158126.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1158126-1667211342.png", "publishedAt": "2022-10-31T10:15:42Z", "content": "An Overview\r\nHaving a slim body is a dream for many people. People put in lots of effort, they go to gyms and suppress their eating habits but they still find difficulty getting into a fit body. This… [+11434 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Donor Hearts from People Who Were #COVID19 -positive Appeared to Be as Safe for ... - Latest Tweet by IANS - LatestLY", "description": "The latest Tweet by IANS India states, 'Donor hearts from people who were #COVID19 -positive appeared to be as safe for transplantation as those from people without the infection, according to a new analysis that includes data from the first 84 Covid-positive…", "url": "https://www.latestly.com/socially/india/news/donor-hearts-from-people-who-were-covid19-positive-appeared-to-be-as-safe-for-latest-tweet-by-ians-india-4399096.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/TW-IANS-India-2-784x441.png", "publishedAt": "2022-10-31T10:12:53Z", "content": "Donor hearts from people who were #COVID19 -positive appeared to be as safe for transplantation as those from people without the infection, according to a new analysis that includes data from the fir… [+591 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Monkeypox attacking kids 8 yrs & below - Ahmedabad Mirror", "description": "Monkeypox attacking kids 8 yrs & below", "url": "https://www.ahmedabadmirror.com/monkeypox-attacking-kids-8-yrs--below/81846649.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1667197726338.jpg-org", "publishedAt": "2022-10-31T09:15:55Z", "content": "#LondonChildren aged 8 years or younger should be considered a group at high risk for more severe monkeypox disease, researchers report.Few children are affected by monkeypox so far but risks are hig… [+1151 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The impact of genetic and lifestyle factors on the risk of major cardiovascular and thromboembolic events post-COVID-19 diagnosis - News-Medical.Net", "description": "A new study aimed to analyze the association between lifestyle risk factors, PRSs, and their interactions along with the risk of CVE within 90 days post-COVID-19 diagnosis.", "url": "https://www.news-medical.net/news/20221031/The-impact-of-genetic-and-lifestyle-factors-on-the-risk-of-major-cardiovascular-and-thromboembolic-events-post-COVID-19-diagnosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729476_16672072123551608.jpg", "publishedAt": "2022-10-31T09:11:00Z", "content": "Cardiovascular disease is known to be the leading cause of death throughout the world. Recently, cardiovascular morbidity and mortality have increased further due to the direct and indirect impact of… [+6870 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Don't use diabetes drugs for weight loss: Docs - Ahmedabad Mirror", "description": "Don’t use diabetes drugs for weight loss: Docs", "url": "https://ahmedabadmirror.com/dont-use-diabetes-drugs-for-weight-loss-docs/81846647.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1667197540440.jpg-org", "publishedAt": "2022-10-31T08:44:44Z", "content": "Experts say each medicine has its indications, share of side effects\r\n#NewDelhiAs celebrities like Tesla CEO Elon Musk promote the use of a diabetes drug to lose some extra kilos around your waist al… [+1484 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "Solve for Tomorrow: Team Sputnik Brain Can't Wait to Get us all Stress-Free - Samsung", "description": "Shanker aka Team Sputnik Brain from Karnataka, one of our Top 10 #SolveforTomorrow teams, can’t wait to get us all stress-free. He is developing a wearable", "url": "https://news.samsung.com/in/solve-for-tomorrow-team-sputnik-brain-cant-wait-to-get-us-all-stress-free", "urlToImage": "https://img.global.news.samsung.com/in/wp-content/uploads/2022/10/feature-sputnik.jpg", "publishedAt": "2022-10-31T08:31:18Z", "content": "Shanker aka Team Sputnik Brain from Karnataka, one of our Top 10 #SolveforTomorrow teams, cant wait to get us all stress-free. He is developing a wearable device that helps reduce stress. He is produ… [+422 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Beat The Cancer In You | MENAFN.COM - MENAFN.COM", "description": "(MENAFN - Khaleej Times)  Published: Mon 31 Oct 2022, 9:49 AM   By Kushmita Bose   'Prevention is better than cure' – Something which we al", "url": "https://menafn.com/1105104077/Beat-The-Cancer-In-You", "urlToImage": "https://menafn.com/updates/pr/2022-10/31/KT_6637bimage_story.jpg", "publishedAt": "2022-10-31T08:22:31Z", "content": "(MENAFN- Khaleej Times) Published: Mon 31 Oct 2022, 9:49 AM\r\n By Kushmita Bose \r\n'Prevention is better than cure' Something which we all have heard. But how many of us have actually implemented it to… [+3797 chars]"}, {"source": {"id": null, "name": "Ophthalmologytimes.com"}, "author": "Lynda Charters", "title": "How to juggle simultaneous treatments for dry eye, glaucoma - Ophthalmology Times Europe", "description": "Gentle eye drops, laser or minimally invasive surgery, advising patients on safe viewing of electronic devices, and addressing eyelid disorders can all help to minimise adverse effects.", "url": "https://europe.ophthalmologytimes.com/view/how-to-juggle-simultaneous-treatments-for-dry-eye-glaucoma", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ophtimeeurope/770b31e47e6bb66e146c54bace6456b64f6a8192-1200x800.jpg?fit=crop&auto=format", "publishedAt": "2022-10-31T07:50:15Z", "content": "Reviewed by Dr Vatinee Bunya.\r\nOphthalmologists are often faced with treating diseases simultaneously because 4060% of patients with glaucoma also have dry eye, according to Dr Vatinee Bunya, the Wil… [+4058 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Immune memory cells are stored in bone marrow at one single cell: Study - Hindustan Times", "description": "After receiving a vaccination we remain largely immune to that disease because our bodies provide an ongoing supply of antibodies against the immunized disease - essentially making sure we remain topped up with these antibodies. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/immune-memory-cells-are-stored-in-bone-marrow-at-one-single-cell-study-101667201965547.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/31/1600x900/bone_1657290259557_1667202033533_1667202033533.jpg", "publishedAt": "2022-10-31T07:43:21Z", "content": "The way vaccines function is by successfully generating immune cells with a lengthy lifespan--often for decades. These immune cells provide a barrier of defence that can stop or lessen re-infection a… [+4372 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Fat Burning Pills That Actually Work Of 2022 [#BE Informed] - Deccan Herald", "description": "Overview Nowadays a large number of people are fighting overweight and obesity health problems. It is important to lose weight and enhance body functioning. With weight gain, many people suffer from severe health issues like high blood pressure, high choleste…", "url": "https://www.deccanherald.com/brandspot/pr-spot/fat-burning-pills-that-actually-work-of-2022-be-informed-1158066.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1158066-1667198312.png", "publishedAt": "2022-10-31T06:38:32Z", "content": "Overview\r\nNowadays a large number of people are fighting overweight and obesity health problems. It is important to lose weight and enhance body functioning. With weight gain, many people suffer from… [+13197 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Is Vitamin D Deficiency Common? Here Are Foods To Prevent It - NDTV", "description": "Vitamin D deficiency: Besides sunbathing, here are vitamin D-rich foods you should add to your daily diet to overcome or prevent vitamin D deficiency.", "url": "https://www.ndtv.com/health/vitamin-d-deficiency-is-vitamin-d-deficiency-common-here-are-foods-to-prevent-it-3475770", "urlToImage": "https://c.ndtvimg.com/2021-04/5t7e57_vitamin-d_625x300_12_April_21.jpg", "publishedAt": "2022-10-31T05:59:52Z", "content": "Vitamin D: Fatty fish, eggs, cheese, mushroom, etc. are a great source of vitamin D\r\nHighlights\r\n<ul><li>Vitamin D is extremely important for your bones\r\n</li><li>Your body produces Vitamin D when ex… [+4053 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Long COVID: how lost connections between nerve cells in the brain may explain cognitive symptoms - EastMojo", "description": "For a portion of people who get COVID, symptoms continue for months or even years after the initial infection. This is commonly referred to as “long", "url": "http://www.eastmojo.com/coronavirus-updates/2022/10/31/long-covid-how-lost-connections-between-nerve-cells-in-the-brain-may-explain-cognitive-symptoms/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/05/corona-5018070_1280.jpg?fit=1280%2C853&ssl=1", "publishedAt": "2022-10-31T04:50:00Z", "content": "For a portion of people who get COVID, symptoms continue for months or even years after the initial infection. This is commonly referred to as long COVID.\r\nCOVID can cause long-lasting cognitive symp… [+4207 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Facts to know about consumption of chia seeds for weightloss | DH Latest News, DH NEWS, Ingredients, Health & Fitness, Latest News, NEWS, Life Style, Food, Health , chia seeds for weightloss, Chia seeds and weight loss, Facts to know about consump - East Coast Daily (English)", "description": "Chia seeds have a number of qualities that make them perfect for people who want to lose weight, from being a nutrient powerhouse to being a food that is kind to the gut. So, are chia seeds the miracl", "url": "https://www.eastcoastdaily.in/2022/10/31/facts-to-know-about-consumption-of-chia-seeds-for-weightloss.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/10/5-50.jpg", "publishedAt": "2022-10-31T03:24:00Z", "content": "Chia seeds have a number of qualities that make them perfect for people who want to lose weight, from being a nutrient powerhouse to being a food that is kind to the gut.\r\nSo, are chia seeds the mira… [+2240 chars]"}, {"source": {"id": null, "name": "Nutraingredients-asia.com"}, "author": "nutraingredients-asia.com", "title": "Probiotics may improve post-partum gut, metabolic health in women with gestational diabetes - NutraIngredients-Asia", "description": "Probiotics supplementation can improve post-partum metabolic outcomes and the gut microbiota in women with a history of gestational diabetes, say researchers in Malaysia.", "url": "https://www.nutraingredients-asia.com/Article/2022/10/31/probiotics-may-improve-metabolic-health-in-women-with-gestational-diabetes-malaysia-study", "urlToImage": "https://www.nutraingredients-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-asia.com/news/research/probiotics-may-improve-metabolic-health-in-women-with-gestational-diabetes-malaysia-study/15852959-1-eng-GB/Probiotics-may-improve-metabolic-health-in-women-with-gestational-diabetes-Malaysia-study.jpg", "publishedAt": "2022-10-31T01:39:02Z", "content": "Low-grade inflammation linked to persistent post-partum obesity and glucose intolerance (GI) in women who have recently experienced gestational diabetes mellitus (post-GDM) is a major public health c… [+1584 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Access to affordable care and recognizing psoriasis under National Health Schemes in India - ETHealthWorld", "description": "The prevalence rate of psoriasis is around 2 – 4 % in the western world, whereas in India it is around 1 -2 %. It is also alarming to note that the prevalence of the disease is increasing in developing countries also.", "url": "https://health.economictimes.indiatimes.com/news/industry/access-to-affordable-care-and-recognizing-psoriasis-under-national-health-schemes-in-india/95173077", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95173077,imgsize-650222,width-1200,height-628,overlay-ethealthworld/access-to-affordable-care-and-recognizing-psoriasis-under-national-health-schemes-in-india.jpg", "publishedAt": "2022-10-31T01:14:00Z", "content": "by Dr. Ramesh Bhat MPsoriasis is one among the common skin diseases prevalent all over the world. It is a chronic immune mediated skin disease with significant physical and psychological impact. The … [+3515 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Study Finds Pandemic-related Stress Associated with Changes in Menstrual Cycle - LatestLY", "description": "Get latest articles and stories on Health at LatestLY.  We know that the pandemic has been a very stressful time for many people, and we also know that stress can appear in women's bodies as alterations in menstruation function. Researchers found the link bet…", "url": "https://www.latestly.com/agency-news/health-news-study-finds-pandemic-related-stress-associated-with-changes-in-menstrual-cycle-4397274.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/10/ANI-20221030211906-588x441.jpg", "publishedAt": "2022-10-31T00:26:17Z", "content": "Pittsburgh (Pennsylvania) [US], October 31 (ANI): According to recent research, women who were under significant stress because of the COVID-19 outbreak, were twice as likely to undergo alterations i… [+3597 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Institut Pasteur welcomes new, comprehensive relationship with UCSF QBI - EurekAlert", "description": "Two Academic and Scientific Heavyweights Agree to Implement Joint Actions Towards the Creation of a Center of Excellence in Emerging Infectious Diseases with Planned Operations/Locations in Paris and San Francisco.", "url": "https://www.eurekalert.org/news-releases/969672", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/83517da2-3920-42b2-8cc4-bb6e8c1c992e/Rendition/thumbnail/Content/Public", "publishedAt": "2022-10-30T20:37:30Z", "content": "image: Pr Stewart Cole, Pr Carla Saleh and Dr Nevan Krogan, on October 21st, 2022 at the Institut Pasteurview more \r\nCredit: © Institut Pasteur - François Gardy\r\nIn a ceremony on October 21, 2022, th… [+5795 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "SMSala", "title": "Crohn's Disease: An Inflammatory Disease - Rising Kashmir", "description": null, "url": "http://risingkashmir.com/crohns-disease-an-inflammatory-disease", "urlToImage": "http://admin.risingkashmir.com/Source/News/4964ca2c-0581-4778-b685-723961f364d1.jpg", "publishedAt": "2022-10-30T15:54:31Z", "content": "Crohn’s disease (CD) is a chronic, relapsing inflammatory bowel disease (IBD). Crohn's disease (CD) is a chronic inflammatory bowel disease, first described as a regional ileitis by Crohn, Ginzburg a… [+6381 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Statins may reduce risk of lung cancer among patients of idiopathic pulmonary fibrosis - Medical Dialogues", "description": "KOREA: According to research findings presented at the American College of Chest Physicians (CHEST) 2022 Annual Meeting, conducted on October 16–19 in Nashville, Tennessee, statin therapy for more...", "url": "https://medicaldialogues.in/medicine/news/statins-may-reduce-risk-of-lung-cancer-among-patients-of-idiopathic-pulmonary-fibrosis-101333", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/14/125493-statins-2.jpg", "publishedAt": "2022-10-30T14:30:57Z", "content": "KOREA: According to research findings presented at the American College of Chest Physicians (CHEST) 2022 Annual Meeting, conducted on October 1619 in Nashville, Tennessee, statin therapy for more tha… [+3155 chars]"}]}