{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "What counts as a good weight loss? - The Indian Express", "description": "\"Losing 20 kg, most of which is the muscle (and little fat), is actually worse than being what you were with 20 kgs added back on,\" said Mihira A R Khopkar, an Olympics nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/good-healthy-weight-loss-body-belly-fat-percentage-muscle-benefits-8161452/", "urlToImage": "https://images.indianexpress.com/2021/06/weight-loss_1200_getty.jpg", "publishedAt": "2022-09-27T10:20:57Z", "content": "In an attempt to lose weightrapidly, many people resort to stringent diets and workout routines. And often, they are successful, too. But is such weight loss sustainable and does it count as healthy?… [+3281 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Being lonely, unhappy increases aging more than smoking: Study - ANI News", "description": "Washington [US], September 27 (ANI): The accumulation of molecular damage contributes to the development of ageing-related frailty and serious diseases. These molecular processes are more intense in some people than in others, a condition known as accelerated…", "url": "https://www.aninews.in/news/lifestyle/others/being-lonely-unhappy-increases-aging-more-than-smoking-study20220927154152", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220927094252.jpg", "publishedAt": "2022-09-27T10:16:07Z", "content": "Washington [US], September 27 (ANI): The accumulation of molecular damage contributes to the development of ageing-related frailty and serious diseases. These molecular processes are more intense in … [+2419 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the impact of SARS-CoV-2 infection on semen parameters and sex hormones? - News-Medical.Net", "description": "A new study aimed to systematically review studies investigating sex hormones and semen parameters in COVID-19 patients to provide a better understanding and treatment approach.", "url": "https://www.news-medical.net/news/20220927/What-is-the-impact-of-SARS-CoV-2-infection-on-semen-parameters-and-sex-hormones.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_726332_16642719074924589.jpg", "publishedAt": "2022-09-27T10:07:00Z", "content": "The coronavirus disease 2019 (COVID-19) pandemic brought about by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) adversely impacted public health and safety worldwide. COVID-19 infectio… [+4406 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "HT Brand Studio", "title": "LiveAltlife aims to eradicate Type 2 Diabetes, other conditions sustainably | Mint - Mint", "description": "The team at LiveAltlife has a Health Restore program that includes AI-driven Precision Nutrition-based therapeutic meals delivered straight to the doorstep, and an online fitness, yoga, & meditation regime curated & designed to improve one's metabolism", "url": "https://www.livemint.com/brand-stories/livealtlife-aims-to-eradicate-type-2-diabetes-other-conditions-sustainably-11664258959876.html", "urlToImage": "https://images.livemint.com/img/2022/09/27/600x338/23_1664259329074_1664259329236_1664259329236.jpg", "publishedAt": "2022-09-27T10:04:11Z", "content": "Founded in 2018, healthtech startup LiveAltlife helps people battling metabolic disorders like Diabetes, PCOS, Obesity, Cardiovascular Health etc., to restore and reverse their health in a safe &amp;… [+5884 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Linda Searing", "title": "Short menstrual cycle could be linked to early menopause - The Washington Post", "description": "Among U.S. women, perimenopause lasts an average of four years, and the average age for reaching menopause is 52, according to the federal Office on Women’s Health.", "url": "https://www.washingtonpost.com/wellness/2022/09/27/period-duration-menopause-connection/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AKRK46D5OYI6TMPTWIZ74WAR54.jpg&w=1440", "publishedAt": "2022-09-27T09:28:12Z", "content": "A shorter-than-average menstrual cycle 25 days or fewer between periods might predict early onset of menopause and more menopausal symptoms, including more severe issues, according to research publis… [+1580 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of California, Davis: Malaria Spike Linked to Amphibian Die-Off - India Education Diary", "description": "Dozens of species of frogs, salamanders and other amphibians quietly disappeared from parts of Latin America in the 1980s and 2000s, with little notice from humans, outside of a small group of ecologists. Yet the amphibian decline had direct health c", "url": "https://indiaeducationdiary.in/university-of-california-davis-malaria-spike-linked-to-amphibian-die-off/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/uc-davis.jpeg?fit=600%2C400&ssl=1", "publishedAt": "2022-09-27T09:08:15Z", "content": "Dozens of species of frogs, salamanders and other amphibians quietly disappeared from parts of Latin America in the 1980s and 2000s, with little notice from humans, outside of a small group of ecolog… [+3880 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Web Desk", "title": "Life’s stresses can make people focus more on their romantic partner’s negative behaviour - The Week", "description": "Stressful life circumstances can affect how married couples interact, but can they affect how partners see each other? A person experiencing stress is more likely to notice their spouse’s negative behavior than positive, according to a new study published in …", "url": "https://www.theweek.in/news/health/2022/09/27/life-s-stresses-can-make-people-focus-more-on-their-romantic-par.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/7/2/couple-unhappy-fight-angry-partners-married--shut.jpg", "publishedAt": "2022-09-27T09:03:35Z", "content": "Stressful life circumstances can affect how married couples interact, but can they affect how partners see each other? A person experiencing stress is more likely to notice their spouses negative beh… [+2500 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Low levels of tumour-suppressing gene identified as reason behind endometrial cancer - The Indian Express", "description": "HOXA10 acts like a tumour suppressor (a brake) in the uterus and when that fails, it sets the system in a continuous proliferation mode, causing cancer with time, says new study", "url": "https://indianexpress.com/article/lifestyle/health-specials/cutting-edge-tumour-suppressing-gene-endometrial-cancer-8175779/", "urlToImage": "https://images.indianexpress.com/2022/09/Cutting-edge.jpg", "publishedAt": "2022-09-27T08:59:24Z", "content": "Endometrial cancer, also called uterine cancer, is the fourth most common malignancy in women. Unfortunately, the cause of this dreadful disease is largely unknown. But for the first time, a study, w… [+3659 chars]"}, {"source": {"id": null, "name": "Businesswireindia.com"}, "author": null, "title": "Hyperbaric Oxygen Therapy Enhances the Recovery from Brain Stroke Significantly Suggests Doctors at HBOT-India - Business Wire India", "description": "Hyperbaric Oxygen Therapy Enhances the Recovery from Brain Stroke Significantly Suggests Doctors at HBOT-India", "url": "https://www.businesswireindia.com/hyperbaric-oxygen-therapy-enhances-the-recovery-from-brain-stroke-significantly-suggests-doctors-at-hbot-india-80881.html", "urlToImage": "https://cms.businesswireindia.com/Uploads/OGTag/OG_Companylog_80881.jpg", "publishedAt": "2022-09-27T08:40:16Z", "content": "Partner with us for Press release distribution and get best in class service, guaranteed postings on tier 1 media and maximum reach"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Life expectancy tool may improve quality of life for dementia patients - Hindustan Times", "description": "In addition to the mortality prediction model, the researchers created an individualised mortality risk calculator for dementia patients, which is available online at ePrognosis. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/life-expectancy-tool-may-improve-quality-of-life-for-dementia-patients-101664265902255.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/27/1600x900/steven-hwg-zBsdRTHIIm4-unsplash_1656125452390_1664265968502_1664265968502.jpg", "publishedAt": "2022-09-27T08:08:32Z", "content": "A mortality prediction model for dementia patients may aid clinicians in framing discussions with patients and families about end-of-life care options such as at-home care and nursing homes. Furtherm… [+4261 chars]"}, {"source": {"id": null, "name": "The News Minute"}, "author": null, "title": "All you need to know about dengue: Symptoms and treatment - The News Minute", "description": "Dengue is a serious systemic viral infection with worldwide distribution. Recent estimates suggest that nearly 3.6 billion people, amounting to almost half the world’s population, live in areas that puts them at risk of contracting the infection. The highest …", "url": "https://www.thenewsminute.com/article/all-you-need-know-about-dengue-symptoms-and-treatment-168333", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Mosquito_Disease_270922_1200.jpg", "publishedAt": "2022-09-27T07:59:11Z", "content": "The disease is endemic in our country, showing its presence seasonally mainly immediately after the monsoon.Dengue is a serious systemic viral infection with worldwide distribution. Recent estimates … [+4729 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Washington University in St. Louis: COVID-19 infections increase risk of long-term brain problems - India Education Diary", "description": "If you’ve had COVID-19, it may still be messing with your brain. Those who have been infected with the virus are at increased risk of developing a range of neurological conditions in the first year after the infection, new research shows. Such compli", "url": "https://indiaeducationdiary.in/washington-university-in-st-louis-covid-19-infections-increase-risk-of-long-term-brain-problems/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Washington-University-in-St.Louis_.jpg?fit=910%2C560&ssl=1", "publishedAt": "2022-09-27T07:50:55Z", "content": "If youve had COVID-19, it may still be messing with your brain. Those who have been infected with the virus are at increased risk of developing a range of neurological conditions in the first year af… [+6607 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Swagota Nandi", "title": "Top 15 health benefits of Spirulina - PINKVILLA", "description": "Spirulina Is Among The World’s Most Popular Supplements. It Is Loaded With Various Nutrients And Antioxidants That May Benefit Your Body And Brain.", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/top-15-health-benefits-of-spirulina-1192325", "urlToImage": "https://englishst.pinkvilla.com/english/images/2022/09/151425582_spirulina_1280*720.jpg", "publishedAt": "2022-09-27T06:50:58Z", "content": "One of the planet's oldest life forms is thought to be the blue-green algal spirulina. Spirulina is regarded as a superfood and is an all-in-one source of nutrients, including protein levels comparab… [+16764 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Explained: What Is Khosta-2? All About The New COVID Vaccine-Resistant Virus Detected In Russian Bats - ABP Live", "description": "Khosta-2: A new virus similar to the novel coronavirus has emerged. The virus, called Khosta-2, has been detected in Russian horseshoe bats. Khosta-2 is a sarbecovirus, a type of respiratory virus.", "url": "https://news.abplive.com/science/khosta-2-new-virus-look-like-covid-19-found-in-russian-bats-what-is-khosta-2-symptoms-causes-explained-1555480", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/09/27/6bb443d54f0fa9f5f214289dde1849d61664263171488324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-09-27T06:49:33Z", "content": "Khosta-2 Virus: As the world continues to battle Covid-19, a new virus similar to the novel coronavirus has emerged. The virus, called Khosta-2, has been detected in Russian horseshoe bats. Khosta-2 … [+4991 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Vidhi Chawla", "title": "Want to make your skin glow from inside out? Add these magical nutrients to your diet - Health shots", "description": "Your skin is delicate and it needs a right balance between nutrients to do their job! Add these 3 nutrients for skin in your regular diet and get glowing skin.", "url": "https://www.healthshots.com/beauty/skin-care/want-glowing-skin-consume-these-3-nutrients-for-skin-daily/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/09/27110909/Beauty-.jpg", "publishedAt": "2022-09-27T06:45:17Z", "content": "Food isn’t the first thing that comes to mind when it comes to achieving that glow-from-within skin that you’ve always desired. We tend to focus on external remedies and cures. You may be using the r… [+2644 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "Diabetes: A popular variety of tea that calms the nerves can control blood sugar by 60 per cent - Times Now", "description": "Diabetes UK, however, does not recommend only drinking chamomile tea for diabetes management – it should be complemented with a balanced diet, regular workout, and timely medication for blood glucose, blood pressure, and cholesterol management. If left unatte…", "url": "https://www.timesnownews.com/health/type-2-diabetes-best-tea-to-control-blood-sugar-levels-chamomile-glucose-article-94471024", "urlToImage": "https://static.tnn.in/thumb/msid-94471024,imgsize-100,width-1280,height-720,resizemode-75/94471024.jpg", "publishedAt": "2022-09-27T06:45:10Z", "content": "Another 2008 study in Diabetes UK claimed that drinking chamomile tea daily can help fight diabetes-related complications like kidney damage, heart disease and blindness. (Photo credit: Pexels)"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Know How Hydrotherapy Exercises Can Help With Joint Pain - News18", "description": "Even though it might seem like something that is extremely difficult to nail the first time, trust us when we say it gets better with time and you are going to love it.", "url": "https://www.news18.com/news/lifestyle/know-how-hydrotherapy-exercises-can-help-with-joint-pain-6045661.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/untitled-design-35-1-166426070416x9.png", "publishedAt": "2022-09-27T06:39:22Z", "content": "Particularly effective treatment for illnesses like arthritis and its complications is hydrotherapy or water therapy. In contrast to aqua aerobics, which typically entails physically demanding activi… [+3668 chars]"}, {"source": {"id": null, "name": "Mims.com"}, "author": "N/A", "title": "Inborn errors of immunity aggravate COVID-19 death risk | Latest news for Doctors, Nurses and Pharmacists | Infectious Diseases - MIMS", "description": "Children with pre-existing inborn errors of immunity are at greater risk of death when infected with the SARS-CoV-2 virus, according to a new study....", "url": "https://specialty.mims.com/topic/inborn-errors-of-immunity-aggravate-covid-19-death-risk", "urlToImage": "https://pubmiddleware.mims.com/resource/image/172370F4-ABA6-4A70-B66D-A8A100CA3FF5/OriginalThumbnail/THUMBNAIL_shutterstock_50093137.jpg", "publishedAt": "2022-09-27T06:00:29Z", "content": "Children with pre-existing inborn errors of immunity (IEI) are at greater risk of death when infected with the SARS-CoV-2 virus, according to a new study.\r\nThe study included 31 children and youth (a… [+1634 chars]"}, {"source": {"id": null, "name": "Feminisminindia.com"}, "author": "Sohini Sengupta", "title": "Queer Health In South Asia: Community-Led Solutions And HIV Case Studies In Sri Lanka - Feminism In India", "description": "Criminalisation, institutionalised discrimination, and social stigma faced by the LGBTQIA+ community make healthcare interventions of utmost urgency.", "url": "https://feminisminindia.com/2022/09/27/queer-health-in-south-asia-hiv-case-studies-in-sri-lanka/", "urlToImage": "https://i0.wp.com/feminisminindia.com/wp-content/uploads/2022/09/1-lgbtq-health-vptxmain.jpg__992x558_q85_crop_subsampling-2_upscale.jpg?fit=1200%2C666&ssl=1", "publishedAt": "2022-09-27T05:53:39Z", "content": "2022 opened with a fresh variant of the coronavirus followed by an outbreak of monkeypox in May. The Covid pandemic saw a rapid interest in prevention and self-initiated health care. Conversations fl… [+14015 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "The Home Doctor Reviews: A Pdf Guide By Dr. Maybell Nieves - Deccan Herald", "description": "Why do you need to know DIYs and tips from a doctor? Doing everything yourself might be tempting, but it's often not safe or effective. Doctors have years of training to prepare them to treat diseases and injuries, and they have access to up-to-date knowledge…", "url": "https://www.deccanherald.com/brandspot/pr-spot/the-home-doctor-reviews-a-pdf-guide-by-dr-maybell-nieves-1148580.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/gfgn.jpg", "publishedAt": "2022-09-27T05:22:24Z", "content": "Why do you need to know DIYs and tips from a doctor?\r\nDoing everything yourself might be tempting, but it's often not safe or effective. Doctors have years of training to prepare them to treat diseas… [+8373 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "ANI", "title": "Protein supplement helps control Type 2 diabetes: Study - Telangana Today", "description": "To compare the potential benefits of whey protein, the same participants also spent a week drinking a control shot that contained no protein in order to measure the results against each other.", "url": "https://telanganatoday.com/protein-supplement-helps-control-type-2-diabetes-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2022/09/type-2-diabetes-1.jpg", "publishedAt": "2022-09-27T04:54:47Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nutritionist Says These 7 Things That Are Harmful For Your Bones - NDTV", "description": "Bookmark this calcium-rich recipe that can be helpful if you do not drink milk or consume dairy products.", "url": "https://www.ndtv.com/health/nutritionist-says-these-7-things-that-are-harmful-for-your-bones-3380629", "urlToImage": "https://c.ndtvimg.com/2022-08/emsdi33o_type-of-coffee_625x300_26_August_22.jpg", "publishedAt": "2022-09-27T04:41:32Z", "content": "Bone Health: Coffee and other caffeine-rich foods increase calcium excretion\r\nHow do you take care of the bones in your body? Difficult question, isn't it? Well, honestly, you don't give too much tho… [+3655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Liver Failure In Kids: The Causes, Early Signs, And Its Prevention - NDTV", "description": "Liver Failure In Kids: Paediatric age group liver failure can be broadly divided into congenital or genetic.", "url": "https://www.ndtv.com/health/liver-failure-in-kids-the-causes-early-signs-and-its-prevention-3378814", "urlToImage": "https://c.ndtvimg.com/2022-08/aoclsjs_kid-with-fever_625x300_22_August_22.jpg", "publishedAt": "2022-09-27T04:32:34Z", "content": "Liver failure in kids may be caused by viruses\r\nPlaying a vital role in metabolism, ofapproximately 500 functions of liver, the most important ones include: synthesis of amino acids and cholesterol; … [+6197 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "COVID-19 linked with higher risk of type 1 diabetes in young people: Study - EastMojo", "description": "Washington: Children and adolescents infected with COVID-19 show a substantially higher risk of developing type 1 diabetes (T1D), according to a study of", "url": "http://www.eastmojo.com/coronavirus-updates/2022/09/27/covid-19-linked-with-higher-risk-of-type-1-diabetes-in-young-people-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/Untitled-design-2022-08-16T125503.137.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-09-27T04:13:17Z", "content": "Washington: Children and adolescents infected with COVID-19 show a substantially higher risk of developing type 1 diabetes (T1D), according to a study of over 1 million patients aged 18 and younger.\r… [+2449 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "First real-world study shows the effectiveness of mRNA COVID-19 vaccines during pregnancy - News-Medical.Net", "description": "The first large, real-world study of the effectiveness of mRNA COVID-19 vaccines during pregnancy found these vaccines, especially two initial doses followed by a booster, are effective in protecting against serious disease in expectant mothers whether the sh…", "url": "https://www.news-medical.net/news/20220927/First-real-world-study-shows-the-effectiveness-of-mRNA-COVID-19-vaccines-during-pregnancy.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/Pregnancy-620x480.jpg", "publishedAt": "2022-09-27T04:05:00Z", "content": "The first large, real-world study of the effectiveness of mRNA COVID-19 vaccines during pregnancy found these vaccines, especially two initial doses followed by a booster, are effective in protecting… [+3882 chars]"}, {"source": {"id": null, "name": "The Philadelphia Tribune"}, "author": "Vince Faust", "title": "Tips to Be Fit: How to reduce your risk for Alzheimer's - The Philadelphia Tribune", "description": "Every 68 seconds an American develops Alzheimer’s disease. It’s a fatal brain disease that steals memory and personality. Alzheimer’s disease is the fifth-leading cause of death among people 65 years", "url": "https://www.phillytrib.com/news/health/tips-to-be-fit-how-to-reduce-your-risk-for-alzheimer-s/article_8e3e097c-4f17-5e11-8c34-e739f8e627e7.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/phillytrib.com/content/tncms/assets/v3/editorial/5/bf/5bf97179-b36b-54ad-9068-d137a3faaa62/632b8d5f9f092.image.jpg?crop=762%2C400%2C69%2C0&resize=762%2C400&order=crop%2Cresize", "publishedAt": "2022-09-27T04:00:00Z", "content": "Every 68 seconds an American develops Alzheimers disease. Its a fatal brain disease that steals memory and personality. Alzheimers disease is the fifth-leading cause of death among people 65 years an… [+4946 chars]"}, {"source": {"id": null, "name": "Cosmeticsdesign-asia.com"}, "author": "cosmeticsdesign-asia.com", "title": "Aussie trial to assess if use of high-factor sunscreen reduces vitamin D production - CosmeticsDesign-Asia.com", "description": "A world-first large-scale trial in Australia will assess if wearing high-factor sunscreen prevents healthy vitamin D production.", "url": "https://www.cosmeticsdesign-asia.com/Article/2022/09/27/aussie-trial-to-assess-if-use-of-high-factor-sunscreen-reduces-vitamin-d-production", "urlToImage": "https://www.cosmeticsdesign-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/cosmetics/cosmeticsdesign-asia.com/headlines/formulation-science/aussie-trial-to-assess-if-use-of-high-factor-sunscreen-reduces-vitamin-d-production/15783207-1-eng-GB/Aussie-trial-to-assess-if-use-of-high-factor-sunscreen-reduces-vitamin-D-production.jpg", "publishedAt": "2022-09-27T01:19:00Z", "content": "The Sun-D trial is being spearheaded by researchers at The QIMR Berghofer Medical Research Institute in Brisbane.\r\nThey are currently recruiting participants for a year-long randomised controlled tri… [+1508 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New discovery changes the understanding of Duchenne muscular dystrophy - News-Medical.Net", "description": "​Duchenne muscular dystrophy (DMD) is caused by a genetic mutation and affects one in every 5,000 boys born. Because the affected gene is on the X chromosome, girls are carriers of the mutant gene but develop the disease only very rarely (one in about 50 mill…", "url": "https://www.news-medical.net/news/20220926/New-discovery-changes-the-understanding-of-Duchenne-muscular-dystrophy.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/6/Chromosome%2c_X%2c_microscope._3d_illustration.-Anatomy_Insider_6d227ed624514887a5747f8229b16cad-620x480.jpg", "publishedAt": "2022-09-27T01:02:00Z", "content": "Duchenne muscular dystrophy (DMD) is caused by a genetic mutation and affects one in every 5,000 boys born. Because the affected gene is on the X chromosome, girls are carriers of the mutant gene but… [+2409 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study shows the importance of night-time blood pressure assessment for diagnosing hypertension - News-Medical.Net", "description": "Around 15% of people aged 40-75 may have a form of undiagnosed high blood pressure (hypertension) that occurs only at night-time.", "url": "https://www.news-medical.net/news/20220926/Study-shows-the-importance-of-night-time-blood-pressure-assessment-for-diagnosing-hypertension.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/9/heart_disease_1_12c3ff20f43b43d898bf18f5689e0c7c-620x480.jpg", "publishedAt": "2022-09-27T00:43:00Z", "content": "Around 15% of people aged 40-75 may have a form of undiagnosed high blood pressure (hypertension) that occurs only at night-time. Because they do not know about this, and therefore are not being trea… [+8121 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Practical use of the FRC basal insulin/GLP1-RA. | DMSO - Dove Medical Press", "description": "Expert Opinion on Diabetes Management Challenges and Role of Basal Insulin/GLP-1 RA Fixed-Ratio Combination in People With Type 2 Diabetes From Indonesia.", "url": "https://www.dovepress.com/expert-opinion-on-diabetes-management-challenges-and-role-of-basal-ins-peer-reviewed-fulltext-article-DMSO", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-09-27T00:29:30Z", "content": "Key Summary Points\r\n<ul><li>A fixed-ratio combination regimen of basal insulin and glucagon-like peptide-1 receptor agonist (GLP-1 RA) has proven to be an effective and practical therapeutic approach… [+47622 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study offers support for increasing the use of living donor liver transplantation in Western countries - News-Medical.Net", "description": "Demand for donor livers for transplant patients outstrips supply with over 15% of waitlist patients dying after a year.", "url": "https://www.news-medical.net/news/20220926/Study-offers-support-for-increasing-the-use-of-living-donor-liver-transplantation-in-Western-countries.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Digital_illustration_of_liver_in_colour_background-Liya_Graphics_0fff2ea2f60c4e71b4991068b748916f-620x480.jpg", "publishedAt": "2022-09-27T00:16:00Z", "content": "Demand for donor livers for transplant patients outstrips supply with over 15% of waitlist patients dying after a year. A new international study offers support for increasing the use of living donor… [+3617 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "HPV vaccination in south Asia: new progress, old challenges - The Lancet", "description": "In a promising advance in its fight against cervical cancer, India has recently launched\nits first locally produced version of the human papillomavirus (HPV) vaccine. The\nquadrivalent Cervavac vaccine, which protects against the virus strains most likely\nto c…", "url": "https://www.thelancet.com/journals/lanonc/article/PIIS1470-2045(22)00567-8/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/0e2d9416-ff4e-4e2b-90ec-7428a8d91760/fx1.jpg", "publishedAt": "2022-09-26T23:25:58Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "New cystic fibrosis treatment changing lives - Japan Today", "description": "David Fiant says his cystic fibrosis and the arduous therapy it required was so bad he &quot;could no longer tell if I was living to heal myself or healing myself to live&quot;. While waiting for a lung transplant, he was on oxygen therapy and had a six-hour …", "url": "https://japantoday.com/category/features/health/'tremendous-hope'-new-cystic-fibrosis-treatment-changing-lives", "urlToImage": null, "publishedAt": "2022-09-26T21:11:00Z", "content": "David Fiant says his cystic fibrosis and the arduous therapy it required was so bad he \"could no longer tell if I was living to heal myself or healing myself to live\".\r\nWhile waiting for a lung trans… [+3582 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Genetic defects lead to enamel malformations - EurekAlert", "description": "Mutations in a certain molecule result in severe damage in the structure and mineral composition of tooth enamel in mice, according to a study conducted at the UZH Center of Dental Medicine. The researchers combined genetic, molecular and imaging techniques.", "url": "https://www.eurekalert.org/news-releases/965908", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-26T21:06:26Z", "content": "Mutations in a certain molecule result in severe damage in the structure and mineral composition of tooth enamel in mice, according to a study conducted at the UZH Center of Dental Medicine. The rese… [+2795 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Bifid Mandibular Condyle With Associated Temporomandibular Joint Ankylosis: A Rare Skeletal Abnormality - Cureus", "description": "Bifid mandibular condyle (BMC) is splitting the mandibular condyle into two separate articular surfaces. The etiology is poorly understood, but trauma and developmental issues are currently the most cited causes. Though most often asymptomatic, occasionally, …", "url": "https://www.cureus.com/articles/70224-bifid-mandibular-condyle-with-associated-temporomandibular-joint-ankylosis-a-rare-skeletal-abnormality", "urlToImage": "https://assets.cureus.com/uploads/figure/file/254645/article_river_23e4529005b811ec8a4901c24da9f9e4-left-tmj-coronal-case-report-f.png", "publishedAt": "2022-09-26T20:27:23Z", "content": "Bifid mandibular condyle (BMC) is splitting the mandibular condyle into two separate articular surfaces. The etiology is poorly understood, but trauma and developmental issues are currently the most … [+11109 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Ciara Turner-Ewert", "title": "Why The Forecast For Type 1 Diabetes Prevalence Does Not Look Promising - Health Digest", "description": "With Type 1 diabetes impacting many individuals around the globe, it&#039;s essential to make some changes now in order to avoid preventable deaths.", "url": "https://www.healthdigest.com/1025996/why-the-forecast-for-type-1-diabetes-prevalence-does-not-look-promising/", "urlToImage": "https://www.healthdigest.com/img/gallery/why-the-forecast-for-type-1-diabetes-prevalence-does-not-look-promising/l-intro-1664218831.jpg", "publishedAt": "2022-09-26T19:40:00Z", "content": "Type 1 diabetes is a chronic condition that impacts many individuals around the globe. When a person suffers from Type 1 diabetes, their pancreas is unable to produce sufficient amounts of a hormone … [+1093 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Weight loss: Crave sugar and calorie-loaded foods but want to be fit? Daily habits to transition toward a heal - Times Now", "description": "It is easy to dictate sensible eating tropes and wonder why anyone who has fallen off the fitness wagon won't walk the path to good health. But if someone who had lost his fitness and regained it with herculean efforts and determination shows you the path, it…", "url": "https://www.timesnownews.com/health/weight-loss-crave-sugar-and-calorie-loaded-foods-but-want-to-be-fit-daily-habits-to-transition-toward-a-healthy-diet-article-94462757", "urlToImage": "https://static.tnn.in/thumb/msid-94462757,imgsize-100,width-1280,height-720,resizemode-75/94462757.jpg", "publishedAt": "2022-09-26T18:05:28Z", "content": "'Congress in Rajasthan is a done deal': Amid political row, BJP leader Sunil Jakhar draws parallel with former Punjab govt"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Leena Dhankhar", "title": "Sharp spike in Gurugram’s dengue cases: 22 recorded in one day - Hindustan Times", "description": "A total of 147 cases were reported over the last month, health department officials said, adding no death from dengue has been reported in the district so far", "url": "https://www.hindustantimes.com/cities/gurugram-news/sharp-spike-in-gurugram-s-dengue-cases-22-recorded-in-one-day-101664214487265.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/26/1600x900/24ec71d8-3dc3-11ed-986f-37f88e2260c8_1664214486109.jpg", "publishedAt": "2022-09-26T17:48:06Z", "content": "In a sudden spike in dengue in the district, 22 fresh cases were reported on Monday, the vector-borne disease report issued by the health department said. This year, the first dengue case in Gurugram… [+3274 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Total Health Keto Gummies Australia Reviews (ACV Gummies AU, NZ 2022): Total Health ACV + Keto Gummies Fake OR Work? - The Tribune India", "description": "Total Health Keto Gummies are one of the best products which can aid in the melting of fat quickly and help to build an ideal body. Keto gummies are based on ketogenic foods which are healthy, nutritious, and efficient in reducing body fat.", "url": "https://www.tribuneindia.com/news/brand-connect/total-health-keto-gummies-australia-reviews-acv-gummies-au-nz-2022-total-health-acv-keto-gummies-fake-or-work-435577", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_390356109.jpg", "publishedAt": "2022-09-26T16:57:00Z", "content": "Total Health Keto Gummies are one of the best products which can aid in the melting of fat quickly and help to build an ideal body. Keto gummies are based on ketogenic foods which are healthy, nutrit… [+9668 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Yash Lakhan", "title": "The Reality Of Artificial Sweeteners - Slurrp", "description": "Artificial sweeteners may really contribute to heart disease, according to a recent study.", "url": "https://www.slurrp.com/article/the-reality-of-artificial-sweeteners-1664210360382", "urlToImage": "https://images.slurrp.com/prodarticles/8s8zakzv3n.webp", "publishedAt": "2022-09-26T16:50:11Z", "content": "This might surprise people who have switched from sugar to artificial sweeteners. Artificial sweeteners may really contribute to heart disease, according to a recent study. Protein shakes, among othe… [+2092 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Christine Bryson", "title": "Four health conditions linked to gum disease - The Conversation Indonesia", "description": "Here’s why it’s so important to look after your oral health.", "url": "https://theconversation.com/four-health-conditions-linked-to-gum-disease-190093", "urlToImage": "https://images.theconversation.com/files/484022/original/file-20220912-22-h1m0ag.jpg?ixlib=rb-1.1.0&rect=0%2C5%2C3660%2C1827&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-09-26T16:31:50Z", "content": "Gum diseases are among the most common chronic human diseases, affecting between 20 to 50% of people worldwide. They happen when plaque, a sticky film of bacteria, builds up on teeth. The earliest st… [+5018 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "The Case of the Young Male with a Longstanding History of Dyspeptic Symptoms: Peritoneal Tuberculosis - Cureus", "description": "Portal vein thrombosis associated with peritoneal tuberculosis is an uncommon manifestation of extrapulmonary tuberculosis. We report one such case of a 33-year-old male with a one-year history of dyspepsia, having been on proton pump inhibitors all this time…", "url": "https://www.cureus.com/articles/44952-the-case-of-the-young-male-with-a-longstanding-history-of-dyspeptic-symptoms-peritoneal-tuberculosis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/172909/article_river_ac4622e038bf11ed8589e18b8895c081-malt-lymphoma-3-2-.png", "publishedAt": "2022-09-26T15:51:05Z", "content": "Portal vein thrombosis associated with peritoneal tuberculosis is an uncommon manifestation of extrapulmonary tuberculosis. We report one such case of a 33-year-old male with a one-year history of dy… [+13436 chars]"}, {"source": {"id": null, "name": "World Economic Forum"}, "author": "Ruma Bhargava, Rohit Ghosh", "title": "Discover how AI tech is being used to detect tuberculosis - World Economic Forum", "description": "Tuberculosis is causing a public health crisis and a health security threat, but AI is now being used to detect tuberculosis and could help combat it.", "url": "https://www.weforum.org/agenda/2022/09/how-ai-can-help-fight-tuberculosis/", "urlToImage": "https://assets.weforum.org/article/image/responsive_medium_iOXrddrQw12w6Geb-dFRd3D10PuQy87kQaBO5lqEhRI.jpg", "publishedAt": "2022-09-26T15:33:41Z", "content": null}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "The Science Advisory Board staff writers", "title": "Gene editing possible for inherited retinal diseases - The Science Board", "description": "Precision genome editing agents can enable gene correction and disease rescue in inherited retinal diseases, according to University of California, Irvine researchers.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=4766", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_cell/2021_07_19_20_45_1054_cell_analysis_therapy_engineering_social.jpg", "publishedAt": "2022-09-26T15:11:00Z", "content": "These disorders affect approximately 1 in 3,000 individuals worldwide and reduce quality of life. IRDs are caused by gene mutations that are critical for the development and/or function of the retina… [+1107 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "The #1 Healthiest Nut to Eat As You Age-Eat This - Eat This, Not That", "description": "Nuts are full of nutrients, but this is the healthiest nut to eat as you age, according to a brand new study.", "url": "https://www.eatthis.com/healthiest-nut-for-aging-news/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/09/Nuts.jpg?quality=82&strip=all", "publishedAt": "2022-09-26T14:55:55Z", "content": "If you've been looking for a healthy snack, then you may want to consider nibbling on a few nuts whenever you get a little hungry. Nuts are full of healthy fats and have been found to be some of the … [+2963 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Unexpected Pulmonary dysfunction in children after recovery from COVID-19 and long COVID, reveals MRI... - Medical Dialogues", "description": "Germany: According to a recent study published in the Radiology by the Radiological Society of North ...", "url": "https://medicaldialogues.in/pediatrics-neonatology/news/unexpected-pulmonary-dysfunction-in-children-after-recovery-from-covid-19-and-long-covid-reveals-mri-study-99693", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/24/186244-untitled-design-21.jpg", "publishedAt": "2022-09-26T14:00:51Z", "content": "Germany: According to a recent study published in the Radiology by the Radiological Society of North America, researchers of Germany observed an unexpected finding of pulmonary dysfunction in childre… [+4574 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Bilateral implantation of trifocal IOLs optimal option for correcting presbyopia: JAMA - Medical Dialogues", "description": "Bilateral implantation of trifocal IOLs optimal option for  correcting presbyopia suggests a recent...", "url": "https://medicaldialogues.in/ophthalmology/news/bilateral-implantation-of-trifocal-iols-optimal-option-for-correcting-presbyopia-jama-99674", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/26/186325-images-7.jpg", "publishedAt": "2022-09-26T14:00:15Z", "content": "Bilateral implantation of trifocal IOLs optimal option for correcting presbyopia suggests a recent study published in the JAMA OphthalmologyA Bayesian network meta-analysis (NMA) can help compare the… [+2132 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Why women should take the cervical cancer vaccine - India Today", "description": "Dr Aparna Gawdi, obstetrician and gynecologist at the Apollo Hospitals, Navi Mumbai, on the risk of cervical cancer, the growing spread and how vaccination can help", "url": "https://www.indiatoday.in/india-today-insight/story/why-women-should-take-the-cervical-cancer-vaccine-2005038-2022-09-26", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/Health_Vaccine-647x363.jpeg?S7UXOxtenxrrWQPFNLhj30EBDuTU3sPm", "publishedAt": "2022-09-26T13:21:14Z", "content": "Seven types of cancer account for more than 40 per cent of the total disease burden in India. Of them, one is cancer of the cervix uteri (4.3 per cent). Recently, the government announced the country… [+2614 chars]"}, {"source": {"id": null, "name": "Home.cern"}, "author": null, "title": "Seminar on 17 October with Dr Grégoire Chick: Osteoarthritis and Prostheses - CERN", "description": "Osteoarthritis (OA) is the most common form of arthritis which can affect any joint, typically the hands, knees, hips, lower back and neck. Historically, OA was known as a “wear and tear” condition, generally associated with older individuals but the disease …", "url": "https://home.cern/news/announcement/knowledge-sharing/seminar-17-october-dr-gregoire-chick-osteoarthritis-and", "urlToImage": "https://cds.cern.ch/images//file?size=medium", "publishedAt": "2022-09-26T12:42:45Z", "content": "Osteoarthritis (OA) is the most common form of arthritis which can affect any joint, typically the hands, knees, hips, lower back and neck. Historically, OA was known as a wear and tear condition, ge… [+1600 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "New Study finds that viruses may have ``eyes and ears`` on us - Zee News", "description": "The first phage in which the research team identified CtrA binding sites infects a particular group of bacteria called Caulobacterales.", "url": "https://zeenews.india.com/health/new-study-finds-that-viruses-may-have-eyes-and-ears-on-us-2514647", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/09/26/1095215-untitled-design-46.png", "publishedAt": "2022-09-26T12:22:07Z", "content": "New research suggests that viruses are using information from their environment to `decide` when to sit tight inside their hosts and when to multiply and burst out, killing the host cell. Right now, … [+5722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Shaheen Bhatt on living with social anxiety: 'I don't know how much eye contact is enough' - The Indian Express", "description": "“I really try to realise that no one is thinking about me as much as I am thinking about myself -- everyone is really focused on themselves,\" Shaheen said", "url": "https://indianexpress.com/article/lifestyle/health/shaheen-bhatt-social-anxiety-mental-health-8158092/", "urlToImage": "https://images.indianexpress.com/2022/09/Shaheen-Bhatt-1200.jpg", "publishedAt": "2022-09-26T11:30:57Z", "content": "Shaheen Bhatt has always been vocal about her struggle with mental health — from experiencing panic attacks to bouts of anxiety; in turn, helping many others who may be battling the same. In a simila… [+3579 chars]"}, {"source": {"id": null, "name": "Spectrum"}, "author": "Lauren Schenkman", "title": "How star cells’ secretions may stunt neurons: Q&A with Nicola Allen - Spectrum", "description": "Non-neuronal brain cells called astrocytes secrete proteins that seem to hamper the growth of neurons in people with autism-related syndromes. These proteins could be new drug targets, Allen says.", "url": "https://www.spectrumnews.org/opinion/how-star-cells-secretions-may-stunt-neurons-qa-with-nicola-allen/", "urlToImage": "https://spectrumnews-web-assets.s3.amazonaws.com/wp-content/uploads/2022/09/23114905/astrocytes-autism-neurodevelopmental-syndromes-lede-844.png", "publishedAt": "2022-09-26T10:55:27Z", "content": "Neurons garner much of the attention in autism research, but they rely on star-shaped brain cells called astrocytes to grow properly and form synapses. Neurons from wildtype mice, for example, fail t… [+7145 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Health and Wellness: How free testing corners at Mumbai hospitals are playing key role in early diagnosis of diabetes, BP - The Indian Express", "description": "As per the BMC, over 1 lakh patients in the city are suffering from diabetes and hypertension. But this could just be the tip of the iceberg as the civic body lacks cumulative data from private hospitals.", "url": "https://indianexpress.com/article/cities/mumbai/ncd-centres-in-mumbai-hospitals-offer-free-diabetes-hypertension-screening-8173730/", "urlToImage": "https://images.indianexpress.com/2022/09/pixabay-diabetes-1200.jpg", "publishedAt": "2022-09-26T09:21:21Z", "content": "In 2020, 36-year-old Bhagwat Kumar, a resident of Dharavi, had to admit his father to Sion Hospital for diabetic foot. As high blood sugar damaged nerves and blood vessels, the limb ultimately had to… [+2255 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "Mahender", "title": "PCOS Cases Are rising Among Adolescent Girls - NewsPatrolling", "description": "There is a surge in the number of PCOS cases in not only older women but even adolescent girls. Being overweight, a sedentary lifestyle, and genetics can be the driving factors behind PCOS. Thus, the parents of young girls need to consult the doctor without a…", "url": "https://newspatrolling.com/pcos-cases-are-rising-among-adolescent-girls/", "urlToImage": null, "publishedAt": "2022-09-26T08:29:31Z", "content": "There is a surge in the number of PCOS cases in not only older women but even adolescent girls. Being overweight, a sedentary lifestyle, and genetics can be the driving factors behind PCOS. Thus, the… [+2520 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Potential Benefits of Sodium-Glucose Transporter-2 Inhibitors in the Symptomatic and Functional Status of Patients With Heart Failure: A Systematic Review and Meta-Analysis - Cureus", "description": "This review evaluates the potential benefits of sodium-glucose transporter-2 (SGLT-2) inhibitors on symptom burden/health-related quality of life (HRQoL), functional improvement, hospitalization for heart failure (HHF), cardiovascular mortality (CVM), and all…", "url": "https://www.cureus.com/articles/107852-potential-benefits-of-sodium-glucose-transporter-2-inhibitors-in-the-symptomatic-and-functional-status-of-patients-with-heart-failure-a-systematic-review-and-meta-analysis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/419488/article_river_c0531f8015cf11ed9c0605a015925d95-PRISMA-Flow-Chart.png", "publishedAt": "2022-09-26T03:06:06Z", "content": "Most cardiac pathologies, and many that do not directly involve the heart, e.g., diabetes mellitus or obesity, may result in heart failure (HF) as the end-stage phenotypic expression of the primary d… [+31658 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Study finds gut microbes consume plant sugars as food - Times of India", "description": "The bacteria in our stomach are fed by a carbohydrate that is frequently found bound to plant proteins, according to researchers. The findings of the study were published in the Proceedings of the National Academy of Sciences. According to new research, the b…", "url": "https://timesofindia.indiatimes.com/videos/news/study-finds-gut-microbes-consume-plant-sugars-as-food/videoshow/94440215.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-94440215,imgsize-91126.cms", "publishedAt": "2022-09-25T18:30:49Z", "content": "Sep 26, 2022, 12:00AM ISTSource: ANIThe bacteria in our stomach are fed by a carbohydrate that is frequently found bound to plant proteins, according to researchers. The findings of the study were pu… [+762 chars]"}, {"source": {"id": null, "name": "Xperttimes.com"}, "author": "R. C Rana", "title": "Diarrhea in children: From causes to symptoms, all that parents need to know - XPERT TIMES", "description": "Diarrhea in children: From causes to symptoms, all that parents need to know | XPERT TIMES", "url": "https://xperttimes.com/diarrhea-in-children-from-causes-to-symptoms-all-that-parents-need-to-know/", "urlToImage": null, "publishedAt": "2022-09-25T18:01:23Z", "content": "Parents often get very concerned when a child gets sick. Diarrhea is a very common problem in children younger than age five. When children suddenly get loose, watery and frequent bowel movements, th… [+2229 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Investigating factors behind consciousness issues - ThePrint", "description": "Liege [Belgium], September 25 (ANI): A Human Brain Project (HBP) study headed by researchers at the University of Liege in Liege, Belgium, looked at fresh ways that might help patients with serious brain injury or in a coma distinguish between two different n…", "url": "https://theprint.in/health/investigating-factors-behind-consciousness-issues/1142818/", "urlToImage": null, "publishedAt": "2022-09-25T16:17:27Z", "content": "Liege [Belgium], September 25 (ANI): A Human Brain Project (HBP) study headed by researchers at the University of Liege in Liege, Belgium, looked at fresh ways that might help patients with serious b… [+4060 chars]"}]}