{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researches come up with new findings on memory impairment in epilepsy - ANI News", "description": "It is possible that retention of the exact combination of features is impaired in people with chronic epilepsy", "url": "https://www.aninews.in/news/health/researches-come-up-with-new-findings-on-memory-impairment-in-epilepsy20221219234315", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221219151812.jpeg", "publishedAt": "2022-12-19T18:13:00Z", "content": "Bonn [Germany], December 19 (ANI): Let's say you decide to see a friend you haven't seen in a while. However, you immediately ring the correct doorbell: You know you're at the correct place when you … [+4484 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Psychosocial stress linked with increased risk of stroke - News-Medical.Net", "description": "Psychosocial stress is associated with an increased risk of stroke, according to new University of Galway led research published in the Journal of the American Medical Association Network Open (JAMA Network Open).", "url": "https://www.news-medical.net/news/20221219/Psychosocial-stress-linked-with-increased-risk-of-stroke.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Stress-620x480.jpg", "publishedAt": "2022-12-19T17:16:00Z", "content": "Psychosocial stress is associated with an increased risk of stroke, according to new University of Galway led research published in the Journal of the American Medical Association Network Open (JAMA … [+3406 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Lauren Manaker MS, RDN, LD, CLEC", "title": "Do Dairy Foods Cause Inflammation? A Dietitian Explains - Eat This, Not That", "description": "Many people associate dairy with inflammation, but it can be hard to tell what is truth and what is a myth. Here's what a dietitian says.", "url": "https://www.eatthis.com/dairy-foods-inflammation/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2019/03/Dairy.jpg?quality=82&strip=all", "publishedAt": "2022-12-19T17:14:39Z", "content": "Finding ways to manage chronic inflammation can be easier said than done, in part, thanks to all of the confusing, and sometimes conflicting, information on the internet. While most people agree that… [+3661 chars]"}, {"source": {"id": null, "name": "EL PAÍS"}, "author": "María José Castro Alija", "title": "How many calories do I need to consume per day? - EL PAÍS USA", "description": "The energy needs of each individual depend on factors such as age, gender and body composition", "url": "https://english.elpais.com/science-tech/2022-12-19/how-many-calories-do-i-need-to-consume-per-day.html", "urlToImage": "https://images.english.elpais.com/resizer/yapdUvvKVfYyGZtKT9Ja-Tto1QA=/1200x0/filters:focal(2246x2658:2256x2668)/cloudfront-eu-central-1.images.arcpublishing.com/prisa/MROAJKNPR5AXHFQBCHEJDAUUWA.jpg", "publishedAt": "2022-12-19T16:55:35Z", "content": null}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Odishatv Bureau", "title": "Consequences of vitamins deficiency one should know - OTV News", "description": "Lacks of nutrients stay normal universally. They are frequently clinically ignored unless they are severe, but even a mild deficiency can have significant negative effects.", "url": "https://odishatv.in/news/health/consequences-of-vitamins-deficiency-one-should-know-192706", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/Vitamins_1671452017.webp", "publishedAt": "2022-12-19T16:41:56Z", "content": "Vitamins are essential nutrients for the body's regular and trouble-free operation. To stay healthy and active, the human body needs about 13 different kinds of vitamins on average. The human body be… [+3369 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Concentration of surgery improves operations for childhood cancer: Research - ANI News", "description": "Neuroblastoma is a tumour of the sympathetic nervous system that occurs mainly in young children. Every year, 25 children in the Netherlands receive this diagnosis. Surgery to remove the tumour tissue forms an important part of the treatment plan. Since Novem…", "url": "https://www.aninews.in/news/health/concentration-of-surgery-improves-operations-for-childhood-cancer-research20221219221046", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221219152420.jfif", "publishedAt": "2022-12-19T16:40:00Z", "content": "Utrecht [Netherlands], December 19 (ANI): The sympathetic nervous system tumour known as neuroblastoma mainly affects young children.In the Netherlands, 25 kids are given this diagnosis per year. An … [+3076 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Ute Eppinger", "title": "Vaccinating Pregnant Women Protects Infants Against Severe RSV Infection - Medscape", "description": "The vaccine RSVpreF had an almost 82% efficacy against severe RSV infection in infants from birth through the first 90 days of life, according to company data.", "url": "https://www.medscape.com/viewarticle/985810", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_181011_pregnant_vaccine_800x450.jpg", "publishedAt": "2022-12-19T16:34:16Z", "content": "An investigational vaccine against respiratory syncytial virus (RSV) in pregnant women has been shown to help protect infants against severe disease, according to the vaccine's manufacturer.\r\nPfizer … [+5846 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Fiona Callingham", "title": "Long Covid left woman, 57, feeling as though she 'had a stroke' - Express", "description": "The mum-of-one said she only feels about '50 percent' better from her initial diagnosis of Covid.", "url": "https://www.express.co.uk/life-style/health/1711432/long-covid-symptoms-woman-slow-recovery-stroke", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4464921.jpg?r=1671465373321", "publishedAt": "2022-12-19T15:55:00Z", "content": null}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Garth Brooks Weight Loss Gummies Review - Trisha Yearwood Weight Loss Exposed Or Fake Scam Keto Luxe ACV Gummies? - The Tribune India", "description": "It's becoming more and more common that people to write all kinds of online stories on how quickly they managed to shed pounds of fat and be slimmer, just like models. They often forget to mention that this process contains a lot of chemical components. The s…", "url": "https://www.tribuneindia.com/news/brand-connect/garth-brooks-weight-loss-gummies-review-trisha-yearwood-weight-loss-exposed-or-fake-scam-keto-luxe-acv-gummies-462582", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1830248443.jpg", "publishedAt": "2022-12-19T15:43:00Z", "content": "It's becoming more and more common that people to write all kinds of online stories on how quickly they managed to shed pounds of fat and be slimmer, just like models. They often forget to mention th… [+9173 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers reveal why young cancer survivors opt out of HPV vaccination - ANI News", "description": "Certain vaccine-related issues have been shown by research that medical professionals should address. Young cancer survivors are more likely to eventually develop cervical, oropharyngeal, and a number of other HPV-related malignancies, despite the fact that H…", "url": "https://www.aninews.in/news/science/researchers-reveal-why-young-cancer-survivors-opt-out-of-hpv-vaccination20221219205301", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221219152238.jpg", "publishedAt": "2022-12-19T15:23:00Z", "content": "New Jersey [US], December 19 (ANI): A study revealed several vaccine-related issues that medical professionals should address. Despite the fact that young cancer survivors have a higher chance of lat… [+2459 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Adrianna Nine", "title": "Scientists Develop Cellular ‘Glue’ That Could Change Regenerative Medicine - ExtremeTech", "description": "Custom-engineered cells could allow scientists to help rebuild damaged tissues, create organs for transplant, and study disease models in the lab.", "url": "https://www.extremetech.com/?p=341642", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2018/07/GettyImages-151330460-640x360.jpg", "publishedAt": "2022-12-19T15:02:00Z", "content": "Nerve cells are difficult to heal after disease or trauma, but UCSF’s research might change that. (Credit: PASIEKA/Getty Images)\r\nDespite how efficient the cells in our bodies can be, they still need… [+2440 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Effective vaccination strategy using SARS-CoV-2 spike cocktail against Omicron and other variants of concern | npj Vaccines - Nature.com", "description": "npj Vaccines - Effective vaccination strategy using SARS-CoV-2 spike cocktail against Omicron and other variants of concern", "url": "https://www.nature.com/articles/s41541-022-00580-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41541-022-00580-z/MediaObjects/41541_2022_580_Fig1_HTML.png", "publishedAt": "2022-12-19T14:38:08Z", "content": "Construction, expression, and purification of recombinant proteins\r\nThe DNA-S sequence of SARS-CoV-2 Omicron (B.1.1.529, BA1) variant (BA1-S) was amplified by polymerase chain reaction (PCR) using a … [+7934 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Coffee consumption tied to incident Atrial Fibrillation, study suggests - Medical Dialogues", "description": "United States: Researchers have highlighted an association between coffee consumption and incident Atrial Fibrillation (AF) in a new study. According to the research middle-aged and older adults'...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/coffee-consumption-tied-to-incident-atrial-fibrillation-study-suggests-104277", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/19/194177-psychosocial-stress-and-stroke-2.jpg", "publishedAt": "2022-12-19T14:30:57Z", "content": "United States: Researchers have highlighted an association between coffee consumption and incident Atrial Fibrillation (AF) in a new study. According to the research middle-aged and older adults' ris… [+2505 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "FDA approves \"glowing tumor\" imaging agent Cytalux to aid lung cancer surgery - Medical Dialogues", "description": "The U.S. Food and Drug Administration (FDA) has approved the targeted imaging agent Cytalux (pafolacianine) for use in lung cancer surgery. This injectable diagnostic binds to cancerous tissue and...", "url": "https://medicaldialogues.in/surgery/news/fda-approves-glowing-tumor-imaging-agent-cytalux-to-aid-lung-cancer-surgery-104280", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/19/194079-untitled-design-2022-12-19t112539249.jpg", "publishedAt": "2022-12-19T14:30:29Z", "content": "The U.S. Food and Drug Administration (FDA) has approved the targeted imaging agent Cytalux (pafolacianine) for use in lung cancer surgery. This injectable diagnostic binds to cancerous tissue and gl… [+3573 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "First H5N3 infection in a captive emperor tamarin documented in new study - News-Medical.Net", "description": "In a new study, researchers reported the first H5N3 infection in a captive Emperor Tamarin.", "url": "https://www.news-medical.net/news/20221219/First-H5N3-infection-in-a-captive-Emperor-Tamarin-documented-in-new-study.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_734036_16714578103309580.jpg", "publishedAt": "2022-12-19T14:00:00Z", "content": "In a recent study posted to the Research Square* preprint server, researchers reported the first H5N3 infection in a captive emperor tamarin.\r\nStudy: First Report of H5n3 Infection in a Captive Group… [+4540 chars]"}, {"source": {"id": null, "name": "Kaiser Health News"}, "author": null, "title": "Common Diet Supplements Useless For Lowering Cholesterol: Study - Kaiser Health News", "description": "Six commonly used supplements, like fish oil or garlic pills, marketed for improving heart health did not lower cholesterol, compared with medication or placebo in a study. Potential heavy metal co…", "url": "https://khn.org/morning-breakout/common-diet-supplements-useless-for-lowering-cholesterol-study/", "urlToImage": "https://khn.org/wp-content/themes/kaiser-healthnews-2017/static/images/placeholder.jpg", "publishedAt": "2022-12-19T13:40:57Z", "content": "Six commonly used supplements, like fish oil or garlic pills, marketed for improving heart health did not lower cholesterol, compared with medication or placebo in a study. Potential heavy metal cont… [+3208 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Rajeshwari Ganesan", "title": "You can 'hack' your immune system to fight cancer better: Here's how - Times Now", "description": "CAR-T-cell immunotherapies have been partially successful in the past against only a small number of cancers and have not been successful for everyone. However, with precision-control, CAR-T-cell immunotherapies have now been found to fight a wider range of t…", "url": "https://www.timesnownews.com/explainer/you-can-hack-your-immune-system-to-fight-cancer-better-heres-how-article-96346576", "urlToImage": "https://static.tnn.in/thumb/msid-96346576,imgsize-100,updatedat-1671455751703,width-1280,height-720,resizemode-75/96346576.jpg", "publishedAt": "2022-12-19T13:15:51Z", "content": "Woman struggles with sore throat, tonsillitis for years, gets diagnosed with a deadly disease of the mouth"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Heather Newgen", "title": "Signs Your Body Cannot Absorb Vitamin D, According to Doctors - Yahoo Life", "description": "Getting outside and soaking up the sunshine is sometimes the best medicine when we're feeling down, but that isn't always the case when it comes to vitamin D...", "url": "https://www.yahoo.com/lifestyle/signs-body-cannot-absorb-vitamin-124517426.html", "urlToImage": "https://media.zenfs.com/en/galvanized/5bc760b8f25d7754d835c8ebf5a45c18", "publishedAt": "2022-12-19T12:45:17Z", "content": "Getting outside and soaking up the sunshine is sometimes the best medicine when we're feeling down, but that isn't always the case when it comes to vitamin D. We can produce the essential vitamin whe… [+10458 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "Natural Remedies To Combat Arthritis Pain In Winter - Pragativadi", "description": "New Delhi: Winter months can be painful for arthritis patients. The pain in their joints gets worse with the weather. Following the Five tips given below will help the patients to cope with the pain and suffering.Stay Active: The cold weather can cau", "url": "https://pragativadi.com/natural-remedies-to-combat-arthritis-pain-in-winter/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2020/12/does-winter-make-your-arthritis-worse-heres-how-to-prevent-joint-pain-flare-ups-from-cold-weather-136423312689303901-171129105015.jpg", "publishedAt": "2022-12-19T12:30:08Z", "content": "New Delhi: Winter months can be painful for arthritis patients. The pain in their joints gets worse with the weather. Following the Five tips given below will help the patients to cope with the pain … [+1655 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "15 Foods That Can Cause High Cholesterol, Ranked by Saturated Fat Content — Eat This Not That - Eat This, Not That", "description": "These foods can cause high cholesterol, ranked by their saturated fat content. Saturated fat tends to increase your cholesterol levels.", "url": "https://www.eatthis.com/foods-high-cholesterol-ranked-saturated-fat/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/12/woman-eating-steak.jpg?quality=82&strip=all", "publishedAt": "2022-12-19T12:15:01Z", "content": "The statistics for high cholesterol are alarming, so it's essential for your health to know the 15 foods that can cause high cholesterol, ranked by saturated fat content. According to the Centers for… [+12857 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Safest Steroid for Bodybuilding [URGENT UPDATE 2023] Safe Anabolic Steroids for Muscle Growth! - Deccan Herald", "description": "Which steroids are safe to use in bodybuilding? Many bodybuilders have this question. It's because steroids can bring massive muscle gains in a short amount of time. They also allow you to gain weight as well as \"cut\" with a lower chance of losing muscle. Eve…", "url": "https://www.deccanherald.com/brandspot/pr-spot/safest-steroid-for-bodybuilding-urgent-update-2023-safe-anabolic-steroids-for-muscle-growth-1173182.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1173182-1671452083.png", "publishedAt": "2022-12-19T12:14:43Z", "content": "Which steroids are safe to use in bodybuilding? Many bodybuilders have this question. It's because steroids can bring massive muscle gains in a short amount of time. They also allow you to gain weigh… [+32230 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exploring microstructural brain abnormalities after mild COVID-19 - News-Medical.Net", "description": "Researchers assessed the functional and microstructural brain abnormalities, tiredness, and cognitive impairment after mild coronavirus disease 2019 (COVID-19).", "url": "https://www.news-medical.net/news/20221219/Exploring-microstructural-brain-abnormalities-after-mild-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_734029_16714504583339872.jpg", "publishedAt": "2022-12-19T11:57:00Z", "content": "In a recent study posted to the Research Square* preprint server, researchers assessed the functional and microstructural brain abnormalities, tiredness, and cognitive impairment after mild coronavir… [+5377 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "Mahender", "title": "Neeraj Clinic announces 3 days Free Epilepsy Camp for epilepsy treatment options and support services - NewsPatrolling", "description": "Rishikesh, Uttarakhand - Neeraj Clinic, a leading Epilepsy clinic based in Rishikesh has announced a community medical camp on epilepsy, to be held on 19, 20 and 21 Dec at Rishikesh. The camp, which is free and open to the public, will provide information and…", "url": "https://newspatrolling.com/neeraj-clinic-announces-3-days-free-epilepsy-camp-for-epilepsy-treatment-options-and-support-services/", "urlToImage": "https://newspatrolling.com/wp-content/uploads/2022/12/Screenshot_2022_1219_170718-660x330.png", "publishedAt": "2022-12-19T11:39:47Z", "content": "Rishikesh, Uttarakhand – Neeraj Clinic, a leading Epilepsy clinic based in Rishikesh has announced a community medical camp on epilepsy, to be held on 19, 20 and 21 Dec at Rishikesh. The camp, which … [+2073 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Is There a Link Between Heart Issues and Covid-19? Experts Talk - News18", "description": "The heart muscle doesn't receive enough oxygen delivery in the blood to perform this additional work.", "url": "https://www.news18.com/news/lifestyle/is-there-a-link-between-heart-issues-and-covid-19-experts-talk-6650053.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/untitled-design-34-2-167144862116x9.png", "publishedAt": "2022-12-19T11:17:45Z", "content": "Scientists at the University of Maryland in Baltimore, US, have now discovered the mechanism underlying the toxic effect the virus has on the heart tissue that may cause a heart attack or heart failu… [+2192 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Researchers identify origin of serious illnesses in children - Deccan Herald", "description": "Researchers from the Karolinska Institutet and the Karolinska University Hospital have pinpointed the causes of the severe cancer-like condition Langerhans cell histiocytosis (LCH). Science Immunology's findings might inspire the development of fresh, special…", "url": "https://www.deccanherald.com/video/science-and-environment/researchers-identify-origin-of-serious-illnesses-in-children-1173130.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2022/12/19/dec19v21-1173130-1671448674.jpg", "publishedAt": "2022-12-19T10:40:43Z", "content": "Researchers from the Karolinska Institutet and the Karolinska University Hospital have pinpointed the causes of the severe cancer-like condition Langerhans cell histiocytosis (LCH). Science Immunolog… [+452 chars]"}, {"source": {"id": null, "name": "NWAOnline"}, "author": null, "title": "Flu patients are filling Northwest Arkansas hospitals, health providers say - Northwest Arkansas Democrat-Gazette", "description": "Health care providers are urging Arkansans to get vaccinated against respiratory illnesses, including the flu and covid-19, ahead of the holidays.", "url": "https://www.nwaonline.com/news/2022/dec/19/flu-patients-are-filling-northwest-arkansas/", "urlToImage": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/203166877_FLU-SHOTS_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676", "publishedAt": "2022-12-19T10:13:35Z", "content": "Health care providers are urging Arkansans to get vaccinated against respiratory illnesses, including the flu and covid-19, ahead of the holidays.\r\nJacqueline Truesdale, chief nursing officer of Merc… [+5924 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "“Breakthrough” Made in Understanding How Inflammation Is Regulated - Technology Networks", "description": "Scientists have discovered that Interleukin-37 has an unexpected function as an immune-activating molecule, rather than an \"off-switch\" as once believed.", "url": "https://www.technologynetworks.com/immunology/news/breakthrough-made-in-understanding-how-inflammation-is-regulated-368563", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/368563/breakthrough-made-in-understanding-how-inflammation-is-regulated-368563-640x360.jpg?cb=20221219", "publishedAt": "2022-12-19T10:05:36Z", "content": "Scientists from Trinity have made an important breakthrough in understanding how inflammation is regulated. They have just discovered that a key immune alarm protein previously believed to calm down … [+3473 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Intermittent fasting may reverse diabetes, Here’s how - Health shots", "description": "Intermittent fasting has become a trend, but it is mainly associated with dieting and weight loss. Now a study has found that intermittent fasting may lead to diabetes remission.", "url": "https://www.healthshots.com/health-news/benefits-of-intermittent-fasting-it-may-reverse-diabetes/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/12/19135451/diabbb-2.jpg", "publishedAt": "2022-12-19T09:30:00Z", "content": "When millennials think of weight loss or dieting, intermittent fasting pops up in their mind. It has made them happy as it has helped them in bringing down their weight. The good news is that it migh… [+3756 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Topamax Alternative [Updated]: Top 4 Over The Counter Natural Alternative To Topiramate For Weight Loss 2023 - Deccan Herald", "description": "A healthy physique is vital. People with high body fat will become obese quickly, making it exceedingly difficult to lose weight. This is very dangerous and might cause several issues for anybody. People must thus maintain a good body fat percentage and take …", "url": "https://www.deccanherald.com/brandspot/pr-spot/topamax-alternative-updated-top-4-over-the-counter-natural-alternative-to-topiramate-for-weight-loss-2023-1173109.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1173109-1671441176.png", "publishedAt": "2022-12-19T09:12:56Z", "content": "A healthy physique is vital. People with high body fat will become obese quickly, making it exceedingly difficult to lose weight. This is very dangerous and might cause several issues for anybody.\r\nP… [+10124 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Squamous cell carcinoma makes up 90% of all head and neck cancers: Doctors - News9 LIVE", "description": "Squamous cells are found in the tissue that forms the surface of the skin, the lining of the hollow organs of the body, and the lining of the respiratory and digestive tracts", "url": "https://www.news9live.com/health/health-conditions/squamous-cell-carcinoma-makes-up-90-of-all-head-and-neck-cancers-doctors-214959", "urlToImage": "https://media.news9live.com/h-upload/2022/12/19/593961-39268825024f8c729742c.jpg", "publishedAt": "2022-12-19T09:05:19Z", "content": "It is important to maintain a healthy lifestyle. According to medical experts, poor lifestyle and dietary habits increase the risk of developing various diseases such as cancers in the respiratory an… [+2887 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Pregnant women are more severely affected by infections : Dr Bindra - United News of India", "description": "Hyderabad, Dec 19 (UNI)  Pregnant women are more severely affected by infections as compared to non-pregnant women, said  Dr. Vimee Bindra - Fertility Enhancing Surgery Specialist: Endometriosis Excision Surgery Specialist & Co-Founder “Endocrusaders''''.", "url": "http://www.uniindia.com/~/pregnant-women-are-more-severely-affected-by-infections-dr-bindra/States/news/2881631.html", "urlToImage": "", "publishedAt": "2022-12-19T08:50:00Z", "content": "More News19 Dec 2022 | 3:49 PMAmaravati, Dec 19 (UNI) Light to moderate rain is likely at one or two places in South Coastal Andhra Pradesh during the next 48 hours, Meteorological Centre said on Mon… [+1131 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "Devki Yadav", "title": "Hong Kong Baptist University develops new aptamer drug for bone anabolic therapies - NewsPatrolling", "description": "HONG KONG SAR - Media OutReach - 19 December 2022 - A research team led by Hong Kong Baptist University (HKBU) has identified a molecular target for bone anabolic therapies using a selected aptamer that serves as an inhibitor of sclerostin, a protein that pre…", "url": "https://newspatrolling.com/hong-kong-baptist-university-develops-new-aptamer-drug-for-bone-anabolic-therapies/", "urlToImage": null, "publishedAt": "2022-12-19T08:46:39Z", "content": "HONG KONG SAR –Media OutReach – 19 December 2022 – A research team led by Hong Kong Baptist University (HKBU) has identified a molecular target for bone anabolic therapies using a selected aptamer th… [+5976 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Obesity is neurodevelopmental disorder, propose scientists - The Tribune India", "description": "Obesity has increased rapidly in recent decades to affect more than 2 billion people, making it one of the largest contributors to poor health worldwide. Despite decades of research on diet and exercise treatments, many people continue to struggle to lose wei…", "url": "https://www.tribuneindia.com/news/health/obesity-is-neurodevelopmental-disorder-propose-scientists-462550", "urlToImage": "https://www.tribuneindia.com/content/images/Logo_eng.png", "publishedAt": "2022-12-19T08:40:00Z", "content": "ANI\r\nWashington, December 19\r\nObesity has increased rapidly in recent decades to affect more than 2 billion people, making it one of the largest contributors to poor health worldwide. Despite decades… [+2657 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Unnati Gusain", "title": "Fauci calls COVID-19 'loudest wake-up call' for emerging infectious diseases; expert says improved... - News9 LIVE", "description": "One of the major COVID-19 setbacks was poor vaccination for other diseases including measles.", "url": "https://www.news9live.com/health/health-conditions/fauci-calls-covid-19-loudest-wake-up-call-for-emerging-infectious-diseases-expert-says-improved-healthcare-required-214948", "urlToImage": "https://media.news9live.com/h-upload/2022/12/19/593941-vaccination-6576827960720.jpg", "publishedAt": "2022-12-19T08:35:19Z", "content": "COVID-19 is the loudest wake-up call in more than a century to our vulnerability to outbreaks of emerging infectious diseases, said Anthony S Fauci, director of the National Institute of Allergy and … [+3981 chars]"}, {"source": {"id": null, "name": "Thip.media"}, "author": "Dr. Shikha Shiromani", "title": "Fact Check: Were there no cases of Flu in the year 2021? - THIP Media", "description": "Quick Take A social media post claims that last year [2021], there were no flu cases on the whole planet as flu was counted as COVID last year. We fact-checked and found this claim to be False. The Claim In a video shared on Instagram, an English media person…", "url": "https://www.thip.media/health-news-fact-check/fact-check-were-there-no-cases-of-flu-in-the-year-2021/38829/", "urlToImage": "https://static.thip.media/wp-content/uploads/2022/04/16181200/Cold-flu-1200x630-cropped.jpg", "publishedAt": "2022-12-19T08:34:09Z", "content": "Quick Take\r\nA social media post claims that last year [2021], there were no flu cases on the whole planet as flu was counted as COVID last year. We fact-checked and found this claim to be False.\r\nThe… [+2972 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "How much memory loss is normal with ageing - The Week", "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI", "url": "https://www.theweek.in/wire-updates/international/2022/12/19/fgn22-memory-loss.html", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2022-12-19T08:15:00Z", "content": "By Oliver Baumann and Cindy Jones, Bond UniversityRobina (Australia), Dec 19 (The Conversation) Youve driven home from work along the same route for the past five years. But lately, youve been stoppi… [+4461 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Tracing tomatoes’ health benefits to gut microbes: Research - ThePrint", "description": "Washington [US], December 19 (ANI): Two weeks of eating a diet heavy in tomatoes increased the diversity of gut microbes and altered gut bacteria toward a more favourable profile in young pigs, researchers have found. After observing these results with a shor…", "url": "https://theprint.in/features/tracing-tomatoes-health-benefits-to-gut-microbes-research/1271267/", "urlToImage": null, "publishedAt": "2022-12-19T08:14:45Z", "content": "Washington [US], December 19 (ANI): Two weeks of eating a diet heavy in tomatoes increased the diversity of gut microbes and altered gut bacteria toward a more favourable profile in young pigs, resea… [+3767 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Long-acting injectable PrEP is a big step forward in HIV prevention - ETHealthWorld", "description": "The main advantage of injectable PrEP is that going for injections every two months is a lot easier to remember than taking pills every day, or taking pills before and after sexual activity. The switch from oral pills to injectable shots means that individual…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/long-acting-injectable-prep-is-a-big-step-forward-in-hiv-prevention/96337071", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96337071,imgsize-1073173,width-1200,height-628,overlay-ethealthworld/long-acting-injectable-prep-is-a-big-step-forward-in-hiv-prevention.jpg", "publishedAt": "2022-12-19T06:57:00Z", "content": "Toronto: One year ago, the United States approved a new injectable drug that prevents HIV.After successful clinical trials, long-acting cabotegravir was found to be almost 100 per cent effective at p… [+4826 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Are Dengue, Chikungunya, And Zika Different - News18", "description": "The symptoms for the three diseases are very similar in nature which is why you need to keep yourself constantly under check and seek for professional advice whenever you feel the issue might escalate.", "url": "https://www.news18.com/news/lifestyle/how-are-dengue-chikungunya-and-zika-different-6639457.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/untitled-design-1-48-167143262616x9.png", "publishedAt": "2022-12-19T06:51:39Z", "content": "Dengue, Chikungunya, and Zika are all arboviral diseases transmitted to humans via Anopheles and Aedes mosquitoes. The occurrence of the three diseases has seen a jump in recent times, likely due to … [+2013 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "This drug offers potential treatment for common kidney disease - Hindustan Times", "description": "The kidney disorder is typically brought on by other illnesses that decrease blood supply to the kidney or by drug toxicity. Researchers discover new drug that offers potential treatment for common kidney disease | Health", "url": "https://www.hindustantimes.com/lifestyle/health/this-drug-offers-potential-treatment-for-common-kidney-disease-101671429635937.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/19/1600x900/41e8bd00-9fcb-11ec-9dea-cf986250bae9_1646845957695_1671431158185_1671431158185.jpg", "publishedAt": "2022-12-19T06:29:19Z", "content": "According to a recent study, there are already medications available to treat a dangerous illness that might lead the kidneys to suddenly stop functioning.\r\nThe study is published in Science Translat… [+1919 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "Uncontrolled blood sugar: THIS drink can help you keep your blood sugar under control - Zee News", "description": "Diabetes has an impact on the bodys insulin and blood sugar levels. Along with altering ones lifestyle with regular medication, alternative treatments like herbs and vitamins may be helpful.", "url": "https://zeenews.india.com/health/uncontrolled-blood-sugar-this-drink-can-help-you-keep-your-blood-sugar-under-control-2550576", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/12/19/1131158-tonic-for-diabetes.png", "publishedAt": "2022-12-19T06:03:38Z", "content": "High blood sugar: Diabetes has an impact on the body's insulin and blood sugar levels. Along with altering one's lifestyle with regular medication, alternative treatments like herbs and vitamins may … [+1337 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "IAP releases guidelines for regular vaccination drive - Express Healthcare", "description": "In view of the dramatic drop in regular immunisation drives and the unpredictable outbreak of measles and rubella cases, IAP released new guidelines for regular vaccination drives", "url": "https://www.expresshealthcare.in/news/iap-releases-guidelines-for-regular-vaccination-drive/437346/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2022/12/Launch-of-iap-standard-treatment-guidelines-2.jpg", "publishedAt": "2022-12-19T05:41:24Z", "content": "In view of the dramatic drop in regular immunisation drives and the unpredictable outbreak of measles and rubella cases, IAP released new guidelines for regular vaccination drives\r\nIndian Academy of … [+3186 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Raunak Jain", "title": "What is MERS virus? Know why its at risk of spreading after FIFA World Cup 2022 in Qatar - DNA India", "description": "MERS is a viral respiratory illness caused by the MERS-CoV virus.", "url": "https://www.dnaindia.com/health/report-what-is-mers-virus-know-why-its-at-risk-spreading-after-fifa-world-cup-2022-in-qatar-3011683", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/12/19/2561515-untitled-design-2022-12-19t093144.367.jpg", "publishedAt": "2022-12-19T04:01:00Z", "content": "Reported By:| Edited By: Raunak Jain |Source: DNA Web Desk |Updated: Dec 19, 2022, 09:43 AM ISTMERS, or Middle East Respiratory Syndrome, is a viral respiratory illness that was first identified in S… [+2149 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cryo-electron microscopy reveals atomic structure of Staphylococcus epidermidis bacteriophage - News-Medical.Net", "description": "Cryo-electron microscopy by University of Alabama at Birmingham researchers has exposed the structure of a bacterial virus with unprecedented detail.", "url": "https://www.news-medical.net/news/20221218/Cryo-electron-microscopy-reveals-atomic-structure-of-Staphylococcus-epidermidis-bacteriophage.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Bacteriophage_viruses_infecting_bacterial_cells_%2c_Bacterial_viruses-nobeastsofierce_1f9734ecc24b48b18edf321551d48376-620x480.jpg", "publishedAt": "2022-12-19T03:58:00Z", "content": "Cryo-electron microscopy by University of Alabama at Birmingham researchers has exposed the structure of a bacterial virus with unprecedented detail. This is the first structure of a virus able to in… [+6279 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Meeting on introduction of HPV vax in immunisation programme held - EastMojo", "description": "New Delhi: The Union Health Ministry has held a meeting with domestic and international pharmaceutical companies for the introduction of human", "url": "http://www.eastmojo.com/national/2022/12/19/meeting-on-introduction-of-hpv-vax-in-immunisation-programme-held/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/09/Untitled-design-47.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-12-19T03:50:00Z", "content": "New Delhi: The Union Health Ministry has held a meeting with domestic and international pharmaceutical companies for the introduction of human papillomavirus (HPV) vaccine against cervical cancer amo… [+3969 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Genes indicating risk for Alzheimer's identified using novel testing methods - Devdiscourse", "description": "The study, which was published today in the journal 'Science', outlined the new and revised model for the identification of risk genes for Alzheimer's disease.", "url": "https://www.devdiscourse.com/article/health/2291230-genes-indicating-risk-for-alzheimers-identified-using-novel-testing-methods", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/19_12_2022_02_57_16_0045444.jpg?width=920&format=jpeg", "publishedAt": "2022-12-19T02:57:18Z", "content": "A new UCLA-led study used a combination of new testing methods to identify multiple new risk genes for Alzheimer's disease and a rare, related brain disorder called progressive supranuclear palsy (PS… [+4539 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Covid virus evolving, can still surprise us: Experts - Sentinelassam - The Sentinel Assam", "description": "The recent spike in flu cases has emerged as a new cause of concern even as the Covid pandemic has...", "url": "https://www.sentinelassam.com/topheadlines/covid-virus-evolving-can-still-surprise-us-experts-628746", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/12/19/422701-covid-ca.jpg", "publishedAt": "2022-12-19T02:11:05Z", "content": "NEW DELHI: The recent spike in flu cases has emerged as a new cause of concern even as the Covid pandemic has been on a decreasing trajectory for the last few months.\r\nCovid in the last two-three yea… [+3747 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Researchers find anti-inflammatory proteins, lipids in long Covid patients - Daily Pioneer", "description": "A team of researchers has found several anti-inflammatory proteins, lipids, and metabolites in long Covid patients, which, they said,&nbsp; could contribute to the most important long Covid syndrome symptoms.\n\nThe study is published in iScience.\n\nToday millio…", "url": "https://www.dailypioneer.com/2022/india/researchers-find-anti-inflammatory-proteins--lipids-in-long-covid-patients.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-12-18T22:20:55Z", "content": "A team of researchers has found several anti-inflammatory proteins, lipids, and metabolites in long Covid patients, which, they said,  could contribute to the most important long Covid syndrome sympt… [+3561 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "Man, 63, diagnosed with pancreatic cancer after experiencing 'very bad' itching & jaundice - Express", "description": "The man's experience highlights the need to get any unusual changes checked by your GP.", "url": "https://www.express.co.uk/life-style/health/1711087/pancreatic-cancer-signs-symptoms-itching-jaundice", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4463506.jpg?r=1671399282008", "publishedAt": "2022-12-18T21:26:00Z", "content": null}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Jamie McCarron", "title": "Majority of countries to miss targets for decreasing cervical cancer - TheJournal.ie", "description": "Ireland had a 3% increase in cervical cancer between 1988 and 2017, one of the highest in the world.", "url": "https://www.thejournal.ie/cervical-cancer-rates-remain-high-5944914-Dec2022/", "urlToImage": "https://img2.thejournal.ie/article/5944914/river/?height=400&version=5944970", "publishedAt": "2022-12-18T18:22:11Z", "content": "TARGETS SET BY the World Health Organisation (WHO) for reducing cervical cancer will be missed unless countries scale up screening programmes, improve coverage of HPV vaccination and improve access t… [+4887 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Adam Meyer", "title": "High Levels of 'Bad Cholesterol' Associated With Greater Dementia Risk, New Study Finds — Eat This Not That - Eat This, Not That", "description": "A new study published in Scientific Reports found that having high levels of LDL cholesterol can elevate your risk of all types of dementia.", "url": "https://www.eatthis.com/high-cholesterol-increases-dementia-risk-study/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/12/high-low-hdl-ldl-cholesterol.jpg?quality=82&strip=all", "publishedAt": "2022-12-18T17:30:55Z", "content": "If you want to live a long, healthy life, one of your top priorities should be taking good care of your heart and brain. While it's no secret that these organs are critical for overall health and nea… [+5564 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers say why exercise, mindfulness don’t boost cognitive function in older people - ThePrint", "description": "Washington [US], December 18 (ANI): In-depth research on the effects of exercise and mindfulness training on older adults’ cognitive function revealed no difference between the two interventions in terms of improving cognitive function. Researchers from the U…", "url": "https://theprint.in/features/researchers-say-why-exercise-mindfulness-dont-boost-cognitive-function-in-older-people/1270758/", "urlToImage": null, "publishedAt": "2022-12-18T17:14:53Z", "content": "Washington [US], December 18 (ANI): In-depth research on the effects of exercise and mindfulness training on older adults’ cognitive function revealed no difference between the two interventions in t… [+4864 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Staff Reporter", "title": "Madhya Pradesh: Second phase of Anti-Rubella campaign to began in the state from December 19 - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/bhopal/madhya-pradesh-second-phase-of-anti-rubella-campaign-to-began-in-the-state-from-december-19", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-12/f71b47b0-2c0c-4682-ac72-36c6d2b1159d/measles_su19.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-12-18T12:01:02Z", "content": "Bhopal (Madhya Pradesh): Second phase of the Anti-Rubella campaign will be launched in the state from Monday. According to health department officials, the second phase of the above campaign is to be… [+1350 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Another monkey virus could be poised for 'spillover to humans' - ETHealthWorld", "description": "Some characteristics of the present outbreak differed from those of previous monkeypox outbreaks, considering if this emergence of monkeypox could cause another global pandemic similar to smallpox or influenza or if it is only the re-emergence of a new strain.", "url": "https://health.economictimes.indiatimes.com/news/industry/another-monkey-virus-could-be-poised-for-spillover-to-humans/96320106", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96320106,imgsize-4638,width-1200,height-628,overlay-ethealthworld/another-monkey-virus-could-be-poised-for-spillover-to-humans.jpg", "publishedAt": "2022-12-18T11:10:00Z", "content": "New Delhi: Since its first confirmation in London on May 12 last year, many monkeypox cases have been reported worldwide. Noticeably, the epidemiology, pathology and clinical features of the current … [+3618 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "7 effective ways to reduce salt intake in your meals - Hindustan Times", "description": "Eating too much salt in your diet? It can put you at risk of heart disease and stroke. Don't know how to restrict? Follow these expert tips. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/7-effective-ways-to-reduce-salt-intake-in-your-meals-101671357429770.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/18/1600x900/high_salt_diet_1671357807557_1671357822531_1671357822531.jpg", "publishedAt": "2022-12-18T10:10:35Z", "content": "Salt is not just a great flavour enhancer but is also essential for nerve function, muscle function and maintaining the right balance of water and minerals. Yet too much of it can invite innumerable … [+2646 chars]"}, {"source": {"id": null, "name": "Pgurus.com"}, "author": "PGurus Newsdesk", "title": "Amid Measles Cases on a Surge, India on Alert - PGurus", "description": "The rise in number of measles cases has emerged as a subject of concern for India. Some states last month reported a surge in measles cases", "url": "https://www.pgurus.com/amid-measles-cases-on-a-surge-india-on-alert-to-manage-post-pandemic-crisis/", "urlToImage": "https://www.pgurus.com/wp-content/uploads/2022/12/Measles-Surge.jpg", "publishedAt": "2022-12-18T08:58:34Z", "content": "The rise in the number of measles cases has emerged as a subject of concern for India. Some states – Maharashtra, Gujarat, Kerala, and Jharkhand – last month reported a surge in measles cases.\r\nEarli… [+2429 chars]"}, {"source": {"id": null, "name": "Birmingham Live"}, "author": "James Rodger", "title": "Prescription rules changing as pharmacies issued new guidance - Birmingham Live", "description": "Pharmacies will be given more flexibility as they aim to tackle strep A cases, which are spiking across the country.", "url": "https://www.birminghammail.co.uk/news/midlands-news/prescription-rules-changing-pharmacies-issued-25780742", "urlToImage": "https://i2-prod.walesonline.co.uk/incoming/article25694628.ece/ALTERNATES/s1200/1_Coronavirus-Mon-Apr-6-2020.jpg", "publishedAt": "2022-12-18T07:25:05Z", "content": "A major change to prescription rules has been announced as deadly Strep A infections soar. Pharmacies will be given more flexibility as they aim to tackle strep A cases, which are spiking across the … [+1605 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "Lessons to be learnt from how Kerala managed Nipah - The Siasat Daily", "description": "The source of the Nipah virus was traced to fruit bats and it was confined to Kozhikode and Malappuram in North Kerala.", "url": "https://www.siasat.com/lessons-to-be-learnt-from-how-kerala-managed-nipah-2482485/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/09/Nipah-Virus.jpg", "publishedAt": "2022-12-18T06:59:00Z", "content": "Thiruvananthapuram: On May 19, 2018, the dreaded Nipah virus was detected in Kerala, in the Kozhikode and Malappuram districts. It later turned into an outbreak leaving 17 people dead and 18 people c… [+3716 chars]"}, {"source": {"id": null, "name": "Dunya News"}, "author": null, "title": "What makes breast cancer come back? - Health - Dunya News", "description": "What makes breast cancer come back?", "url": "https://dunyanews.tv/en/Health/681641-What-makes-breast-cancer-come-back", "urlToImage": "https://img.dunyanews.tv/news/2022/December/12-18-22/news_big_images/681641_87467579.jpg", "publishedAt": "2022-12-18T06:56:38Z", "content": "What makes breast cancer come back?\r\n18 December,2022\r\n11:51 am\r\nISLAMABAD, (Online) - Millions of people live with breast cancer, the most common form of cancer worldwide — and also, in most cases, … [+2776 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Satyen Mohapatra", "title": "Alzheimer’s disease: Why women are more prone? - The Siasat Daily", "description": "Alzheimer's disease is the most common type of dementia. In 2020 there were over 55 million people worldwide living with dementia and by 2050 it is supposed to reach 139 million worldwide, with most of them being in developing countries. Of dementia disorders…", "url": "https://www.siasat.com/alzheimers-disease-why-women-are-more-prone-2482407/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/11/Untitled-design-2022-11-30T131533.887.png", "publishedAt": "2022-12-18T05:21:00Z", "content": "Alzheimer’s disease is the most common type of dementia. In 2020 there were over 55 million people worldwide living with dementia and by 2050 it is supposed to reach 139 million worldwide, with most … [+4854 chars]"}, {"source": {"id": null, "name": "Times of Oman"}, "author": "Bitwize - http://bitwize.com.lb", "title": "Walnuts are the new brain superfood for stressed students - Times of Oman", "description": "In a recent clinical experiment, undergraduate students' self-reported indices of mental health and biomarkers of general health were positively impacted by walnut consumption during their university studies. According to a University of South Australia study…", "url": "https://timesofoman.com/article/124580-walnuts-are-the-new-brain-superfood-for-stressed-students", "urlToImage": "https://shabiba.eu-central-1.linodeobjects.com/2022/12/1671339183-1671339183-txicazplo8go-700x400.jpg", "publishedAt": "2022-12-18T04:53:00Z", "content": "In the weeks before their next exam, stressed-out college students may wish to add walnuts to their daily diet.In a recent clinical experiment, undergraduate students' self-reported indices of mental… [+2800 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Genetically engineered muscle tissue promising for type 2 diabetes treatment: Study - Medical Dialogues", "description": "Israel: Injections of genetically engineered muscle tissue hold great promise for type 2 diabetes (T2D) treatment, a recent study has shown. A single transplant of engineered tissue kept blood...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/genetically-engineered-muscle-tissue-promising-for-type-2-diabetes-treatment-study-104163", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/23/186142-untitled-design-25.jpg", "publishedAt": "2022-12-18T04:00:42Z", "content": "Israel: Injections of genetically engineered muscle tissue hold great promise for type 2 diabetes (T2D) treatment, a recent study has shown. A single transplant of engineered tissue kept blood sugar … [+2668 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Kacie Goff, Amelia Ti", "title": "13 Foods to Help Keep Your Kidneys Healthy - CNET", "description": "These foods are rich in all the most important nutrients for kidney health.", "url": "https://www.cnet.com/health/nutrition/13-foods-to-help-keep-your-kidneys-healthy/", "urlToImage": "https://www.cnet.com/a/img/resize/c6fe587d007630c65b324ae184fe6f6e41050410/hub/2022/10/19/5d34152d-8760-4c44-93bb-9652e74a0115/gettyimages-1291652346.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-12-17T18:00:08Z", "content": "Your kidneys are like filters that get rid of all the things you don't want in your body. These two bean-shaped organs filter your blood and remove toxins and excess fluids. \r\nNot only that, but they… [+6225 chars]"}]}