{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Durgesh Nandan Jha", "title": "Phase-3 trials find 1-shot chikungunya vaccine safe, effective: Lancet - Indiatimes.com", "description": "The first chikungunya vaccine may be on its way with phase 3 trials of a single-shot jab developed by French biotech company Valneva showing the vacci", "url": "https://timesofindia.indiatimes.com/india/phase-3-trials-find-1-shot-chikungunya-vaccine-safe-effective-lancet/articleshow/100947278.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100947283,width-1070,height-580,imgsize-61690,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-12T19:29:00Z", "content": "Dal khichdi, halwa: Here's what Gaganyaan's menu will be like"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study finds how brain waves can predict cognitive impairment in Parkinson's disease - ThePrint", "description": "Iowa [US], June 13 (ANI): For Parkinson’s disease (PD) patients, a few minutes of data collected from a single electrode put on top of the head may be sufficient to anticipate cognitive issues, including dementia. The results of a recent University of Iowa st…", "url": "https://theprint.in/health/study-finds-how-brain-waves-can-predict-cognitive-impairment-in-parkinsons-disease/1624493/", "urlToImage": null, "publishedAt": "2023-06-12T19:16:16Z", "content": "Iowa [US], June 13 (ANI): For Parkinson’s disease (PD) patients, a few minutes of data collected from a single electrode put on top of the head may be sufficient to anticipate cognitive issues, inclu… [+4482 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Chronic exposure to lead, cadmium and arsenic associated with increased risk of cardiovascular disease - News-Medical.Net", "description": "Chronic exposure to low levels of lead, cadmium and arsenic through commonly used household items, air, water, soil and food is associated with an increased risk of cardiovascular disease, according to a new American Heart Association scientific statement pub…", "url": "https://www.news-medical.net/news/20230612/Chronic-exposure-to-lead-cadmium-and-arsenic-associated-with-increased-risk-of-cardiovascular-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/9/heart_disease_1_12c3ff20f43b43d898bf18f5689e0c7c-620x480.jpg", "publishedAt": "2023-06-12T18:44:00Z", "content": "Chronic exposure to low levels of lead, cadmium and arsenic through commonly used household items, air, water, soil and food is associated with an increased risk of cardiovascular disease, according … [+8663 chars]"}, {"source": {"id": null, "name": "Organiser.org"}, "author": "WEB DESK", "title": "Study finds cause and cure for common type of high blood pressure - Organiser", "description": "Researchers discovered a gene mutation that causes a common type of hypertension (high blood pressure) and a treatment for it. This study was published in", "url": "https://organiser.org/2023/06/12/178568/world/study-finds-cause-and-cure-for-common-type-of-high-blood-pressure/", "urlToImage": "https://organiser.org/wp-content/uploads/2023/06/whatsapp-image-2023-06-12-at-2.13.55-pm.jpeg", "publishedAt": "2023-06-12T17:32:18Z", "content": "Researchers discovered a gene mutation that causes a common type of hypertension (high blood pressure) and a treatment for it.\r\nThis study was published in the journal, ‘Nature Genetics.’ A little be… [+3081 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's Why You Should Eat Jimikand More Often - NDTV", "description": "Jimikand is an excellent vegetable to include in your diet to promote better health and reduce the risk of several health conditions.", "url": "https://www.ndtv.com/health/heres-why-you-should-eat-jimikand-more-often-4115925", "urlToImage": "https://c.ndtvimg.com/2018-10/f1rskfgo_jimikand_625x300_23_October_18.jpg", "publishedAt": "2023-06-12T17:19:59Z", "content": "Jimikand can be boiled, fried, mashed, or roasted and used in a variety of ways\r\nJimikand, also known as Yam, is a starchy root vegetable originating from South Asia. The vegetable is nutritious and … [+2043 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Editorial", "title": "Gluten-Free Diet: Really Beneficial Or Just A Food Fad? - Slurrp", "description": "While gluten-free diets are crucial for individuals with celiac disease or gluten sensitivity, the notion that they are universally healthier for the general population is not supported by substantial scientific evidence. It is vital to remember that gluten i…", "url": "https://www.slurrp.com/article/gluten-free-diet-really-beneficial-or-just-a-food-fad-1686579799301", "urlToImage": "https://images.slurrp.com/prodarticles/uinj9dm2s2a.webp", "publishedAt": "2023-06-12T17:11:55Z", "content": "In recent years, gluten-free diets have gained significant popularity as a means to improve overall health. However, it is important to question whether these diets are actually healthier for individ… [+1302 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Saffron For Mental Health: Nutritionist Shares Anti-Depressant Properties Of Kesar - NDTV", "description": "According to studies, saffron can help you improve mood, memory and learning ability.", "url": "https://www.ndtv.com/health/saffron-for-mental-health-nutritionist-shares-anti-depressant-properties-of-kesar-4113852", "urlToImage": "https://c.ndtvimg.com/2020-11/7a94u7h_saffron_625x300_21_November_20.jpg", "publishedAt": "2023-06-12T17:00:57Z", "content": "Saffron is loaded with antioxidants\r\nIngredients that go into our daily meals have properties and nutrients that complement our overall health and well-being. In addition to our physical health, the … [+3024 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kinkini Gupta", "title": "Social Isolation And Hypertension: Middle Aged And Older Women May Be At High Risk Says Study | TheHealth - TheHealthSite", "description": "Researchers found that for women social isolation had the same effect on blood pressure as high sodium diets pollution weight gain or non-steroidal anti-inflammatory drugs. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/social-isolation-and-hypertension-middle-aged-and-older-women-may-be-at-high-risk-says-study-984609/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/pexels-enric-cruz-lopez-6642541.jpg", "publishedAt": "2023-06-12T16:35:00Z", "content": "Social Isolation And Hypertension: Middle Aged And Older Women May Be At High Risk, Says Study \r\nResearchers found that for women, social isolation had the same effect on blood pressure as high sodiu… [+2974 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Gonorrhea: As STI cases are over 80 million currently, here are the symptoms you should be aware of - Times of India", "description": "​As per a 2021 report released by the World Health Organisation (WHO), 82.4 million people were newly infected with Gonorrhea in 2020. In its The Global Health Sector Strategy on STIs 2016-2021, the WHO had aimed to reduce gonorrhea by 90% by 2030.​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/gonorrhea-as-sti-cases-are-over-80-million-currently-here-are-the-symptoms-you-should-be-aware-of/photostory/100937873.cms", "urlToImage": "https://static.toiimg.com/photo/100937904.cms", "publishedAt": "2023-06-12T16:30:00Z", "content": "Apart from the genital areas, gonorrhea also occurs in the rectum, eyes, throat, and joints. The signs of gonorrhea vary as per the location of the disease. In the eyes, it causes eye pain, sensitivi… [+307 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "8 desi Indian foods to help stay active and fit - Recipes", "description": "​The Indian kitchen is the hub of good health and that's because right from grains to pulses to spices, everything adds to our well-being and helps us stay fit and active. Take a look at 8 desi Indian foods that help us stay fit and active.", "url": "https://recipes.timesofindia.com/web-stories/8-desi-indian-foods-to-help-stay-active-and-fit/photostory/100941419.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100941437,imgsize-76492,width-900,height-1200,resizemode-6/100941437.jpg", "publishedAt": "2023-06-12T16:30:00Z", "content": "Pulses or dals are rich in vitamins A, B, C and E and minerals like calcium, iron, and potassium and are also a good source of amino acids."}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Study discovers long Covid patients suffer from persistent inflammation - DTNEXT", "description": "Scientists have seen previous links between inflammation and long COVID, but the new study is the first to trace the persistence of these inflammatory markers over time in the same patients.", "url": "https://www.dtnext.in/lifestyle/wellbeing/study-discovers-long-covid-patients-suffer-from-persistent-inflammation-718094", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/12/740330-nation.jpg", "publishedAt": "2023-06-12T16:24:38Z", "content": "WASHINGTON: A recent study from the Allen Institute and Fred Hutchinson Cancer Centre suggested that the cause of many protracted COVID cases may be an excessive inflammatory response. \r\nWhen researc… [+5374 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Barriers of Care to Ovarian Cancer: A Scoping Review - Cureus", "description": "Ovarian cancer is a leading cause of female cancer-related deaths, but patients continue to be diagnosed late. This subjects them to disease progression and possible death due to lack of early detection, despite earlier stage detection improving survival rate…", "url": "https://www.cureus.com/articles/143085-barriers-of-care-to-ovarian-cancer-a-scoping-review", "urlToImage": "https://assets.cureus.com/uploads/figure/file/585753/article_river_745ba690c3af11ed80e6cbc50276b867-Picture1.png", "publishedAt": "2023-06-12T15:44:20Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Alcohol Consumption Linked To Increased Risk Of 61 Diseases In Chinese Men, Including Gout, Cataract: Study - ABP Live", "description": "The researchers analysed a total of 207 diseases. Self-reported alcohol intake was associated with higher risks of 61 diseases, which included gout, cataract, gastric ulcers and some fractures.", "url": "https://news.abplive.com/science/alcohol-consumption-61-diseases-increased-risk-chinese-men-gout-cataract-gastric-ulcer-nature-medicine-study-1608600", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/12/784bfe2ef8ae77d8a17b5920f34065671686573466645324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-06-12T15:25:03Z", "content": null}, {"source": {"id": null, "name": "Pulmonologyadvisor.com"}, "author": "Ron Goldberg", "title": "CPAP Lowers Blood Pressure in Select Patients With Severe OSA and Hypertension - Pulmonology Advisor", "description": "Researchers sought to identify which patients with severe OSA and untreated hypertension could achieve reduced blood pressure with CPAP.", "url": "https://www.pulmonologyadvisor.com/home/topics/obstructive-sleep-apnea-osa/cpap-lowers-blood-pressure-in-select-patients-with-severe-osa-and-hypertension/", "urlToImage": null, "publishedAt": "2023-06-12T14:56:00Z", "content": "Among patients with severe obstructive sleep apnea (OSA) and untreated hypertension, those whose high blood pressure (BP) is induced by transient apnea events are likely to achieve lower blood pressu… [+3970 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Catherine Shuttleworth", "title": "IBS could be a form of ‘gravity intolerance’, according to a new hypothesis - indy100", "description": "A gastroenterologist has argued that irritable bowel syndrome is triggered by the body’s inability to manage gravity.Brennan Spiegel from Cedars-Sinai Medical Centre in Los Angeles outlined a new hypothesis as to why some people suffer from IBS.IBS affects ap…", "url": "https://www.indy100.com/science-tech/ibs-gravity-intolerance-hypothesis", "urlToImage": "https://www.indy100.com/media-library/woman-having-stomach-pain.jpg?id=28069321&width=1200&height=600&coordinates=0%2C463%2C0%2C687", "publishedAt": "2023-06-12T14:28:36Z", "content": "A gastroenterologist has argued that irritable bowel syndrome is triggered by the bodys inability to manage gravity.\r\nBrennan Spiegel from Cedars-Sinai Medical Centre in Los Angeles outlined a new hy… [+2485 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Nishad Thaivalappil", "title": "Why Sugar Sweeteners Pose Risks To Your Health And Body Weight - News18", "description": "As per WHO guidelines, using non-sugar sweeteners does not have any long-term benefits for reducing body fat in adults or children", "url": "https://www.news18.com/lifestyle/why-sugar-sweeteners-pose-risks-to-your-health-and-body-weight-8059675.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/06/shutterstock_1492424483-168657716516x9.jpg", "publishedAt": "2023-06-12T13:39:42Z", "content": "In our modern quest for a balanced and healthy lifestyle, the allure of quick fixes and easy solutions often tempts us. One area that has garnered considerable attention is the search for alternative… [+2484 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Annie Lennon", "title": "Nut consumption is linked to better memory and brain blood flow - Medical News Today", "description": "A recent study suggests that people who consume more nuts later in life may improve their memory and brain health.", "url": "https://www.medicalnewstoday.com/articles/could-eating-more-nuts-help-boost-memory-later-in-life", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/06/nut_consumption_GettyImages1171664302_Thumb.jpg", "publishedAt": "2023-06-12T13:30:00Z", "content": "<ul><li>Researchers examined the effects of nut consumption on memory and brain health. </li><li>They found that consuming 60 grams of mixed nuts per day increases verbal memory and blood flow in the… [+4980 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "IL-17 protein plays important role in skin ageing: Study - ThePrint", "description": "Barcelona [Spain], June 12 (ANI): A team of researchers from the Institute for Research in Biomedicine (IRB Barcelona) and the National Centre for Genomic Analysis (CNAG) determined that the IL-17 protein is important in skin ageing. Dr. Guiomar Solanas, Dr. …", "url": "https://theprint.in/health/il-17-protein-plays-important-role-in-skin-ageing-study/1624268/", "urlToImage": null, "publishedAt": "2023-06-12T13:15:07Z", "content": "Barcelona [Spain], June 12 (ANI): A team of researchers from the Institute for Research in Biomedicine (IRB Barcelona) and the National Centre for Genomic Analysis (CNAG) determined that the IL-17 pr… [+3800 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Polygenic risk scores may enhance detection of colorectal cancer - ThePrint", "description": "Glasgow [UK], June 12 (ANI): Despite the broad acceptance of screening initiatives in several high-income European nations, colorectal cancer rates remain high. Most people are screened starting at the same age in these initiatives, which tend to utilise a on…", "url": "https://theprint.in/health/polygenic-risk-scores-may-enhance-detection-of-colorectal-cancer/1624256/", "urlToImage": null, "publishedAt": "2023-06-12T13:13:53Z", "content": "Glasgow [UK], June 12 (ANI): Despite the broad acceptance of screening initiatives in several high-income European nations, colorectal cancer rates remain high. Most people are screened starting at t… [+4688 chars]"}, {"source": {"id": null, "name": "Dnpindia.in"}, "author": "Pooja Singh, Pooja Singh", "title": "Top 5 facts about PCOS you should know - DNP INDIA ", "description": "To bridge the knowledge gap surrounding this lifelong health condition here are five significant facts to help understand PCOS", "url": "https://www.dnpindia.in/current-affairs/helth/top-5-facts-about-pcos-you-should-know/245988/", "urlToImage": "https://www.dnpindia.in/wp-content/uploads/2023/06/PCOSS.webp", "publishedAt": "2023-06-12T13:10:01Z", "content": "PCOS only affects 10% of women of reproductive age, still it is a disorder that many women are not very familiar or known with. One might not believe that PCOS symptoms might affect fertility and som… [+2149 chars]"}, {"source": {"id": null, "name": "Longevity.technology"}, "author": "Kyle Umipig", "title": "7 Healthy drinks to boost nitric oxide - Longevity.Technology", "description": "From Pomegranate juice to red wine, these drinks provide several health benefits including natural food sources of nitric oxide.", "url": "https://longevity.technology/lifestyle/7-healthy-drinks-to-boost-nitric-oxide/", "urlToImage": "https://longevity.technology/lifestyle/wp-content/uploads/2023/06/person-drinking-green-tea-in-restaurant_Cr_jennimareephoto_envato.jpg", "publishedAt": "2023-06-12T13:06:44Z", "content": "While our body produces Nitric Oxide (NO), we can also consume foods and drinks with high levels of this molecule. \r\nIn this article, we’ll explore seven drink sources of nitric oxide that you can en… [+7508 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "101 Millions People Have Diabetes In India | 136 Million Pre-diabetic, ICMR Data Finds - moneycontrol", "description": "India now has over 101 million people living with diabetes compared to 70 million people in 2019, as per an ICMR study. The study by the Indian Council of Me...", "url": "https://www.youtube.com/watch?v=QMXG2G8xZF0", "urlToImage": "https://i.ytimg.com/vi/QMXG2G8xZF0/maxresdefault.jpg", "publishedAt": "2023-06-12T13:00:17Z", "content": null}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Metformin may reduce risk for long COVID among adults with obesity - Healio", "description": "Adults with overweight or obesity who received metformin shortly after a COVID-19 diagnosis had a lower risk for developing long COVID than those receiving placebo, according to study data.\n&ldquo;Early outpatient COVID-19 treatment with metformin decreased t…", "url": "https://www.healio.com/news/endocrinology/20230612/metformin-may-reduce-risk-for-long-covid-among-adults-with-obesity", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/fm_im/c/covid-19-test-tube-being-held-by-someone.jpeg", "publishedAt": "2023-06-12T12:43:25Z", "content": "Key takeaways:\r\n<ul><li>Adults who received metformin after being diagnosed with COVID-19 had a reduced risk for developing long COVID.</li><li>Ivermectin and fluvoxamine were not associated with a r… [+3708 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Diet Tracking Essential Element For Effective Weight Loss: Study - Zee News", "description": "Children Who Volunteer Are Less Likely To Have Anxiety, Depression: Study Researchers and developers are seeking ways to make the tracking process less burdensome, because as Pagoto says, for a lot of programs, users may feel like they need to count calories …", "url": "https://zeenews.india.com/health/diet-tracking-essential-element-for-effective-weight-loss-study-2620779", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/06/12/1218800-diet-tracking.jpg", "publishedAt": "2023-06-12T12:38:33Z", "content": "It is hard and difficult to maintain over time to keep track of everything you consume in a day. Sadly, a recent study shows that diligent tracking is an essential element for effective weight loss. … [+5912 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "Jamun Health Benefits: 5 Reasons To Eat Black Plums in Summer - The Quint FIT", "description": "Jamun, also known as black plums are of two types. There are various health benefits of eating Jamun. Check the benefits in detail below", "url": "https://www.thequint.com/fit/jamun-health-benefits-5-reasons-to-eat-black-plums-in-summer", "urlToImage": "https://images.thequint.com/thequint%2F2023-06%2Fc1ca8212-91b9-4cae-848a-ff90949ae690%2Fjamun_or_black_plum_in_a_bowl_with_leaves_isolated_on_white_wooden_background_with_copy_space_jpg_s_.jpg", "publishedAt": "2023-06-12T12:30:48Z", "content": "Jamun is a tiny healthy and nutritious fruit that is rich in various nutrients namely- antioxidants, calcium, phosphorus, and flavonoids. It also contains other nutrients like sodium, thiamine, ribof… [+586 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "This is what happens when you consume oats in breakfast every morning - Indiatimes.com", "description": "In recent years, oats have gained popularity as a nutritious and healthy breakfast option. Packed with essential nutrients, oats provide numerous benefits when consumed regularly. Incorporating oats into your morning routine can have a remarkable impact on yo…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/this-is-what-happens-when-you-consume-oats-in-breakfast-every-morning/photostory/100941156.cms", "urlToImage": "https://static.toiimg.com/photo/100941176.cms", "publishedAt": "2023-06-12T12:30:00Z", "content": "Oats are not only a great source of fibre but also contain a range of essential nutrients. They are rich in vitamins, minerals, and antioxidants, including manganese, phosphorus, magnesium, and vitam… [+262 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Business Standard", "title": "Strengthen routine immunisation, focus on unvaccinated children: WHO - Business Standard", "description": "The World Health Organisation (WHO) on Monday called for focused efforts to provide life-saving vaccines to nearly 4.6 million unvaccinated children in Southeast Asia as countries intensify efforts to equal or surpass pre-Covid vaccination coverage levels.", "url": "https://www.business-standard.com/world-news/strengthen-routine-immunisation-focus-on-unvaccinated-children-who-123061200547_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-07/12/full/1594529872-4234.jpg", "publishedAt": "2023-06-12T12:08:22Z", "content": "The World Health Organisation (WHO) on Monday called for focused efforts to provide life-saving vaccines to nearly 4.6 million unvaccinated children in Southeast Asia as countries intensify efforts t… [+3425 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Hannah Flynn", "title": "Dementia: Fat composition in menopause may affect cognitive function - Medical News Today", "description": "The composition of fat an individual has around the time of menopause can affect how likely they are to experience cognitive difficulties later in life, a new study suggests.", "url": "https://www.medicalnewstoday.com/articles/healthy-vascular-fat-in-menopause-may-help-protect-against-dementia", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/06/fat_menopause_GettyImages1411272488_Thumb.jpg", "publishedAt": "2023-06-12T11:57:09Z", "content": "<ul><li>Menopause results in changes in a womans hormones, which have many effects on the body, including fat distribution. </li><li>While different types of fat distribution have different effects o… [+6124 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Adolescent binge drinking may cause long-lasting brain changes: Study - Morung Express", "description": "New York, June 12 (IANS) Heavy alcohol consumption may cause permanent dysregulation of neurons, or brain cells, in adolescents, according to a new study in mice.", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2023/06/27712223_1686570743_d2c2a9be1350df22164085729c6d999d.jpg", "publishedAt": "2023-06-12T11:56:21Z", "content": "New York, June 12 (IANS) Heavy alcohol consumption may cause permanent dysregulation of neurons, or brain cells, in adolescents, according to a new study in mice.\r\nThe findings, published in the jour… [+2384 chars]"}, {"source": {"id": null, "name": "Zoomtventertainment.com"}, "author": "Zoom TV Digital", "title": "Robotic Knee Replacement: Myths And Facts You Should Know About This Surgery - Zoom TV", "description": "With the advent of technology, surgical divisions have gained better insights to lead to more successful and accurate surgeries. Technological advancements have brought robotic knee replacement techniques to overpower the conventional Total Knee Replacement s…", "url": "https://www.zoomtventertainment.com/lifestyle/health-fitness/robotic-knee-replacement-myths-and-facts-you-should-know-about-this-surgery-article-100939953", "urlToImage": "https://static.zoomnews.com/thumb/msid-100939953,updatedat-1686570808203,width-1280,height-720,resizemode-75/100939953.jpg", "publishedAt": "2023-06-12T11:53:28Z", "content": "Adipurush Fever! After Ranbir Kapoor, Ananya Birla Pledges To Donate 10,000 Tickets For Prabhas, Kriti Sanon Film"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Tushar Gore", "title": "Testing to prevent heart attack in asymptomatic people: Required, wasteful or dangerous? - The Indian Express", "description": "These tests are not 100 per cent accurate and a positive result does not always mean the individual has the disease. And vice versa. Such tests in asymptomatic individuals are generally not recommended and might even be dangerous, says Dr Tushar Gore", "url": "https://indianexpress.com/article/health-wellness/testing-to-prevent-heart-attack-8659083/", "urlToImage": "https://images.indianexpress.com/2023/06/heartday_1200_getty.jpg", "publishedAt": "2023-06-12T11:39:32Z", "content": "Cardiac health first shows up on the radar as a concern in the middle age, even in asymptomatic individuals. It perhaps reaches the top of mind for short durations upon hearing of someones collapse d… [+8040 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "Monday blues may increase heart attack risk: Study reveals surprising link - Health shots", "description": "Heart attacks are one of the most common diseases that cause mortality. And a study has found that the chances of you getting a heart attack on a Monday is more common. Read on to understand the link.", "url": "https://www.healthshots.com/health-news/monday-blues-may-lead-to-a-heart-attack-know-the-risk/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/06/12163125/heart-attack-risk.jpg", "publishedAt": "2023-06-12T11:30:05Z", "content": "While some people awaken to a fresh start of the week on Monday, others can’t help but despise the dreadful day ahead of the long week! And some even end up in the emergency room. Yes, you heard it r… [+3845 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Try these 5 nuts to lower your bad cholesterol levels - DTNEXT", "description": "Eating a handful of nuts every day, such as almonds, walnuts, peanuts, hazelnuts, and pistachios, may provide amazing advantages like weight loss and blood sugar regulation.", "url": "https://www.dtnext.in/lifestyle/wellbeing/try-these-5-nuts-to-lower-your-bad-cholesterol-levels-718032", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/12/740246-patnajune8socialnewsxyzbiharsdeputychiefministertejashwiyadavonthursdayclaimedthatbjpleaderswerecluelessonhowtocounterastrongoppositionunityinthecountryreactingtobjpclaims20.jpg", "publishedAt": "2023-06-12T11:20:09Z", "content": "NEW DELHI: Nuts are a rich source of vitamins as well as healthy fats, and they also effectively lower levels of harmful cholesterol and improve heart health. Eating a handful of nuts every day, such… [+1612 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "Charushree Chundawat", "title": "7 healthier alternatives to junk food - Zee Business", "description": "Here are some healthy snacks options for work time or evening.", "url": "https://www.zeebiz.com/web-stories/trending/7-healthier-alternatives-to-junk-food-1686566704978", "urlToImage": "https://images1.zeebiz.com/images/ZB-EN/900x1600/2023/6/12/1686566912423_Screenshot20230612161820.png", "publishedAt": "2023-06-12T11:08:05Z", "content": "Fox nuts, or makhanas, are a traditional Indian snack. Makhanas are rich in nutrients and are a highly potent source of manganese, potassium, magnesium, thiamine, protein, and phosphorus."}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: 7 high-fibre foods that can prevent blood sugar spikes - Hindustan Times", "description": "Maintaining stable blood sugar levels is crucial for individuals with diabetes. Here are high-fibre foods that can prevent blood sugar spikes. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-7-high-fibre-foods-that-can-prevent-blood-sugar-spikes-101686567491226.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/12/1600x900/diabetes_1679306736558_1686567557399.jpg", "publishedAt": "2023-06-12T11:05:01Z", "content": "Pandemic is over but the epidemic of chronic diseases is growing fast as pointed by some recent studies. A recent study by ICMR published in the international journal Lancet notes that India has a st… [+3924 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "One pill a day can cut lung cancer deaths by a significant margin - msnNOW", "description": "One pill a day can cut lung cancer deaths by a significant margin", "url": "https://www.msn.com/en-in/news/other/one-pill-a-day-can-cut-lung-cancer-deaths-by-a-significant-margin/ss-AA1cqjmx", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1cqnTD.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-06-12T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "DTNEXT Bureau", "title": "Vaginal Prolapse: Symptoms, treatments and precautions - DTNEXT", "description": "A prolapse occurs when your organs sag or droop from their natural position. When the top of the vagina weakens and collapses into your vaginal canal, this is known as vaginal prolapse.", "url": "https://www.dtnext.in/lifestyle/wellbeing/vaginal-prolapse-symptoms-treatments-and-precautions-718023", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/12/740236-woman.jpg", "publishedAt": "2023-06-12T10:46:55Z", "content": "Dr. Poornima Kinila, Consultant - Obstetrics &amp; Gynecology and Infertility, Aster RV Hospital\r\nCHENNAI: The vagina is one of several organs located in the pelvic region. Muscles and other tissue h… [+3926 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "'Risk factors to be considered for detection of breast cancer' - DTNEXT", "description": "The results of this additional screening were assessed to establish its advantages and disadvantages for patients in a recent study that was just published by Wiley online in CANCER, a...", "url": "https://www.dtnext.in/lifestyle/wellbeing/risk-factors-to-be-considered-for-detection-of-breast-cancer-718021", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/12/740233-nation.jpg", "publishedAt": "2023-06-12T10:36:11Z", "content": "NEW JERSEY: Breast cancer risk factors include dense breast tissue with a larger percentage of fibrous tissue than fat. Dense breast tissue also makes it more challenging to detect cancer on mammogra… [+2765 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kashish Sharma", "title": "Frequent Musculoskeletal Problems? It Could Be Poor Heart Health | TheHealthSite.com - TheHealthSite", "description": "As per a study those with higher cardiovascular risk are 17 times more likely to develop four or more musculoskeletal conditions. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/having-musculoskeletal-problems-poor-heart-health-could-be-a-reason-984487/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/musculoskeletal-symptoms.jpg", "publishedAt": "2023-06-12T10:31:00Z", "content": "Cardiovascular diseases increase inflammation in the body and this can contribute to the development of issues in muscles, bones and joints.\r\nAs per a study, those with higher cardiovascular risk are… [+3060 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "10 rare heart conditions you might not have heard of - Times of India", "description": "​Heart is prone to several complications and we only know the common ones. There are several cardiovascular complications which we do not know about and there is a need to know about these because having a preliminary idea about these can help you in getting …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/10-rare-heart-conditions-you-might-not-have-heard-of/photostory/100936121.cms", "urlToImage": "https://static.toiimg.com/photo/100936231.cms", "publishedAt": "2023-06-12T10:30:00Z", "content": "Another rare heart disease, the Kawasaki disease, happens due to inflammation of the coronary arteries. It is mostly seen in children and the typical symptoms of this disease are high fever, swollen … [+131 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Good Carbs To Vitamin D-rich Foods Women Must Consume To Elevate Mood And Health - News18", "description": "Women frequently overlook their own needs while attending to their families and other commitments.", "url": "https://www.news18.com/lifestyle/good-carbs-to-vitamin-d-rich-foods-women-must-consume-to-elevate-mood-and-health-8059597.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/06/untitled-design-2023-06-12t154905.541-168656515416x9.jpg", "publishedAt": "2023-06-12T10:20:00Z", "content": "Our eating choices have a significant impact on both our mental and overall health. Women frequently neglect their own needs in favour of caring for their families and children. They, then, experienc… [+1677 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "How To Lose 5 Pounds in 2 Weeks, According to People Who Did It - Eat This, Not That", "description": "People on TikTok share their tried and true tips that helped them lose five pounds in two weeks. Experts weigh in on these healthy habits.", "url": "https://www.eatthis.com/lose-five-pounds-in-two-weeks-tips/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/06/mature-man-happy-weight-loss.jpg?quality=82&strip=all", "publishedAt": "2023-06-12T10:01:02Z", "content": "When you're trying to slim down and get into shape, it's always especially motivating to see what healthy hacks worked for individuals who lost the same amount of weight as you'd like to. Weight loss… [+5780 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Gender Disparities in Hypertensive Emergency Admissions: A National Retrospective Cohort Study - Cureus", "description": "Background\n\nHypertension is one of the most common conditions affecting almost one in every five adults globally and hypertensive emergency is a life-threatening complication of uncontrolled hypertension leading to significant disability. Despite advances in …", "url": "https://www.cureus.com/articles/161406-gender-disparities-in-hypertensive-emergency-admissions-a-national-retrospective-cohort-study?score_article=true", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_0.png", "publishedAt": "2023-06-12T09:54:11Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "11 More Highlights From Digestive Disease Week 2023 Part 2 - Medscape", "description": "Dr David Johnson offers yet more practice-changing observations from this year's meeting, which featured an abundance of data on novel treatments and new rev...", "url": "https://www.youtube.com/watch?v=4QJc63sVOis", "urlToImage": "https://i.ytimg.com/vi/4QJc63sVOis/hqdefault.jpg", "publishedAt": "2023-06-12T09:30:01Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "Kanakanjali Roy", "title": "'Ideal Time To Eat Cheat Meal Is...': Expert Suggested Weight Loss Tips You Should Follow | HealthBeat - Times Now", "description": "It is not necessary that if some lifestyle changes have worked for someone, it will be the same for everyone. Well, no matter what, the journey of losing weight is healthy and very beneficial for your health, as it involves consuming a balanced diet and a hea…", "url": "https://www.timesnownews.com/lifestyle/ideal-time-to-eat-cheat-meal-is-expert-suggested-weight-loss-tips-you-should-follow-for-best-results-article-100934137", "urlToImage": "https://static.tnn.in/thumb/msid-100934137,updatedat-1686559379356,width-1280,height-720,resizemode-75/100934137.jpg", "publishedAt": "2023-06-12T08:42:59Z", "content": "Krishna Bhatt, Vedant Sarda Wedding Reception: Sunny Leone, Bobby Deol, Mahesh Bhatt And More Arrive In Style"}, {"source": {"id": null, "name": "Marketscreener.com"}, "author": null, "title": "New Study Shows That 84% of People With Diabetes Struggle With Mental Health1 - Marketscreener.com", "description": "To honour the strength of the diabetes community, Dexcom to host uplifting Puppy Yoga Event in London with Roxy Horner and Henry Slade\n\n\n\nNew research from Dexcom shows that 84% of people agree that... | June 12,  2023", "url": "https://www.marketscreener.com/quote/stock/DEXCOM-INC-9115/news/New-Study-Shows-That-84-of-People-With-Diabetes-Struggle-With-Mental-Health1-44089938/", "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png", "publishedAt": "2023-06-12T08:01:02Z", "content": "As the UK marks the start of Diabetes Awareness Week, a new study reveals 84% of people surveyed agree having diabetes can negatively impact mental health.1 The study, commissioned by DexCom, Inc. (N… [+4279 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Yoga Burn Reviews – This 12 week Yoga Burn - Deccan Herald", "description": "The Yoga Burn is an advanced Yoga exercise for women with rich results which promotes a healthy weight loss program with easy instructions. This yoga workout is designed by “Zoe Bray Cotton,” a known certified yoga Instructor from the US. Yoga Burn Introducti…", "url": "https://www.deccanherald.com/brandspot/sponsored/yoga-burn-reviews-this-12-week-yoga-burn-1227072.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Picture17-1227072-1686554970.jpg", "publishedAt": "2023-06-12T07:29:30Z", "content": "The Yoga Burn is an advanced Yoga exercise for women with rich results which promotes a healthy weight loss program with easy instructions. This yoga workout is designed by Zoe Bray Cotton, a known c… [+19086 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "397", "title": "10 Herbs that help reduce menstrual pain - India TV News", "description": "Menstrual cramps are extremely painful as any girl would tell you and popping pills for it every time is not the solution. So, here is a list of some herbs that can help reduce the pain from menstrual cramps naturally. at India TV News", "url": "https://www.indiatvnews.com/web-stories/health/10-herbs-that-help-reduce-menstrual-pain-2023-06-12-875540", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1080_-/2023/06/menstrual-cramps-1686549738.jpg", "publishedAt": "2023-06-12T07:25:38Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Garg", "title": "Weight Loss: How to Drop Kilos Without Gym? - India.com", "description": "Follow these simple weight loss tips to shed those extra pounds without going to the gym -", "url": "https://www.india.com/webstories/lifestyle/weight-loss-how-to-drop-kilos-without-gym-6105371/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/06/Weight-Loss-Tips-1-1.jpeg", "publishedAt": "2023-06-12T07:01:48Z", "content": "It's critical to understand the significance of a healthy diet, exercise routine, and lifestyle to reduce or maintain weight.\r\nRefrain from bad habits like consuming alcohol, smoking, and substance u… [+535 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "All things vitamin B: Its function, types, sources, and how a deficiency can negatively impact the body - The Indian Express", "description": "“B vitamins hold significant importance for our overall well-being. They play a crucial role in facilitating the body's energy production and metabolism from the food we consume,” Dr Payal Chaudhary, Senior Consultant, Obstetrics and Gynaecology, Rosewalk Hea…", "url": "https://indianexpress.com/article/lifestyle/health/vitamin-b-function-types-sources-health-benefits-8642672/", "urlToImage": "https://images.indianexpress.com/2023/06/vitamin-B.jpg", "publishedAt": "2023-06-12T07:00:54Z", "content": "Pregnant women are often prescribed folate, a type of vitamin B, while patients who have undergone surgeries along with those experiencing fatigue are given vitamin B supplements. Similarly, biotin (… [+5813 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "8 things you should never apply under your eyes - Health shots", "description": "The under-eye area is quite sensitive, so you should be careful while applying skin care products. In fact, there are some ingredients that you should never apply under your eyes.", "url": "https://www.healthshots.com/beauty/skin-care/tips-for-under-eye-area-avoid-these-ingredients/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/06/12120638/undereye.jpg", "publishedAt": "2023-06-12T06:39:09Z", "content": "We all have a skin care routine. Some might include more products in their skin care regime and others might just stick to three or four products. If skin is dry, we look for moisturizing products. I… [+4705 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Can drinking milk protect you from diabetes? Here's what you need to know - Hindustan Times", "description": "A recent research highlights role of milk and dairy products in decreasing risk of developing diabetes. Here’s all you want to know. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/can-drinking-milk-protect-you-from-diabetes-heres-what-you-need-to-know-101686549200299.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/12/1600x900/_817e905e-a446-11e8-8a41-d1a200222336_1686549240576.jpg", "publishedAt": "2023-06-12T06:00:13Z", "content": "People with diabetes have to be very careful while designing their diets as it may affect their blood sugar levels. Milk is usually considered a crucial part of our diet being high on protein, calciu… [+3007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Nutrition alert: A ripe guava (100 grams) contains… - msnNOW", "description": "\"Guava is low in saturated fat and cholesterol while being rich in dietary fiber and potassium, which contribute to a healthy heart,\" said Dr G Sushma Consultant Clinical Dietician, CARE Hospitals, Banjara Hills, Hyderabad", "url": "https://indianexpress.com/article/lifestyle/health/amrood-nutrition-value-guava-vitamin-c-powehouse-aids-weight-loss-8654299/?utm_source=msn&amp;utm_medium=Referral", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1cqCsh.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-06-12T05:01:48Z", "content": "© Provided by The Indian Express\r\n Guava has a low glycemic index and is high in fiber content. It can help regulate blood sugar levels\r\nGuava has a low glycemic index and is high in fiber content. I… [+5007 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Long COVID could be caused by the virus lingering in the body: Study - EastMojo", "description": "While most people survive and recover from COVID, for some people symptoms can persist for months or years. When symptoms last longer than 12 weeks, the condition is known as long COVID.", "url": "http://www.eastmojo.com/science-tech/2023/06/12/long-covid-could-be-caused-by-the-virus-lingering-in-the-body-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/Untitled-design-7.png?fit=1920%2C1080&ssl=1", "publishedAt": "2023-06-12T04:50:00Z", "content": "While most people survive and recover from COVID, for some people symptoms can persist for months or years. When symptoms last longer than 12 weeks, the condition is known as long COVID.\r\nLong COVID … [+7326 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prithvijit Mitra", "title": "‘Number of young heart patients rises in Kolkata’ - Indiatimes.com", "description": "A growing number of youngsters in Kolkata are developing cardiac issues, sometimes leading to a sudden heart attack and death, say city cardiologists.", "url": "https://timesofindia.indiatimes.com/city/kolkata/number-of-young-heart-patients-rises-in-city/articleshow/100925419.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100928758,width-1070,height-580,imgsize-1516920,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-12T02:48:00Z", "content": "Rahul Gandhi slams BJP, RSS for dwelling in the past, blaming others"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "El Nino rains behind Peru's worst dengue outbreak ever, over 130,000 cases recorded | Mint - Mint", "description": "Peru is experiencing its worst dengue outbreak ever, with over 130,000 cases and a death toll exceeding 200 due to El Niño's heavy rainfall creating breeding grounds for mosquitoes.", "url": "https://www.livemint.com/news/world/el-nino-rains-behind-perus-worst-dengue-outbreak-ever-over-130-000-cases-recorded-11686531863463.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/06/12/600x338/peru_1686534339991_1686534351228.webp", "publishedAt": "2023-06-12T01:48:01Z", "content": "Peru is currently grappling with its most severe dengue outbreak on record, which is expected to worsen due to the presence of the El Niño climate phenomenon bringing heavy rainfall. The country's he… [+2011 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Robert Abraham", "title": "Experts: Nearly 50% of Chandigarh residents may have underlying non-alcoholic fatty liver disease - Hindustan Times", "description": "The disease is characterised by the accumulation of excessive fat in the liver, unrelated to significant alcohol consumption or other liver diseases", "url": "https://www.hindustantimes.com/cities/chandigarh-news/alarming-statistic-reveals-nearly-half-of-chandigarh-s-population-may-have-non-alcoholic-fatty-liver-disease-101686514128778.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/11/1600x900/A-recent-meta-analysis-from-India-has-shown-the-pr_1686514114984.jpg", "publishedAt": "2023-06-11T20:08:48Z", "content": "A concerning situation regarding non-alcoholic fatty liver disease (NAFLD) in the City Beautiful has been revealed by Dr Arka De, assistant professor at the department of hepatology, PGIMER, Chandiga… [+2652 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study finds cells linking chronic psychological stress to inflammatory bowel disease - ThePrint", "description": "Pennsylvania [US], June 11 (ANI): According to a study from the University of Pennsylvania’s Perelman School of Medicine, cells that are connected to the relationship between stress reactions in the brain and inflammation in the gastrointestinal (GI) tract ha…", "url": "https://theprint.in/science/study-finds-cells-linking-chronic-psychological-stress-to-inflammatory-bowel-disease/1623412/", "urlToImage": null, "publishedAt": "2023-06-11T16:13:40Z", "content": "Pennsylvania [US], June 11 (ANI): According to a study from the University of Pennsylvania’s Perelman School of Medicine, cells that are connected to the relationship between stress reactions in the … [+3157 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers reveal how blood biomarkers, genomics predict common disease risk - ThePrint", "description": "Glasgow [UK], June 11 (ANI): It is possible to target individuals with chronic illness risk factors with preventative interventions before they get ill. Research presented at the annual conference of the European Society of Human Genetics suggested that combi…", "url": "https://theprint.in/science/researchers-reveal-how-blood-biomarkers-genomics-predict-common-disease-risk/1623410/", "urlToImage": null, "publishedAt": "2023-06-11T16:13:30Z", "content": "Glasgow [UK], June 11 (ANI): It is possible to target individuals with chronic illness risk factors with preventative interventions before they get ill.\r\nResearch presented at the annual conference o… [+3177 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Love snacking on mangoes? Beware of stomach infections due to its excessive consumption - India TV News", "description": "Check out these possible causes and health expert-backed preventive measures related to stomach infections due to eating mangoes in summer.", "url": "https://www.indiatvnews.com/health/love-snacking-on-mangoes-beware-of-stomach-infections-due-to-its-excessive-consumption-2023-06-11-875476", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/06/qwsdddddddddddddwsdass-1686496358.jpg", "publishedAt": "2023-06-11T15:21:52Z", "content": "Totapuri, Alphonso, Sidhura, Langra and many more, the season of mangoes is here! the King of the fruit is loved by all. Every year, we wait for the summer just to savour the delicious mangoes.While … [+2952 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Worm genetics reveals key sleep-regulation pathways: Study - ETHealthWorld", "description": "According to a recent study published in 'Cell Reports,' the body regulates sleep in worms through cellular pathways that ensure optimal protein function from synthesis to breakdown. It can be difficult to know where to begin when studying the body's sleep re…", "url": "https://health.economictimes.indiatimes.com/news/industry/worm-genetics-reveals-key-sleep-regulation-pathways-study/100917804", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100917804,imgsize-13732,width-1200,height=765,overlay-ethealth/industry/worm-genetics-reveals-key-sleep-regulation-pathways-study.jpg", "publishedAt": "2023-06-11T13:15:31Z", "content": "Washington: Although the brain is thought to regulate sleep-how much, when, and how much sleep occurs-sleep deprivation affects the body, and body signals can affect sleep. The mechanisms that the bo… [+2381 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "How Is Stress And Headache Related To Brain Tumours? Check Expert Guide - Zee News", "description": "benign and malignant. Malignant tumours can be further categorized as primary, originating within the brain, or secondary, which are metastatic and come from other parts of the body. Furthermore, brain tumours can also be classified based on their location wi…", "url": "https://zeenews.india.com/health/how-is-stress-and-headache-related-to-brain-tumours-check-expert-guide-2620381", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/06/11/1218087-headaches.png", "publishedAt": "2023-06-11T11:37:55Z", "content": "A brain tumour can cause inflammation and tissue damage by raising the pressure inside the skull. One typical sign of brain tumours is severe, ongoing headaches. However, the majority of headaches ar… [+3098 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Deepali Verma", "title": "Is Gluten-Free Healthy? 5 Nutrition Myths Busted - Slurrp", "description": "Learn the facts about nutrition and clarify the myths. This article includes helpful ideas to help you make informed choices regarding your diet and general health, from addressing the myths to studying the reality of superfoods.", "url": "https://www.slurrp.com/article/is-gluten-free-healthy-5-nutrition-myths-busted-1686481405369", "urlToImage": "https://images.slurrp.com/prodarticles/81hx8g77hua.webp", "publishedAt": "2023-06-11T11:03:44Z", "content": "Shonali Sabherwal, a nutritionist, recently posted on her Instagram account a series of debunked illusions about various aspects of nutrition.   \r\nEverybody needs supplements: Just remember everythin… [+178 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "High Cholesterol Symptoms That May Appear On Your Legs And Feet | TheHealthSite.com - TheHealthSite", "description": "Check out these symptoms of high cholesterol that can show up on your legs and feet. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/10-high-cholesterol-symptoms-that-may-appear-on-your-legs-and-feet-984253/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/High-Cholesterol-4.jpg", "publishedAt": "2023-06-11T08:03:00Z", "content": "High Cholesterol Symptoms\r\nCheck out these symptoms of high cholesterol that can show up on your legs and feet.\r\nHigh cholesterol is often referred to as a 'silent killer' because, unlike other healt… [+4496 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "At 35, this tennis player suffered a brain stroke. But with timely intervention, he can now walk and relearn words - The Indian Express", "description": "'We could save Aakash because we treated him within the golden hour. Lipids are deposited along our blood vessels and with vigorous activity, the fat cluster may dislodge, travel to the brain and block the artery,' says Dr Mukesh Sharma, Director of Neuro-int…", "url": "https://indianexpress.com/article/health-wellness/35-year-old-tennis-player-collapsed-rare-brain-stroke-survivor-walk-relearn-words-8654965/", "urlToImage": "https://images.indianexpress.com/2023/06/brain-stroke-illustration-3_1.jpg", "publishedAt": "2023-06-11T01:00:03Z", "content": "Thirty-five-year old Aakash Batras* world stopped at precisely 9.45 am on the third Friday in February. He was reviewing the days game with his tennis coach when he suddenly slurred, lost his speech … [+6281 chars]"}, {"source": {"id": null, "name": "The Herald"}, "author": "The Herald", "title": "Fitness check: Insulin resistance - The Herald", "description": "", "url": "https://www.herald.co.zw/fitness-check-insulin-resistance/", "urlToImage": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/Insulin.jpg", "publishedAt": "2023-06-09T22:04:02Z", "content": "Coach Kelly Fitness Correspondent\r\nInsulin is a hormone that allows glucose to enter cells in the body for use as energy and also reduces blood glucose (blood sugar).\r\nInsulin is released by the panc… [+4051 chars]"}]}