{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Erin Hunter, Assistant Editor", "title": "People With Epilepsy May Have Mechanisms Within Their Brain to Reduce Epileptic Activity - Pharmacy Times", "description": "These patients have slow brain wave activity during wakefulness, which can reduce the firing of nerve cells to protect against the pathology of epilepsy.", "url": "https://www.pharmacytimes.com/view/people-with-epilepsy-may-have-mechanisms-within-their-brain-to-reduce-epileptic-activity", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/94e7ec981b4e6235c67f4ebfde20d9a3e41c9d04-5000x3863.jpg?fit=crop&auto=format", "publishedAt": "2023-12-05T20:15:58Z", "content": "Researchers discovered that the brains of people with epilepsy might have a mechanism for reducing risk of epileptic activity, according to investigators at University College London who published th… [+3027 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Nina Shapiro", "title": "Newly Recognized Syndrome Linked To Prenatal Fentanyl Exposure - Forbes", "description": "A recently identified cluster of newborn infants with multiple congenital abnormalities has been linked to maternal exposure to fentanyl during pregnancy.", "url": "https://www.forbes.com/sites/ninashapiro/2023/12/05/newly-recognized-syndrome-linked-to-prenatal-fentanyl-exposure/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/656f6a34ae1accb14f173ad2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2023-12-05T20:09:59Z", "content": "Newborn with cleft lip and palate.\r\ngetty\r\nA recently identified cluster of newborn infants with multiple congenital abnormalities has been linked to maternal exposure to fentanyl during pregnancy. T… [+3300 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study exploits biomolecular condensates to inhibit androgen receptor in prostate cancer - News-Medical.Net", "description": "Transcription factors play essential roles in turning the genetic information encoded in genes into proteins in all cells and organisms.", "url": "https://www.news-medical.net/news/20231205/Study-exploits-biomolecular-condensates-to-inhibit-androgen-receptor-in-prostate-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/12/shutterstock_369113957_e355e5336cc14dc19d0c66522344e34a-620x480.jpg", "publishedAt": "2023-12-05T19:20:00Z", "content": "Transcription factors play essential roles in turning the genetic information encoded in genes into proteins in all cells and organisms. These regulatory proteins bind DNA, turn genes on or off, and … [+5095 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Revolutionary gene therapy shows promise in treating autism - Earth.com", "description": "The research marks a significant step in the treatment of autism spectrum disorder (ASD) through genetic base editing", "url": "https://www.earth.com/news/revolutionary-gene-therapy-shows-promise-in-treating-autism/", "urlToImage": "https://cff2.earth.com/uploads/2023/12/05121845/Autism-scaled.jpg", "publishedAt": "2023-12-05T19:19:35Z", "content": "Chinese scientists have achieved a major advancement in gene therapy for autism, as reported in the journal Nature Neuroscience. This innovative therapy, developed by a research team in Shanghai, has… [+3978 chars]"}, {"source": {"id": null, "name": "Contemporarypediatrics.com"}, "author": "Gary Marshall, MD", "title": "Critical Role of Children in Influenza Transmission - Contemporary Pediatrics", "description": "Gary Marshall, MD, discusses the critical role that children play in influenza transmission.", "url": "https://www.contemporarypediatrics.com/view/critical-role-of-children-in-influenza-transmission", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contpeds/89ef8fde9ef5b268af901e10da4a26883cd0d9b8-1291x724.png?fit=crop&auto=format", "publishedAt": "2023-12-05T19:18:52Z", "content": "This is a video synopsis discussion involving Gary Marshall, MD:\r\nChildren, especially school-aged children, play a critical role in driving seasonal influenza epidemics through transmission of the v… [+1269 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "IANS", "title": "New wearable device can send health data up to 24 km farther than Wi-Fi - greaterkashmir - Greater Kashmir", "description": "New York, Dec 5: A group of researchers has developed a wearable monitoring device system that can send health data up to 24 kms much…", "url": "https://www.greaterkashmir.com/latest-news/new-wearable-device-can-send-health-data-up-to-24-km-farther-than-wi-fi/", "urlToImage": "https://www.greaterkashmir.com/wp-content/uploads/2023/08/nurse-technology.jpg", "publishedAt": "2023-12-05T19:15:11Z", "content": "New York, Dec 5: A group of researchers has developed a wearable monitoring device system that can send health data up to 24 kms much farther than Wi-Fi or Bluetooth systems can without any significa… [+1462 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "20% of \"living\" patients in California are actually dead, wasting healthcare resources - News-Medical.Net", "description": "About 20 % of patients whose medical records showed them as being alive with a serious illness were in fact deceased according to California data, leading to hundreds of unnecessary interactions such as appointment reminders, prescription refills and other ki…", "url": "https://www.news-medical.net/news/20231205/2025-of-living-patients-in-California-are-actually-dead-wasting-healthcare-resources.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Electronic_Health_Record-620x480.jpg", "publishedAt": "2023-12-05T19:11:00Z", "content": "About 20 % of patients whose medical records showed them as being alive with a serious illness were in fact deceased according to California data, leading to hundreds of unnecessary interactions such… [+3772 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Erin Hunter, Assistant Editor", "title": "Long-term Chia Seed Supplementation May Significantly Lower Systolic Blood Pressure - Pharmacy Times", "description": "Chia seeds are a nutrient dense product that are rich in fiber and omega-3 fatty acids, and could have a hypocholesterolemic effect when ingested.", "url": "https://www.pharmacytimes.com/view/long-term-chia-seed-supplementation-may-significantly-lower-systolic-blood-pressure", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/926b37834316aa40f0b8b2d8e66300ff22df948e-6000x4000.jpg?fit=crop&auto=format", "publishedAt": "2023-12-05T19:00:30Z", "content": "Chia seed supplementation was associated with significant improvement in certain metabolic health factors, according to a recent systematic review and meta-analysis of more than a dozen randomized cl… [+3464 chars]"}, {"source": {"id": null, "name": "Apdaparkinson.org"}, "author": "Phil Franchina", "title": "Questions on Urinary Dysfunction & Parkinson's | APDA - American Parkinson Disease Association", "description": "Dr. Gilbert answers questions regarding urinary dysfunction and incontinence that we didn't have time to answer during the Dr. Gilbert Hosts broadcast in August.", "url": "https://www.apdaparkinson.org/article/qs-urinary-dysfunction-parkinsons-disease/", "urlToImage": "https://d2icp22po6iej.cloudfront.net/wp-content/uploads/2023/12/urinary-issues-toliet-paper--scaled.jpeg", "publishedAt": "2023-12-05T18:46:11Z", "content": "On a recent episode of APDAs Dr. Gilbert Hosts, I spoke with Dr. Victor Nitti, a urologist with expertise in Parkinsons disease (PD). We covered a lot of ground during the broadcast and answered ques… [+8645 chars]"}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Study: School air sampling worked as well as other methods in tracking COVID, flu - University of Minnesota Twin Cities", "description": null, "url": "https://www.cidrap.umn.edu/covid-19/study-school-air-sampling-worked-well-other-methods-tracking-covid-flu", "urlToImage": "https://www.cidrap.umn.edu/sites/default/files/styles/layout_large/public/article/Girl%20raising%20hand.jpg?itok=IuC7H-Ni", "publishedAt": "2023-12-05T18:31:39Z", "content": null}, {"source": {"id": null, "name": "WebMD"}, "author": "Lisa O’Mary", "title": "Varied Length of Sleep Linked to Decline in Thinking Skills: Study - WebMD", "description": "Older people who don’t sleep the same amount of time each night may have a higher risk of problems with their thinking skills as they age, according to new research.", "url": "https://www.webmd.com/sleep-disorders/news/20231205/variability-sleep-duration-cognitive-decline-study", "urlToImage": "https://img.wbmdstatic.com/vim/live/webmd/consumer_assets/site_images/articles/health_tools/find_emotional_support_for_differentiated_thyroid_cancer_slideshow/1800ss_getty_rf_man_with_insomnia.jpg", "publishedAt": "2023-12-05T18:22:08Z", "content": "Dec. 5, 2023 Older people who dont sleep the same amount of time each night may have a higher risk of problems with their thinking skills as they age, according to new research.\r\nIts the first study … [+2096 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Shanice Harris", "title": "New study suggests more US lives could have been saved by authorizing COVID-19 booster sooner - Medical Xpress", "description": "A new Northwestern University study—led by Bernard Black of Northwestern's Pritzker School of Law and Kellogg School of Management—suggests that the U.S. could have saved many lives by authorizing a COVID-19 booster dose sooner, along with stronger public hea…", "url": "https://medicalxpress.com/news/2023-12-authorizing-covid-booster-sooner.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/covid-19-booster.jpg", "publishedAt": "2023-12-05T18:10:19Z", "content": "A new Northwestern University studyled by Bernard Black of Northwestern's Pritzker School of Law and Kellogg School of Managementsuggests that the U.S. could have saved many lives by authorizing a CO… [+4228 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Elana Gotkine", "title": "Albuminuria reduction accounts for much of finerenone effect on CKD - Medical Xpress", "description": "For patients with chronic kidney disease (CKD) and type 2 diabetes, early albuminuria reduction accounts for a large proportion of the treatment effect of finerenone against CKD progression, according to a study published online Dec. 5 in the Annals of Intern…", "url": "https://medicalxpress.com/news/2023-12-albuminuria-reduction-accounts-finerenone-effect.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/kidneys.jpg", "publishedAt": "2023-12-05T18:02:41Z", "content": "For patients with chronic kidney disease (CKD) and type 2 diabetes, early albuminuria reduction accounts for a large proportion of the treatment effect of finerenone against CKD progression, accordin… [+2074 chars]"}, {"source": {"id": null, "name": "Contemporarypediatrics.com"}, "author": "Killian Meara", "title": "Continuous glucose monitors ease care for parents of young children with T1D - Contemporary Pediatrics", "description": "Continuous glucose monitors have been found to improve sleep for parents of young children with type 1 diabetes and may help alleviate the care burden associated with the condition, according to a study conducted in France.", "url": "https://www.contemporarypediatrics.com/view/continuous-glucose-monitors-ease-care-for-parents-of-young-children-with-t1d", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contpeds/ccf74c71f9e39c798a6aed93e9c298ee87dce1db-4860x3644.jpg?fit=crop&auto=format", "publishedAt": "2023-12-05T17:42:56Z", "content": "Takeaways\r\n<ul><li>Continuous glucose monitors (CGMs) reduce the burden of care for families with young children with type 1 diabetes.</li><li>Glycemic control for children under 6 with type 1 diabet… [+3879 chars]"}, {"source": {"id": null, "name": "OncLive"}, "author": "Gladys Giron, MD, FACS, Cristina Lopez-Peñalver, MD", "title": "Reviewing Best Practices in the Surgical Management of Breast Cancer: Post-Surgery Outcomes in Stage IV Disease - OncLive", "description": "In this final episode of OncChats: Reviewing Best Practices in the Surgical Management of Breast Cancer, Gladys Giron, MD, FACS, and Cristina Lopez-Peñalver, MD, shed light on clinical outcomes following surgery of the primary tumor in patients with stage IV …", "url": "https://www.onclive.com/view/reviewing-best-practices-in-the-surgical-management-of-breast-cancer-post-surgery-outcomes-in-stage-iv-disease", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/onclive/e230a74dbf210664ffdd0190c40c3bc511442b81-1241x662.png?fit=crop&auto=format", "publishedAt": "2023-12-05T17:04:40Z", "content": "In this final episode of OncChats: Reviewing Best Practices in the Surgical Management of Breast Cancer, Gladys Giron, MD, FACS, and Cristina Lopez-Peñalver, MD, both of Baptist Health South Florida,… [+2446 chars]"}, {"source": {"id": null, "name": "Mypunepulse.com"}, "author": null, "title": "Benefits of consuming ghee in winter; Check to know more - Pune Pulse", "description": "The country has been hit by a wave of cold weather, and as a result, our immunity is the first to be affected. To combat this, we often include foods in our diet that not only keep us warm but also boost our immunity. One such food is ghee, which is known for…", "url": "https://www.mypunepulse.com/benefits-of-consuming-ghee-in-winter-check-to-know-more/", "urlToImage": "https://www.mypunepulse.com/wp-content/uploads/2023/12/WhatsApp-Image-2023-12-05-at-21.59.37-jpeg.webp", "publishedAt": "2023-12-05T16:59:09Z", "content": "The country has been hit by a wave of cold weather, and as a result, our immunity is the first to be affected. To combat this, we often include foods in our diet that not only keep us warm but also b… [+2495 chars]"}, {"source": {"id": null, "name": "Umich.edu"}, "author": null, "title": "Grandchild’s stillbirth risk linked to grandma’s weight - University of Michigan News", "description": "Research has shown that pregnant women with a body max index of 30 or higher face a greater chance of experiencing a stillbirth compared to pregnant women with a normal BMI.", "url": "https://news.umich.edu/grandchilds-stillbirth-risk-linked-to-grandmas-weight/", "urlToImage": "https://news.umich.edu/wp-content/uploads/mc-image-cache/2023/12/grandchilds-stillbirth-risk-linked-to-grandmas-weight-iStock-949808862.jpg", "publishedAt": "2023-12-05T16:18:12Z", "content": "Study: Grandmaternal body mass index in early pregnancy and risk of grandoffspring stillbirth: A nationwide, three-generation cohort study\r\nResearch has shown that pregnant women with a body max inde… [+2427 chars]"}, {"source": {"id": null, "name": "PharmiWeb.com"}, "author": null, "title": "Obulytix is developing a revolutionary solution for antibiotic resistance - PharmiWeb.com", "description": "Obulytix, a spin-off based on research results from Ghent University and KU Leuven, has built a platform that creates new ways to tackle bacterial infections. The innovative, phage lysin-based platform – leveraging the power of artificial intelligence – attra…", "url": "https://www.pharmiweb.com/press-release/2023-12-05/obulytix-is-developing-a-revolutionary-solution-for-antibiotic-resistance", "urlToImage": "https://cdn.pharmiweb.com/media/1024/1200x448-pwjobs.png", "publishedAt": "2023-12-05T15:54:00Z", "content": "Obulytix, a spin-off based on research results from Ghent University and KU Leuven, has built a platform that creates new ways to tackle bacterial infections. The innovative, phage lysin-based platfo… [+3587 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Ashley Gallagher, Associate Editor", "title": "New Risk Factor Found for Future Cardiovascular Disease in Patients With Systemic Lupus Erythematosus - Pharmacy Times", "description": "Investigators found that positive antiphospholipid antibodies and traditional risk factors were associated with atherosclerotic cardiovascular disease.", "url": "https://www.pharmacytimes.com/view/new-risk-factor-found-for-future-cardiovascular-disease-in-patients-with-systemic-lupus-erythematosus", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/804f419856661b5448f47ba461a2f220a98eae01-5824x3264.jpg?fit=crop&auto=format", "publishedAt": "2023-12-05T15:33:06Z", "content": "Investigators have found a link between positive antiphospholipid antibodies (aPL) and an increase in the risk of future cardiovascular disease (CVC) in individuals with systemic lupus erythematosus … [+3716 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Leslie Tate-Tulane", "title": "Antibiotics combo treats Lyme disease better - Futurity: Research News", "description": "A combination of antibiotics is more effective in treating Lyme disease than the commonly prescribed course of a single antibiotic alone.", "url": "https://www.futurity.org/antibiotics-combo-lyme-disease-3004702/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2023/12/lyme-disease-antibiotics-combo-1600.jpg", "publishedAt": "2023-12-05T15:13:02Z", "content": "A combination of antibiotics is more effective in treating Lyme disease than the commonly prescribed course of one single antibiotic, a new study finds.\r\nThe finding could pave the way for improved L… [+2130 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Trisha Pathak", "title": "7 Foods To Avoid For Staying Fit, Energetic In Winter - WION", "description": "Here are seven foods to avoid to ensure you stay fit and energetic during the winter season:", "url": "https://www.wionews.com/web-stories/trending/7-foods-to-avoid-for-staying-fit-energetic-in-winter-1701786221292", "urlToImage": null, "publishedAt": "2023-12-05T14:43:44Z", "content": "While dairy is a good source of calcium, consuming it in excess during winter can lead to increased mucus production. Consider alternatives like almond or soy milk, or consume dairy in moderation."}, {"source": {"id": null, "name": "Stoptb.org"}, "author": null, "title": "New Report by TAG and Stop TB: TB R&D Funding Perilously Off Track of UN Commitments to End TB by 2030 - Stop TB Partnership", "description": "5 December 2023, New York & Geneva - A new report released today by Treatment Action Group (TAG) and the Stop TB Partnership has found that cumulative funding for tuberculosis (TB) research and", "url": "https://www.stoptb.org/news/new-report-tag-and-stop-tb-tb-rd-funding-perilously-off-track-of-un-commitments-to-end-tb-2030", "urlToImage": null, "publishedAt": "2023-12-05T14:42:24Z", "content": "5 December 2023, New York &amp; Geneva  - A new report released today by Treatment Action Group (TAG) and the Stop TB Partnership has found that cumulative funding for tuberculosis (TB) research and … [+4337 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Kritika Pushkarna", "title": "This is why drinking coconut water is a must in winters - Recipes", "description": "While coconut water is often associated with summers as it is said to have cooling properties, but it can be included in winter routine too. There are several benefits of drinking a glass of coconut water in winter. Take a look at some of them.", "url": "https://recipes.timesofindia.com/web-stories/this-is-why-drinking-coconut-water-is-a-must-in-winters/photostory/105758765.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-105758805,imgsize-48994,width-900,height-1200,resizemode-6/105758805.jpg", "publishedAt": "2023-12-05T14:30:00Z", "content": null}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Blood pressure spikes in pregnancy linked to later heart risks for Hispanic women - UPI News", "description": "Hispanic women who experience spikes in blood pressure while pregnant may also face higher heart risks years later, new research shows.", "url": "https://www.upi.com", "urlToImage": "https://cdnph.upi.com/sv/ph/og/i/3691701785021/2023/1/17017855837176/v1.5/Blood-pressure-spikes-in-pregnancy-linked-to-later-heart-risks-for-Hispanic-women.jpg", "publishedAt": "2023-12-05T14:27:51Z", "content": "Hispanic women who experience spikes in blood pressure while pregnant may also face higher heart risks years later, new research shows.\r\nThese \"hypertensive disorders of pregnancy\" (HDP) -- condition… [+2376 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Beetroot to banana; 5 foods to naturally lower blood pressure - Hindustan Times", "description": "Eating foods rich in magnesium, potassium and antioxidants can naturally lower blood pressure. Here are 5 foods that you must add to your diet this winter.", "url": "https://www.hindustantimes.com/photos/lifestyle/beetroot-to-banana-5-foods-to-naturally-lower-blood-pressure-101701785227497.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/12/05/1600x900/blood_pressure_foods_1701785281954_1701785706861.jpg", "publishedAt": "2023-12-05T14:15:12Z", "content": "Published on Dec 05, 2023 07:45 PM IST\r\nEating foods rich in magnesium, potassium and antioxidants can naturally lower blood pressure. Here are 5 foods that you must add to your diet this winter. ...… [+19 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Researchers develop a blood test to identify individuals at risk of developing Parkinson's disease - Medical Xpress", "description": "Research carried out at Oxford's Nuffield Department of Clinical Neurosciences has led to the development of a new blood-based test to identify the pathology that triggers Parkinson's disease before the main symptoms occur. This could allow clinicians to scre…", "url": "https://medicalxpress.com/news/2023-12-blood-individuals-parkinson-disease.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/blood-test-5.jpg", "publishedAt": "2023-12-05T14:10:29Z", "content": "Research carried out at Oxford's Nuffield Department of Clinical Neurosciences has led to the development of a new blood-based test to identify the pathology that triggers Parkinson's disease before … [+6128 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Dennis Thompson", "title": "Cognitive Decline May Come Earlier for People With Epilepsy - HealthDay", "description": "TUESDAY, Dec. 5, 2023 (HealthDay News) -- People with epilepsy suffer quicker declines in thinking than people without the brain disorder, particularly if they", "url": "https://www.healthday.com/health-news/neurology/cognitive-decline-may-come-earlier-for-people-with-epilepsy", "urlToImage": "https://gumlet.assettype.com/healthday%2Fimport%2F32350045%2Forigin.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100", "publishedAt": "2023-12-05T13:44:21Z", "content": "TUESDAY, Dec. 5, 2023 (HealthDay News) -- People with epilepsy suffer quicker declines in thinking than people without the brain disorder, particularly if they also have risk factors like high blood … [+1921 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Ernie Mundell", "title": "Any Kind of Drug Abuse Treatment Can Help Gay Men Kick Meth Habit - HealthDay", "description": "TUESDAY, Dec. 5, 2023 (HealthDay News) -- Methamphetamine abuse has long plagued the gay community, but a new study finds that any form of substance abuse treat", "url": "https://www.healthday.com/health-news/mental-health/any-kind-of-drug-abuse-treatment-can-help-gay-men-kick-meth-habit", "urlToImage": "https://gumlet.assettype.com/healthday%2Fimport%2F25454525%2Forigin.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100", "publishedAt": "2023-12-05T13:41:53Z", "content": "TUESDAY, Dec. 5, 2023 (HealthDay News) -- Methamphetamine abuse has long plagued the gay community, but a new study finds that any form of substance abuse treatment can help users quit. \r\nIn a news r… [+2338 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Dennis Thompson", "title": "Surgery Helps Kids With Drug-Resistant Epilepsy, But Race Could Hinder Access - HealthDay", "description": "TUESDAY, Dec. 5, 2023 (HealthDay News) -- Black, Hispanic and low-income kids are less likely to receive surgery that can treat their drug-resistant epilepsy, a", "url": "https://www.healthday.com/health-news/neurology/surgery-helps-kids-with-drug-resistant-epilepsy-but-race-could-hinder-access", "urlToImage": "https://gumlet.assettype.com/healthday%2Fimport%2F29701561%2Forigin.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100", "publishedAt": "2023-12-05T13:40:34Z", "content": "TUESDAY, Dec. 5, 2023 (HealthDay News) -- Black, Hispanic and low-income kids are less likely to receive surgery that can treat their drug-resistant epilepsy, a new study finds.\r\nResearchers discover… [+2855 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Japan`s traditional spice Wasabi has potential memory-boosting properties: Study - WION", "description": "Japans traditional spice Wasabi has potential memory-boosting properties: Study", "url": "https://www.wionews.com/world/japans-traditional-spice-wasabi-has-potential-memory-boosting-properties-study-666525", "urlToImage": "https://cdn.wionews.com/sites/default/files/2023/12/05/397409-untitled-design-2023-12-05t171459814.png", "publishedAt": "2023-12-05T13:28:28Z", "content": "The famed Japanese condiment, wasabi, generally served with sushi, is more than just a spicy green paste. Researchers in Japan found that the traditional spice is quite beneficial in improving memory… [+2591 chars]"}, {"source": {"id": null, "name": "News.cn"}, "author": "", "title": "France elevates bird flu alert following farm contamination - Xinhua", "description": "", "url": "https://english.news.cn/20231205/ab557287b980409b96e2e12b95faed56/c.html", "urlToImage": null, "publishedAt": "2023-12-05T13:19:30Z", "content": "PARIS, Dec. 5 (Xinhua) -- France has escalated its alert status for avian influenza from \"moderate\" to \"high\" nationwide after confirming the contamination of a turkey farm by the highly pathogenic a… [+948 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Psoriasis management: Guidelines for safe sun exposure in psoriasis treatment - Hindustan Times", "description": "Undergoing phototherapy for psoriasis management? Here's what you need to know about safe sun exposure in psoriasis treatment | Health", "url": "https://www.hindustantimes.com/lifestyle/health/psoriasis-management-guidelines-for-safe-sun-exposure-in-psoriasis-treatment-101701779713004.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/12/05/1600x900/psoriasis_thumb_1635413424637_1701780271625.jpg", "publishedAt": "2023-12-05T13:03:05Z", "content": "Psoriasis is a chronic skin condition characterised by itchy, scaly patches, commonly found on the knees, elbows, trunk and scalp and while there is no definitive cure for psoriasis, it can be a pers… [+4670 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Sasirekha Peter", "title": "RAD-140 (SARMs) Testolone in Australia Review | Results, Side Effects - Deccan Herald", "description": "Dive into the RAD-140 (SARMs) Testolone review in Australia, exploring results and potential side effects. Gain insights into the use of Testolone for fitness and bodybuilding, helping you make informed decisions about incorporating this SARM into your regimen", "url": "https://www.deccanherald.com/brandspot/featured/rad-140-sarms-testolone-in-australia-review-results-side-effects-2797965", "urlToImage": "https://images.deccanherald.com/deccanherald%2F2023-12%2F37059bfc-5534-400e-af12-1aba1d95a2df%2F13.png?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop", "publishedAt": "2023-12-05T12:54:09Z", "content": "Keeping your muscles Stopping your muscles from breaking down Doing better in sports or exercise Getting leaner Bodybuilders used to take anabolic steroids, but they are very bad for your health. So … [+4681 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "MIT scientists create molecules that could be used as organic LEDs - Mint Lounge", "description": "The molecules, known as acenes, could be useful as organic light-emitting diodes or solar cells, among other possible applications", "url": "https://lifestyle.livemint.com/smart-living/innovation/mit-chemists-acenes-molecules-organic-leds-111701776795957.html", "urlToImage": "https://images.livemint.com/img/2023/12/05/1140x641/MIT-StableAcenes-01-press_1701777115867_1701777138068.jpg", "publishedAt": "2023-12-05T12:51:35Z", "content": "Chemists at the Massachusetts Institute of Technology (MIT) have come up with a way to make molecules known as acenes more stable. These molecules, could be useful as organic light-emitting diodes (L… [+4091 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Sasirekha Peter", "title": "7 Best Legal Steroids in Australia For 2024 - Top Natural Alternatives For Fast Muscle Gains! - Deccan Herald", "description": "Explore the 7 best legal steroids in Australia for 2024, offering top natural alternatives for fast muscle gains. Discover safe and effective options to enhance your fitness journey and achieve remarkable results without compromising your health", "url": "https://www.deccanherald.com/brandspot/featured/7-best-legal-steroids-in-australia-for-2024-top-natural-alternatives-for-fast-muscle-gains-2797930", "urlToImage": "https://images.deccanherald.com/deccanherald%2F2023-12%2Fcb5365c5-8453-45ed-bcd9-d04dc7c778c7%2F12.png?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop", "publishedAt": "2023-12-05T12:46:49Z", "content": "Another big benefit of legal steroid supplements is that you do not need a doctors prescription or advice to buy them. This lets you feel in charge of your wellness in your search for the perfect sup… [+1628 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Health Desk, Times Now Digital", "title": "8 Foods High In Probiotics That Help In Weight Loss - Times Now", "description": "8 Foods High In Probiotics That Help In Weight Loss", "url": "https://www.timesnownews.com/web-stories/health/8-foods-high-in-probiotics-that-help-in-weight-loss/photostory/105757680.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-105757715,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-12-05T12:31:00Z", "content": "This is a staple in Korean cuisine. It has fermented vegetables, usually cabbage and radishes, seasoned with spices. Its low in calories and high in probiotics."}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel mRNA vaccine GLB-COV2-043 shows high efficacy against COVID-19 variants in early trials - News-Medical.Net", "description": "The safety, efficacy, and immunogenicity of a mRNA-based vaccine.", "url": "https://www.news-medical.net/news/20231205/Novel-mRNA-vaccine-GLB-COV2-043-shows-high-efficacy-against-COVID-19-variants-in-early-trials.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_766244_17017782533463453.jpg", "publishedAt": "2023-12-05T12:14:00Z", "content": "In a recent study published in Scientific Reports, researchers examined the safety, efficacy, and immunogenicity of a messenger ribonucleic acid (mRNA)-based vaccine for coronavirus disease 2019 (COV… [+5522 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Firstpost", "title": "9 wonderful heath benefits from eating carrots - Firstpost", "description": "From supporting vision and weight loss to boosting immunity and promoting heart health, here are the many health benefits of carrots", "url": "https://www.firstpost.com/web-stories/lifestyle/9-wonderful-heath-benefits-from-eating-carrots-17062.html", "urlToImage": "https://images.news18.com/webstories/2023/12/cropped-Web-capture_5-12-2023_17859_www.freepik.com_.jpeg", "publishedAt": "2023-12-05T12:06:46Z", "content": "Cancer ProtectionCarotenoids in carrots may help reduce the risk of prostate, colon, stomach, and breast cancers.\r\nHeart HealthCarrot intake is linked to lower cholesterol levels, reducing the risk o… [+1002 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Namita S Kalla", "title": "How to keep your brain healthy: Regular exercises, Sudoku, healthy diet are crucial in old age - Moneycontrol", "description": "Brain health: You can keep your mental edge sharp as you age with simple strategies. Engaging in mentally stimulating activities builds cognitive reserves, reducing the risk of cognitive decline and age-related issues. Stay sharp and enjoy a fulfilling life i…", "url": "https://www.moneycontrol.com/news/health-and-fitness/how-to-keep-your-brain-healthy-regular-exercises-sudoku-healthy-diet-are-crucial-in-old-age-11858221.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/08/Collage-Maker-15-Aug-2023-01-35-PM-8304-770x433.jpg", "publishedAt": "2023-12-05T11:41:53Z", "content": "Ageing, we all know, is inevitable. But what is not inevitable is the deterioration of our cognitive functions that come bundled with the process. We can keep our minds sharp and active, even as we a… [+2951 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Investigating IDO1 and PDL1: Key immune checkpoints in cutaneous leishmaniasis research - News-Medical.Net", "description": "In this Interview News Med talks to Dr. Nidhi Dey about immune checkpoints IDO1 and PDL1 and how they relate to cutaneous leishmaniasis research.", "url": "https://www.news-medical.net/news/20231205/Investigating-IDO1-and-PDL1-Key-immune-checkpoints-in-cutaneous-leishmaniasis-research.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_761253_17006657524915151.png", "publishedAt": "2023-12-05T11:41:00Z", "content": "Sponsored Content by TissueGnosticsDec 5 2023Reviewed by Maria Osipova\r\nIn this Interview News Med talks to Dr. Nidhi Dey about immune checkpoints IDO1 and PDL1 and how they relate to cutaneous leish… [+10083 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Alzheimer’s blood test could hit the market in early 2024, researchers say - Fox News", "description": "A simple blood test could detect Alzheimer’s disease with 100% accuracy, according to research from Resonant, a Utah biotech company that develops diagnostic tests for neurodegenerative diseases.", "url": "https://www.foxnews.com/health/alzheimers-blood-test-could-hit-market-early-2024-researchers-say", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/12/blood-test.jpg", "publishedAt": "2023-12-05T11:02:00Z", "content": "Could a simple blood test detect Alzheimers disease\r\n years before symptoms appear?\r\nNew research from Resonant, a Utah biotech company\r\n that develops diagnostic tests for neurodegenerative diseases… [+5447 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Protein clumps can cause brain diseases - Tech Explorist", "description": "Prion protein cross-seeding deactivates TDP-43.", "url": "https://www.techexplorist.com/protein-clumps-cause-brain-diseases/78114/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/12/brain-ai.jpg", "publishedAt": "2023-12-05T10:42:06Z", "content": "Neurodegenerative diseases involve clumped proteins in the brain, leading to cell death. While the link between protein clumps and cell death is apparent, how misfolded proteins cause it is unknown. … [+2767 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "FIT", "title": "HIV Prevention Drug PrEP Found to Be ‘Highly Effective’: What We Know - The Quint FIT", "description": "PrEP, an HIV prevention drug, confirmed to be highly effective in the real world, by a UK study. The study would pave the way towards better awareness and accessibility of the drug, especially among minority groups.", "url": "https://www.thequint.com/fit/hiv-prevention-prophylactic-prep-effective-study", "urlToImage": "https://images.thequint.com/thequint%2F2022-11%2F51546331-4498-4599-bf8f-4ad1562f4f86%2FWhatsApp_Image_2022_11_30_at_10_10_31_PM.jpeg?rect=0%2C11%2C720%2C378", "publishedAt": "2023-12-05T10:25:16Z", "content": "The bigger picture: PreP received US FDA approval in 2012, and while it is accessible through health clinics in the US and some other countries, its not currently part of the India's national HIV pro… [+270 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Riya Teotia", "title": "6 Amazing Health Benefits of Soybean - WION", "description": "6 Amazing Health Benefits of Soybean", "url": "https://www.wionews.com/web-stories/life-fun/health-and-wellness/6-amazing-health-benefits-of-soybean-1701768247002", "urlToImage": null, "publishedAt": "2023-12-05T09:41:42Z", "content": "Menopause can be very unpleasant with symptoms like sweating, hot flashes and mood swings. Studies indicate that isoflavones, a family of phytoestrogens found in soybeans, may alleviate these symptom… [+30 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "90-30-50 meal plan: Know health benefits, side effects of this diet method - DNA India", "description": "The 90-30-50 diet are based on the sound nutritional advice of eating more protein, fiber, and healthy fats.", "url": "https://www.dnaindia.com/lifestyle/report-90-30-50-meal-plan-fo-weight-loss-know-health-benefits-side-effects-of-this-diet-method-3070705", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/full/public/2023/12/05/2618691-image-2023-12-05t145725.008.jpg", "publishedAt": "2023-12-05T09:25:00Z", "content": "The 90-30-50 diet are based on the sound nutritional advice of eating more protein, fiber, and healthy fats.The creator of the 90-30-50 diet is claiming incredible weight loss outcomes with this stra… [+1313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "China pneumonia: Is drug-resistant bacteria causing severe disease? - The Indian Express", "description": "Experts debate whether overuse of antibiotics like Azithromycin during the pandemic is a factor", "url": "https://indianexpress.com/article/health-wellness/china-pneumonia-is-drug-resistant-bacteria-causing-severe-disease-9055253/", "urlToImage": "https://images.indianexpress.com/2023/12/china-pneumonia.jpg", "publishedAt": "2023-12-05T09:09:07Z", "content": "After China, some European countries have also started witnessing an increase in cases of severe pneumonia in children. While China has not provided information on the cluster of pneumonia cases, the… [+3571 chars]"}, {"source": {"id": null, "name": "EURACTIV"}, "author": "Christoph Schwaiger", "title": "Dutch survey finds redispensing cancer pills can save millions - EURACTIV", "description": "Re-issuing a cancer patient’s unused medication to a fellow patient can save up to €50 million annually i", "url": "https://www.euractiv.com/section/health-consumers/news/dutch-survey-finds-redispensing-cancer-pills-can-save-millions/", "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2023/12/pills-800x450.jpg", "publishedAt": "2023-12-05T09:08:09Z", "content": "Re-issuing a cancer patients unused medication to a fellow patient can save up to 50 million annually in the Netherlands, a study conducted at four Dutch hospitals and published in JAMA Oncology has … [+5094 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Plant-based diet may reduce risk of Alzheimer's disease: Study - ETHealthWorld", "description": "The study, published in the Journal of Alzheimer's Disease, discusses in detail the role of diet in modifying the risk of Alzheimer's disease. It identifies dementia risk factors, including higher consumption of saturated fats, meat, especially red meat such …", "url": "https://health.economictimes.indiatimes.com/news/industry/plant-based-diet-may-reduce-risk-of-alzheimers-disease-study/105751657", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-105751657,imgsize-21744,width-1200,height=765,overlay-ethealth/industry/plant-based-diet-may-reduce-risk-of-alzheimers-disease-study.jpg", "publishedAt": "2023-12-05T08:53:15Z", "content": "New Delhi: Plant-based and traditional diets found in countries such as China, Japan and India may reduce the risk of Alzheimer's disease, especially when compared to the Western diet, according to a… [+2179 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Wearable ultrasound monitors can help with injury rehabilitation: Study - IndiaTimes", "description": "Science News: Parag Chitnis of George Mason University developed a wearable ultrasound system that provides clinically relevant information about muscle function du", "url": "https://timesofindia.indiatimes.com/home/science/wearable-ultrasound-monitors-can-help-with-injury-rehabilitation-study/articleshow/105751553.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-105754924,width-1070,height-580,imgsize-499435,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-12-05T08:50:25Z", "content": "<ul><li>News</li>\r\n<li>Science News</li>\r\n<li>Wearable ultrasound monitors can help with injury rehabilitation: Study</li></ul>\r\nParag Chitnis of George Mason University developed a wearable ultrasou… [+607 chars]"}, {"source": {"id": null, "name": "AuntMinnie"}, "author": "Will Morton", "title": "Can stem cell injections treat knee osteoarthritis? - AuntMinnie", "description": "Injections of mesenchymal stem cells can improve clinical symptoms of patients with knee osteoarthritis and may result in early cartilage regeneration.", "url": "https://www.auntminnie.com/clinical-news/mri/article/15659559/can-stem-cell-injections-treat-knee-osteoarthritis", "urlToImage": "https://img.auntminnie.com/files/base/smg/all/image/2023/12/knee3.656e48093b69d.png?auto=format%2Ccompress&fit=max&q=70&w=1200", "publishedAt": "2023-12-05T08:45:04Z", "content": "MRI shows that injections of mesenchymal stem cells can improve clinical symptoms of patients with knee osteoarthritis and may result in early cartilage regeneration, according to research delivered … [+2849 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "UNAIDS calls for accelerated political and financial support for communities to lead in the response to HIV - World - ReliefWeb", "description": "News and Press Release in English on World about HIV/Aids; published on 4 Dec 2023 by UNAIDS", "url": "https://reliefweb.int/report/world/unaids-calls-accelerated-political-and-financial-support-communities-lead-response-hiv", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/default.png", "publishedAt": "2023-12-05T08:34:59Z", "content": "GENEVA/HARARE, 4 December 2023 - The world can end AIDS as a public health threat if communities on the frontlines of the HIV response are fully engaged and supported to do their work. This was the i… [+6350 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Health Desk", "title": "Experimental implants raise hopes of recovery from severe brain injuries - India Today", "description": "Participants in the study, who had suffered moderate to severe brain injuries, exhibited remarkable improvements in mental processing speed, concentration and daily life activities.", "url": "https://www.indiatoday.in/health/story/experimental-implants-raise-hopes-of-recovery-from-severe-brain-injuries-2472163-2023-12-05", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202312/brain-stimulation-device-05011753-16x9_0.jpg?VersionId=WkSEMsrooEVgdleUCo5mkmkU8NMK5hN5", "publishedAt": "2023-12-05T08:25:31Z", "content": "In a groundbreaking study, researchers have successfully restored cognitive function in individuals with enduring impairments resulting from traumatic brain injuries (TBIs) using deep-brain-stimulati… [+3024 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Namita S Kalla", "title": "Hyperuricemia causes, symptoms, cure: Here's how high uric acid levels can lead to kidney stones, gout - Moneycontrol", "description": "Hyperuricemia, an excess of uric acid in the blood, often goes unnoticed. High uric acid levels can lead to gout and kidney stones. Early detection is crucial as it poses risks for various health conditions.", "url": "https://www.moneycontrol.com/news/health-and-fitness/hyperuricemia-causes-symptoms-and-cure-heres-how-high-uric-acid-levels-can-lead-to-kidney-stones-or-gout-11856901.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/causes-symptoms-and-treatment-of-kidney-stones-770x433.jpg", "publishedAt": "2023-12-05T07:09:54Z", "content": "If you're frequently thirsty and making more trips to the washroom than usual, get yourself checked for hyperuricemia. Uric acid, a standard waste product in the blood, can cause problems when it acc… [+4046 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's How Walking In Winters Can Benefit Your Health - NDTV", "description": "In this article, we discuss the many benefits of walking in winter.", "url": "https://www.ndtv.com/health/heres-how-walking-in-winters-can-benefit-your-health-4634955", "urlToImage": "https://c.ndtvimg.com/2023-11/8k55r74_walking_625x300_23_November_23.jpeg", "publishedAt": "2023-12-05T07:09:16Z", "content": "Walking in winter can help regulate sleep patterns and improve the quality of sleep\r\nWalking is generally considered to be a healthy form of exercise. It is a low-impact activity that can help improv… [+3392 chars]"}, {"source": {"id": null, "name": "Medriva.com"}, "author": "Mason Walker", "title": "Ground-breaking Approach to Vaccine Delivery Using Ultrasound Technology - Medriva", "description": "Discover the innovative technique of using ultrasound technology for needle-free and painless vaccine delivery. Learn about the potential impact and surprising results from initial tests.", "url": "https://medriva.com/breaking-news/revolutionizing-vaccine-delivery-needle-free-and-painless-ultrasound-technology/", "urlToImage": "https://media.medriva.com/content/uploads/2023/12/ultrasound-needle-free-vaccine-delivery-research-by-darcy-dunn-lawless-20231205065830.jpg", "publishedAt": "2023-12-05T06:58:40Z", "content": "A Ground-breaking Approach to Vaccine Delivery\r\nWith the recent advancements in biomedical engineering, a doctoral student at the University of Oxford’s Institute of Biomedical Engineering is explori… [+2933 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Healthshots", "title": "Foods to boost stamina - Health shots", "description": "Boosting stamina is crucial for overall well-being and enhanced performance. Incorporate these 5 superfoods into your diet for sustained energy and endurance.", "url": "https://www.healthshots.com/web-stories/foods-to-boost-stamina/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/12/05104909/stamina-2.jpg", "publishedAt": "2023-12-05T05:30:44Z", "content": "Boosting stamina is crucial for overall well-being and enhanced performance. Incorporate these 5 superfoods into your diet for sustained energy and endurance.\r\nImage Credits : Shutterstock\r\nImage Cre… [+1124 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Sudan cholera cases up 70 pct with 160 deaths: UN - United News of India", "description": "United Nations, Dec 5 (UNI) UN humanitarians on Monday reported a 70 percent surge in cholera cases in strife-torn Sudan, which has prompted a scale-up of response.", "url": "https://uniindia.com/sudan-cholera-cases-up-70-pct-with-160-deaths-un/world/news/3099501.html", "urlToImage": "https://www.uniindia.com/cms/gall_content/2023/12/2023_12$largeimg05_Dec_2023_100536470.jpg", "publishedAt": "2023-12-05T04:50:16Z", "content": "United Nations, Dec 5 (UNI) UN humanitarians on Monday reported a 70 percent surge in cholera cases in strife-torn Sudan, which has prompted a scale-up of response.\r\nThe UN Office for the Coordinatio… [+1025 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "National Influenza Vaccination Week - WITN-TV", "description": "National Influenza Vaccination Week   For more Local News from WITN:  https://www.witn.com/ For more YouTube Content: https://www.youtube.com/channel/UCQyJnw...", "url": "https://www.youtube.com/watch?v=VYBQBsFsGLU", "urlToImage": "https://i.ytimg.com/vi/VYBQBsFsGLU/maxresdefault.jpg", "publishedAt": "2023-12-05T03:12:09Z", "content": null}, {"source": {"id": null, "name": "Ians.in"}, "author": "", "title": "Indo-Asian News Service-BREAK THE BLOCK: LET'S TALK ABOUT CONSTIPATION - IANS India Pvt Ltd", "description": "Indo-Asian News Service", "url": "https://www.ians.in", "urlToImage": "https://ians.in/assets/img/new-logo.png", "publishedAt": "2023-12-05T00:09:00Z", "content": ""}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "The underlying cause of childhood Pneumonia: A complex interplay of pathogens and risk factors - IndiaTimes", "description": "Childhood pneumonia, a major public health hazard, is caused by infections like Streptococcus pneumoniae, Haemophilus influenzae type b (Hib), respira", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/the-underlying-cause-of-childhood-pneumonia-a-complex-interplay-of-pathogens-and-risk-factors/articleshow/105726147.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-105726294,width-1070,height-580,imgsize-44770,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-12-04T22:30:00Z", "content": "World AIDS Day: Lesser known facts about HIV and how to manage AIDS"}, {"source": {"id": null, "name": "WION"}, "author": "Vikrant Singh", "title": "8 Signs of Heart Disease - WION", "description": "It's time to visit your doctor if you are persistently facing these heart-related symptoms.", "url": "https://www.wionews.com/web-stories/life-fun/health-and-wellness/8-signs-of-heart-disease-1701716417054", "urlToImage": null, "publishedAt": "2023-12-04T19:08:53Z", "content": "Uncomfortable pressure, fullness, squeezing, or pain in the centre of the chest that may come and go."}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "Brahmi, triphala, neem, ashwagandha and more: 8 Ayurvedic herbs that help you detox - Moneycontrol", "description": "Embrace the wisdom of Ayurveda and let these potent herbs guide you on your detox journey! Whether consumed as supplements, incorporated into meals, or used in herbal teas, these herbs offer a holistic approach to detoxifying the body.", "url": "https://www.moneycontrol.com/news/health-and-fitness/brahmi-triphala-neem-ashwagandha-and-more-8-ayurvedic-herbs-that-help-you-detox-11852791.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/07/Health-benefits-of-ashwagandha-770x433.jpg", "publishedAt": "2023-12-04T12:30:57Z", "content": "Detoxification is a natural process the body performs to eliminate toxins, and Ayurveda, the ancient Indian system of medicine, offers a wealth of herbs to support this holistic cleansing journey. Ha… [+3624 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Anjuri Nayar Singh", "title": "Jasmine rice might be healthier than you think! Here’s how to include it in your diet - Health shots", "description": "Jasmine rice has many nutritional benefits! Know all about it and how to cook it in different ways to maintain variety.", "url": "https://www.healthshots.com/healthy-eating/nutrition/jasmine-rice-benefits-uses/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/06/05123146/diabetes-and-rice.jpg", "publishedAt": "2023-12-04T05:03:03Z", "content": "If you are a Thai or a Vietnamese food lover, jasmine rice will be a constant staple you order to accompany all those delicious curries! The popcorn-like smell and the elongated texture of the grains… [+5192 chars]"}]}