{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Blame Gut-brain link for your cravings for fatty food - Daily Pioneer", "description": "If you have been blaming your tongue for your temptation for those fatty foods causing obesity, diabetes and heart diseases, then better not! Researchers have found that gut-brain connection is the culprit that derives our desire for unhealthy foods having hi…", "url": "https://www.dailypioneer.com/2022/sunday-edition/blame-gut-brain-link-for-your-cravings-for-fatty-food.html", "urlToImage": "https://www.dailypioneer.com/uploads/2022/story/images/big/blame-gut-brain-link-for-your-cravings-for-fatty-food-2022-09-11.jpg", "publishedAt": "2022-09-10T21:21:24Z", "content": "If you have been blaming your tongue for your temptation for those fatty foods causing obesity, diabetes and heart diseases, then better not! Researchers have found that gut-brain connection is the c… [+5424 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Stress, depression may increase risk of long Covid: Researchers - Daily Pioneer", "description": "Most of those who went through psychological distress like anxiety, depression, worry, and perceived stress before Covid-19 struck them, happened to develop Long Covid, a study published in The JMMA Psychiatry said, suggesting that physical health conditions …", "url": "https://www.dailypioneer.com/2022/india/stress--depression-may-increase-risk-of-long-covid--researchers.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-09-10T21:05:21Z", "content": "Most of those who went through psychological distress like anxiety, depression, worry, and perceived stress before Covid-19 struck them, happened to develop Long Covid, a study published in The JMMA … [+2965 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Researchers identified genetic mutations that contribute to nonalcoholic fatty liver disease - Tech Explorist", "description": "This study lays the groundwork for the future development of approaches to activate the human Gm4951 homolog to combat NAFLD.", "url": "https://www.techexplorist.com/genetic-mutations-contribute-nonalcoholic-fatty-liver-disease/53682/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/09/liver-disease.jpg", "publishedAt": "2022-09-10T18:24:34Z", "content": "Obesity and diabetes are well-known risk factors for nonalcoholic fatty liver disease (NAFLD), but the genetic factors contributing to the development of NAFLD remain poorly understood.\r\nA new study … [+2547 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Scientists discover how air pollution causes lung cancer - Al Jazeera English", "description": "New study illustrates the health risk posed by the tiny particles produced by burning fossil fuels.", "url": "https://www.aljazeera.com/news/2022/9/10/scientists-discover-how-air-pollution-triggers-lung-cancer", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/11/000_9RQ9EX.jpg?resize=1920%2C1440", "publishedAt": "2022-09-10T17:28:08Z", "content": "Scientists say they have identified the mechanism through which air pollution triggers lung cancer in non-smokers, a discovery one expert hailed as an important step for science and for society.\r\nThe… [+5137 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Charu Jain", "title": "What is Anorexia Nervosa: Know this eating disorder's causes, symptoms and treatment - India TV News", "description": "Anorexia Nervosa is a serious eating disorder that takes a toll on a person’s mental health. In this illness, a person cuts down on their food consumption and starves themselves to look thin. Read more about its causes, symptoms, and how one can cure it", "url": "https://www.indiatvnews.com/health/anorexia-nervosa-know-this-eating-disorder-causes-symptoms-and-treatment-2022-09-10-784513", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/06/farah-khan-vicky-kaushal-6-1655203440.jpg", "publishedAt": "2022-09-10T16:30:01Z", "content": "Anorexia nervosa is an eating disorder with a psychological problem that has serious side effects on a persons mental being. This problem also takes a toll on a persons physical health as they cut th… [+3000 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Study says monkeypox may cause neurological damage, including inflammation of the brain - The Indian Express", "description": "Although we found that people with monkeypox infection can have neuropsychiatric symptoms, the studies in our paper cannot say with any certainty that it's the virus causing these problems, said James Brunton Badenoch, Academic Foundation Doctor, Queen Mary U…", "url": "https://indianexpress.com/article/lifestyle/health/monkeypox-inflammation-brain-study-8142217/", "urlToImage": "https://images.indianexpress.com/2022/09/monkeypox_200_getty.jpg", "publishedAt": "2022-09-10T16:10:05Z", "content": "Monkeypox’s effect on the skin the disfiguring rashes and the flu-like symptoms have been well described, but few have investigated the neurological and psychiatric problems the virus might cause.\r\nT… [+4365 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Incidence of Acute Myocardial Infarction in Patients Presenting With Cerebrovascular Accident in a Tertiary Care Centre in Eastern India - Cureus", "description": "Acute myocardial infarction in individuals who have had a cerebrovascular accident or transient ischemic attack (CVA-TIA) is a medical emergency, which must be examined and treated as soon as possible. Physicians face a significant problem in managing this sc…", "url": "https://www.cureus.com/articles/104566-incidence-of-acute-myocardial-infarction-in-patients-presenting-with-cerebrovascular-accident-in-a-tertiary-care-centre-in-eastern-india", "urlToImage": "https://assets.cureus.com/uploads/figure/file/433022/article_river_f6eed6d01bbd11ed986b65f4908656ed-Picture1-1.png", "publishedAt": "2022-09-10T15:39:31Z", "content": "Acute myocardial infarction in individuals who have had a cerebrovascular accident or transient ischemic attack (CVA-TIA) is a medical emergency, which must be examined and treated as soon as possibl… [+22521 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Indian-origin researcher develops antiviral therapy that block Covid transmission - Morung Express", "description": "", "url": "https://www.morungexpress.com/", "urlToImage": "https://www.morungexpress.com/uploads/2022/09/71693524_1662819058_a9ce07e1dd3b1466ca216757f53882f6.jpg", "publishedAt": "2022-09-10T14:36:41Z", "content": "San Francisco, Sep 10 (IANS) A team of US scientists, including research investigator Sonali Chaturvedi, has developed a single-dose, intranasal treatment that not only reduces symptoms of multiple C… [+2629 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Weight loss: The time of day you eat your biggest meal has little effect, shows study - Deccan Herald", "description": "By Jonathan Johnston, Alex Johnstone and Peter Morgan for The Conversation Some of the most popular diet advice in recent years has centred around the idea that the right timing for your meals can make a big difference in the amount of weight you lose. It was…", "url": "https://www.deccanherald.com/science-and-environment/weight-loss-the-time-of-day-you-eat-your-biggest-meal-has-little-effect-shows-study-1143954.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/09/10/food-istock-1143954-1662819399.jpg", "publishedAt": "2022-09-10T14:16:00Z", "content": "By Jonathan Johnston, Alex Johnstone and Peter Morgan for The Conversation\r\nSome of the most popular diet advice in recent years has centred around the idea that the right timing for your meals can m… [+4299 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "First time ever, Dolphin, porpoise avian flu is seen in cetaceans - DNAIndiaNews", "description": "Scientists said a bottlenose dolphin found dead in a Florida canal this past spring tested positive for a highly virulent strain of bird flu#dolphin #avianfl...", "url": "https://www.youtube.com/watch?v=NPkf-_MJF1c", "urlToImage": "https://i.ytimg.com/vi/NPkf-_MJF1c/maxresdefault.jpg", "publishedAt": "2022-09-10T14:00:47Z", "content": null}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "Nearly half of the dengue cases in 2022 were reported in Aug: PMC - Inshorts", "description": "Nearly half of the suspected dengue fever cases reported this year under the Pune Municipal Corporation's (PMC) limits were recorded in August. According to the PMC's data, 2,621 suspected cases of dengue were reported till September 3. \"At least 1,062 suspec…", "url": "https://inshorts.com/en/news/nearly-half-of-the-dengue-cases-in-2022-were-reported-in-aug-pmc-1662815307970", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2022/09_sep/10_sat/img_1662806054854_823.jpg?", "publishedAt": "2022-09-10T13:09:07Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "HKUST: Vaccine Expected to Induce Strong Immune Responses Against 2022 Monkeypox Virus, Research Shows - India Education Diary", "description": "New research has suggested that recommended vaccinia virus (VACV)-based vaccines will mount a robust immune response against the monkeypox virus observed in the current outbreak (MPXV-2022).Since the new virus was first observed in early May 2022, ov", "url": "https://indiaeducationdiary.in/hkust-vaccine-expected-to-induce-strong-immune-responses-against-2022-monkeypox-virus-research-shows/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/HKUST.png?fit=220%2C220&ssl=1", "publishedAt": "2022-09-10T12:47:36Z", "content": "New research has suggested that recommended vaccinia virus (VACV)-based vaccines will mount a robust immune response against the monkeypox virus observed in the current outbreak (MPXV-2022).\r\nSince t… [+2767 chars]"}, {"source": {"id": null, "name": "Sakshi.com"}, "author": "Sakshi Post", "title": "Diabetes Can Be Reversed With Homeopathy, Lifestyle Changes And Dietary Interventions - Sakshi Post", "description": "Diabetes has become the most common disorder of the decade, with 40% of the world’s population suffering from Diabetes (diagnosed......", "url": "https://english.sakshi.com/news/health-fitness/diabetes-can-be-reversed-homeopathy-lifestyle-changes-and-dietary-interventions", "urlToImage": "https://english.sakshi.com/sites/default/files/article_images/2022/09/10/main-1662811254.jpg", "publishedAt": "2022-09-10T12:00:54Z", "content": "Diabetes has become the most common disorder of the decade, with 40% of the worlds population suffering from Diabetes (diagnosed or undiagnosed) along with other metabolic disorders put together. Ind… [+4754 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Cholesterol Control: Does Consuming Dark Chocolate Helps to Reduce Your Cholesterol? Expert Speaks - India.com", "description": "Dark chocolate consumption can lower numerous significant heart disease risk factors and it might guard against high cholesterol, know-how", "url": "https://www.india.com/health/cholesterol-control-does-consuming-dark-chocolate-helps-to-reduce-your-cholesterol-expert-speaks-5623289/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/09/WhatsApp-Image-2022-09-10-at-4.32.58-PM.jpeg", "publishedAt": "2022-09-10T11:21:24Z", "content": "Dark Chocolate For Cholesterol: Although high cholesterol can be genetic, it’s usually brought on by poor lifestyle choices, making it both curable and preventive. In some cases, medication as well a… [+1960 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "4 signs that you have heart failure and you don't know - Hindustan Times", "description": "Even healthy people who eat a balanced diet and exercise are susceptible to heart attacks. It is impossible to know who is the healthiest person in such a situation, since everyone is susceptible to heart attacks. Here are 4 signs that you have heart failure …", "url": "https://www.hindustantimes.com/lifestyle/health/4-signs-that-you-have-heart-failure-and-you-don-t-know-101662799041320.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/10/1600x900/FbtRsbUWAAMz7fZ_1662799254126_1662799279024_1662799279024.jpg", "publishedAt": "2022-09-10T08:50:11Z", "content": "The burgeoning rate of heart attacks in India is a growing concern for everyone. Even healthy people who eat a balanced diet and exercise are susceptible to heart attacks hence, it is impossible to k… [+2673 chars]"}, {"source": {"id": null, "name": "Indiaspend.com"}, "author": "Prachi Salve", "title": "Low Testing And Climate Change Hamper India's Fight Against Dengue And Malaria - IndiaSpend", "description": "Experts say India needs more decentralised planning, and access to testing and treatment for malaria ...", "url": "https://www.indiaspend.com/health/low-testing-and-climate-change-hamper-indias-fight-against-dengue-and-malaria-834310", "urlToImage": "https://www.indiaspend.com/h-upload/2022/09/10/791079-malaria-dengue-india-1500.jpg", "publishedAt": "2022-09-10T08:49:22Z", "content": "Mumbai: India is unable to eliminate malaria and dengue because of a lack of testing and diagnosis of these diseases, and because of delayed treatment, experts say. In addition, climate change is mak… [+13028 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Experts urge for including cervical cancer vaccine in the universal immunisation programme - Express Healthcare", "description": "To discuss about the development and the road ahead, the IHW Council under its Rapid Global Cancer Alliance, initiated a virtual expert roundtable titled, “India Against Cervical Cancer- Role of India’s First Indigenous Vaccine”", "url": "https://www.expresshealthcare.in/news/experts-urge-for-including-cervical-cancer-vaccine-in-the-universal-immunisation-programme/436282/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/01/31182513/admin-ajax-4-1-2.jpg", "publishedAt": "2022-09-10T08:46:03Z", "content": "To discuss about the development and the road ahead, the IHW Council under its Rapid Global Cancer Alliance, initiated a virtual expert roundtable titled, India Against Cervical Cancer- Role of India… [+2456 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Key protein that drives rheumatoid arthritis damage: Study - ETHealthWorld", "description": "Tumor necrosis factor-alpha -- or TNF-alpha for short -- is one of the main inflammatory proteins that drive rheumatoid arthritis and is targeted by many currently available therapies,\" said senior author Salah-Uddin Ahmed, a professor in Washington State Uni…", "url": "https://health.economictimes.indiatimes.com/news/industry/key-protein-that-drives-rheumatoid-arthritis-damage-study/94114479", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94114479,imgsize-29910,width-1200,height-628,overlay-ethealthworld/key-protein-that-drives-rheumatoid-arthritis-damage-study.jpg", "publishedAt": "2022-09-10T08:30:00Z", "content": "Washington : Scientists have identified a protein known as sulfatase-2 that plays a critical role in the damage caused by rheumatoid arthritis. The researchers' discovery sheds new light on the molec… [+3653 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "Ginger Candy; Natural And Home-Made Cure For Flu And Fever - Slurrp", "description": "Treat your flu and fever with this candy!", "url": "https://www.slurrp.com/article/ginger-candy-natural-and-home-made-cure-for-flu-and-fever-1662754228177", "urlToImage": "https://images.slurrp.com/prod/articles/osfsdlxptt.webp", "publishedAt": "2022-09-10T06:56:51Z", "content": "All you need to treat a sore throat and fever is this simple, five-minute ginger candy recipe. Going back to the fundamentals to treat seasonal health issues is a prevalent culture for the majority o… [+1761 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "A study shows how early exposure to antibiotics may affect gut health in adulthood - mid-day.com", "description": "The study observed that antibiotics have these long-lasting effects which result in disturbed gastrointestinal function, including the speed of motility through the gut and diarrhoea-like symptoms in adulthood", "url": "http://www.mid-day.com/lifestyle/health-and-fitness/article/a-study-shows-how-early-exposure-to-antibiotics-may-affect-gut-health-in-adulthood-23245171", "urlToImage": "https://images.mid-day.com/images/images/2022/sep/antibiotics-sept-ten_d.jpg", "publishedAt": "2022-09-10T06:35:00Z", "content": "The study observed that antibiotics have these long-lasting effects which result in disturbed gastrointestinal function, including the speed of motility through the gut and diarrhoea-like symptoms in… [+2457 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Kelly Clarkson Keto Gummies Reviews Shark Tank Warning Exposed Scam? - The Tribune India", "description": "Why aren&rsquo;t we able to maintain a normal body weight? Why aren&rsquo;t we able to tackle weight gain issues? If you are also facing this major problem, you are not the only one. The vast majority of individuals from across the globe are looking for the m…", "url": "https://www.tribuneindia.com/news/brand-connect/kelly-clarkson-keto-gummies-reviews-shark-tank-warning-exposed-scam-430393", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_891700348.jpg", "publishedAt": "2022-09-10T06:28:00Z", "content": "Why aren’t we able to maintain a normal body weight? Why aren’t we able to tackle weight gain issues? If you are also facing this major problem, you are not the only one. The vast majority of individ… [+7944 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New nasal COVID-19 vaccine - eNCA", "description": "Global efforts to fight Covid-19 are continuing. Well, China and India have recently given the green light to nasal and inhaled vaccines. It's hoped the immu...", "url": "https://www.youtube.com/watch?v=6CWUe7LAf48", "urlToImage": "https://i.ytimg.com/vi/6CWUe7LAf48/maxresdefault.jpg", "publishedAt": "2022-09-10T05:43:28Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study reveals improving body positivity during pregnancy can lead to healthier mothers and children - ETHealthWorld", "description": "Respondents said the downsides of pursuing an ideal body image included poor mental health, disordered eating and exercise habits, lost time and money, and negative self-talk.", "url": "https://retail.economictimes.indiatimes.com/news/industry/study-reveals-improving-body-positivity-during-pregnancy-can-lead-to-healthier-mothers-and-children/94110947", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94110947,imgsize-643470,width-1200,height-628,overlay-ethealthworld/study-reveals-improving-body-positivity-during-pregnancy-can-lead-to-healthier-mothers-and-children.jpg", "publishedAt": "2022-09-10T05:15:00Z", "content": "Boston : Pregnancy is frequently portrayed as a time of great enthusiasm and anticipation. The typical physical changes that occur during pregnancy, however, can raise the likelihood of body dissatis… [+4966 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers discover new type of technology to detect ovarian cancer - ETHealthWorld", "description": "The study analyzed gene expression from captured cells in blood and evaluated 72 different gene transcripts and seven blood biomarkers related to ovarian cancer (including CA125)", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/researchers-discover-new-type-of-technology-to-detect-ovarian-cancer/94110879", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94110879,imgsize-30494,width-1200,height-628,overlay-ethealthworld/researchers-discover-new-type-of-technology-to-detect-ovarian-cancer.jpg", "publishedAt": "2022-09-10T05:15:00Z", "content": "Rochester: According to a new study led by a Wilmot Cancer Institute physician/scientist, a new type of technology can collect stray ovarian cancer cells from a simple blood test and successfully for… [+4726 chars]"}, {"source": {"id": null, "name": "Intelligentliving.co"}, "author": "Jennifer Barns", "title": "How To Improve Your Physical and Mental Health Through Your Daily Routine - Intelligent Living", "description": "Maintaining your mental and physical health is one of the most important things you can do for yourself. Your health affects every aspect of your life, from your work performance to your relationships and overall happiness. It’s essential to take care of your…", "url": "https://www.intelligentliving.co/how-improve-physical-and-mental-health-daily-routine/", "urlToImage": "https://www.intelligentliving.co/wp-content/uploads/2022/09/veg.jpg", "publishedAt": "2022-09-10T04:27:29Z", "content": "Maintaining your mental and physical health is one of the most important things you can do for yourself. Your health affects every aspect of your life, from your work performance to your relationship… [+6108 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "Do Bananas Cause Or Prevent Constipation? - Slurrp", "description": "What are the digestive benefits of bananas?", "url": "https://www.slurrp.com/article/do-bananas-cause-or-prevent-constipation-1662751622465", "urlToImage": "https://images.slurrp.com/prod/articles/8a3shfkfjja.webp", "publishedAt": "2022-09-10T03:48:08Z", "content": "Constipation is a typical medical condition. It is characterised by erratic bowel movements and challenging-to-pass firm faeces. Constipation can be brought on by a variety of factors, from a bad die… [+3031 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Food Insecurity Has Lasting Impacts on the Brains and Behavior of Mice - Neuroscience News", "description": "Food insecurity has lasting effects on both behavior and brain function in mice. Mice who grew up with food insecurity were more flexible in uncertain situations.", "url": "https://neurosciencenews.com/food-insecurity-brain-behavior-21388/", "urlToImage": "https://neurosciencenews.com/files/2022/09/food-insecurity-mice-neurosinces-publiv.jpg", "publishedAt": "2022-09-09T23:13:04Z", "content": "Summary: Food insecurity has lasting effects on both behavior and brain function in mice. Mice who grew up with food insecurity were more flexible in uncertain situations.\r\nSource: UC Berkeley\r\nWhile… [+9421 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Batya Swift Yasgur MA, LSW", "title": "CRP May Flag Patients at Risk for Poststroke Delirium - Medscape", "description": "Although developing delirium after a stroke is common, elevated serum C-reactive protein levels may help identify those at highest risk for the condition, new research suggests.", "url": "https://www.medscape.com/viewarticle/980538", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220909_CRP_test_blood_sample_800x450.jpg", "publishedAt": "2022-09-09T22:21:21Z", "content": "Adding the evaluation of serum C-reactive protein (CRP) level to other clinical predictors may help identify which patients will experience delirium following a stroke, new research suggests.\r\nAnalys… [+7922 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Ohio State University: Neutralizing antibodies from single COVID-19 booster steadily decline - India Education Diary", "description": "Neutralizing antibody levels against the original COVID-19 virus and omicron variants in vaccinated adults tend to decline by at least 15% per month after a single booster shot, a new study using serum from human blood samples suggests.Data from two", "url": "https://indiaeducationdiary.in/ohio-state-university-neutralizing-antibodies-from-single-covid-19-booster-steadily-decline/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/ohio.jpg?fit=1024%2C683&ssl=1", "publishedAt": "2022-09-09T21:00:00Z", "content": "Neutralizing antibody levels against the original COVID-19 virus and omicron variants in vaccinated adults tend to decline by at least 15% per month after a single booster shot, a new study using ser… [+5553 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Cristina Ferrario", "title": "Sex Is Still a Taboo Subject for Patients With Breast Cancer - Medscape", "description": "Many women with breast cancer say that their diagnosis has had a negative effect on their sex life. But few of these women consider consulting a sexologist.", "url": "https://www.medscape.com/viewarticle/980532", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220909_breast_cancer_awareness_ribbon_pink_800x450.jpg", "publishedAt": "2022-09-09T20:36:58Z", "content": "An Italian study of women diagnosed with breast cancer reported that around 50% experienced body image disturbance and 20% noted a negative impact on their sex life. And while meeting with a speciali… [+3109 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Andrea Michelson", "title": "Eating frozen meals and cold cuts raises your risk of cancer and early death, new studies show - Business Insider India", "description": "Two recent studies added to evidence about how ultra-processed foods may affect health.One found an increased risk of colorectal cancer for men in the top", "url": "https://www.businessinsider.in/science/health/news/eating-frozen-meals-and-cold-cuts-raises-your-risk-of-cancer-and-early-death-new-studies-show/articleshow/94106749.cms", "urlToImage": "https://www.businessinsider.in/photo/94106749/eating-frozen-meals-and-cold-cuts-raises-your-risk-of-cancer-and-early-death-new-studies-show.jpg?imgsize=654312", "publishedAt": "2022-09-09T20:12:00Z", "content": "Hundreds of studies have linked processed foods to health risks including cancer, obesity, and early death.\r\nThe latest evidence against ultra-processed foods — a category that includes hot dogs, pot… [+3000 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Luke Coutinho", "title": "Wellness by Luke Coutinho: The gut clock - Hindustan Times", "description": "The strong connection between dietary patterns and circadian rhythm must not be ignored. How good are you with your gut health?", "url": "https://www.hindustantimes.com/lifestyle/brunch/wellness-by-luke-coutinho-the-gut-clock-101662752641210.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/09/1600x900/861934c4-2f62-11ed-b063-b28d2006e403_1662752640163.jpg", "publishedAt": "2022-09-09T19:44:00Z", "content": "Do you know our dietary patterns, appetite, and satiety are all regulated by our circadian rhythm? Unfortunately, we do not align our eating habits to it and revolve it around our work schedules, soc… [+5067 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals app that identifies perfect day for kids in terms of screen time and rest - ANI News", "description": "Melbourne [Australia], September 10 (ANI): It can be difficult to strike the \"just right\" balance in a child's hectic day--not too much sport, not too little sleep. While parents find it difficult to fit homework between extracurricular obligations and downti…", "url": "https://www.aninews.in/news/health/study-reveals-app-that-identifies-perfect-day-for-kids-in-terms-of-screen-time-and-rest20220910000936", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220909183857.jpg", "publishedAt": "2022-09-09T18:39:00Z", "content": "Melbourne [Australia], September 10 (ANI): It can be difficult to strike the \"just right\" balance in a child's hectic day--not too much sport, not too little sleep. While parents find it difficult to… [+2906 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study: Children who have temporary facial paralysis can recover without treatment - ThePrint", "description": "Melbourne [Australia], September 9 (ANI): According to a new study, the majority of youngsters with a syndrome that temporarily weakens or paralyses the muscles in the face recover without medicine within six months. Prednisolone did not significantly affect …", "url": "https://theprint.in/health/study-children-who-have-temporary-facial-paralysis-can-recover-without-treatment/1123001/", "urlToImage": null, "publishedAt": "2022-09-09T17:13:21Z", "content": "Melbourne [Australia], September 9 (ANI): According to a new study, the majority of youngsters with a syndrome that temporarily weakens or paralyses the muscles in the face recover without medicine w… [+2129 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Sabika Hassan", "title": "What Does It Really Mean When Your Thyroid-Stimulating Hormone (TSH) Is Low? - Health Digest", "description": "The thyroid-stimulating hormone (TSH) is a chemical that regulates thyroid function. Too high or too low levels of TSH indicate dysfunction of the thyroid.", "url": "https://www.healthdigest.com/1000721/what-does-it-really-mean-when-your-thyroid-stimulating-hormone-tsh-is-low/", "urlToImage": "https://www.healthdigest.com/img/gallery/what-does-it-really-mean-when-your-thyroid-stimulating-hormone-tsh-is-low/l-intro-1662738670.jpg", "publishedAt": "2022-09-09T16:01:00Z", "content": "According to MedicalNewsToday, low TSH levels indicate that you have hyperthyroidism or an overactive thyroid. It is a condition in which the thyroid produces too much of the hormone, causing the pit… [+866 chars]"}, {"source": {"id": null, "name": "Www.epw.in"}, "author": null, "title": "Needles, Blood, and Data : The Case of COVID-19 Vaccine Side Effects - Economic and Political Weekly", "description": "That COVID-19 has been difficult on gender minorities has been well-documented. Through a combination of abandonment by the state, reluctance towards women’s health beyond their reproductive capacity, and an epistemological gap at the heart of modern medicine…", "url": "https://www.epw.in/journal/2022/37/commentary/needles-blood-and-data.html", "urlToImage": "http://www.epw.in/sites/default/files/epw-logo.png", "publishedAt": "2022-09-09T15:16:32Z", "content": "That COVID-19 has been difficult on gender minorities has been well-documented. Through a combination of abandonment by the state, reluctance towards womens health beyond their reproductive capacity,… [+22772 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Boosting physical activity and curbing sitting time likely to lower breast cancer risk - Medical Dialogues", "description": "Boosting physical activity levels and curbing sitting time are highly likely to lower breast cancer...", "url": "https://medicaldialogues.in/oncology/news/boosting-physical-activity-and-curbing-sitting-time-likely-to-lower-breast-cancer-risk-98781", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/06/182759-breast-cancer.jpg", "publishedAt": "2022-09-09T14:15:45Z", "content": "Boosting physical activity levels and curbing sitting time are highly likely to lower breast cancer risk, finds research designed to strengthen proof of causation and published online in the British … [+4999 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study: Hypertension in people features debilitating headaches, sight loss - ThePrint", "description": "Birmingham [UK], September 9 (ANI): Patients suffering from a type of elevated brain pressure may have their disease recognised earlier thanks to new biochemical clues, according to new research. The findings of the study were published in the journal Neurolo…", "url": "https://theprint.in/health/study-hypertension-in-people-features-debilitating-headaches-sight-loss/1122752/", "urlToImage": null, "publishedAt": "2022-09-09T14:15:13Z", "content": "Birmingham [UK], September 9 (ANI): Patients suffering from a type of elevated brain pressure may have their disease recognised earlier thanks to new biochemical clues, according to new research.\r\nTh… [+2960 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Swetha Sivakumar", "title": "Soy to the world!: Swetha Sivakumar’s ode to the Chinese sauce - Hindustan Times", "description": "The word soy comes from the Japanese “shoyu”, but the condiment was invented in China. How was it traditionally made? What should you look for on the supermarket shelves? Take a look.", "url": "https://www.hindustantimes.com/lifestyle/art-culture/soy-to-the-world-swetha-sivakumar-s-ode-to-the-chinese-sauce-101662732853817.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/09/1600x900/25941464-2ec9-11ed-b063-b28d2006e403_1662732849297.jpg", "publishedAt": "2022-09-09T14:14:13Z", "content": "The term soy sauce most likely comes from the condiments Japanese name, shoyu. This is a bit strange, given that the Chinese invented the process of fermenting soy to create this nuanced sauce packed… [+5370 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Dr. Elizabeth Klodas", "title": "A cardiologist shares the 5 foods she eats to lower cholesterol—and keep her 'heart healthy' - CNBC", "description": "One of the biggest health concerns among Americans today is high cholesterol. But the solution doesn't have to come from a pill, says cardiologist Dr. Elizabeth Klodas. Here are five foods she eats every day to lower LDL cholesterol numbers — or the \"bad\" cho…", "url": "https://www.cnbc.com/2022/09/09/a-cardiologist-shares-foods-she-eats-every-day-to-lower-cholesterol-and-keep-a-healthy-heart.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107115675-1662663232919-GettyImages-1320631621.jpg?v=1662663300&w=1920&h=1080", "publishedAt": "2022-09-09T14:06:46Z", "content": "As a cardiologist who has treated thousands of patients, one of the most common health concerns I come across is high cholesterol. But the solution doesn't always have to come from a pill, which can … [+2759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "What does the future Covid-19 vaccine look like? It has to be multivalent - The Indian Express", "description": "A combination of ancestral and BA.1 (which was one of the variants that caused the January surge) will provide the widest protection while a combination with BA.4 or BA.5 will provide good protection against the variants in circulation. If we plan to add more…", "url": "https://indianexpress.com/article/lifestyle/health-specials/covid-19-vaccine-multivalent-8141282/", "urlToImage": "https://images.indianexpress.com/2022/09/doctor.jpeg", "publishedAt": "2022-09-09T13:09:28Z", "content": "Dr Agarwal is the Dean of Biosciences and Health Research at the Trivedi School of Biosciences of Ashoka University. He is a trained pulmonologist whose research focusses on respiratory disease biolo… [+5642 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Vanshika Sharma", "title": "Are artificial sweeteners safe for your heart? Here’s what a study says - Health shots", "description": "We often turn to foods with artificial sweeteners instead of refined sugar to reduce risk of obesity, diabetes and heart problems. But know what a new study says.", "url": "https://www.healthshots.com/health-news/are-artificial-sweeteners-safe-for-your-heart-heres-what-a-study-says/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/09/09181015/sweeteners.jpg", "publishedAt": "2022-09-09T13:00:58Z", "content": "In today’s world, dietary drinks and foods laced with artificial sweeteners are doing the rounds among fitness-conscious people. In fact, artificial sweeteners find their way into foods which claim t… [+2843 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Can moderate exercise reverse blood vessel damage in diabetes - The Indian Express", "description": "A new study says so. 'We get complaints of diabetic foot all the time where a patient’s blood vessels are affected badly. Now research hints at the possibility of new vessels being formed in diabetics. Of course, we do prescribe walking and moderate exercises…", "url": "https://indianexpress.com/article/lifestyle/health-specials/can-moderate-exercise-reverse-blood-vessel-damage-in-diabetes-8140786/", "urlToImage": "https://images.indianexpress.com/2022/09/pexels-li-sun-2294361.jpg", "publishedAt": "2022-09-09T12:28:01Z", "content": "What if somebody told you that moderate exercises could help you reverse your diabetic foot, a condition when high blood sugar damages the nerves and blood vessels in the feet, making you numb or tin… [+4109 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Younger people are more prone to cancer, here is why - Down To Earth Magazine", "description": "Risk factors include &mdash; highly processed foods, sugary beverages, weight, type 2 diabetes, sedentary lifestyle, sleep deprivation and alcohol consumption", "url": "https://www.downtoearth.org.in/news/health/younger-people-are-more-prone-to-cancer-here-is-why-84842", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2022-09-09/0.66117900_1662720017_cancer.jpg", "publishedAt": "2022-09-09T12:27:52Z", "content": "Risk factors include — highly processed foods, sugary beverages, weight, type 2 diabetes, sedentary lifestyle, sleep deprivation and alcohol consumptionThe incidence of cancers diagnosed before the a… [+2973 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "INDIATODAY", "title": "5 Tips To Reduce Your Belly Fat - India Today", "description": "Want to wear a figure-hugging dress but worried about your stomach bulging out?", "url": "https://www.indiatoday.in/visualstories/wellness/5-tips-to-flatten-your-belly-fat-10361-09-09-2022", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/visualstory/stories/2022_09/story_10361/assets/15.jpeg?time=1662724970", "publishedAt": "2022-09-09T12:05:19Z", "content": "Include abdominal muscles workout to reduce belly fat. Try crunches, planks, and leg raising exercises."}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "UN health agency kicks off meningitis vaccination campaigns in Africa - indiablooms", "description": "New York: With the COVID-19 pandemic delaying meningitis vaccination campaigns for more than 50 million children in Africa, the region is at a heightened risk of outbreaks of meningitis type A, the UN health agency said on Thursday.", "url": "https://www.indiablooms.com/health-details/H/11931/un-health-agency-kicks-off-meningitis-vaccination-campaigns-in-africa.html", "urlToImage": "https://www.indiablooms.com/health_pic/2022/ea0afaad46abc03c9ec0b4619745a617.jpg", "publishedAt": "2022-09-09T10:58:24Z", "content": "New York: With the COVID-19 pandemic delaying meningitis vaccination campaigns for more than 50 million children in Africa, the region is at a heightened risk of outbreaks of meningitis type A, the U… [+3634 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Your hypertension is killing your bones faster than ever - Ahmedabad Mirror", "description": "#NEWYORK\nA team of researchers has discovered that high high blood pressure may lead to bone loss and osteoporosis-related bone damage.\nIn lab studies on rats, they found that when compared to the young mice without hypertension, the young mice with induced h…", "url": "https://ahmedabadmirror.com/your-hypertension-is-killing-your-bones-faster-than-ever/81844385.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1662662110848.jpg-org", "publishedAt": "2022-09-09T09:31:13Z", "content": "Researchers say by understanding how high BP leads to osteoporosis, risks may be reduced\r\n#NEWYORKA team of researchers has discovered that high high blood pressure may lead to bone loss and osteopor… [+2071 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI Press Release", "title": "Scientists from Spain and India lead an international project to develop new antibiotics against Gram-negative bacteria - Business Standard", "description": "Bengaluru (Karnataka) [India], September 9 (ANI/BusinessWire India): Antimicrobial resistance (AMR) and the increase of multi-resistant bacteria is an ongoing threat to global public health, as the World Health Organization (WHO) warns. In 2019,", "url": "https://www.business-standard.com/content/press-releases-ani/scientists-from-spain-and-india-lead-an-international-project-to-develop-new-antibiotics-against-gram-negative-bacteria-122090900483_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-09/09/full/20220909131140.jpg", "publishedAt": "2022-09-09T08:00:04Z", "content": "Bengaluru (Karnataka) [India], September 9 (ANI/BusinessWire India): Antimicrobial resistance (AMR) and the increase of multi-resistant bacteria is an ongoing threat to global public health, as the W… [+6343 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Immunity: Best Ways To Incorporate Immunity-Boosting Foods In Your Diet - NDTV", "description": "Immunity-Boosting Foods:  In this article, we discuss how you can incorporate different immunity-boosting foods into your diet.", "url": "https://www.ndtv.com/health/immunity-best-ways-to-incorporate-immunity-boosting-foods-in-your-diet-3304971", "urlToImage": "https://c.ndtvimg.com/2021-09/3slploe_gulkand_625x300_27_September_21.jpg", "publishedAt": "2022-09-09T05:32:44Z", "content": "Immunity-Boosting Foods: Turmeric and cinnamon milk is a great immunity-boosting beverage\r\nEating healthy is extremely essential to make sure our bodies receive the nutrients it needs. In addition to… [+3545 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Swine flu: Warning signs and symptoms, treatments, key precautions to avoid H1N1 - Hindustan Times", "description": "Doctors reveal what are the key precautions required to avoid swine flu or H1N1, the symptoms and warning signs to look out for if someone has caught it, treatments to overcome it and special precautions and care are required specifically for children and the…", "url": "https://www.hindustantimes.com/lifestyle/health/swine-flu-warning-signs-and-symptoms-treatments-key-precautions-to-avoid-h1n1-101662698887791.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/09/1600x900/pexels-cottonbro-3951628_1662699417407_1662699442554_1662699442554.jpg", "publishedAt": "2022-09-09T05:16:53Z", "content": "H1N1 is simply one of the strains of the influenza virus, that causes H1N1 flu, also commonly called swine flu as it was originally found in pigs. The virus is quite contagious and spreads between hu… [+5034 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Devyani Madaik", "title": "Vaccines Significantly Lower Risk Of Long-Term Effects Of COVID-19 - Swachh India NDTV", "description": "The study said that people who received at least two doses of the COVID-19 vaccination compared to those who received none experienced 8 of the 10 most frequently reported symptoms between 50 and 80 per cent less often", "url": "https://swachhindia.ndtv.com/vaccines-significantly-lower-risk-of-long-term-effects-of-covid-19-70930/", "urlToImage": "https://w.ndtvimg.com/sites/3/2022/09/09183211/660-3-2.jpg", "publishedAt": "2022-09-09T05:05:58Z", "content": "Ramat Gan: A new study demonstrates that receiving at least two doses of Pfizer vaccinations significantly lowers the majority of the long-term symptoms people observed months after getting COVID-19.… [+5785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Why diabetics should monitor blood sugar levels before exercising - The Indian Express", "description": "Universally, 30 minutes of exercise for at least five days a week is recommended for all diabetic patients, said a doctor", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-before-exercising-diabetics-blood-sugar-level-8134914/", "urlToImage": "https://images.indianexpress.com/2022/09/GettyImages-cycling-1200.jpg", "publishedAt": "2022-09-09T03:40:49Z", "content": "The Centers for Disease Control and Prevention (CDC) defines diabetes as a “chronic (long-lasting) health condition that affects how your body turns food into energy”. It explains that the human body… [+4413 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Do non-alcoholic or energy drinks increase risk of progressive retinal disease? - Hindustan Times", "description": "Of late, the consumption of energy drinks has been on the rise among the younger population. Doctors reveal whether non-alcoholic drinks are a ‘healthier’ alternative to sugary soft drinks or associated with increased odds of severe diabetic eye complications…", "url": "https://www.hindustantimes.com/lifestyle/health/diabetic-eye-do-non-alcoholic-or-energy-drinks-increase-the-risk-of-progressive-retinal-disease-doctors-answer-101662691309449.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/09/1600x900/kenny-eliason-OGlhEkaMot0-unsplash_1662691821060_1662691848361_1662691848361.jpg", "publishedAt": "2022-09-09T03:02:52Z", "content": "Of late, the consumption of energy drinks also has been on the rise among the younger population and caffeine, a major content of these, is said to reduce choroidal thickness and blood-flow in the ey… [+4130 chars]"}, {"source": {"id": null, "name": "Sparkchronicles.com"}, "author": null, "title": "Smallpox Of The Apes, There Is The First Case In Salento. Faithful: “It is transmitted with physical con... - Spark Chronicles", "description": "LECCE - Persistent fever and spots on the skin: these are the symptoms that prompted a 45-year-old f", "url": "https://sparkchronicles.com/smallpox-of-the-apes-there-is-the-first-case-in-salento-faithful-it-is-transmitted-with-physical-contact-it-is-healed-within-a-month-cases-on-the-rise-in-italy/", "urlToImage": "https://www.corrieresalentino.it/wp-content/uploads/2021/12/alberto-fedele.jpg.webp", "publishedAt": "2022-09-09T02:59:09Z", "content": "LECCE – Persistent fever and spots on the skin: these are the symptoms that prompted a 45-year-old from Lecce to contact his doctor basic to ascertain the causes of what appeared to be a strange flu … [+1286 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers discover new way to reverse effects of neurological disease in patient cells, mice - Devdiscourse", "description": "Scientists at Mount Sinai's Icahn School of Medicine, the National Center for Advancing Translational Sciences (NCATS), and other institutions have reversed the effects of several life-threatening inherited neurodegenerative diseases known as lysosomal storag…", "url": "https://www.devdiscourse.com/article/health/2172812-researchers-discover-new-way-to-reverse-effects-of-neurological-disease-in-patient-cells-mice", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/09_09_2022_02_00_43_4720367.jpg?width=920&format=jpeg", "publishedAt": "2022-09-09T02:01:06Z", "content": "Scientists at Mount Sinai's Icahn School of Medicine, the National Center for Advancing Translational Sciences (NCATS), and other institutions have reversed the effects of several life-threatening in… [+3772 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Susan Kreimer", "title": "Insomnia Often Goes Hand in Hand With Depression in Older Adults - Medscape", "description": "These overlapping conditions can prove a vicious cycle impacting overall health, but cognitive behavioral therapy has emerged as a potential savior.", "url": "https://www.medscape.com/viewarticle/980478", "urlToImage": "https://img.medscape.com/thumbnail_library/is_210223_senior_insomnia_800x450.jpg", "publishedAt": "2022-09-08T23:42:57Z", "content": "As people age, symptoms of insomnia often creep in. They may toss and turn for hours, struggling to fall or stay asleep. Frequent nocturnal and early morning awakenings are very common in older adult… [+8018 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "The Global Fund: replenishment and future-proofing - The Lancet", "description": "From Sept 19 to 22, the Global Fund to Fight AIDS, Tuberculosis and Malaria will gather\ninternational donors to replenish funding for its vital core mission towards Sustainable\nDevelopment Goal (SDG) 3: ending AIDS, tuberculosis, and malaria and building resi…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01735-4/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/b8ec279c-5a29-409a-9ad2-043d8a78ff50/fx1.jpg", "publishedAt": "2022-09-08T23:04:33Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}]}