{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Nibbling synapses: Glial cells eating of synapses may enhance learning and memory - Science Daily", "description": "As our brains develop, cells within it 'eat' neuronal elements to clear out debris, pathogens and help improve efficiency. A recent study showed that motor learning in mice helped enhance the engulfing of synapses by Bergmann glial cells. The discovery could …", "url": "https://www.sciencedaily.com/releases/2022/11/221102110535.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-02T15:45:07Z", "content": "As our brains develop, cells within it 'eat' neuronal elements to clear out debris, pathogens and help improve efficiency. A recent study showed that motor learning in mice helped enhance the engulfi… [+3092 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "mint", "title": "How the KFD vaccine is made and tested | Mint - Mint", "description": "The Institute of Animal Health and Veterinary Biologicals, located in Hebbal, Bengaluru, manufactured the Kyasanur Forest Disease (KFD) vaccine until 2022. The manufacturing process for the vaccine has not changed since the 1980s, when the vaccine was origina…", "url": "https://www.livemint.com/science/health/how-the-kfd-vaccine-is-made-and-tested-11667398917864.html", "urlToImage": "https://images.livemint.com/img/2022/11/02/600x338/KFD_vaccine_1667399060646_1667399060770_1667399060770.jpg", "publishedAt": "2022-11-02T15:17:36Z", "content": "BENGALURU : The Institute of Animal Health and Veterinary Biologicals (IAHVB), located in Hebbal, Bengaluru, manufactured the Kyasanur Forest Disease (KFD) vaccine until 2022. The number of doses it … [+6237 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Theresa R. Cerulli, MD, Andrew Cutler, MD, Alice Mao, MD, Birgit H. Amann, MD, Michael Feld, MD", "title": "Clinical Burden of ADHD and Impact on Quality of Life - MD Magazine", "description": "Panelists share clinical burden of ADHD and how it impacts pediatric, adolescent and adult populations.", "url": "https://www.hcplive.com/view/clinical-burden-of-adhd-and-impact-on-quality-of-life", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/091a5269ac3824b8ad2746c27546ef76507618dc-1920x1080.png?fit=crop&auto=format", "publishedAt": "2022-11-02T15:03:11Z", "content": "Theresa R. Cerulli, MD: The questions that come to mind is, what is the clinical burden of ADHD [attention-deficit/hyperactivity disorder] overall in young children, adolescents, and adults? How is i… [+8575 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Helen Albert", "title": "Extra Surveillance for Women at Risk of Ovarian Cancer Can Be Effective in Short Term - Inside Precision Medicine", "description": "Short-term surveillance can help improve outcomes and treatment costs before preventive surgery in women at high-risk for ovarian cancer.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/ovarian-cancer/extra-surveillance-for-women-at-risk-of-ovarian-cancer-can-be-effective-in-short-term/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2019/01/1322.jpeg", "publishedAt": "2022-11-02T14:42:47Z", "content": "Women who are carriers of one of the BRCA1/2 cancer risk alleles are advised to have preventive surgery to stop ovarian cancer, but a new U.K. study reveals that extra surveillance can be effective i… [+2193 chars]"}, {"source": {"id": null, "name": "Neurologyadvisor.com"}, "author": "Emily Estrada", "title": "Off-Label TAVI Associates With Higher Risk for Poor Outcomes - Neurology Advisor", "description": "A study was conducted to evaluate outcomes in patients that receive transcatheter aortic valve implantation for off-label indications.", "url": "https://www.neurologyadvisor.com/topics/stroke/off-label-tavi-associates-with-higher-risk-for-poor-outcomes/", "urlToImage": null, "publishedAt": "2022-11-02T14:11:00Z", "content": "Transcatheter aortic valve implantation (TAVI) for off-label indications is associated with increased risk for mortality, stroke, and bleeding compared with guideline-directed (GD)-TAVI. These findin… [+2105 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Supreeth  D R", "title": "Isolated Antero medial Osteoarthritis on the rise among Indian Patients Undergoing TKA - Medical Dialogues", "description": "Isolated antero-medial osteoarthritis (AMOA) of the knee is a distinct pattern of arthritis. Medial arthritis of the knee in select patients can be managed with uni-compartmental arthroplasty...", "url": "https://medicaldialogues.in/orthopaedics/news/isolated-antero-medial-osteoarthritis-on-the-rise-among-indian-patients-undergoing-tka-101620", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/01/189634-total-knee-replacement.jpg", "publishedAt": "2022-11-02T14:00:54Z", "content": "Isolated antero-medial osteoarthritis (AMOA) of the knee is a distinct pattern of arthritis. Medial arthritis of the knee in select patients can be managed with uni-compartmental arthroplasty (UKA), … [+2691 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Explainers", "title": "Explained: Can nose-picking raise risk of dementia and Alzheimer’s? - Firstpost", "description": "A study by an Australian university shows nose-picking can cause bacteria to travel through the nose and into the brain, where it creates markers that are a hallmark of Alzheimer's disease. The study was published in the journal Scientific Report", "url": "https://www.firstpost.com/explainers/explained-can-nose-picking-raise-risk-of-dementia-and-alzheimers-11559711.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/10/Nose-Picking-1280.jpg", "publishedAt": "2022-11-02T13:24:01Z", "content": "Everyone knows at least one person who picks their nose whether out of nervousness, boredom or curiosity.\r\nWhile many would call the habit disgusting but ultimately harmless, new research has come to… [+3218 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "DNA 'Nanotransporters' to treat cancer - Science Daily", "description": "Chemists specializing in nanotechnology draw inspiration from nature to create molecular transporters that optimize the release of therapeutic drugs.", "url": "https://www.sciencedaily.com/releases/2022/11/221102085421.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-02T13:14:50Z", "content": "A team of Canadian researchers from Université de Montréal has designed and validated a new class of drug transporters made of DNA that are 20,000 times smaller than a human hair and that could impro… [+4712 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Scientists test 'smart' red blood cells to deliver antibiotics that target specific bacteria - ANI News", "description": "The platform, described in a new paper in the journal ACS Infectious Diseases, could help to address the ongoing antibiotic resistance crisis, say the scientists. They modified and then tested red blood cells as a carrier for one of the world's only remaining…", "url": "https://www.aninews.in/news/health/scientists-test-smart-red-blood-cells-to-deliver-antibiotics-that-target-specific-bacteria20221102183645", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221102123656.jpg", "publishedAt": "2022-11-02T13:06:00Z", "content": "Washington [US], November 2 (ANI): Physicists have identified a natural delivery system which can safely carry potent antibiotics throughout the body to selectively attack and kill bacteria by using … [+2534 chars]"}, {"source": {"id": null, "name": "Drugtopics.com"}, "author": "Sandra Fyfe", "title": "Flu Shots and Ischemic Stroke Risk in Older Adults - Drug Topics", "description": "Recently published research reveals an important benefit for middle-aged and older adults: a reduction in ischemic stroke risk.", "url": "https://www.drugtopics.com/view/flu-shots-and-ischemic-stroke-risk-in-older-adults", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/99a6ce25bd66830c59176fa3a65300d1245e165e-1200x800.jpg?fit=crop&auto=format", "publishedAt": "2022-11-02T12:56:57Z", "content": "Sara Rodríguez-Martín, PharmD, PhD, of the department of biomedical sciences pharmacology sector in the school of medicine at the University of Alcalá (IRYCIS) and the clinical pharmacology unit at U… [+3999 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "doctor.ndtv.com", "title": "Mental Health: How Important Is A Proper Diet For A Good Mental Health? - NDTV Doctor", "description": "Consuming nutritious food encourages the growth of \"good\" bacteria, which in turn has a positive impact on the synthesis of neurotransmitters.", "url": "https://doctor.ndtv.com/emotions/mental-health-how-important-is-a-proper-diet-for-a-good-mental-health-3481776", "urlToImage": "https://c.ndtvimg.com/2021-06/0ppk115_healthy-diet_625x300_22_June_21.jpg", "publishedAt": "2022-11-02T12:36:47Z", "content": "Your sense of well-being and mood can be enhanced by eating a nutritious diet that is well-balanced and rich in veggies. We often consider the brain to be separate from the rest of the body, yet over… [+4088 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Dengue cases on the rise in India, Delhi records its 1st death - Down To Earth Magazine", "description": "India recorded 63,280 dengue cases as of September 30, 2022", "url": "https://www.downtoearth.org.in/news/health/dengue-cases-on-the-rise-in-india-delhi-records-its-1st-death-85739", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2022-11-02/0.86476600_1667390725_istock-187382932.jpg", "publishedAt": "2022-11-02T12:31:09Z", "content": "As many as 12 states of India have been gripped by dengue since the beginning of this year, with cases soaring in October, official data showed. \r\nExperts have linked the surge to a delayed monsoon w… [+2317 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Here’s why strong perfumes give you a headache - EastMojo", "description": "Humans can smell over 1 trillion odours. But no two people will react in quite the same way to the same smell. While there are some smells almost everyone", "url": "http://www.eastmojo.com/news/2022/11/02/three-reasons-strong-perfumes-give-you-a-headache/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/10/Untitled-design-27-2.png?fit=1200%2C675&ssl=1", "publishedAt": "2022-11-02T12:30:00Z", "content": "Humans can smell over 1 trillion odours. But no two people will react in quite the same way to the same smell. While there are some smells almost everyone agrees are unpleasant (such as paint thinner… [+6203 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Trivedi", "title": "Yoga and Pranayama can be beneficial for Alzheimer`s patients. Here`s how - Zee News", "description": "Alzheimers disease is the most common cause of dementia that affects about 5-6% of people in the age group of 65-70 years in India. Research reveals that as the population of India ages, the number of people with dementia and Alzheimer`s disease is set to go …", "url": "https://zeenews.india.com/health/yoga-and-pranayama-can-be-beneficial-for-alzheimers-patients-heres-how-2530128", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/02/1111617-untitled-design-2022-11-02t175352.982.png", "publishedAt": "2022-11-02T12:25:27Z", "content": "New Delhi: Alzheimers disease is the most common cause of dementia that affects about 5-6% of people in the age group of 65-70 years in India. Research reveals that as the population of India ages, t… [+4876 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: Can A low-Carb Diet Help Control Blood Sugar Levels? - NDTV", "description": "Diabetes diet: Adopting a low-carb diet is one strategy to improve blood sugar levels. In this article, we understand what a low-carb diet entails, how it benefits diabetics and how to follow it.", "url": "https://www.ndtv.com/health/diabetes-can-a-low-carb-diet-help-control-blood-sugar-levels-3478419", "urlToImage": "https://c.ndtvimg.com/2022-10/kl0n094o_fruits-to-avoid-in-diabetes_625x300_19_October_22.jpg", "publishedAt": "2022-11-02T12:25:22Z", "content": "You must timely check your blood sugar to better understand how to alter your diet and medication\r\nDiabetes is a chronic condition that affects a large number of people worldwide. Despite the fact th… [+4432 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The use of wearable health devices by cardiovascular disorder patients and those at an increased risk of cardiovascular disorders in the US - News-Medical.Net", "description": "Researchers evaluated the usage of WHDs (wearable health devices) by cardiovascular (CVS) disorder patients and those at an increased risk of CVS disorders in the United States (US).", "url": "https://www.news-medical.net/news/20221102/The-use-of-wearable-health-devices-by-cardiovascular-disorder-patients-and-those-at-an-increased-risk-of-cardiovascular-disorders-in-the-US.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729799_16673908790472793.jpg", "publishedAt": "2022-11-02T12:14:00Z", "content": "In a recent study soon to be presented at the American Heart Association (AHA) Scientific Sessions 2022*, researchers evaluated the usage of WHDs (wearable health devices) by cardiovascular (CVS) dis… [+5515 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "Monkeypox a global health emergency, says WHO: These precautions can keep you safe - India Today", "description": "A member committee declared monkeypox a public health emergency of international concern. Monkeypox, which spreads via close contact, tends to cause flu-like symptoms and pus-filled skin lesions.", "url": "https://www.indiatoday.in/health/story/monkeypox-a-global-health-emergency-says-who-these-precautions-can-keep-you-safe-2292349-2022-11-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/untitled_design_-_2022-11-02t124508.705-sixteen_nine.png?VersionId=gDQHijDK62sEX9z.B17RlOB2AkEJGvRZ", "publishedAt": "2022-11-02T11:55:23Z", "content": "By Daphne Clarance: Monkeypox continues to be a global health emergency, stated the World Health Organisation (WHO) on Tuesday. \r\nIn the third meeting of the International Health Regulations (IHR) (2… [+2705 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "Morning exercise has no benefits to control blood sugar: Study - Business Insider India", "description": "Morning physical activity offers no advantages in reducing insulin resistance while afternoon or evening physical activity has now been associated with better", "url": "https://www.businessinsider.in/science/health/news/morning-exercise-has-no-benefits-to-control-blood-sugar-study/articleshow/95256618.cms", "urlToImage": "https://www.businessinsider.in/photo/95256618/morning-exercise-has-no-benefits-to-control-blood-sugar-study.jpg?imgsize=29542", "publishedAt": "2022-11-02T11:53:00Z", "content": "Morning physical activity offers no advantages in reducing insulin resistance while afternoon or evening physical activity has now been associated with better blood sugar control to avoid diabetes ri… [+2613 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Is Nano vitamin D better than conventional Vitamin D when bioavailability and absorption are concerned? - Medical Dialogues", "description": "It has long been understood that vitamin D, which is synthesized under the skin when exposed to sunlight, is essential for bone health. It is well established that the association between vitamin", "url": "https://medicaldialogues.in/orthopaedics/perspective/is-nano-vitamin-d-better-than-conventional-vitamin-d-when-bioavailability-and-absorption-are-concerned-101625", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/02/189775-nano-vitamin-d.jpg", "publishedAt": "2022-11-02T11:35:03Z", "content": "It has long been understood that vitamin D, which is synthesized under the skin when exposed to sunlight, is essential for bone health. It is well established that the association between vitamin D d… [+5186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can even mild Covid cause blood clots, cardiovascular issues? - The Indian Express", "description": "According to the study, patients hospitalised with Covid were 21 times more likely to experience heart failure, and 17 times more likely to suffer a stroke", "url": "https://indianexpress.com/article/lifestyle/health/mild-covid-blood-clots-cardiovascular-disease-risk-8233567/", "urlToImage": "https://images.indianexpress.com/2022/10/covid-19-issues.jpg", "publishedAt": "2022-11-02T11:30:43Z", "content": "Emerging evidence suggests that venous thromboembolism or blood clots — that begin in patients’ veins and spread to the heart, lungs, and other regions of the body — are more likely to be experienced… [+3367 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "Chronic Daily Headaches: Types, Causes, Symptoms, and Tips for Prevention - The Quint FIT", "description": "Headaches are normal if they occur once in a while but frequent headaches can be a sign of underlying chronic diseases. Thus here are few causes, types, signs and symptoms of headaches.", "url": "https://www.thequint.com/fit/chronic-daily-headaches-types-causes-symptoms-and-tips-for-prevention", "urlToImage": "https://images.thequint.com/thequint%2F2022-07%2F4408b5be-138a-4246-9003-326b46add1bb%2Fhave_to_keep_away_from_focusing_on_the_pain_picture_id949054828.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-11-02T11:28:54Z", "content": "Headaches are a common issue in one's life and it is normal to experience headaches once in a while. But if you begin to experience severe headaches on a regular basis, or even daily- that might be a… [+613 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "What is Postmenopausal Osteoporosis? Know about your bone health - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/lifestyle/what-is-postmenopausal-osteoporosis-know-about-your-bone-health", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-11/8c2311a1-9f5e-42a0-be2f-1fee199cbd09/osteoporosis_bone_health1.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-11-02T11:21:56Z", "content": "Did you know? Osteoporosis is a common occurrence in postmenopausal women. It is a condition that weakens bones and increases the risk of fractures. It refers to a decrease in bone mass and strength.… [+1087 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Ways to boost children's immunity during winter season - Hindustan Times", "description": "Growing children are highly exposed to viral and bacterial infections in schools as well as playgrounds hence, need foods which help in building immune cells and repair body tissues to fight off these infections. Here's how parents can boost children's immuni…", "url": "https://www.hindustantimes.com/lifestyle/health/ways-to-boost-children-s-immunity-during-winter-season-101667385080258.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/02/1600x900/pexels-aleks-6706575_1667385474033_1667385503984_1667385503984.jpg", "publishedAt": "2022-11-02T11:02:08Z", "content": "While we all love winters, theres no denying that it brings many health issues in children. With the winter season approaching and our continued battle with Covid-19, a high surge in infections is pr… [+7548 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Poor quality sleep may put you at high glaucoma risk - ETHealthWorld", "description": "The findings underscore the need for sleep therapy in people at high risk of the disease as well as eye checks among those with chronic sleep disorders to check for early signs of glaucoma.", "url": "https://health.economictimes.indiatimes.com/news/industry/poor-quality-sleep-may-put-you-at-high-glaucoma-risk/95254361", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95254361,imgsize-19700,width-1200,height-628,overlay-ethealthworld/poor-quality-sleep-may-put-you-at-high-glaucoma-risk.jpg", "publishedAt": "2022-11-02T11:00:00Z", "content": "New Delhi: Poor quality sleep, including too much or too little shut eye, daytime sleepiness, and snoring, may be linked to a heightened risk of developing irreversible sight loss (glaucoma), UK-base… [+2312 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Saliva metabolome alterations after acute stress | Scientific Reports - Nature.com", "description": "Scientific Reports - Saliva metabolome alterations after acute stress", "url": "https://www.nature.com/articles/s41598-022-23136-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-23136-6/MediaObjects/41598_2022_23136_Fig1_HTML.png", "publishedAt": "2022-11-02T10:38:39Z", "content": "<li>Yaribeygi, H., Panahi, Y., Sahraei, H., Johnston, T. P. &amp; Sahebkar, A. The impact of stress on body function: A review. EXCLI J16, 10571072 (2017).\r\nPubMed \r\n PubMed Central \r\nGoogle Scholar … [+11593 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Periodontitis - A modifiable risk factor for Atrial Fibrillation, finds study - Medical Dialogues", "description": "A recent investigation found that there is a histological association between periodontitis and atrial fibrosis, and it is a modifiable risk factor for atrial fibrillation. The study was published...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/periodontitis-a-modifiable-risk-factor-for-atrial-fibrillation-finds-study-101604", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/05/149532-1600x960123662-periodontitis.jpg", "publishedAt": "2022-11-02T10:30:31Z", "content": "A recent investigation found that there is a histological association between periodontitis and atrial fibrosis, and it is a modifiable risk factor for atrial fibrillation. The study was published in… [+1989 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The acute and chronic impact of pod-based e-cigarettes on vascular health - News-Medical.Net", "description": "Researchers evaluated the impact of PEC [pod-based electronic (e)-cigarette] usage on cardiovascular (CVS) health under the agenesis of the AHA’s TCORS (tobacco center for regulatory science) group.", "url": "https://www.news-medical.net/news/20221102/The-acute-and-chronic-impact-of-pod-based-e-cigarettes-on-vascular-health.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729786_16673844625088094.jpg", "publishedAt": "2022-11-02T10:27:00Z", "content": "In a recent study soon to be presented at the American Heart Association (AHA) Scientific Sessions 2022*, researchers evaluated the impact of PEC [pod-based electronic (e)-cigarette] usage on cardiov… [+6011 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Parina Taneja", "title": "Dengue fever or viral fever: How to identify the warning signs - India TV News", "description": "Dengue cases are on the rise in India and one death has also been reported due to the dangerous fever. Here's how you can differentiate dengue fever from viral fever. at India TV News", "url": "https://www.indiatvnews.com/https://www.indiatvnews.com/web-stories/health/dengue-fever-or-viral-fever-how-to-identify-the-warning-signs-2022-11-02-820747", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1080_-/2022/11/fever-1667381850.jpg", "publishedAt": "2022-11-02T09:54:33Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Red Boost Reviews SCAM EXPOSED You Must Need To KNow - Deccan Herald", "description": "Red Boost Review: Is this Supplement Really Work Men’s Appetitive Behavior Performance? Check this Critical Review Red Boost's target market is men who have unproductiveness or other steamy performance issues. Many men can find relief from ED symptoms by boos…", "url": "https://www.deccanherald.com/brandspot/pr-spot/red-boost-reviews-scam-exposed-you-must-need-to-know-1158724.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1158724-1667381362.png", "publishedAt": "2022-11-02T09:29:22Z", "content": "Red Boost Review: Is this Supplement Really Work Mens Appetitive Behavior Performance? Check this Critical Review\r\nRed Boost's target market is men who have unproductiveness or other steamy performan… [+12673 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Study: COVID-19 Triggers Brain Inflammation Similar to Parkinson’s and Other Neurodegenerative Conditions - News18", "description": "COVID-19 activates the same inflammatory response in the brain as Parkinson’s disease and other neurodegenerative conditions", "url": "https://www.news18.com/news/lifestyle/study-covid-19-triggers-brain-inflammation-similar-to-parkinsons-and-other-neurodegenerative-conditions-6292423.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/brain-165581295916x9.png", "publishedAt": "2022-11-02T09:25:02Z", "content": "COVID-19 activates the same inflammatory response in the brain as Parkinsons disease and other neurodegenerative conditions, according to research led by University of Queensland (UQ), Australia. Thi… [+3275 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Building Bone Health With A Healthy Diet and Exercises - News18", "description": "Building strong and healthy bones during childhood and adolescence with a healthy balanced diet, can help prevent bone ailments in adulthood", "url": "https://www.news18.com/news/lifestyle/building-bone-health-with-a-healthy-diet-and-exercises-6292297.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/arthritis-166252357216x9.jpg", "publishedAt": "2022-11-02T09:12:00Z", "content": "Bones are an integral part of our body in the body. They provide structure, protect organs, and store calcium. Building strong and healthy bones during childhood and adolescence with a healthy balanc… [+2874 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How does imprinted SARS-CoV-2 humoral immunity drive convergent Omicron evolution? - News-Medical.Net", "description": "Researchers examined how imprinted SARS-CoV-2 humoral immunity drives convergent evolution in continuously emerging Omicron subvariants.", "url": "https://www.news-medical.net/news/20221102/How-does-imprinted-SARS-CoV-2-humoral-immunity-drive-convergent-Omicron-evolution.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729772_1667379028396344.jpg", "publishedAt": "2022-11-02T08:57:00Z", "content": "In a recent study posted to the bioRxiv* server, researchers examined how imprinted severe acute respiratory syndrome coronavirus-2 (SARS-CoV-2) humoral immunity drives convergent evolution in contin… [+5534 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists trace the brain circuits that cause vomiting after consuming infected food - Tech Explorist", "description": "Scientists mapped out the detailed neural pathway of the defensive responses from the gut to brain in mice.", "url": "https://www.techexplorist.com/scientists-trace-brain-circuits-cause-vomiting-consuming-infected-food/54603/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/vomiting.jpg", "publishedAt": "2022-11-02T08:01:32Z", "content": "If you’re throwing up, it usually means your body is trying to get rid of a toxin. Often, it is a sign of a stomach infection.\r\nThe urge to vomit after eating contaminated food is the body’s natural … [+3874 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "High Blood Pressure: Long-term BP affects kidneys; check kidney disease symptoms and how to keep BP in chec... - Zee News", "description": "Reduce High Blood Sugar: 5 vegetables good for diabetes patients - consume regularly Symptoms of Kidney Disease According to Webmd, the following are the symptoms of kidney disease: - High/worsening blood pressure - Decrease in the amount of urine or difficul…", "url": "https://zeenews.india.com/health/high-blood-pressure-long-term-bp-affects-kidneys-check-kidney-disease-symptoms-and-how-to-keep-bp-in-check-2529966", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/02/1111455-blood-pessure-pixabay-bp.jpg", "publishedAt": "2022-11-02T07:59:21Z", "content": "High Blood Pressure or Hypertension is one of the leading causes of kidney diseases and eventually kidney failure, which is end-stage renal disease. Every human being normally has two kidneys and the… [+2099 chars]"}, {"source": {"id": null, "name": "Nippon.com"}, "author": null, "title": "Japan Team Develops Way to Efficiently Activate Anticancer Immunity - Nippon.com", "description": "Osaka, Nov. 2 (Jiji Press)--A Japanese research team has announced the development of a vaccine ingredient cap…", "url": "https://www.nippon.com/en/news/yjj2022110200146/", "urlToImage": "https://www.nippon.com/en/ncommon/contents/news/2062551/2062551.jpg", "publishedAt": "2022-11-02T07:13:24Z", "content": "Osaka, Nov. 2 (Jiji Press)--A Japanese research team has announced the development of a vaccine ingredient capable of effectively activating anticancer immune cells, even with a small amount of cance… [+991 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Tirtho Banerjee", "title": "Having cough, fever or sore throat? Here’s how you can find out if it’s flu, RSV or Covid - India Today", "description": "Since their symptoms are similar, it is important that we understand the subtle difference between influenza, Respiratory Syncytial Virus (RSV), and Covid-19.", "url": "https://www.indiatoday.in/health/story/cough-fever-sore-throat-flu-season-rsv-covid-symptoms-treatment-medicine-2292331-2022-11-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/mask_1-sixteen_nine.jpg?VersionId=e1Zx.DFIopGk6Rv0gpvBiNKkkTXR6HSS", "publishedAt": "2022-11-02T07:13:07Z", "content": "By Tirtho Banerjee: Are you suffering from bouts of cough, runny nose, fever, sore throat, or headache? Winter is round the corner and most of us do experience these during this season. But how do yo… [+3699 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Olive Oil Or Desi Ghee? Nutritionist Pooja Malhotra Tells Which Is Healthier - NDTV", "description": "Desi ghee has a high smoking point. This, according to the nutritionist, makes desi ghee a good choice for high-temperature Indian cooking.", "url": "https://www.ndtv.com/health/olive-oil-or-desi-ghee-nutritionist-pooja-malhotra-tells-which-is-healthier-3478985", "urlToImage": "https://c.ndtvimg.com/2022-09/go9mb0a8_ghee_625x300_22_September_22.jpg", "publishedAt": "2022-11-02T07:13:00Z", "content": "Ghee has a high smoking point which makes it ideal for Indian cooking\r\nFrom salad dressing and baking to frying some delicious chicken and vegetables, cooking oil and ghee are used for a range of pur… [+2150 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "How Covid-19 damages lungs: The virus attacks mitochondria, continuing an ancient battle that began in the primordial soup - The Indian Express", "description": "SARS-CoV-2 is the third novel coronavirus to cause human outbreaks in the 21st century, following SARS-CoV in 2003 and MERS-CoV in 2012. We need to better understand how coronaviruses cause lung injury to prepare for the next pandemic", "url": "https://indianexpress.com/article/lifestyle/health/how-covid-19-damages-lungs-mitochondria-virus-8241993/", "urlToImage": "https://images.indianexpress.com/2022/11/lungs_1200_getty-1.jpg", "publishedAt": "2022-11-02T06:30:30Z", "content": "Viruses and bacteria have a very long history. Because viruses can’t reproduce without a host, they’ve been attacking bacteria for millions of years. Some of those bacteria eventually became mitochon… [+8036 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Things To Keep In Mind While Resuming Work After Heart Stroke - News18", "description": "While it may not be possible almost immediately to start work after suffering a heart stroke, proper rest and treatment will allow you to resume life as usual.", "url": "https://www.news18.com/news/lifestyle/things-to-keep-in-mind-while-resuming-work-after-heart-stroke-6286513.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/untitled-design-17-15-166668543416x9.png", "publishedAt": "2022-11-02T06:04:38Z", "content": "A heart stroke causes a significant burden of cardiovascular complications. It may occur in people regardless of age or gender and causes a series of cardiac changes ranging from acute myocardial inj… [+2064 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "US in flu season earlier, more severe: CDC - ETHealthWorld", "description": "There have already been at least 880,000 cases of influenza illness, 6,900 hospitalisations and 360 flu-related deaths nationally, including one child, according to estimates released on Friday by the Centers for Disease Control and Prevention (CDC), the news…", "url": "https://health.economictimes.indiatimes.com/news/industry/us-in-flu-season-earlier-more-severe-cdc/95245742", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95245742,imgsize-59752,width-1200,height-628,overlay-ethealthworld/us-in-flu-season-earlier-more-severe-cdc.jpg", "publishedAt": "2022-11-02T05:45:00Z", "content": "New York: Influenza is hitting the US unusually early and hard, resulting in the most hospitalisations at this point in the season in more than a decade and underscoring the potential for a perilous … [+900 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Recreational Drugs Including Cannabis Increase Risk Of Irregular Heartbeat - IFLScience", "description": "Surprisingly, cannabis use increased the risk of atrial fibrillation by 35 percent.", "url": "https://www.iflscience.com/recreational-drugs-including-cannabis-increase-risk-of-irregular-heartbeat-66023", "urlToImage": "https://assets.iflscience.com/assets/articleNo/66023/aImg/63104/cannabis-meta.jpg", "publishedAt": "2022-11-02T03:56:00Z", "content": "Cannabis, methamphetamine, cocaine, and opiate use are associated with a significant increase in atrial fibrillation (an irregular heartbeat), according to a new observational study by the American H… [+2356 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "3 great HIIT workouts to improve your cardio health - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/health/fitness/3-great-hiit-workouts-to-improve-your-cardio-health-111667303879806.html", "urlToImage": "https://images.livemint.com/img/2022/11/01/1140x641/HIIT_Workout_1667304318082_1667304324865_1667304324865.jpg", "publishedAt": "2022-11-02T02:31:50Z", "content": "One of my favourite ways to feel energized after a long and draining week is to either go for a long run or to do a few days of short but intense HIIT workouts. And thats what Im doing right now, bec… [+2238 chars]"}, {"source": {"id": null, "name": "Jmig.org"}, "author": null, "title": "Preoperative Hematocrit Level and Associated Risk of Transfusion Based on Fibroid Burden and Surgical Route - Journal of Minimally Invasive Gynecology", "description": "To determine the association between preoperative hematocrit and risk of blood transfusion\nfor laparotomic and laparoscopic myomectomy based on fibroid burden and surgical route.", "url": "https://www.jmig.org/article/S1553-4650(22)00972-4/fulltext", "urlToImage": "https://www.jmig.org/cms/asset/50984cd9-b1d6-4c56-b8ba-fda9fedbb982/gr2.jpg", "publishedAt": "2022-11-02T01:25:36Z", "content": "Footnotes\r\nConflict of interest: The authors report no conflict of interest.\r\nSource of funding: none\r\nPrior presentation or publications: To be presented at AAGL 2022: 51st Global Congress on MIGS; … [+158 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "WSO Angels Award for Lalita Neurology dept - The New Indian Express", "description": "Dr Vijaya also presented two research scientific papers during the conference.", "url": "https://www.newindianexpress.com/cities/vijayawada/2022/nov/02/wso-angels-award-for-lalita-neurology-dept-2514072.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/2/2/w600X390/stethoscopeMBBS.jpg", "publishedAt": "2022-11-02T01:20:00Z", "content": "Disclaimer : We respect your thoughts and views! But we need to be judicious while moderating your comments. All the comments will be moderated by the newindianexpress.com editorial. Abstain from pos… [+631 chars]"}, {"source": {"id": null, "name": "Benzinga"}, "author": "WebWire", "title": "Tea Burn Supplement Turns Ordinary Tea into The Best Detox Tea for Weight Loss - Benzinga", "description": "Tea Burn has been launched for easy weight loss and it has reached popularity as many consumers succeeded in losing weight after consuming the tea. It is processed and manufactured in an FDA approved facility in the", "url": "https://www.benzinga.com/pressreleases/22/11/w29515119/tea-burn-supplement-turns-ordinary-tea-into-the-best-detox-tea-for-weight-loss", "urlToImage": null, "publishedAt": "2022-11-01T23:20:42Z", "content": "Tea Burn has been launched for easy weight loss and it has reached popularity as many consumers succeeded in losing weight after consuming the tea. It is processed and manufactured in an FDA approved… [+2291 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Top news of October: USPSTF statin statement, refined grains tied to CAD risk and more - Healio", "description": "Healio and Cardiology Today have curated a list of the most-read news in cardiology of October 2022.Readers were most interested in U.S. Preventive Services Task Force statement on statins for primary prevention; smartphone speech analysis to detect worsening…", "url": "https://www.healio.com/news/cardiology/20221101/top-news-of-october-uspstf-statin-statement-refined-grains-tied-to-cad-risk-and-more", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/cardiology/b/breaking-news-2.jpg", "publishedAt": "2022-11-01T16:14:28Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nHealio and Cardiology Today have curated… [+3173 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Samudyata, The Conversation", "title": "Long Covid changes the human brain. We may finally know how - Scroll.in", "description": "Lost connections between nerve cells in the brain may explain cognitive symptoms such as brain fog and memory lapses.", "url": "https://scroll.in/article/1036087/long-covid-changes-the-human-brain-we-may-now-know-how", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/176556-xqyzyfyxiw-1656680595.jpg", "publishedAt": "2022-11-01T16:00:00Z", "content": "For a portion of people who get Covid, symptoms continue for months or even years after the initial infection. This is commonly referred to as long Covid.\r\nSome people with long Covid complain of bra… [+3755 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Julia Bonavitacola", "title": "Diabetic Kidney Disease Progression Associated With Changes in Muscle, Fat Amounts - AJMC.com Managed Markets Network", "description": "Patients with type 2 diabetes with a high to very high prognostic risk of diabetic kidney disease were more likely to have a reduced rectus femoris cross-sectional area, a measure of muscle mass in the lower body, and an increased visceral fat area.", "url": "https://www.ajmc.com/view/diabetic-kidney-disease-progression-associated-with-changes-in-muscle-fat-amounts", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/c2f76033e7d2f7d987f013cdd83dc65df48a70a3-3724x2094.jpg?fit=crop&auto=format", "publishedAt": "2022-11-01T14:59:07Z", "content": "A study published in Frontiers in Endocrinology found that diabetic kidney disease (DKD) progression in patients with type 2 diabetes (T2D) was associated with reduced rectus femoris cross-sectional … [+3937 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Sickness, death surpass official count in DRC monkeypox outbreak - Al Jazeera English", "description": "In the Democratic Republic of the Congo’s monkeypox outbreak, sickness and death go undetected.", "url": "https://www.aljazeera.com/gallery/2022/11/1/photos-dr-congo-monkeypox", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/10/2022-10-31T060142Z_121861697_RC2PTW9AVZGA_RTRMADP_3_HEALTH-MONKEYPOX-AFRICA.jpg?resize=1920%2C1440", "publishedAt": "2022-11-01T13:27:19Z", "content": "Yalolia, Democratic Republic of the Congo At a village clinic in central Democratic Republic of the Congo, separated from the world by a tangle of waterways and forests, six-year-old Angelika Lifafu … [+2349 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "World-first human brain cell map shows gene activity changes - Medical Xpress", "description": "Australian scientists have developed a world-first map showing gene activity changes in diverse human brain cell types from pre-birth to adulthood. By having this map of normal brain cell development, researchers will now be able to identify altered states mo…", "url": "https://medicalxpress.com/news/2022-11-world-first-human-brain-cell-gene.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/world-first-human-brai-1.jpg", "publishedAt": "2022-11-01T13:02:03Z", "content": "Australian scientists have developed a world-first map showing gene activity changes in diverse human brain cell types from pre-birth to adulthood. By having this map of normal brain cell development… [+4720 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Heart-related deaths increased among younger adults during pandemic: Study - News9 LIVE", "description": "The increases in death rates from heart disease in 2020 represented about five years of lost progress among adults nationwide", "url": "https://www.news9live.com/health/health-conditions/heart-related-deaths-increased-among-younger-adults-during-pandemic-study-205355", "urlToImage": "https://media.news9live.com/h-upload/2022/11/01/576918-covid-death-768x432-1.jpg", "publishedAt": "2022-11-01T12:10:53Z", "content": "The death rate from heartdiseases has increased during the pandemic period, as prior to 2020, death rates from heart disease had been declining among adults for decades in the US, an epidemiologist a… [+2688 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "Antibody treatment tested as a new tool against malaria: Research - Hindustan Times", "description": "Malaria killed more than 620,000 people in 2020 and sickened 241 million, mainly children under 5 in Africa. The World Health Organization is rolling out the first authorized malaria vaccine for children, but it is about 30% effective and requires four doses.…", "url": "https://www.hindustantimes.com/lifestyle/health/antibody-treatment-tested-as-a-new-tool-against-malaria-research-101667297894180.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/01/1600x900/4bf2cb16-d4db-11ec-ae80-64fe22456763_1652682434816_1667301512392_1667301512392.jpg", "publishedAt": "2022-11-01T11:23:28Z", "content": "Research in Africa found a one-time dose of an experimental drug protected adults against malaria for at least six months, the latest approach in the fight against the mosquito-borne disease. Malaria… [+2810 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "ProDentim Probiotics Healthy Teeth Ingredients and Side Effects Report Exposes - The Tribune India", "description": "After reading many research studies on how each ProDentim ingredient might impact oral hygiene, I only used the supplement. Many people have written reviews about organic supplements. ProDentim supplement does more than provide a probiotic candy. It also trac…", "url": "https://www.tribuneindia.com/news/brand-connect/prodentim-probiotics-healthy-teeth-ingredients-and-side-effects-report-exposes-446553", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_974704669.jpg", "publishedAt": "2022-11-01T09:54:00Z", "content": "After reading many research studies on how each ProDentim ingredient might impact oral hygiene, I only used the supplement. Many people have written reviews about organic supplements. ProDentim suppl… [+14746 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What makes some humans mosquito magnets? - News-Medical.Net", "description": "Researchers explored the reasons for the greater attractiveness of some individuals to mosquitoes.", "url": "https://www.news-medical.net/news/20221101/What-makes-some-humans-mosquito-magnets.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729627_16672943017487001.jpg", "publishedAt": "2022-11-01T09:24:00Z", "content": "In a recent review published in Cell Press, researchers explored the reasons for the greater attractiveness of some individuals to mosquitoes.\r\nStudy: Why are some people more attractive to mosquitoe… [+5219 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Clinical Genomics: Career Opportunities and Skill-sets - BSI bureau", "description": "We are in the Genomics era, cherished by Nobel winners like Dr Jennifer A. Doudna and Dr Emmanuelle Charpentier at 2020 for Genome editing CRISPR technology and Dr Svante Paabo in 2022  for paleogenomics. The 13 years of Human Genome Sequencing project gave h…", "url": "https://www.biospectrumindia.com/views/17/22172/clinical-genomics-career-opportunities-and-skill-sets.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/6-22172.png", "publishedAt": "2022-11-01T06:46:40Z", "content": "We are in the Genomics era, cherished by Nobel Prize winners like Dr Jennifer A. Doudna and Dr Emmanuelle Charpentier in 2020 for Genome editing CRISPR technology and Dr Svante Paabo in 2022 for pale… [+2434 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Sylvia Thompson", "title": "'There is an epidemic of short-sightedness' – The Irish Times - The Irish Times", "description": "The Covid-19 pandemic forced innovation for eye care in Ireland, consultant ophthalmologist Dr Emma Duigan says", "url": "https://www.irishtimes.com/health/your-wellness/2022/11/01/there-is-an-epidemic-of-short-sightedness/", "urlToImage": "https://www.irishtimes.com/resizer/fhWVj7r2PiMnMpeaZhu6mSZ9ZXY=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/55E4JOLF7BHQTHNBFWSOJUGUHY.jpg", "publishedAt": "2022-11-01T05:27:42Z", "content": "There is an epidemic of short-sightedness across the developed world, according to Dr Emma Duignan, consultant ophthalmologist at the Royal Victoria Eye and Ear Hospital in Dublin.\r\nIt is estimated t… [+5431 chars]"}, {"source": {"id": null, "name": "Yale.edu"}, "author": "Isabella Backman", "title": "Researchers Probe Why Vaccine Responses Differ From Person to Person - Yale School of Medicine", "description": "A team of researchers led by Yale School of Medicine’s Steven Kleinstein, PhD, is striving to understand why some people’s immune systems generate a robust", "url": "https://medicine.yale.edu/news-article/researchers-probe-why-vaccine-responses-differ-from-person-to-person/", "urlToImage": "https://ysm-res.cloudinary.com/image/upload/c_limit,f_auto,h_630,q_auto,w_1200/v1/yms/prod/da99a30b-e9a4-4cd0-9d59-ff322f32daf5", "publishedAt": "2022-10-31T20:04:06Z", "content": "COVID-19 vaccines boast efficacy rates against severe disease and hospitalization as high as 95 percent. But even among young, healthy adults, this doesnt mean individuals who received the groundbrea… [+7724 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Mass School Shootings Are Not Caused by Mental Illness - Neuroscience News", "description": "Most perpetrators of mass school shootings do not suffer from severe mental illness, a new study reports. When psychosis is present, mass murderers in an academic setting use means other than firearms to commit their crimes. Consistent with previous findings,…", "url": "https://neurosciencenews.com/mental-health-school-shootings-21759/", "urlToImage": "https://neurosciencenews.com/files/2022/10/mental-health-school-shootings-neurosicnes-public.jpg", "publishedAt": "2022-10-31T19:54:26Z", "content": "Summary: Most perpetrators of mass school shootings do not suffer from severe mental illness, a new study reports. When psychosis is present, mass murderers in an academic setting use means other tha… [+6239 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers use AI to predict compounds that could neutralize baldness - News-Medical.Net", "description": "Hair loss is undesirable for many men -; and women -; because one's hairstyle is often closely tied to their self-confidence.", "url": "https://www.news-medical.net/news/20221031/Researchers-use-AI-to-predict-compounds-that-could-neutralize-baldness.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/futuristic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg", "publishedAt": "2022-10-31T19:08:00Z", "content": "Hair loss is undesirable for many men -; and women -; because one's hairstyle is often closely tied to their self-confidence. And while some people embrace it, others wish they could regrow their los… [+2380 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Greg Slabodkin, ScienceBoard Editor in Chief", "title": "New computational method maps architecture of human tissues in unprecedented detail - The Science Board", "description": "Weill Cornell Medicine researchers have developed a new computational method to map the architecture of human tissues in unprecedented detail, with the potential to accelerate studies on organ-scale cellular interactions and enable powerful new diagnostic str…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=4937", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_bioproc/2021_12_06_21_38_2865_single_cell_analysis_social.jpg", "publishedAt": "2022-10-31T19:01:35Z", "content": "While manually combining single-cell data with maps of tissue structure is a slow and complex process, researchers developed a computational strategy -- called unsupervised discovery of tissue archit… [+2479 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Michael DePeau-Wilson", "title": "Kids With Migraines More Likely to Experience Anxiety, Depression - Medpage Today", "description": "All kids with migraine should be screened for these mental health issues, meta-analysis suggests", "url": "https://www.medpagetoday.com/neurology/migraines/101503", "urlToImage": "https://assets.medpagetoday.net/media/images/101xxx/101503.jpg", "publishedAt": "2022-10-31T17:31:17Z", "content": "Children and adolescents who experience migraines are more likely to have anxiety and depression compared with those who don't have migraines, according to a systematic review and meta-analysis.\r\nIn … [+3342 chars]"}, {"source": {"id": null, "name": "Longevity.technology"}, "author": "Roselle Espina", "title": "Can Green Tea Extract be Used as a Fat Burner? - Longevity.Technology", "description": "Many weight loss supplements have nearly the same common ingredient: green tea extract which is scientifically based to help you lose weight.", "url": "https://longevity.technology/lifestyle/can-green-tea-extract-be-used-as-a-fat-burner/", "urlToImage": "https://longevity.technology/lifestyle/wp-content/uploads/2022/10/Can-green-tea-extract-be-used-as-a-fat-burner-1.jpg", "publishedAt": "2022-10-31T17:24:48Z", "content": "Among the many supplements out there claiming that they can help you achieve a healthier and sexier body, there is green tea extract. \r\nIn fact, many weight loss or fat-burning supplements have nearl… [+8126 chars]"}]}