{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Hdy: Watch your child for addiction. It can cause cancer - The Indian Express", "description": "A ten-year-old boy from Nashik contracted cancer by chewing leftover tobacco from his father’s gutka packet. He succumbed to the disease, showing how parents need to monitor their young, surgical oncologist Dr Raj Nagarkar tells Anuradha Mascarenhas", "url": "https://indianexpress.com/article/lifestyle/health/hdy-watch-child-addiction-can-cause-cancer-7955541/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-06-at-3.47.25-PM.jpeg", "publishedAt": "2022-06-06T10:30:01Z", "content": "This is one cancer story that no parent would like to hear about but for Dr Raj Nagarkar, managing director and surgical oncologist at HCG Manavata Cancer Centre, Nashik, it has been an eye-opener on… [+2867 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "These lung cancer symptoms may not seem related to the disease - Times of India", "description": "Lung cancer is the leading cause of death in several countries. It is one of the most common cancers, accounting for almost 2.21 million global cases and 1.80 million deaths in 2020, as per the World Health Organization (WHO).", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/these-lung-cancer-symptoms-may-not-seem-related-to-the-disease/photostory/92017063.cms", "urlToImage": "https://static.toiimg.com/photo/92017069.cms", "publishedAt": "2022-06-06T10:30:00Z", "content": "Lung cancer is the leading cause of death in several countries. It is one of the most common cancers, accounting for almost 2.21 million global cases and 1.80 million deaths in 2020, as per the World… [+756 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The frequency and nature of RNA errors in both SARS-CoV-2 and its vaccine - News-Medical.Net", "description": "A recent article demonstrated that SARS-CoV-2 mutants and vaccine variability stem from ribonucleic acid polymerase inaccuracy.", "url": "https://www.news-medical.net/news/20220606/The-frequency-and-nature-of-RNA-errors-in-both-SARS-CoV-2-and-its-vaccine.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_715782_16545100344266444.jpg", "publishedAt": "2022-06-06T10:11:00Z", "content": "A recent article posted to the Research Square* preprint server demonstrated severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) mutants and vaccine variability stem from ribonucleic acid po… [+5922 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Can bariatric surgery slash risk of developing cancer & death? - Daijiworld.com", "description": "New York, Jun 6 (IANS): Adults with obesity, who achieve weight loss with bariatric surgery can reduce risk of developing cancer and death related to it, finds a study.\r\nObesity is a known risk factor for developing cancer and a host of other diseases. The In…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=965989", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/arun_060622_caridac.jpg", "publishedAt": "2022-06-06T09:56:42Z", "content": "New York, Jun 6 (IANS): Adults with obesity, who achieve weight loss with bariatric surgery can reduce risk of developing cancer and death related to it, finds a study.\r\nObesity is a known risk facto… [+1947 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Include This Summer Superfood In Your Regular Diet To Stay Cool - NDTV Doctor", "description": "Include sabja seeds in your daily diet, especially during summer", "url": "https://doctor.ndtv.com/living-healthy/here-s-a-summer-superfood-you-must-know-about-3028680", "urlToImage": "https://c.ndtvimg.com/2022-04/3p27430g_sabja-seeds-rose-drink_625x300_30_April_22.jpg", "publishedAt": "2022-06-06T09:44:59Z", "content": "In summer, it's crucial to make certain dietary adjustments. We need to eat more season-appropriate foods to stay hydrated, energised, and, most importantly, healthy even when the temperature is soar… [+2504 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "Here are 5 Indian superfoods you must add to your diet - Firstpost", "description": "Many might not be aware of superfoods that can aid our health and give us an instant boost. These items are a rich source of several vitamins, mineral and other nutrients and help boost our immunity levels", "url": "https://www.firstpost.com/living/here-are-5-indian-superfoods-you-must-add-to-your-diet-10764441.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/01/GettyImages-1188654262-1-e1654507350225.jpg", "publishedAt": "2022-06-06T09:24:37Z", "content": "Many might not be aware of superfoods that can aid our health and give us an instant boost. These items are a rich source of several vitamins, mineral and other nutrients and help boost our immunity … [+2182 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "5 Diabetes-friendly Sweet Snacks - The Quint FIT", "description": "Diabetes can put the patients on a strict diet excluding their favorite foods from the diet. But we have a solution for your sweet cravings. Here is a list of sweet snacks you can enjoy guilt-free.", "url": "https://www.thequint.com/fit/diabetes-and-diet-five-sweet-snack-options-for-diabetes-patients", "urlToImage": "https://images.thequint.com/thequint%2F2022-06%2F53d469ee-198e-4c59-9f60-d37d580ac815%2Fdiabetic_measurement_tools_and_apple_comparing_with_junk_food_picture_id1318959323.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-06T09:22:49Z", "content": "For the people who do not know what does trail mix mean, it is a mix of seeds, dry fruits, and nuts that is usually enjoyed by the hikers or mountaineers due to its portability, convenience, and cust… [+418 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Why all obese patients do not develop diabetes - Sentinelassam - The Sentinel Assam", "description": "Obesity, often a result of eating too much fat and sugar in combination with low physical activity", "url": "https://www.sentinelassam.com/international/why-all-obese-patients-do-not-develop-diabetes-595465", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/06/06/352521-dia.jpg", "publishedAt": "2022-06-06T09:02:16Z", "content": "NEW YORK: Obesity, often a result of eating too much fat and sugar in combination with low physical activity, is known as a key factor for developing Type 2 diabetes. However, some obese people do no… [+1273 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Do You Bleach Your Skin Regularly? It Does More Harm Than Good, Says Dr Geetika Mittal Gupta - NDTV Doctor", "description": "Dermatologist Dr Geetika Mittal Gupta tells her followers that face bleaching can harm the skin", "url": "https://doctor.ndtv.com/skin/dr-geetika-mittal-gupta-underlines-the-harmful-effects-of-face-bleaching-3013622", "urlToImage": "https://c.ndtvimg.com/2020-11/c6vhkbv_tips-for-skin-bleaching_625x300_05_November_20.jpg", "publishedAt": "2022-06-06T09:00:38Z", "content": "Imagine gearing up for a family wedding, party or any other social gathering. Would you go for face beaching to enhance your skin tone, or get rid of the dark spots? Well, many people still prefer to… [+3009 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A systematic review and meta-analysis on prevalence of and risk factors associated with depression, anxiety and insomnia in infectious diseases, including COVID-19: a call to action | Molecular Psychiatry - Nature.com", "description": "Molecular Psychiatry - A systematic review and meta-analysis on prevalence of and risk factors associated with depression, anxiety and insomnia in infectious diseases, including COVID-19: a call to...", "url": "https://www.nature.com/articles/s41380-022-01638-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41380-022-01638-z/MediaObjects/41380_2022_1638_Fig1_HTML.png", "publishedAt": "2022-06-06T08:35:05Z", "content": "<li>Varatharaj A, Thomas N, Ellul MA, Davies NWS, Pollak TA, Tenorio EL, et al. Neurological and neuropsychiatric complications of COVID-19 in 153 patients: a UK-wide surveillance study. Lancet Psych… [+12073 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Attention coffee lovers! New research links coffee to long life - Times of India", "description": "A new study has found that in comparison to non-coffee drinkers, adults who drank moderate amounts of coffee were less likely to die during a 7-year follow-up period.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/attention-coffee-lovers-new-research-links-coffee-to-long-life/photostory/92033869.cms", "urlToImage": "https://static.toiimg.com/photo/92034023.cms", "publishedAt": "2022-06-06T08:30:00Z", "content": "They caution that the average amount of daily sugar per cup of coffee recorded in this analysis is much lower than speciality drinks at popular coffee chain restaurants, and many coffee consumers may… [+423 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Brand Studio", "title": "Getting your family monsoon ready - Hindustan Times", "description": "The latest session of HT Spotlight, ‘Be Monsoon Ready as a Family’, presented by Sanofi Vaccines, saw Dr Indranil Halder, Associate Professor, College of Medicine and JNM hospital, Kolkata discuss how to stay safe from infections this monsoon as a family and …", "url": "https://www.hindustantimes.com/brand-stories/getting-your-family-monsoon-ready-101654501784699.html", "urlToImage": "https://images.livemint.com/img/2022/06/06/1600x900/Resize_(4)_1654503864319_1654503874626.jpg", "publishedAt": "2022-06-06T08:25:55Z", "content": "The rainy season is around the corner and so are increased instances of bronchial infections and can aggravate breathing disorders like asthma. Wet and humid weather conditions offer the perfect bree… [+4112 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Karkinos Healthcare launches HPV test CerviRaksha priced at Rs 2499 - Medical Dialogues", "description": "CerviRaksha HPV test identifies the high-risk HPV-16 and HPV-18 genotypes individually.", "url": "https://medicaldialogues.in/news/industry/pharma/karkinos-healthcare-launches-hpv-test-cerviraksha-priced-at-rs-2499-94047", "urlToImage": "https://medicaldialogues.in/h-upload/2022/01/17/168472-hpv-test.jpg", "publishedAt": "2022-06-06T07:56:17Z", "content": "Mumbai: Karkinos Healthcare - a technology driven oncology-focused managed health care platform, has introduced CerviRaksha, a first-of-its-kind clinically validated HPV test, in partnership with Kar… [+3087 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Egg Consumption May Boost Good Cholesterol, As Per Latest Study - NDTV Food", "description": "In a recent study, researchers found a positive link between moderate egg consumption and good cholesterol or HDL.", "url": "https://food.ndtv.com/news/egg-consumption-may-boost-good-cholesterol-as-per-latest-study-3041935", "urlToImage": "https://c.ndtvimg.com/2022-05/68bl0lsg_egg_625x300_23_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-06T07:49:10Z", "content": "An egg is an ingredient which is not just versatile, but also extremely beneficial for health. An excellent source of high-quality protein, an egg is also loaded with Vitamin B, D and antioxidants. A… [+2398 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "What is Covid-19 brain fog and why it is in rise in Bengaluru | Mint - Mint", "description": "Brain fog: A healthy diet including olive oil, fruits and vegetables, nuts and beans, and whole grains has been proven to improve thinking, memory. and brain health", "url": "https://www.livemint.com/science/health/what-is-covid-19-brain-fog-and-why-it-is-in-rise-in-bengaluru-11654498555112.html", "urlToImage": "https://images.livemint.com/img/2022/06/06/600x338/Covid-19_1654500035369_1654500036044.jpg", "publishedAt": "2022-06-06T07:44:30Z", "content": "The doctors in Bengaluru are witnessing cases of brain fog among patients who have recovered from Covid according to a report.What is brain fog?\r\n Brain fog is a term which is used by individuals to … [+2234 chars]"}, {"source": {"id": null, "name": "CanIndia News"}, "author": null, "title": "Nutrition myths that are rampant in India - CanIndia News", "description": "New Delhi, June 6 (IANSlife) The internet is riddled with misinformation, and it can be difficult (if not impossible) to distinguish between fact and myth. Myths that were once passed down through word of mouth are now spreading like wildfire through social m…", "url": "https://www.canindia.com/nutrition-myths-that-are-rampant-in-india/", "urlToImage": "https://www.canindia.com/wp-content/uploads/2022/03/imageCireplace.png", "publishedAt": "2022-06-06T07:40:16Z", "content": "New Delhi, June 6 (IANSlife) The internet is riddled with misinformation, and it can be difficult (if not impossible) to distinguish between fact and myth. Myths that were once passed down through wo… [+4663 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Monkeypox - Deploy Appropriate Measures to Avert Spread, CITAD Tells Govt - AllAfrica - Top Africa News", "description": "Alarmed by the outbreak of Monkeypox virus in some states across Nigeria, Centre for Information Technology and Development, CITAD, has called on the Federal Government to urgently deploy appropriate measures to contain the spread.", "url": "https://allafrica.com/stories/202206060139.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-06-06T07:30:25Z", "content": "Kano — Alarmed by the outbreak of Monkeypox virus in some states across Nigeria, Centre for Information Technology and Development, CITAD, has called on the Federal Government to urgently deploy appr… [+3257 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "IANS", "title": "Babies exposed to Covid in womb at risk of neurodevelopmental changes - Telangana Today", "description": "Babies exposed to Covid in womb at risk of neurodevelopmental changes", "url": "https://telanganatoday.com/babies-exposed-to-covid-in-womb-at-risk-of-neurodevelopmental-changes", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/06/Babies-exposed-to-Covid-in-womb-at-risk-of-neurodevelopmental-changes.jpg", "publishedAt": "2022-06-06T07:30:03Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Monkeypox outbreak: WHO lists 5 preventive measures to stop human-to-human transmission - Details here - Zee News", "description": "After a total of 780 laboratory-confirmed cases of monkeypox have been reported or identified since May 13 and as of June 2 from 27 countries across four WHO regions, the World Health Organisation (WHO) has decided to take quick action so that the spread of t…", "url": "https://zeenews.india.com/world/monkeypox-outbreak-who-lists-5-preventive-measures-to-stop-human-to-human-transmission-details-here-2470981.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/06/1050623-monkeypox-2.jpg", "publishedAt": "2022-06-06T07:23:43Z", "content": "New Delhi: After a total of 780 laboratory-confirmed cases of monkeypox have been reported or identified since May 13 and as of June 2 from 27 countries across four WHO regions, the World Health Orga… [+2764 chars]"}, {"source": {"id": null, "name": "Shethepeople.tv"}, "author": "The Conversation", "title": "What Are ‘Binaural Beats’ And Do They Affect Our Brain? - SheThePeople", "description": "You might have seen online or heard about “binaural beats”, which have been described as “digital drugs”. Listening to binaural beats has been claimed to help with sleep, stress, anxiety and cognition, and there’s much discussion online about whether or not t…", "url": "https://www.shethepeople.tv/mental-health/what-are-binaural-beats/", "urlToImage": "https://www.shethepeople.tv/wp-content/uploads/2020/04/lauren-kashuk-lCanI11Uy8Y-unsplash1-e1587545001224.jpg", "publishedAt": "2022-06-06T06:59:27Z", "content": "You might have seen online or heard about binaural beats, which have been described as digital drugs.\r\nListening to binaural beats has been claimed to help with sleep, stress, anxiety and cognition, … [+5406 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Looking Your Best Through PCOS: The Skin & Hair Guide For Patients With PCOS - NDTV", "description": "PCOS can cause various health and aesthetic complications to your body. In this article, we discuss some common concerns women with PCOS might experience in regard to their skin and hair health.", "url": "https://www.ndtv.com/health/looking-your-best-through-pcos-the-skin-hair-guide-for-patients-with-pcos-3035001", "urlToImage": "https://c.ndtvimg.com/2022-05/ao4rbj4_anti-acne-drinks_625x300_10_May_22.jpg", "publishedAt": "2022-06-06T06:43:40Z", "content": "PCOS can cause severe acne which can be tough to manage\r\nWhile PCOS (polycystic ovarian syndrome) can wreak havoc with your menstruation and fertility, it also is a very visible condition. In most ca… [+4822 chars]"}, {"source": {"id": null, "name": "Russh.com"}, "author": null, "title": "The 10 best moisturisers to add to your beauty cupboard - RUSSH", "description": "The best moisturisers leave your skin supple and hydrated, and we've compiled a list of 10 we turn to for looking and feeling our best.", "url": "https://www.russh.com/best-moisturisers/", "urlToImage": "https://www.russh.com/wp-content/uploads/2022/06/best-moist.jpg", "publishedAt": "2022-06-06T06:11:26Z", "content": "A moisturiser is the cornerstone of a daily skin care routine, the bare minimum beauty product to be slathered onto skin. While we know there is an abundance of other products to be using daily namel… [+6635 chars]"}, {"source": {"id": null, "name": "Mumbailive.com"}, "author": null, "title": "Causes and Prevention For Repeated IVF Failures - Mumbai Live", "description": "Many people in Mumbai opt for IVF treatment Through the guidance of their IVF specialist in Mumbai most couples achieve the gift of becoming parents Parenthood is a beautiful experience and the challenges that a couple must go through do not matter to them Th…", "url": "https://www.mumbailive.com/en/health/causes-and-prevention-for-repeated-ivf-failures-73608", "urlToImage": "https://www.mumbailive.com/images/media/images/dr_hrishikesh_pai_1646306213626.jpg?bg=e8dfda&canvas=0.25&crop=606%2C787%2C0%2C0&fit=fill&fitToScale=h%2C1368%2C768&fm=webp&h=606.3157894736842&height=787&w=1080&width=606", "publishedAt": "2022-06-06T06:00:00Z", "content": "Many people in Mumbai opt for IVF treatment. Through the guidance of their IVF specialist in Mumbai, most couples achieve the gift of becoming parents. Parenthood is a beautiful experience, and the c… [+4576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How Safe Is Diet Soda - Expert Reveals All - NDTV Food", "description": "Sodas are made up of carbonated water and sweeteners, like high fructose corn syrup or sucrose, phosphoric acid, natural flavours and caffeine.", "url": "https://food.ndtv.com/health/how-safe-is-diet-soda-expert-reveals-all-3041574", "urlToImage": "https://c.ndtvimg.com/2021-07/rcqc4mi_soda_625x300_27_July_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-06T05:39:04Z", "content": "Way back in the '70s, research showed that high consumption of fats was the leading cause of heart diseases. The researchers, however, forgot to differentiate between healthy fats and unhealthy fats,… [+3473 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "When thinking about pregnancy, patients with Arthritis and Lupus must control their condition due to compli... - Code List", "description": "There are different types of arthritis that we have to work on for these women, as we know that arthritis occurs mostly in women of reproductive age. Dr. Annette Pérez Delboy, director of the Ashford Center. Photo: Journal of Medicine and Public Health. Fabio…", "url": "https://codelist.biz/2022/06/06/when-thinking-about-pregnancy-patients-with-arthritis-and-lupus-must-control-their-condition-due-to-complications/", "urlToImage": "https://medicinaysaludpublica.blob.core.windows.net.optimalcdn.com/images/2022/03/26/sacs-11-2f4bc9f6.png", "publishedAt": "2022-06-06T05:38:22Z", "content": "There are different types of arthritis that we have to work on for these women, as we know that arthritis occurs mostly in women of reproductive age.\r\n Dr. Annette Pérez Delboy, director of the Ashfo… [+2814 chars]"}, {"source": {"id": null, "name": "IWMBuzz"}, "author": "Audrey Menezes", "title": "Stop: Before You Pop That Pimple, Here’s What You Should Know - IWMBuzz", "description": "NEVER pop pimple, here's why", "url": "https://www.iwmbuzz.com/lifestyle/health-fitness/stop-before-you-pop-that-pimple-heres-what-you-should-know/2022/06/06", "urlToImage": "https://www.iwmbuzz.com/wp-content/uploads/2022/06/stop-before-you-pop-that-pimple-heres-what-you-should-know.jpg", "publishedAt": "2022-06-06T05:05:41Z", "content": "If I can see the white area of a pimple, can I pop it?Dan*\r\nIt may be tempting, but popping or squeezing a pimple will not always solve the problem. Squeezing the skin can force bacteria and pus furt… [+690 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Monkeypox: What Do We Know So Far - NDTV Doctor", "description": "Since we have experienced this pandemic due to coronavirus, our fear of diseases has increased. Here's everything we know about the Monkeypox so far.", "url": "https://doctor.ndtv.com/infection/monkeypox-what-do-we-know-so-far-origin-causes-treatment-prevention-3041459", "urlToImage": "https://c.ndtvimg.com/2022-05/s324ni3o_monkeypox-bloomberg_625x300_25_May_22.jpg", "publishedAt": "2022-06-06T05:02:28Z", "content": "There has been much written and spoken about a new threat to global health that emerged in the second week of May 2022 MONKEYPOX. Coming close on the heels of the prolonged COVID-19 pandemic, there i… [+5612 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Sarah Johnson", "title": "‘Our country is getting old’: the man changing how Brazil sees dementia - The Guardian", "description": "When his grandmother was diagnosed, Fernando Peres realised how ill prepared countries like Brazil are for treating dementia", "url": "https://amp.theguardian.com/global-development/2022/jun/06/our-country-is-getting-old-the-man-changing-how-brazil-sees-dementia-acc", "urlToImage": null, "publishedAt": "2022-06-06T05:00:00Z", "content": "A common conditionWhen his grandmother was diagnosed, Fernando Peres realised how ill prepared countries like Brazil are for treating dementia\r\nIt took one year and countless visits to various doctor… [+7460 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Healthy lifestyle: How you can bring your circadian rhythm back on track - The Indian Express", "description": "Circadian rhythm tells your body when to get up and get out of bed, sleep, eat and even ovulate, says nutritionist Bhakti Kapoor", "url": "https://indianexpress.com/article/lifestyle/health/healthy-lifestyle-circadian-rhythm-on-track-internal-clock-health-7950398/", "urlToImage": "https://images.indianexpress.com/2022/06/GettyImages-circadian-rhythm-1200.jpg", "publishedAt": "2022-06-06T04:30:29Z", "content": "Owing to stressful lives, long working hours and the need to feel gratified by technology, we end up spending a big chunk of our sleeping time staring at screens, resulting in reduced sleep and an ov… [+1565 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Height increases risk of certain diseases - News-Medical.Net", "description": "In a recent study published in the Journal PLoS Genetics, researchers investigated how height determined several common clinical traits in adults by comparing associations of those traits with actual- and genetically-predicted-height.", "url": "https://www.news-medical.net/news/20220605/Height-increases-risk-of-certain-diseases.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_715764_16544868515902599.jpg", "publishedAt": "2022-06-06T03:41:00Z", "content": "In a recent study published in the Journal PLoS Genetics, researchers investigated how height determined several common clinical traits in adults by comparing associations of those traits with actual… [+6818 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Follow these breathing techniques to improve heart health - Times of India", "description": "We all know that walking, jogging or other aerobic exercises are key to heart health, but did you know that something you already do thousands of times each day can help, too?", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/follow-these-breathing-techniques-to-improve-heart-health/photostory/92008610.cms", "urlToImage": "https://static.toiimg.com/photo/92008640.cms", "publishedAt": "2022-06-06T03:30:00Z", "content": "Cardiovascular diseases (CVDs) are the leading cause of death globally, taking an estimated 17.9 million lives each year, as per World Health Organization. Moreover, heart disease and many of the con… [+1206 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "Diet for post-covid recovery: Expert shares tips - Hindustan Times", "description": "From healthy fats to consuming muscle-building food items, here’s all that you know to know about post-covid recovery diet. Take a look. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diet-for-post-covid-recovery-expert-shares-tips-101654482100554.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/06/1600x900/_6fd63af0-55b3-11e8-aa60-d0af28d4422a_1654482152458.jpg", "publishedAt": "2022-06-06T02:25:50Z", "content": "Two years back, the covid-19 pandemic changed the way we live forever. The contagious disease made us lock ourselves inside the homes and go through the terror of watching in horror how it got hold o… [+2300 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Siddhant Pusdekar", "title": "In India's Unequal Research System, Frugal Labs Are Bittersweet Gems – The Wire Science - The Wire Science", "description": "Jugaad is regarded as a virtue that makes Indians more ‘innovative’, yet the romanticism surrounding it often obscures the circumstances that make it necessary.", "url": "https://science.thewire.in/the-sciences/india-unequal-research-system-frugal-labs-bittersweet-gems/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/06/04190412/Screenshot-2022-06-04-at-6.59.48-PM.png", "publishedAt": "2022-06-06T01:59:45Z", "content": "Some of the attendees of the CUBE Conference held on August 7, 2016. Photo: HBCSE/TIFR\r\n<ul><li>In state colleges and universities, where most of Indias science students study, frugal labs are helpin… [+13179 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "discover signs to stay alert - Play Crazy Game", "description": "Mysterious cases of hepatitis are appearing in children under 10 years of age on the European continent. In most cases, these are children who are between 1 and 5 years old and have started to show the first symptoms of hepatitis. The British Health Safety Ag…", "url": "https://playcrazygame.com/2022/06/06/discover-signs-to-stay-alert/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/04/febre.jpg", "publishedAt": "2022-06-06T00:40:32Z", "content": "Mysterious cases of hepatitis are appearing in children under 10 years of age on the European continent. In most cases, these are children who are between 1 and 5 years old and have started to show t… [+2069 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "CAR-T shows 'impressive efficacy' for patients with advanced multiple myeloma - Healio", "description": "CHICAGO &mdash; A novel chimeric antigen receptor T-cell therapy has elicited objective responses among the first eight patients who received the treatment, according to results from the phase 1 POLARIS trial presented at ASCO Annual Meeting. Use of OriCAR-01…", "url": "https://www.healio.com/news/hematology-oncology/20220606/cart-shows-impressive-efficacy-for-patients-with-advanced-multiple-myeloma", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/hemonc/m/multiple_myeloma_cytology_333721002.jpeg", "publishedAt": "2022-06-06T00:36:19Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nCHICAGO — A novel chimeric antigen recep… [+3765 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Why stress-related illness is so hard to diagnose, and how to help - EastMojo", "description": "For at least three decades, researchers have gathered evidence that chronic stress puts pressure on the body to constantly adjust itself to restore", "url": "http://www.eastmojo.com/features/2022/06/06/why-stress-related-illness-is-so-hard-to-diagnose-and-how-to-help/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/06/Untitled-design-53.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-06-06T00:30:00Z", "content": "For at least three decades, researchers have gathered evidence that chronic stress puts pressure on the body to constantly adjust itself to restore physiological stability. This process is known as a… [+8180 chars]"}, {"source": {"id": null, "name": "SurvivorNet"}, "author": null, "title": "Understanding Heart Failure - SurvivorNet", "description": "This in-depth guide on heart failure offers insights on the latest research & insight from leading doctors in the field.", "url": "https://www.survivornet.com/journey/heart-failure/", "urlToImage": "https://assets.survivornet.com/wp-content/uploads/2021/03/01114905/survivornet_logo_2400x1260-1-1200x630.png", "publishedAt": "2022-06-05T22:36:10Z", "content": "What is Heart Failure?\r\nHeart failure is a condition that causes the heart to not pump blood as well as it should. It does not mean that your heart has actually failed or stopped beating; its just th… [+2828 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Lifestyle News | Study: Consumption of Protein Supplements Can Manage Type 2 Diabetes - LatestLY", "description": "Get latest articles and stories on Lifestyle at LatestLY. According to research findings published in the 'BMJ Open Diabetes Research &amp; Care' journal, consuming small quantities of whey protein before meals is beneficial for controlling blood sugar levels…", "url": "https://www.latestly.com/agency-news/lifestyle-news-study-consumption-of-protein-supplements-can-manage-type-2-diabetes-3790083.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/06/protein_supplement20220605172512-588x441.jpg", "publishedAt": "2022-06-05T17:44:24Z", "content": "England [UK], June 5 (ANI): According to research findings published in the 'BMJ Open Diabetes Research &amp; Care' journal, consuming small quantities of whey protein before meals is beneficial for … [+3174 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Kevin Kunzmann", "title": "Semaglutide Significantly Reduces Long-Term Diabetes Risk Among Obesity Patients - MD Magazine", "description": "New post hoc data from the STEP 1 and 4 trials show an approximate 60% risk reduction of type 2 diabetes over 10 years versus placebo.", "url": "https://www.hcplive.com/view/semaglutide-long-term-diabetes-risk-obesity-patients", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/fcd7214943140e5ea6ebead5eb23250fcf435708-300x300.jpg?fit=crop&auto=format", "publishedAt": "2022-06-05T17:11:04Z", "content": "Once-weekly 2.4 mg semaglutide is associated with an approximate 60% reduced risk of type 2 diabetes in patients with obesity, according to new findings presented at the American Diabetes Association… [+3708 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Shuvangi Sen Chaudhury", "title": "Fact Check: Are Nutrient Profiling Systems Helpful? - Sportskeeda", "description": "Nutrient profiling systems have been around for a while now. They let the consumer understand the nutritional value of each item and help them understand what works best for their diet.", "url": "https://www.sportskeeda.com/health-and-fitness/are-nutrient-profiling-systems-helpful-weight-loss", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/06/87d0b-16544431984948-1920.jpg", "publishedAt": "2022-06-05T16:08:17Z", "content": "Nutrient profiling systems have been around for a while now. They let the consumer understand the nutritional value of each item and help them understand what works best for their diet.\r\nHowever, the… [+3396 chars]"}, {"source": {"id": null, "name": "See.news"}, "author": "Basant ahmed", "title": "Monkeypox... Brazil Asks Its Citizens to Wear Mask - See", "description": "The Brazilian Ministry of Health announced that it is checking four other \"suspected\" cases of monkeypox, bringing the number of", "url": "https://see.news/monkeypox-brazil-asks-its-citizens-to-wear-mask/", "urlToImage": "https://see.news/wp-content/uploads/2022/05/frgfgdf.png", "publishedAt": "2022-06-05T14:58:15Z", "content": "The Brazilian Ministry of Health announced that it is checking four other “suspected” cases of monkeypox, bringing the number of patients under medical observation to six, calling on citizens to wear… [+1771 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Supreeth  D R", "title": "Amikacin & meropenem impregnated calcium sulfate beads effective for orthopaedic infections - Medical Dialogues", "description": "New York, USA: The study by LEVACK et al provides important novel data regarding the utility of...", "url": "https://medicaldialogues.in/orthopaedics/news/amikacin-meropenem-impregnated-calcium-sulfate-beads-effective-for-orthopaedic-infections-94005", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/03/177893-antibiotics.jpg", "publishedAt": "2022-06-05T14:30:18Z", "content": "New York, USA: The study by LEVACK et al provides important novel data regarding the utility of amikacin, meropenem and dalbavancin as alternative choices to place in CaSO4 carriers when treating ort… [+3053 chars]"}, {"source": {"id": null, "name": "Webnewsobserver.com"}, "author": "https://www.facebook.com/webnewsobserver", "title": "8 Reasons why should start your day with coconut water - Web News Observer", "description": "Nature is the best medicine. And one amazing gift of nature to mankind is coconut water. An amazing source of fiber, potassium, manganese, and selenium, and", "url": "https://webnewsobserver.com/8-reasons-why-should-start-your-day-with-coconut-water/", "urlToImage": "https://blaze.webnewsobserver.com/wp-content/uploads/2022/06/Copy-of-kim-kardashian-12.png", "publishedAt": "2022-06-05T14:01:54Z", "content": "Nature is the best medicine. And one amazing gift of nature to mankind is coconut water. An amazing source of fiber, potassium, manganese, and selenium, and really low in fat and sugar content it is … [+4497 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Cardiac arrest survivors at increased risk of neurologic and psychiatric events: JAMA - Medical Dialogues", "description": "Denmark: A new study conducted by Niels Secher and team showed that when compared to patients with...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/cardiac-arrest-survivors-at-increased-risk-of-neurologic-and-psychiatric-events-jama-93956", "urlToImage": "https://medicaldialogues.in/h-upload/2021/02/26/148705-257497web.jpg", "publishedAt": "2022-06-05T14:00:00Z", "content": "Denmark: A new study conducted by Niels Secher and team showed that when compared to patients with myocardial infarction and the general population, individuals discharged after cardiac arrest had a … [+3079 chars]"}, {"source": {"id": null, "name": "Chiang Rai Times"}, "author": "Salman Ahmad", "title": "COVID Can Severely Affect These 4 Organs. Check Early Symptoms - Covid-19 - CTN NEWS ", "description": "Covid is a respiratory disease that at first glance seems like it could affect our bodies in a milder or even more debilitating way. The virus has", "url": "https://www.chiangraitimes.com/covid-19/covid-can-severely-affect-these-4-organs-check-early-symptoms/", "urlToImage": "https://www.chiangraitimes.com/wp-content/uploads/2022/06/COVID-5.webp", "publishedAt": "2022-06-05T12:20:40Z", "content": "Covid is a respiratory disease that at first glance seems like it could affect our bodies in a milder or even more debilitating way. The virus has unfortunately been able to impact our lungs, heart, … [+2824 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Sangeeta Nair", "title": "Coronavirus in Rodents: Scientists discover new coronavirus strain in rodents in Sweden- Should we be alarmed? - Jagran Josh", "description": "Coronavirus in Rodents:The research team identified a new coronavirus strain known as aGrimso Virus in the bank voles caught around Grimso in Orebro County in Sweden.", "url": "https://www.jagranjosh.com/current-affairs/coronavirus-in-rodents-scientists-discover-new-coronavirus-strain-in-rodents-in-sweden-1654429151-1", "urlToImage": "https://img.jagranjosh.com/images/2022/June/562022/coronavirus_found_in-rodents_in_sweden (1).jpg", "publishedAt": "2022-06-05T11:45:00Z", "content": "Coronavirus in Rodents: A team of scientists in Sweden have identified a new coronavirus commonly found in red-backed voles, small dark grey rodents similar to field mice.\r\nThe study was conducted by… [+2671 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "5 complex health problems that could arise due to uncontrolled type 2 diabetes - Times Now", "description": "When an individual suffers from diabetes, high blood sugar levels can harm vital organs and nerves over time. The increase in blood sugar level can be detrimental to the body.", "url": "https://www.timesnownews.com/health/5-complex-health-problems-that-could-arise-due-to-uncontrolled-type-2-diabetes-article-92019444", "urlToImage": "https://static.tnn.in/thumb/msid-92019444,imgsize-100,width-1280,height-720,resizemode-75/92019444.jpg", "publishedAt": "2022-06-05T11:22:00Z", "content": "Ministry urges citizens to adopt government-subsidised rooftop solar panels, launches pan-India campaign"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5-year-old's sample sent for monkeypox testing; Know all about the tell-tale signs, testing procedures and preventive measures - Times of India", "description": "In a recent report, the Ghaziabad health department sent samples from a five-year-old child for monkeypox testing. The two doctors who sent the samples to the National Institute of Virology, or NIV, were treating the young patient in a private clinic when the…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/5-year-olds-sample-sent-for-monkeypox-testing-know-all-about-the-tell-tale-signs-testing-procedures-and-preventive-measures/photostory/92016764.cms", "urlToImage": "https://static.toiimg.com/photo/92016771.cms", "publishedAt": "2022-06-05T10:30:00Z", "content": "In light of increasing monkeypox cases, India`s Health Ministry recently issued `Guidelines on Management of Monkeypox Disease` to prevent the disease outbreak.\r\n\"There are no reported cases of monke… [+1178 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Circulating tumor DNA can identify stage II colon cancer patients : Research - ANI News", "description": "Washington [US], June 5 (ANI): Circulating tumor DNA (ctDNA) thats is a genetic material shed from tumors into the bloodstream can identify stage II colon cancer patients who can most benefit from chemotherapy following surgery and spare other patients the ne…", "url": "https://www.aninews.in/news/health/circulating-tumor-dna-can-identify-stage-ii-colon-cancer-patients-research20220605145640", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/hgfjgkh20220605092616.jpg", "publishedAt": "2022-06-05T09:26:00Z", "content": "ANI | Updated: Jun 05, 2022 14:56 IST\r\nWashington [US], June 5 (ANI): Circulating tumor DNA (ctDNA) thats is a genetic material shed from tumors into the bloodstream can identify stage II colon cance… [+5684 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Chance of ‘Aneurym Rupture’ can be reduced via some blood pressure medicines - ThePrint", "description": "Dallas [US], June 5 (ANI): A class of blood pressure-lowering medications, reduced the risk of aneurysm rupture by 18 per cent in a multi-centre study of more than 3,000 people with high blood pressure and brain aneurysms, according to new research by the Ame…", "url": "https://theprint.in/science/chance-of-aneurym-rupture-can-be-reduced-via-some-blood-pressure-medicines/984365/", "urlToImage": null, "publishedAt": "2022-06-05T09:15:46Z", "content": "Dallas [US], June 5 (ANI): A class of blood pressure-lowering medications, reduced the risk of aneurysm rupture by 18 per cent in a multi-centre study of more than 3,000 people with high blood pressu… [+4540 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Jigyasa Kakwani", "title": "Planning to go for a swim? Doctors warn about infections you might catch in a public swimming pool - Times of India", "description": "But before you get your swimming bag ready, have you ever wondered  about the diseases you can catch from a public", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/planning-to-go-for-a-swim-doctors-warn-about-infections-you-might-catch-in-a-public-swimming-pool/articleshow/92006463.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92006523,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-196512/92006523.jpg", "publishedAt": "2022-06-05T05:30:00Z", "content": "The June sun is upon us and it is the best time to hit the refreshing swimming pools to beat the scorching heat. It is super refreshing and fun, whether you go for swimming lessons, water sports or a… [+4853 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Dr Anushikha Dhankhar", "title": "Heart and cardiovascular problems: Not just an old-age problem - Moneycontrol", "description": "Precautions against heart diseases for men in the late 40s and early 50s.", "url": "https://www.moneycontrol.com/news/trends/health-trends/heart-and-cardiovascular-problems-not-just-an-old-age-problem-8642031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/Heart-health-770x433.jpg", "publishedAt": "2022-06-05T03:42:07Z", "content": "May 31, 2022. A melodious evening in the City of Joy. Seemingly healthy, Krishnakumar Kunnath (KK) had fans singing along at the Nazrul Mancha auditorium. He had complained of some uneasiness during … [+5699 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "What Can People Do To Avoid Sudden Heart Attacks? | Mint - Mint", "description": "A heart attack, also called a myocardial infarction, happens when a part of the heart muscle doesn’t get enough blood", "url": "https://www.livemint.com/science/health/what-can-people-do-to-avoid-sudden-heart-attacks-11654398770270.html", "urlToImage": "https://images.livemint.com/img/2022/06/05/600x338/heart_attack_1654399994431_1654399994676.jpg", "publishedAt": "2022-06-05T03:38:04Z", "content": "Jammu and Kashmir administration has asked pilgrims to follow precautionary measures ahead of the commencement of the annual Amarnath pilgrimage. According to the report in ANI, over 90 pilgrims lost… [+2135 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Why protein is so important for older adults - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/health/wellness/why-protein-is-so-important-for-older-adults-111654391333838.html", "urlToImage": "https://images.livemint.com/img/2022/06/05/1140x641/Health_Protein_1654395269887_1654395285665.jpg", "publishedAt": "2022-06-05T02:40:34Z", "content": "Shreya Majumder had always led an active life. After she retired from her job as a bank officer in Kolkata, she continued with her routine walks. Around the same time, she decided to give up on non-v… [+4471 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "Liquid biopsy may better predict response to immunotherapy in lung cancer patients than tumor biopsy - OI Canadian", "description": "Mount Sinai researchers have validated for the first time that a simple blood test called a liquid biopsy may be a better predictor of a lung cancer patient's response to immunotherapy than an invasiv", "url": "https://oicanadian.com/liquid-biopsy-may-better-predict-response-to-immunotherapy-in-lung-cancer-patients-than-tumor-biopsy/", "urlToImage": "https://fr.palestinaliberation.com/wp-content/uploads/2022/03/Reponses-des-lymphocytes-T-liees-a-la-protection-contre-linfection.jpg", "publishedAt": "2022-06-05T02:38:32Z", "content": "Mount Sinai researchers have validated for the first time that a simple blood test called a liquid biopsy may be a better predictor of a lung cancer patient’s response to immunotherapy than an invasi… [+2441 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "GK NEWS NETWORK", "title": "Canada confirms 58 cases of monkeypox - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/srinagar/canada-confirms-58-cases-of-monkeypox", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-05%2F7bb8c13e-354a-432f-9f71-d093dc62562b%2FScreenshot__2226_.png?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-04T23:06:18Z", "content": "Indo Asian News Service\r\nOttawa, June 4: Canada has confirmed 58 cases of monkeypox, the country's Chief Public Health Officer Theresa Tam said.\r\nSpeaking to reporters at a health briefing, Tam said … [+149 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "Pumpkin seeds have only health benefits! No doubt: eat it regularly! - OI Canadian", "description": "This is the trend of recent years: pumpkin seeds are on the rise in the field of food. Indeed, rich in proteins, micronutrients and vitamins, pumpkin seeds are super foods. In addition, they have a si", "url": "https://oicanadian.com/pumpkin-seeds-have-only-health-benefits-no-doubt-eat-it-regularly/", "urlToImage": "https://deavita.fr/wp-content/uploads/2022/06/les-bienfaits-des-graines-de-courges-sur-notre-sante-en-2022.jpg", "publishedAt": "2022-06-04T22:13:11Z", "content": "This is the trend of recent years: pumpkin seeds are on the rise in the field of food. Indeed, rich in proteins, micronutrients and vitamins, pumpkin seeds are super foods. In addition, they have a s… [+3225 chars]"}, {"source": {"id": null, "name": "EL PAÍS"}, "author": "Nuño Domínguez", "title": "The dream of a universal cancer vaccine… we’re getting closer - EL PAÍS in English", "description": "Results from animal experiments reveal a revolutionary method that stimulates the immune system to destroy even the most resistant tumors, using a new molecule and approach to removes cancers’ invisibility", "url": "https://english.elpais.com/science-tech/2022-06-04/the-dream-of-a-universal-cancer-vaccine-were-getting-closer.html", "urlToImage": "https://images.english.elpais.com/resizer/dIUofBzTCKUwiDyc2oKXS-3IvFY=/1200x0/cloudfront-eu-central-1.images.arcpublishing.com/prisa/2PYWAYP5CVFCBPOBOWFD6622O4.jpg", "publishedAt": "2022-06-04T19:08:00Z", "content": null}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Arif Mohammad and Suraj Kumar", "title": "Perilous pathogen - Millennium Post", "description": "While bewildered health experts are scrambling through the dark to find out exact transmission...", "url": "http://www.millenniumpost.in/sundaypost/in-retrospect/perilous-pathogen-480873", "urlToImage": "http://www.millenniumpost.in/h-upload/2022/06/04/626156-1280px-livingontherainforest2-1.jpg", "publishedAt": "2022-06-04T18:54:42Z", "content": "In the largest Monkeypox outbreak outside Africa ever, nearly 800 cases of infection have come out mostly in European countries. Just appearing to emerge from the COVID-19 pandemic, the global popula… [+8505 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Pregnancy and mental health - Rising Kashmir", "description": "Rising Kashmir: Leading English newspaper in Jammu and Kashmir", "url": "https://www.risingKashmir.com/", "urlToImage": "https://www.risingkashmir.com/userfiles/image/safe_imagenow.png", "publishedAt": "2022-06-04T18:44:18Z", "content": null}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Editor", "title": "Smoking Takes a Toll On Male and Female Reproductive Health: Explains Doctor - Punekar News", "description": "Pune, 30th May 2022: Smoking not only causes lung cancer, heart disease, stroke, and lung diseases, but also reproductive health problems in men and women. It can lead to erectile dysfunction and low sperm count in men, while infertility, ectopic pregnancy, p…", "url": "https://www.punekarnews.in/smoking-takes-a-toll-on-male-and-female-reproductive-health-explains-doctor/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2021/05/smoking.jpg", "publishedAt": "2022-06-04T18:27:50Z", "content": "Pune, 30th May 2022: Smoking not only causes lung cancer, heart disease, stroke, and lung diseases, but also reproductive health problems in men and women. It can lead to erectile dysfunction and low… [+2721 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Treadmill versus exercise bike: What’s better for weight loss? - Times of India", "description": "We all know that both exercise bikes and treadmills are excellent cardio machines, and they each have their own set of advantages. Of course, the intensity with which the exerciser works has a significant impact on the equipment's benefits.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/treadmill-versus-exercise-bike-whats-better-for-weight-loss/photostory/91987798.cms", "urlToImage": "https://static.toiimg.com/photo/91987963.cms", "publishedAt": "2022-06-04T15:30:00Z", "content": "When you walk on a treadmill, you use more of your core muscles. Treadmills can also help you get the most out of your workout in the least amount of time. Individual calorie-burning, speed, and mile… [+301 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "Ana Williams", "title": "3D-Printed Living Ear Transplanted To Girl Born Without One - Global Circulate", "description": "3DBio is using a new 3D printing technique that'll allow the creation of a second ear for a girl born with just one, using cells from one to create the other.FOLLOW US ON GOOGLE NEWSRead original article here Denial of responsibility! Global Circulat", "url": "https://globalcirculate.com/3d-printed-living-ear-transplanted-to-girl-born-without-one/amp/", "urlToImage": "https://www.slashgear.com/img/gallery/3d-printed-living-ear-transplanted-to-girl-born-without-one/l-intro-1654289514.jpg", "publishedAt": "2022-06-04T12:46:06Z", "content": "3DBio is using a new 3D printing technique that’ll allow the creation of a second ear for a girl born with just one, using cells from one to create the other.\r\nFOLLOW US ON GOOGLE NEWS\r\nRead original… [+440 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Hassan Vally | The Conversation", "title": "Why herd immunity no longer being sold as the path out of the pandemics - Business Standard", "description": "circumstances have changed dramatically over the course of the pandemic with the original SARSCoV2 virus superseded by far more infectious variants", "url": "https://www.business-standard.com/article/current-affairs/why-herd-immunity-no-longer-being-sold-as-the-path-out-of-the-pandemic-122060400634_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-01/23/full/1642899670-3904.jpg", "publishedAt": "2022-06-04T12:07:00Z", "content": "Early in the pandemic, the term “herd immunity” hit the headlines, along with a polarised discussion on how to achieve it.\r\n Some groups were attached to the now-discredited notion of letting a dange… [+5954 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Find out if intermittent fasting is good for you - The Indian Express", "description": "It has been suggested that intermittent fasting may help in cell repair (which may combat ageing) and produce favourable effects on metabolic parameters like cholesterol and blood sugar.", "url": "https://indianexpress.com/article/lifestyle/health/find-intermittent-fasting-good-7952610/", "urlToImage": "https://images.indianexpress.com/2022/06/fasting.jpg", "publishedAt": "2022-06-04T10:06:41Z", "content": "The quest for perfect health and a long life has always driven humankind to try different kinds of food and diets. Despite all the advances in science, the search for an ideal diet remains elusive. F… [+5410 chars]"}]}