{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study links rising symptoms of depression among pregnant moms to their kids' behavioural issues - ETHealthWorld", "description": "Their recently published seven-year study, which tracked mothers and their offspring from preconception until the children were 5 years old, is the first to demonstrate how changes in mothers' level of depression over time may impact early childhood behaviour…", "url": "https://health.economictimes.indiatimes.com/news/industry/study-links-rising-symptoms-of-depression-among-pregnant-moms-to-their-kids-behavioural-issues/91958890", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91958890,imgsize-16460,width-1200,height-628,overlay-ethealthworld/study-links-rising-symptoms-of-depression-among-pregnant-moms-to-their-kids-behavioural-issues.jpg", "publishedAt": "2022-06-02T08:15:00Z", "content": "Representative image\r\nWashington : UCLA psychology researchers and colleagues have reported that children whose mothers experience rising levels of depression from the period before pregnancy until t… [+4555 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Rohitha Naraharisetty", "title": "How the Human Heart Can Repair Itself After a Heart Attack, According to a New Study - The Swaddle", "description": "New research shows how the immune response of the body and the lymphatic system are crucial in the way that the heart heals.", "url": "https://theswaddle.com/how-the-human-heart-can-repair-itself-after-a-heart-attack-according-to-a-new-study/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/06/02-june-2022-heart-heals-editorial.jpg", "publishedAt": "2022-06-02T08:06:20Z", "content": "Contrary to what it seems like, a heart attack is not the end of the road — human hearts can, and do, repair themselves after such adverse events. Understanding how could be our key to revolutionizin… [+2174 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Heat And Heart Failure: 7 Tips to Protect Your Heart This Summer - India.com", "description": "High temperatures put more pressure on the heart to work harder, thus making the summers more challenging for heart failure patients.", "url": "https://www.india.com/health/heat-and-heart-failure-7-tips-to-protect-your-heart-this-summer-5428587/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/01/Heart-Attack-In-Winter-highest-risk-of-heart-attack-in-Winter-keep-yourself-safe-with-these-habits.jpg", "publishedAt": "2022-06-02T07:44:15Z", "content": "The brutal summer this year has proven to be challenging for people across the country. With temperatures soaring to nearly 50 degrees Celsius in parts of the country, the heatwave has affected every… [+4114 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI", "title": "More than 550 confirmed monkeypox cases reported across 30 countries: WHO - Business Standard", "description": "Thirty nonendemic countries have reported more than 550 confirmed cases of monkeypox the head of the World Health Organization WHO Tedros Adhanom Ghebreyesus said", "url": "https://www.business-standard.com/article/current-affairs/more-than-550-confirmed-monkeypox-cases-reported-across-30-countries-un-122060200443_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-05/21/full/1653134895-5819.jpg", "publishedAt": "2022-06-02T07:39:00Z", "content": "Thirty non-endemic countries have reported more than 550 confirmed cases of monkeypox, the head of the World Health Organization (WHO) Tedros Adhanom Ghebreyesus said.\r\n\"Investigations are ongoing, b… [+4273 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Medtronic India unveils Pipeline Vantage Embolization Device with shield technology to treat Brain... - Medical Dialogues", "description": "Cerebral or brain aneurysm is a condition where there is a ballooning or weakening of the inside...", "url": "https://medicaldialogues.in/news/industry/medical-devices/medtronic-india-unveils-pipeline-vantage-embolization-device-with-shield-technology-to-treat-brain-aneurysms-93850", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/02/177766-pipeline-vantage.jpg", "publishedAt": "2022-06-02T07:09:35Z", "content": "Mumbai: India Medtronic Private Limited, a wholly-owned subsidiary of Medtronic plc a healthcare technology company, has announced the launch of CE marked fourth-generation flow diverter, Pipeline Va… [+2968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "K Srinath Reddy", "title": "Why has aspirin advice for heart protection changed? - The Indian Express", "description": "The recent change in guidelines, to dis-favour the routine use of aspirin, takes into account the reduction in anticipated benefits due to the increased protection being offered by other drugs and non-drug measures.", "url": "https://indianexpress.com/article/lifestyle/health/aspirin-heart-protection-risk-prevention-america-guidelines-7948784/", "urlToImage": "https://images.indianexpress.com/2022/06/asprin-1200.jpg", "publishedAt": "2022-06-02T07:00:58Z", "content": "For many decades, aspirin was advised to prevent heart attacks, both for those who had pre-existing cardiovascular disease (CVD) and for preventing coronary heart disease (CHD). Baby aspirin (low dos… [+9649 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "West Nile fever: How is it different from malaria? - The Indian Express", "description": "Many a time, a person doesn't even realise that he/she has been infected with the West Nile virus", "url": "https://indianexpress.com/article/lifestyle/health/kerala-man-west-nile-fever-symptoms-causes-treatment-prevention-7945855/", "urlToImage": "https://images.indianexpress.com/2022/02/mosquitoes-parenting-1200.jpg", "publishedAt": "2022-06-02T07:00:34Z", "content": "A man from Kerala’s Thrissur reportedly succumbed to West Nile fever last week. According to Kerala’s State Health Minister, Veena George, controlling the growth of mosquitoes and carrying out source… [+2870 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "New strategy may reduce fatigue after Covid vaccination: Study - The Week", "description": "Subcutaneous injection of the Covid-19 vaccines may reduce the adverse post-vaccination effects, such as fatigue, while still providing similar immune-system responses, according to a study in mice. Currently, mRNA-based Covid-19 vaccines are injected deep in…", "url": "https://www.theweek.in/news/health/2022/06/02/new-strategy-may-reduce-fatigue-after-covid-vaccination--study.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/2/10/empty-vials-of-Covishield-vaccine-vaccination-center-for-the-Covid-19-pti.jpg", "publishedAt": "2022-06-02T06:36:27Z", "content": "Subcutaneous injection of the Covid-19 vaccines may reduce the adverse post-vaccination effects, such as fatigue, while still providing similar immune-system responses, according to a study in mice.\r… [+2767 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How To Manage Kids With Asthma; Tips For Parents - News18", "description": "India is one of the leading countries in terms of concentrations of air pollution caused by various sources of exhaustion.", "url": "https://www.news18.com/news/lifestyle/how-to-manage-kids-with-asthma-tips-for-parents-5277613.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/asthma-165159853316x9.jpg", "publishedAt": "2022-06-02T06:08:17Z", "content": "Asthma is a chronic condition that can affect people of all ages. Asthma, among kids, is also becoming a major concern for parents these days.\r\nIf your kid is suffering from this chronic condition, t… [+1292 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Is Monkeypox? - 'Hot Mic' With Nidhi Razdan - NDTV", "description": "Hot Mic with Nidhi Razdan: Monkeypox has been detected in 14 countries now including the US and Britain. The outbreak has taken scientists by surprise since Monkeypox is most common in remote parts of Central and West Africa", "url": "https://www.ndtv.com/world-news/what-is-monkeypox-hot-mic-with-nidhi-razdan-3004732", "urlToImage": "https://c.ndtvimg.com/2022-05/6lfgfj0g_monkey-pox_625x300_24_May_22.jpg", "publishedAt": "2022-06-02T05:20:59Z", "content": "Hi, This is Hot Mic and I'm Nidhi Razdan.\r\nThe COVID pandemic is not over yet. But there is a new virus that's causing concern in several countries. Monkeypox has been detected in 14 countries until … [+5326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "What should a diabetic keep in mind when having pumpkin? - The Indian Express", "description": "With a high GI, at 75, it is believed that pumpkin is not good for diabetes patients., said Preety Tyagi, a nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-patients-pumpkins-benefits-7941185/", "urlToImage": "https://images.indianexpress.com/2020/07/pumpkin-seeds-1200.jpg", "publishedAt": "2022-06-02T05:20:29Z", "content": "Diabetes, a condition caused by insufficient insulin in the blood or lack of proper movement of the same, has today become increasingly common in people of all age groups. It is one of the most commo… [+3226 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Brain cell activity is responsible for central nervous system disorder outcomes - ThePrint", "description": "Los Angeles (California) [US], June 2 (ANI): According to a research led by the investigators at the Cedars-Sinai Medical Center, brain cell activities and the spinal cord is responsible for regulating the body’s response to the central nervous systems (CNS) …", "url": "https://theprint.in/health/brain-cell-activity-is-responsible-for-central-nervous-system-disorder-outcomes/980345/", "urlToImage": null, "publishedAt": "2022-06-02T05:14:12Z", "content": "Los Angeles (California) [US], June 2 (ANI): According to a research led by the investigators at the Cedars-Sinai Medical Center, brain cell activities and the spinal cord is responsible for regulati… [+3879 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "4 health tips to help you slow down the progression of kidney diseases - Hindustan Times", "description": "Any minor imbalance in the functioning of kidneys usually goes undetected owing to lack of any major symptoms and may silently proceed to advanced kidney disease. Thankfully, altering some lifestyle activities can help delay kidney damage. Check these 4 tips …", "url": "https://www.hindustantimes.com/lifestyle/health/4-health-tips-to-help-you-slow-down-the-progression-of-kidney-diseases-101654145967361.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/02/1600x900/FTnZdEUWIAMTM_f_1654146578825_1654146597115.jpg", "publishedAt": "2022-06-02T05:12:15Z", "content": "To maintain overall health and well-being, we must be cautious about all our body organs, especially the kidneys, which are fist-like organs found below the ribs and situated on both sides of the spi… [+3582 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Amid monkeypox scare, Delhi directs govt hospitals to be on alert - India Today", "description": "A day after the Centre issued an advisory, the Delhi government directed all the hospitals to be on alert for any early symptoms of monkeypox.", "url": "https://www.indiatoday.in/cities/delhi/story/delhi-news-monkeypox-government-hospitals-on-alert-1957322-2022-06-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Monkeypox-647x363.jpeg?dIPbVRlOHs0jqsOFurunr_QjIRAEe0vj", "publishedAt": "2022-06-02T04:53:18Z", "content": "All the government hospitals in Delhi on Wednesday were directed to be on alert for any early symptoms of monkeypox and to ensure prompt reporting.\r\nThe Delhi government directed the hospitals a day … [+1452 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Iraq Witnesses Outbreak Of Nose-Bleed Fever: Know More About The Deadly Disease - TIMES NOW", "description": "The deadly Nose-Bleed Fever has no vaccine and its onset can be swift, causing severe bleeding both internally and externally and especially from the nose. I...", "url": "https://www.youtube.com/watch?v=1Ot4PGQETqo", "urlToImage": "https://i.ytimg.com/vi/1Ot4PGQETqo/hqdefault.jpg", "publishedAt": "2022-06-02T04:00:01Z", "content": null}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Michael Schulson", "title": "How Do You Calculate the Risk of a Lab Leak? – The Wire Science - The Wire Science", "description": "The odds of a dangerous pathogen escaping a lab are uncertain, and have implications for COVID-19 and more.", "url": "https://science.thewire.in/health/covid19-pandemic-lab-leak-risk/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/06/01173544/NIAID_Integrated_Research_Facility_-_Positive_Pressure_Personnel_Suit.jpg", "publishedAt": "2022-06-02T01:59:52Z", "content": "Scientists working inside positive pressure personnel suit at a BSL-4 laboratory in Frederick, Maryland. Photo: NIAID\r\nOn a sunny September morning in 2011, at a conference on the Mediterranean islan… [+16573 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Chetana Belagere", "title": "Asymptomatic Covid patients less likely to spread infection - The New Indian Express", "description": "Virologists in India say it may not be correct to completely dismiss the possibility of spread by asymptomatic patients.", "url": "https://www.newindianexpress.com/cities/bengaluru/2022/jun/02/asymptomatic-covid-patients-less-likely-to-spread-infection-2460750.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/6/1/w600X390/COVID_Gurugram.jpg", "publishedAt": "2022-06-02T01:42:00Z", "content": "BENGALURU: Asymptomatic Covid-19 patients were so far considered silent spreaders, however, a study claimed that people infected with SARS-CoV-2 but with no symptoms, are 66% less likely to pass on t… [+2756 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Anoushka Rajesh", "title": "Can Monkeypox Lead to Another COVID Like Pandemic? - The Quint", "description": "Monkeypox has already spread to over 25 countries and counting. What is causing this virus to spread now? is it a cause for concern? are we headed in for another COVID like global pandemic? FIT asks experts.", "url": "https://www.thequint.com/fit/coronavirus/monkeypox-virus-pandemic-covid", "urlToImage": "https://images.thequint.com/thequint%2F2022-06%2Feda0cd2e-b770-4a90-af5e-2c42af3b6df6%2Ffit_hero.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-02T01:30:00Z", "content": "We know how things escalated from there.\r\nSo, are we seeing a similar situation playing out now with monkeypox?\r\nDr JP Muliyil says the two are not comparable at all. \"COVID was an absolutely new dis… [+686 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Importance of flu vaccine amid the COVID-19 pandemic | New Day - CNN Philippines", "description": "With the rainy season upon us and the threat of COVID-19 still very much present, medical experts have been stressing the need to get and update our vaccines...", "url": "https://www.youtube.com/watch?v=daJ9aAlvECw", "urlToImage": "https://i.ytimg.com/vi/daJ9aAlvECw/hqdefault.jpg", "publishedAt": "2022-06-02T01:26:31Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Bengalureans, get your daily dose of Vitamin D - Bangalore Mirror", "description": "Bengaluru skies have been cloudy nearly most of the year and with pre-covid normalcy making a comeback, Vitamin D-deficient individuals are finding it hard to follow an active lifestyle.", "url": "https://bangaloremirror.indiatimes.com/bangalore/civic/bengalureans-get-your-daily-dose-of-vitamin-d/articleshow/91948569.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-289072,msid-91948523/91948523.jpg", "publishedAt": "2022-06-02T00:30:00Z", "content": "By Melvin MathewLack of sunny days causing rise in Vitamin D\r\n deficiency cases; doctors say exposure to sunlight every day mandatory to curb fatigue &amp; brittle bonesSunny days are on the wane and… [+2890 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Finding the Biological Roots for the Pathological Social Withdrawal Known as 'Hikikomori' - Neuroscience News", "description": "Hikikomori is a mental health disorder identified as a pathological social withdrawal. Researchers have discovered a number of biomarkers in the blood associated with hikikomori.", "url": "https://neurosciencenews.com/hikikomori-social-withdrawal-biomarker-20722/", "urlToImage": "https://neurosciencenews.com/files/2022/06/social-isolation-biology-neurosinces-public.jpg", "publishedAt": "2022-06-01T23:25:32Z", "content": "Summary: Hikikomori is a mental health disorder identified as a pathological social withdrawal. Researchers have discovered a number of biomarkers in the blood associated with hikikomori.\r\nSource: Ky… [+6372 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Engineers Develop Nanoparticles That Cross the Blood-Brain Barrier - Neuroscience News", "description": "Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles can get into tumors and kill glioblastoma brain cancer cells.", "url": "https://neurosciencenews.com/bbb-nanoparticles-glioblastoma-20718/", "urlToImage": "https://neurosciencenews.com/files/2022/06/bbb-nanoparticles-neurosinces-public.jpg", "publishedAt": "2022-06-01T21:34:41Z", "content": "Summary: Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles … [+6811 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Pam Harrison", "title": "COVID-19 Vaccines Equally Effective in Patients on Dialysis - Medscape", "description": "Two doses of either an mRNA vaccine or the AZ equivalent provide equal and significant protection against severe disease in patients on dialysis who have been infected with COVID-19", "url": "https://www.medscape.com/viewarticle/974896", "urlToImage": "https://img.medscape.com/thumbnail_library/is_201109_pancreas_cancer_800x450.jpg", "publishedAt": "2022-06-01T19:54:35Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nTwo doses of either the Pfizer-BioNTech COVID-19 vaccine or the Oxford AstraZeneca alternative pr… [+6723 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Combination anti-HIV antibody infusions suppress virus for long period, says study - ThePrint", "description": "Maryland [US], June 1 (ANI): According to a new study, HIV patients who started antiretroviral medication (ART) early in their infection had a long duration of HIV suppression without ART after getting two broadly neutralising anti-HIV antibodies (bNAbs). The…", "url": "https://theprint.in/science/combination-anti-hiv-antibody-infusions-suppress-virus-for-long-period-says-study/980103/", "urlToImage": null, "publishedAt": "2022-06-01T18:14:16Z", "content": "Maryland [US], June 1 (ANI): According to a new study, HIV patients who started antiretroviral medication (ART) early in their infection had a long duration of HIV suppression without ART after getti… [+3843 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Priyanka Sharma", "title": "SII to launch vaccine to fight cervical cancer by November | Mint - Mint", "description": "Cervical cancer is 4th most common cancer in women after breast, lung & colorectal.The Union health ministry plans to target girls in the 9-14 years age group for vaccination against cervical cancer", "url": "https://www.livemint.com/news/india/sii-to-launch-vaccine-to-fight-cervical-cancer-by-november-11654102756009.html", "urlToImage": "https://images.livemint.com/img/2022/06/01/600x338/SII_1654102898533_1654102898685.jpg", "publishedAt": "2022-06-01T17:54:05Z", "content": "NEW DELHI : Pune-based drugmaker Serum Institute of India (SII) hopes to launch the countrys first indigenous human papillomavirus vaccine (HPV) by November 2022 in Indias biggest push against cervic… [+1853 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Hearing Outcomes of Infants Born to Mothers With Active COVID-19 Infection - Cureus", "description": "Introduction\r\n\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and the ramifications on infant hearing. This retrospective s…", "url": "https://www.cureus.com/articles/99081-hearing-outcomes-of-infants-born-to-mothers-with-active-covid-19-infection", "urlToImage": "https://assets.cureus.com/uploads/figure/file/380347/article_river_b291b230d80d11eca5df6d9ad78e20f8-image.png", "publishedAt": "2022-06-01T17:13:32Z", "content": "Introduction\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and… [+22369 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Texas at Dallas: Neuroscientist Seeks Origins of Alcoholism at Molecular Level - India Education Diary", "description": "Recovering alcoholics face significant challenges in changing their habits, due in part to the way the brain adapts to the regular presence of alcohol. A University of Texas at Dallas neuroscientist is trying to pinpoint these neurological changes at", "url": "https://indiaeducationdiary.in/university-of-texas-at-dallas-neuroscientist-seeks-origins-of-alcoholism-at-molecular-level/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-Texas-at-Dallas.jpg", "publishedAt": "2022-06-01T16:51:08Z", "content": "Recovering alcoholics face significant challenges in changing their habits, due in part to the way the brain adapts to the regular presence of alcohol. A University of Texas at Dallas neuroscientist … [+4496 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Type-2 diabetes: Study says THIS masala can lower blood sugar levels by 35 per cent - Times Now", "description": "Ginger – a spice with a strong taste – has been used for centuries for its medicinal properties. Additionally, it gives food a distinct and irresistible taste. And now, several studies reveal that it could work wonders with better management of blood sugar le…", "url": "https://www.timesnownews.com/health/type-2-diabetes-study-says-this-masala-can-lower-blood-sugar-levels-by-35-per-cent-article-91946655", "urlToImage": "https://static.tnn.in/thumb/msid-91946655,imgsize-100,width-1280,height-720,resizemode-75/91946655.jpg", "publishedAt": "2022-06-01T15:35:25Z", "content": "IISc Bangalore top Indian University in THE University Rankings 2022, total 71 universities make the list"}, {"source": {"id": null, "name": "Medscape"}, "author": "Tara Haelle", "title": "Lupus Mutation May Unlock Targeted Drugs for Patient Subset - Medscape", "description": "A new study provides definitive proof of one pathway that contributes to lupus, though it’s unclear how many patients with lupus are affected by this mechanism.", "url": "https://www.medscape.com/viewarticle/974872", "urlToImage": "https://img.medscape.com/thumbnail_library/ht_220601_crick_carola_vinuesa_800x450.jpg", "publishedAt": "2022-06-01T14:47:36Z", "content": "Scientists have confirmed that a receptor long suspected to be linked to lupus is, in fact, a major driver of the autoimmune disease for at least some subset of patients, according to a study recentl… [+8609 chars]"}, {"source": {"id": null, "name": "FoodNavigator.com"}, "author": "foodnavigator.com", "title": "Vitamin D food fortification works better with water and milk than in juice: study - FoodNavigator.com", "description": "By measuring the maximum concentration over time, Danish researchers found bioavailability of vitamin D to be higher in milk and water.", "url": "https://www.foodnavigator.com/Article/2022/06/01/vitamin-d-food-fortification-works-better-with-water-and-milk-than-in-juice-study", "urlToImage": "https://www.foodnavigator.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/foodnavigator.com/news/science/vitamin-d-food-fortification-works-better-with-water-and-milk-than-in-juice-study/15464101-2-eng-GB/Vitamin-D-food-fortification-works-better-with-water-and-milk-than-in-juice-study.jpg", "publishedAt": "2022-06-01T14:43:00Z", "content": "Vitamin D insufficiency is a global health problem, linked with multiple health issues, including the immune response to COVID-19. Estimates show that as much as 40% of the European population could … [+1424 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Reasons Behind Delayed or Irregular Menstrual Cycle - News18", "description": "The common causes can range from hormonal imbalances to serious medical conditions", "url": "https://www.news18.com/news/lifestyle/reasons-behind-delayed-or-irregular-menstrual-cycle-5277601.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/periods-163855917716x9.jpg", "publishedAt": "2022-06-01T13:38:22Z", "content": "There are many factors from changes in sleeping cycle to stress which can affect the menstrual cycle. Being pregnant is a possible reason for a missed period but there are also other factors that aff… [+1933 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "ANI", "title": "Spain confirms 12 more monkeypox cases - The New Indian Express", "description": "Spain, followed by Britian, becomes the country with the most detected cases of the disease in the current outbreak.", "url": "https://www.newindianexpress.com/world/2022/jun/01/spain-confirms-12-more-monkeypox-cases-2460603.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/5/31/w600X390/Monkeypox_WHO.jpg", "publishedAt": "2022-06-01T13:18:00Z", "content": "MADRID: The Spanish Ministry of Health on Tuesday confirmed 12 new monkeypox cases, raising the total caseload to 132.\r\nSpain, followed by Britian, becomes the country with the most detected cases of… [+636 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Ayurveda tips to improve metabolism; dos and don'ts you must remember - Hindustan Times", "description": "Having a slow metabolism not only leads to weight gain but a series of health issues from skin troubles, hair loss, chronic fatigue, to unhealthy cravings. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/ayurveda-tips-to-improve-metabolism-dos-and-don-ts-you-must-remember-101654088955078.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/metabolism_1654089069171_1654089079489.jpg", "publishedAt": "2022-06-01T13:15:43Z", "content": "Having a good metabolism is important for the healthy functioning of the body. It is the process by which your body converts what you consume into energy. Having a slow metabolism not only leads to w… [+2452 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Swine flu outbreak: 3 H1N1 cases detected in Madhya Pradesh's Indore | Mint - Mint", "description": "Two men and a woman, who have been infected with the H1N1 virus, are undergoing treatment at a local hospital and their condition is said to be stable.", "url": "https://www.livemint.com/news/india/swine-flu-outbreak-3-h1n1-cases-detected-in-madhya-pradesh-s-indore-11654088428696.html", "urlToImage": "https://images.livemint.com/img/2022/06/01/600x338/Swine_Flu_1654089009996_1654089010178.PNG", "publishedAt": "2022-06-01T13:11:30Z", "content": "Three persons have been found to be infected with swine flu in Madhya Pradesh's Indore and they are currently undergoing treatment for the same, a state health official informed on Wednesday.   Chief… [+1426 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid caused collateral damage to global cardiac services: Study - ETHealthWorld", "description": "Disruption to cardiac services during the Covid-19 pandemic has caused a \"global collateral damage\" that may have lasting ramifications, according to a study published on Tuesday.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-caused-collateral-damage-to-global-cardiac-services-study/91941996", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91941996,imgsize-1079511,width-1200,height-628,overlay-ethealthworld/covid-caused-collateral-damage-to-global-cardiac-services-study.jpg", "publishedAt": "2022-06-01T13:00:00Z", "content": "London, Disruption to cardiac services during the Covid-19 pandemic has caused a \"global collateral damage\" that may have lasting ramifications, according to a study published on Tuesday.In the paper… [+3241 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Twitching can be a Warning Sign of Cancer, Look for These Symptoms - News18", "description": "Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywhere in the body", "url": "https://www.news18.com/news/lifestyle/twitching-can-be-a-warning-sign-of-cancer-look-for-these-symptoms-5273911.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/world-cancer-day-164821611916x9.png", "publishedAt": "2022-06-01T12:58:35Z", "content": "A dreadful disease, cancer can affect any part of the human body including blood, bones, lungs or liver. Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywher… [+1778 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Bowl Method Can Help You Keep Your Calorie Intake In Check - News18", "description": "The bowl method simply involves choosing a small bowl to measure the portions of your food to prevent you from overeating", "url": "https://www.news18.com/news/lifestyle/how-bowl-method-can-help-you-keep-your-calorie-intake-in-check-5290369.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/untitled-design-8-165408126916x9.png", "publishedAt": "2022-06-01T11:02:14Z", "content": "Losing weight and going for a lean look is something almost everyone desires. While many of you may be training regularly in the gym and trying to shed those extra kilos, your diet plays an equally i… [+1573 chars]"}, {"source": {"id": null, "name": "Citizen Matters"}, "author": "Geeta Lal Sahai", "title": "Mental illness a ticking time bomb, say experts - Citizen Matters", "description": "Sadly, the state offers no help to families of people with mental illness, no medical help, economic security or concession of any sort.", "url": "https://citizenmatters.in/mental-illness-support-care-laws-guardianship-other-issues-30660", "urlToImage": "https://images.citizenmatters.in/wp-content/uploads/sites/2/2022/06/01122447/mental-illness-brain-pixabay-Jun22.jpg", "publishedAt": "2022-06-01T10:42:48Z", "content": "We are sitting on a mental health time bomb, say mental health experts. Our mental health policies need to be revisited.\r\nRepresentational image by Gerd Altmann/Pixabay CC0\r\nI just want to run away; … [+7067 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Science has proof of how bad diet can lead to bad memory - ThePrint", "description": "Campus Voice is an initiative by ThePrint where young Indians get an opportunity to express their opinions on a prevalent issue.", "url": "https://theprint.in/campus-voice/science-has-proof-of-how-bad-diet-can-lead-to-bad-memory/976669/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2019/10/bacon-burger-beef-burger.jpg", "publishedAt": "2022-06-01T09:16:56Z", "content": "Strong immunity building is a drawing-room conversation in every house, especially after Covid. Despite an increased interest in the concept of immunity, most of the time we fail to put a stop to our… [+3836 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Unnati Gusain", "title": "Zoonosis leads to 60% of all known infectious diseases, 75% emerging illnesses - News9 LIVE", "description": "A zoonosis is an infectious disease that is transmitted between species from animals to humans.", "url": "https://www.news9live.com/health/zoonosis-leads-to-60-of-all-known-infectious-diseases-75-emerging-illnesses-173718", "urlToImage": "https://media.news9live.com/h-upload/2022/06/01/407144-virus-a-member-of-the-virus-family-arenaviridae-is-a-single-stranded-rna-virus-and-is-zoonotic-850x5471.jpg", "publishedAt": "2022-06-01T07:29:20Z", "content": "Just as COVID-19, one of the worst zoonotic diseases was ebbing, monkeypox took over the headlines. According to the World Health Organization, monkeypox is a viral zoonotic disease, caused by monkey… [+5529 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: 8 Sweet Snacks Safe For Diabetics - NDTV", "description": "Eating something delicious if you are craving something sweet is not ideal if you have diabetes. Here are sweet snacks completely safe for diabetics.", "url": "https://www.ndtv.com/health/diabetes-8-sweet-snacks-safe-for-diabetics-3026251", "urlToImage": "https://c.ndtvimg.com/2020-05/i3hiuje8_chia-pudding_625x300_08_May_20.jpg", "publishedAt": "2022-06-01T06:43:01Z", "content": "Chia pudding is a healthy and sweet snack for diabetics\r\nDiabetes is caused as a response to resistance to insulin in the cells. Insulin is the hormone that helps regulate the glucose levels in the b… [+3415 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Thyroid: Types of disorders, risk factors, symptoms, tests - Hindustan Times", "description": "Here's all you need to know about thyroid hormones in normal health and disease conditions, the types of disorders due to imbalance in thyroid hormones, their symptoms and protocol for testing of thyroid diseases | Health", "url": "https://www.hindustantimes.com/lifestyle/health/thyroid-types-of-disorders-due-to-imbalance-in-thyroid-hormones-risk-factors-symptoms-protocol-for-testing-of-thyroid-diseases-101654063659006.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/FTzTfeQXsAMtjXR_1654064055678_1654064078267.jpg", "publishedAt": "2022-06-01T06:25:51Z", "content": "The thyroid gland, located in the front of the neck, is the main source of thyroid hormones in the body and hypothalamic thyrotropin-releasing hormone (TRH) stimulates thyroid-stimulating hormone (TS… [+6465 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Acute stress may hamper body’s fight against Covid, influenza: Study - EastMojo", "description": "Washington: Acute stress may impair the body's ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a", "url": "http://www.eastmojo.com/world/2022/06/01/acute-stress-may-hamper-bodys-fight-against-covid-influenza-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/05/Untitled-design-8-13.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-06-01T06:10:00Z", "content": "Washington: Acute stress may impair the bodys ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a study conducted in mice.\r\nThe research, published … [+3621 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "IIT-D study reveals mechanisms driving SARS-CoV-2 evolution in humans - BioSpectrum India", "description": "The results lay the necessary groundwork for future studies", "url": "https://www.biospectrumindia.com/news/58/21351/iit-d-study-reveals-mechanisms-driving-sars-cov-2-evolution-in-humans.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/shutterstock_281615630-21351.jpg", "publishedAt": "2022-06-01T05:56:28Z", "content": "A team of researchers at the Indian Institute of Technology Delhi (IIT-D) has discovered the existence of temporal variations in selection pressures during SARS-CoV-2 evolution and adaptation to the … [+1222 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arthritis: 10 Common Workout Mistakes That Might Be Worsening Your Arthritis - NDTV", "description": "Working out is great if you have arthritis but doing it incorrectly might worsen it. Here are the most common workout mistakes you might be making.", "url": "https://www.ndtv.com/health/arthritis-10-common-workout-mistakes-that-might-be-worsening-your-arthritis-3015212", "urlToImage": "https://c.ndtvimg.com/2020-03/n6ssraqo_stairs-_625x300_09_March_20.jpg", "publishedAt": "2022-06-01T04:39:23Z", "content": "If you have arthritis, taking stairs might worsen your symptoms\r\nArthritis refers to the condition under which, you experience pain, swelling, and stiffness in your joints. Arthritis may be due to gr… [+3820 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Esha Chainani", "title": "The Issue With Seeing PCOS As Just a 'Period Problem' - The Swaddle", "description": "People think of PCOS as a purely physical problem that occurs a few days a month, as opposed to a chronic condition that reduces the overall quality of life.", "url": "https://theswaddle.com/the-issue-with-seeing-pcos-as-just-a-period-problem/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/06/PCOS-Editorials-min.png", "publishedAt": "2022-06-01T03:48:00Z", "content": "I constantly feel like Im a fat waste of space. These were the exact words Rekha*, 23 said when asked about her mental health during my consultation with her. \r\nAs a gynecologist in Mumbai specializi… [+8623 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "Paint your plate with colour: A meal packed with phytonutrients - Hindustan Times", "description": "From the health benefits of phytonutrients to the quantity of consumption that should be followed, here is all that you need to know. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/paint-your-plate-with-colour-a-meal-packed-with-phytonutrients-101654055021107.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/veggies_1653488130974_1654055055020.jpg", "publishedAt": "2022-06-01T03:46:30Z", "content": "Phytonutrients are natural compounds found in fruits, vegetables and whole grain products which helps in working with other essential nutrients in promoting good health. Phytonutrients come with mult… [+2335 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Eye health tips: Excessive heat can harm your eyes. Here's how to keep them safe - Hindustan Times", "description": "The eyes are one of the most commonly affected body parts during summers as the scorching heat of the sun is extremely harmful for eye health. As a result, extra care and attention to the eyes are required during this time. Follow these guidelines to keep the…", "url": "https://www.hindustantimes.com/lifestyle/health/eye-health-tips-excessive-heat-can-harm-your-eyes-here-s-how-to-keep-them-safe-in-summers-101654052006488.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/pexels-engin-akyurt-1552583_1654052488738_1654052509381.jpg", "publishedAt": "2022-06-01T03:12:32Z", "content": "Health experts insist that extra care and attention to the eyes are required during this time as people are battling not only intense heat waves but also the diseases that come with them as the mercu… [+5419 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "Manage your BP, manage your pregnancy - The New Indian Express", "description": "Blood pressure refers to the force exerted on your blood vessels wall by the flowing blood.", "url": "https://www.newindianexpress.com/cities/chennai/2022/jun/01/manage-your-bp-manage-your-pregnancy-2460252.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/4/10/w600X390/Pregnant_Woman_Photo.jpg", "publishedAt": "2022-06-01T01:27:00Z", "content": "CHENNAI: Blood pressure refers to the force exerted on your blood vessels wall by the flowing blood. You are said to have high blood pressure (also called hypertension) when this force of your blood … [+3466 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Does coffee protect against liver cancer, melanomas, oral and pharyngeal cancers OR causes the disease? A doct - Times Now", "description": "Dr Prasad Kasbekar, Consultant Surgical Oncologist, Masina Hospital, Byculla, Mumbai cites that studies suggest that coffee is not associated with cancers in general. A few studies have been associating coffee with the risk of bladder cancer and lung cancer, …", "url": "https://www.timesnownews.com/health/does-coffee-protect-against-liver-cancer-melanomas-oral-and-pharyngeal-cancers-or-causes-the-disease-a-doctor-explains-article-91929025", "urlToImage": "https://static.tnn.in/thumb/msid-91929025,imgsize-100,width-1280,height-720,resizemode-75/91929025.jpg", "publishedAt": "2022-06-01T01:15:45Z", "content": "Stocks to track in trade for June 02, 2022: RIL, Greaves Cotton, NMDC, Yes Bank, Religare, PDS"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "The first positive cases of the avian influenza virus detected at KRTB - OI Canadian", "description": "A good number of dead birds have been listed, according to the report that was carried out between Rivière-du-Loup and Trois-Pistoles. A total of 870 common eider carcasses and nearly 200 gulls were f", "url": "https://oicanadian.com/the-first-positive-cases-of-the-avian-influenza-virus-detected-at-krtb/", "urlToImage": "https://cimtchau.ca/app/uploads/oiseau-mort.jpg", "publishedAt": "2022-05-31T22:37:53Z", "content": "A good number of dead birds have been listed, according to the report that was carried out between Rivière-du-Loup and Trois-Pistoles. A total of 870 common eider carcasses and nearly 200 gulls were … [+3076 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "When Should I Schedule My Exercise? - Neuroscience News", "description": "Women looking to reduce belly fat and blood pressure should exercise in the morning. Men who exercise in the evening showed improvements in metabolic and heart health, and improved overall emotional wellbeing.", "url": "https://neurosciencenews.com/exercise-time-day-20711/", "urlToImage": "https://neurosciencenews.com/files/2022/05/exercise-schedule-neurosicenes-public.jpg", "publishedAt": "2022-05-31T22:32:40Z", "content": "Summary: Women looking to reduce belly fat and blood pressure should exercise in the morning. Men who exercise in the evening showed improvements in metabolic and heart health, and improved overall e… [+8108 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Acute Myocardial Infarction After COVID-19 Vaccination: A Case Report - Cureus", "description": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine across the globe, various cases were reported with thrombotic ev…", "url": "https://www.cureus.com/articles/94893-acute-myocardial-infarction-after-covid-19-vaccination-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/362096/article_river_a05d5a90bc9e11ecb6c169d390228567-Figure-1.png", "publishedAt": "2022-05-31T17:39:04Z", "content": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine acro… [+12842 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Anna Nordberg", "title": "How to parent a picky eater - The Washington Post", "description": "Picky eating is a typical stage of development for children. Here are expert tips to make sure picky eaters stay healthy.", "url": "https://www.washingtonpost.com/parenting/2022/05/31/picky-eaters-children/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/W7LWRZW3U4I6ZPBVVEOQVFESHM.jpg&w=1440", "publishedAt": "2022-05-31T16:30:00Z", "content": "Placeholder while article actions load\r\nPicky eating is one of those challenges thats practically guaranteed to make parents go bananas. Not only is it frustrating to cook a healthy meal, have your c… [+6391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Understanding the link between tobacco consumption and infertility in women - The Indian Express", "description": "World No Tobacco Day is observed on May 31 every year, and the theme for this year – “tobacco is killing us and our planet” – highlights how it is not only deteriorating our lives but also altering our future generations", "url": "https://indianexpress.com/article/lifestyle/health/world-no-tobacco-day-consumption-infertility-women-7944371/", "urlToImage": "https://images.indianexpress.com/2022/05/infertility_200_gettu.jpg", "publishedAt": "2022-05-31T14:30:26Z", "content": "The impact of intoxicants, such as tobacco, on both male and female health has been reported widely. Irrespective of the quantity or frequency of consumption, it can affect the lungs, heart, neck and… [+3639 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Food For All Ages | A look at the ideal foods to eat healthily at every stage of life - Moneycontrol", "description": "From the moment we make our kicking-screaming entrance into this world, food is one of only a handful of things that we would perish without. But we can’t just ingest any food at any age, not if we want to have a fighting chance at the madness that is life. A…", "url": "https://www.moneycontrol.com/news/photosworld/food-for-all-ages-a-look-at-the-ideal-foods-to-eat-healthily-at-every-stage-of-life-8614431.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/Eid-food-770x433.jpg", "publishedAt": "2022-05-31T11:52:30Z", "content": null}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pradeep Sahoo", "title": "Practice These Easy Yoga Poses To Get Relief From Sinusitis - Pragativadi", "description": "New Delhi: Sinusitis is usually caused by allergies, infection or irritation due to particles or chemicals in the air. The symptoms include a stuffy nose, thick discharge from the nose and facial pain. It can also cause cough, headache, fever and sor", "url": "https://pragativadi.com/practice-these-easy-yoga-poses-to-get-relief-from-sinusitis/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2022/05/Untitled-design-88-1.png", "publishedAt": "2022-05-31T11:05:40Z", "content": "New Delhi: Sinusitis is usually caused by allergies, infection or irritation due to particles or chemicals in the air. The symptoms include a stuffy nose, thick discharge from the nose and facial pai… [+2308 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "On World No Tobacco Day, Meet Nico- A first of its kind personal user interface by Nicotex to help smoke - Times of India", "description": "Spotlight News: On World No Tobacco Day, Nicotex has launched Nico, a first of its kind personal user interface that will help smokers kick the butt by providing the", "url": "https://timesofindia.indiatimes.com/spotlight/on-world-no-tobacco-day-meet-nico-a-first-of-its-kind-personal-user-interface-by-nicotex-to-help-smokers-during-their-quit-smoking-journey/articleshow/91913742.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91917219,width-1070,height-580,imgsize-117622,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-31T11:03:00Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "From Boosting Immunity to Preventing Skin Infection, Bael is Perfect Summer Fruit - News18", "description": "Bael juice is a perfect summer drink which rejuvenates, cleanses, and nourishes the body with all the nutrients.", "url": "https://www.news18.com/news/lifestyle/from-boosting-immunity-to-preventing-skin-infection-bael-is-perfect-summer-fruit-5283247.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-2-94-165399488116x9.png", "publishedAt": "2022-05-31T11:01:54Z", "content": "Soothing and refreshing beverages go a long way in beating the scorching heat in summers. Aegle Marmelos, commonly known as Bael, is rich in fibre and nutrients like proteins, beta-carotene, fibre, r… [+1804 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Wala Or Khus: Nutritionist Rujuta Diwekar Outlines Its Benefits, Especially In Summer - NDTV Doctor", "description": "Nutritionist Rujuta Diwekar shared the benefits of vetiver roots and the different ways in which they can be used", "url": "https://doctor.ndtv.com/living-healthy/rujuta-diwekar-highlights-the-benefits-of-vetiver-roots-or-wala-in-an-instagram-video-3014542", "urlToImage": "https://c.ndtvimg.com/2020-09/h8ff8fdg_shower-gel_625x300_15_September_20.jpg", "publishedAt": "2022-05-31T10:04:30Z", "content": "Some age-old traditions may look simple or old to follow, but they carry several health benefits. One such thing native to India is vetiver, also known as khus or wala. Do you know vetiver works as a… [+2395 chars]"}]}