{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "How ghee can help in both weight gain and weight loss - IndiaTimes", "description": "Ghee, a form of clarified butter, is a staple in Indian cuisine and has gained popularity worldwide. While traditionally associated with weight gain due to its high-calorie content, recent studies and trends suggest that ghee can play a role in both weight lo…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/how-ghee-can-help-in-both-weight-gain-and-weight-loss/photostory/106859926.cms", "urlToImage": "https://static.toiimg.com/photo/106859976.cms", "publishedAt": "2024-01-15T08:30:00Z", "content": "While ghee can be beneficial, it's essential to consume it in moderation. Be mindful of portion sizes, as excessive calorie intake, even from healthy fats, can contribute to weight gain. Use ghee as … [+570 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Cancer-Preventive Diet: Can Lifestyle Change Reduce Cancer Risk - Expert Explains - Zee News", "description": "Begin consuming meals high in omega-3 fatty acids or supplements. Cold-water fish like salmon and sardines, as well as walnuts and flax seeds, are excellent sources of omega-3 fatty acids. They can all effectively combat cancer thanks to their anti-cancer pro…", "url": "https://zeenews.india.com/health/cancer-preventive-diet-can-lifestyle-change-reduce-cancer-risk-expert-explains-2709874", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2024/01/15/1349450-healthy-food-pixabay.jpg", "publishedAt": "2024-01-15T08:25:36Z", "content": "Cancer is now considered a lifestyle illness. It is caused by lifestyle factors including drinking alcohol, smoking, and so on, but nutrition also has a significant impact on the disease's developmen… [+4283 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Study finds new immune cell to attack and eliminate cancer, Covid - Daijiworld.com", "description": "New York, Jan 15 (IANS): Researchers have discovered a type of immune cell in the human body known to be important for allergy and other immune responses that can also attack and eliminate cancer and fight viruses like SARS-Cov-2, that causes Covid-19 infecti…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1158525", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2024-01-15T08:23:39Z", "content": "New York, Jan 15 (IANS): Researchers have discovered a type of immune cell in the human body known to be important for allergy and other immune responses that can also attack and eliminate cancer and… [+2742 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "From Weight Loss To Bone Health: 5 Health Benefits Of Munching On Roasted Chana - NDTV Food", "description": "Roasted chana is a staple in Indian households. This crunchy snack offers incredible benefits for our health. Learn about them in detail in this article.", "url": "https://food.ndtv.com/health/from-weight-loss-to-bone-health-5-health-benefits-of-munching-on-roasted-chana-4866162", "urlToImage": "https://c.ndtvimg.com/2024-01/gm6m697_roasted-chana_625x300_15_January_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2024-01-15T07:58:35Z", "content": "Roasted chana is one snack that we all have fond memories of. It's been a constant in Indian households, and we simply cannot get enough of it. You must recall your mother or father giving you a hand… [+3189 chars]"}, {"source": {"id": null, "name": "Bnnbreaking.com"}, "author": "Hadeel Hashem", "title": "Psychologist Merve Ramazan Sheds Light on Emotional Changes During Pregnancy - BNN Breaking", "description": "Psychologist Merve Ramazan discusses the emotional changes during pregnancy and the importance of therapy and support for expectant mothers and fathers.", "url": "https://bnnbreaking.com/breaking-news/health/psychologist-merve-ramazan-sheds-light-on-emotional-changes-during-pregnancy/", "urlToImage": null, "publishedAt": "2024-01-15T07:46:00Z", "content": "In a recent discourse on the emotional and psychological changes during pregnancy, Clinical Psychologist Merve Ramazan unveiled an array of insights that are of immense significance to both expectant… [+1832 chars]"}, {"source": {"id": null, "name": "Newsdrum.in"}, "author": "NewsDrum Desk", "title": "Breakthroughs and burdens in a century of diabetes treatment - NewsDrum", "description": "Sydney, Jan 15 (360info) Since the discovery of insulin, diabetes treatment has made huge advances, but the condition has grown into a global killer. Leonard T...", "url": "https://www.newsdrum.in/international/breakthroughs-and-burdens-in-a-century-of-diabetes-treatment-2384961", "urlToImage": "https://img-cdn.thepublive.com/fit-in/1200x675/", "publishedAt": "2024-01-15T07:45:40Z", "content": "Sydney, Jan 15 (360info) Since the discovery of insulin, diabetes treatment has made huge advances, but the condition has grown into a global killer.\r\n Leonard Thompson was 14 when he made history. T… [+5271 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Affiliate Desk", "title": "Best protein powder for weight gain: Top 10 choices to help you bulk up - Hindustan Times", "description": "Fuel your fitness goals with the potent power of protein powder! These supplements pack punch of essential amino acids to help you build muscle, recover faster", "url": "https://www.hindustantimes.com/lifestyle/best-protein-powder-for-weight-gain-top-10-choices-to-help-you-bulk-up-101705058609967.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/01/12/1600x900/protein_pro_1705069849097_1705069849721.jpg", "publishedAt": "2024-01-15T07:34:59Z", "content": "Sculpt the physique you've always dreamed of with the muscle-building prowess of protein powder for weight gain. Packed with a concentrated dose of protein, this revolutionary supplement provides the… [+22795 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Vitamin D-Rich Diet: Mushrooms, Fatty Fish And Other Immunity-Boosting Foods You Must Add to Your Winter Meal - India.com", "description": "Vitamin D is very essential for our body. Here are some food items that are a rich source of this sunshine vitamin.", "url": "https://www.india.com/health/vitamin-d-rich-diet-mushrooms-fatty-fish-and-other-immunity-boosting-foods-you-must-add-to-your-winter-meal-6650474/", "urlToImage": "https://static.india.com/wp-content/uploads/2024/01/Untitled-design-16-10.png", "publishedAt": "2024-01-15T07:20:45Z", "content": "Vitamin D is very essential for our body. Here are some food items that are a rich source of this sunshine vitamin. \r\nHealthy Vitamin D Rich Foods\r\nWe all know that the best source of Vitamin D is su… [+2683 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lactose Intolerant? Try These Non-Dairy Foods Recommended By Nutritionist - NDTV", "description": "Nutritionist Anjali Mukerjee recently highlighted that you don't have to rely only on dairy for strong bones.", "url": "https://www.ndtv.com/health/lactose-intolerant-try-these-non-dairy-foods-recommended-by-nutritionist-4865877", "urlToImage": "https://c.ndtvimg.com/2022-09/jsnrt9ig_-best-lentils-for-health_625x300_21_September_22.jpg", "publishedAt": "2024-01-15T07:02:54Z", "content": "Most whole pulses like rajma, kabuli chana, black dal, kuleeth have about 200 mg of calcium per 100 gms\r\nHaving strong bones is essential for overall health and well-being. Bones serve as the framewo… [+2743 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "Overuse of antifungal skin meds driving drug-resistant disease: Study - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/overuse-of-antifungal-skin-meds-driving-drugresistant-disease-study-3973175", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/0fca5a3ca3ce8b026f6d5f482ab18d56_w_800_h_450.jpg", "publishedAt": "2024-01-15T06:48:01Z", "content": "New York, Jan 15 (IANS) Doctors are prescribing antifungal creams to patients with skin complaints at rates so high that they could be contributing to the rise of drug-resistant infections, according… [+2820 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Shankhyaneel Sarkar", "title": "Researchers Find New Virus in Thailand in Bat Faeces Which Is Used by Farmers as Manure - News18", "description": "The finding was made a group of researchers who were linked to biological experiments in China's Wuhan.", "url": "https://www.news18.com/world/researchers-find-new-virus-in-thailand-in-bat-faeces-which-is-used-by-farmers-as-manure-8740753.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/01/thailand-bat-virus-covid-unsplash-2024-01-cce5fc22809672812337c07a622a70dd-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-01-15T06:42:55Z", "content": "The New York-based EcoHealth Alliance, which was previously linked to experiments in Chinas Wuhan, last week reported the discovery of a new virus found in bats in Thailand, according to a report by … [+2111 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Apoorva Misra, Himani Chandna", "title": "H1N1 Surge in Delhi-NCR Hospitals: Dipping Mercury Triggers Rise in High BP, Gastric and Heart Emergencies - News18", "description": "Common symptoms of H1N1 flu include fever, muscle pain, cough, sore throat, runny nose and watery eyes", "url": "https://www.news18.com/india/h1n1-surge-in-delhi-ncr-hospitals-dipping-mercury-triggers-rise-in-high-bp-gastric-and-heart-emergencies-8740734.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/01/swine-flu-2024-01-0fafe5a18e77f7a4f7c1d22a2e213a2a-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-01-15T06:42:27Z", "content": "As temperatures dip, Delhi-NCR hospitals are noticing a surge in cases of flu, especially H1N1 infection, among elderly and co-morbid people.\r\nMedical experts treating the patients told News18 that e… [+3358 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Namita S Kalla", "title": "From weight goals to heart health, here’s why vegan milk is good for you - Moneycontrol", "description": "If you are a new vegan looking for dairy alternatives, you can choose from a variety of plant-based milks that are nutritional and flavorful. Here are five effective plant-based milk alternatives – almond, coconut, peanut, sesame, and soy milk – each with uni…", "url": "https://www.moneycontrol.com/news/health-and-fitness/health-benefits-of-plant-based-milk-vegan-milk-health-benefits-of-almonds-coconut-soy-sesame-peanut-milk-keep-heart-healthy-what-to-eat-to-lose-weight-12052881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/01/Health-benefits-of-almond-milk-770x433.jpg", "publishedAt": "2024-01-15T06:37:14Z", "content": "If you're a new vegan looking for a delicious and nutritious replacement for cow's milk, you're in luck! There are so many plant-based milks to choose from, each with its own benefits and flavours. W… [+3175 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Neurosurgeon pioneers Alzheimer's, addiction treatments using ultrasound | 60 Minutes - 60 Minutes", "description": "American neurosurgeon Ali Rezai is pioneering ways to try to help people with drug addiction and with Alzheimer's disease. One experiment focuses beams of ul...", "url": "https://www.youtube.com/watch?v=7BGtVJ3lBdE", "urlToImage": "https://i.ytimg.com/vi/7BGtVJ3lBdE/maxresdefault.jpg", "publishedAt": "2024-01-15T05:20:24Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol", "title": "Natural remedies to stop premature greying of hair - Moneycontrol", "description": "Find out what causes your hair to lose its colour and try these natural remedies to restore your youthful look. You can fight back against premature greying of hair with these simple home remedies", "url": "https://www.moneycontrol.com/web-stories/home-remedies-for-long-hair-natural-remedies-to-stop-premature-greying-of-hair-1533919.html", "urlToImage": "https://images.news18.com/webstories/2024/01/Grey-hair-3.jpg", "publishedAt": "2024-01-15T05:13:40Z", "content": "Amla: A rich source of antioxidants and Vitamin C, amla, or Indian gooseberry, helps nurture your hair and fights oxidative stress, a notorious contributor to premature greying"}, {"source": {"id": null, "name": "Tennews.in"}, "author": "TenNews Team", "title": "Inclisiran for cholesterol: Docs call it expensive, bat for cheaper options - Ten News", "description": "New Delhi, Jan 14 (IANS) Even as India is set to soon launch promising new DCGI and US FDA-approved medicine Inclisiran to lower cholesterol and keep it low with just two doses a year, doctors, while hailing the advance, contend that the drug is expe", "url": "https://tennews.in/inclisiran-for-cholesterol-docs-call-it-expensive-bat-for-cheaper-options/", "urlToImage": null, "publishedAt": "2024-01-15T05:05:18Z", "content": "New Delhi, Jan 14 (IANS) Even as India is set to soon launch promising new DCGI and US FDA-approved medicine Inclisiran to lower cholesterol and keep it low with just two doses a year, doctors, while… [+4281 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk, Edited by Kristina Das", "title": "Thyroid Diet: 10 nutrient-rich foods to include in your meal plan - India TV News", "description": "Individuals can support their thyroid health and overall well-being by adopting a diet rich in these nutrient-dense foods. Coupled with a healthy lifestyle, including regular exercise and proper hydration, a thyroid-friendly diet can play a significant role i…", "url": "https://www.indiatvnews.com/health/thyroid-diet-10-nutrient-rich-foods-to-include-in-your-meal-plan-2024-01-15-911868", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/01/thyroid-diet-1705293649.jpg", "publishedAt": "2024-01-15T04:45:15Z", "content": "Maintaining a well-balanced diet is essential for supporting thyroid health. The thyroid gland plays a crucial role in regulating metabolism and overall well-being, and certain nutrients are particul… [+2799 chars]"}, {"source": {"id": null, "name": "Bnnbreaking.com"}, "author": "Sakchi Khandelwal", "title": "Unveiling the Health Benefits of Jaggery: Aiding Digestion, Boosting Iron Levels, and Beyond - BNN Breaking", "description": "Explore the health benefits of jaggery, a traditional Indian sweetener. Learn how it aids digestion, regulates blood pressure, boosts iron levels, and more.", "url": "https://bnnbreaking.com/lifestyle/food/unveiling-the-health-benefits-of-jaggery-aiding-digestion-boosting-iron-levels-and-beyond/", "urlToImage": "https://media.bnn.network/content/uploads/2024/01/health-benefits-of-jaggery-20240115042128.jpg", "publishedAt": "2024-01-15T04:37:11Z", "content": "The humble jaggery, or ‘gur’ as it is fondly known in India, is more than just a traditional sweetener. It’s a health elixir passed down through generations, seamlessly woven into the fabric of the I… [+2313 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "This essential food is the leading cause of most deaths: WHO - IndiaTimes", "description": "The World Health Organisation (WHO) has warned against the consumption of excessive salts. Implying the disastrous effects of salt consumption on human health, the WHO had earlier said in a report that the primary health effect associated with diets high in s…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/this-essential-food-is-the-leading-cause-of-most-deaths-who/photostory/106852127.cms", "urlToImage": "https://static.toiimg.com/photo/106852146.cms", "publishedAt": "2024-01-15T04:25:33Z", "content": "Sodium, a component of table salt, plays a crucial role in maintaining fluid balance and transmitting nerve impulses in the body. However, excessive sodium intake can lead to increased blood pressure… [+894 chars]"}, {"source": {"id": null, "name": "Highlandpost.com"}, "author": "HP News Service", "title": "Advanced Stage Cervical Cancer Cases on the Rise and importance of HPV vaccine - Highland Post", "description": "Human papillomavirus, also called HPV, is spread by sexual activity. Some strains of HPV cause genital warts. Other HPV strains", "url": "https://highlandpost.com/advanced-stage-cervical-cancer-cases-on-the-rise-and-importance-of-hpv-vaccine/", "urlToImage": "https://highlandpost.com/wp-content/uploads/2024/01/HPV-Vaccines-to-Prevent-Cervical-Cancer.jpg", "publishedAt": "2024-01-15T04:12:27Z", "content": "Human papillomavirus, also called HPV, is spread by sexual activity. Some strains of HPV cause genital warts. Other HPV strains can cause cancers.\r\nHPV vaccine protects against cancer of the vagina, … [+1800 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "12 healthy reasons to eat Grapes regularly - Recipes", "description": "​Grapes make for a healthy and nutritious fruit snack. Readily available in green, red, black, yellow, and pink, this seasonal fruit is rich in nutrients, which makes it no less than a superfood. Here are some of its benefits.", "url": "https://recipes.timesofindia.com/web-stories/12-healthy-reasons-to-eat-grapes-regularly/photostory/106849685.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106849698,imgsize-120234,width-900,height-1200,resizemode-6/106849698.jpg", "publishedAt": "2024-01-15T03:31:00Z", "content": "Grapes make for a healthy and nutritious fruit snack. Readily available in green, red, black, yellow, and pink, this seasonal fruit is rich in nutrients, which makes it no less than a superfood. Here… [+25 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "saumya pandey", "title": "Understanding The Internal Turmoil Caused By Sleep Deprivation | TheHealthSite.com - TheHealthSite", "description": "Understanding the profound impact of sleep deprivation on both body and mind emphasizes the importance of prioritizing sleep for overall health. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/understanding-the-internal-turmoil-caused-by-sleep-deprivation-1054345/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2024/01/tired-student-business-girl-wake-up-morning-due-alarm-clock-ringing-bedroom.jpg", "publishedAt": "2024-01-15T03:31:00Z", "content": "Addressing sleep issues promptly and adopting healthy sleep habits.\r\nUnderstanding the profound impact of sleep deprivation on both body and mind emphasizes the importance of prioritizing sleep for o… [+3903 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Postpartum Weight Loss: A Step-by-Step Nutritional Plan For Newly Moms to Shed Those Extra Pounds Safely - India.com", "description": "While most women lose half the postpartum weight within 5-6 months, some may take a few more months. Here are few steps for new mothers that can help them in losing those extra pounds slowly and effectively.", "url": "https://www.india.com/lifestyle/postpartum-weight-loss-a-step-by-step-nutritional-plan-for-newly-moms-to-shed-those-extra-pounds-safely-6655639/", "urlToImage": "https://static.india.com/wp-content/uploads/2024/01/WhatsApp-Image-2024-01-15-at-8.42.20-AM.jpeg", "publishedAt": "2024-01-15T03:14:37Z", "content": "While most women lose half the postpartum weight within 5-6 months, some may take a few more months. Here are few steps for new mothers that can help them in losing those extra pounds slowly and effe… [+2730 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Bivalent COVID-19 vaccines show higher effectiveness against thromboembolic events - News-Medical.Net", "description": "Study finds bivalent mRNA COVID-19 vaccines are more effective than monovalent vaccines in preventing thromboembolic events in older adults and those with end-stage renal disease.", "url": "https://www.news-medical.net/news/20240114/Bivalent-COVID-19-vaccines-show-higher-effectiveness-against-thromboembolic-events.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_769061_17052861142766079.jpg", "publishedAt": "2024-01-15T02:37:00Z", "content": "In a recent study published in the MMWR and Morbidity and Mortality Weekly Report, researchers retrospectively analyzed two cohorts among Medicare enrollees to estimate the vaccine effectiveness (VE)… [+5772 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Decoding the role of sleep in weight loss maintenance - Mint Lounge", "description": "Multiple studies have found that there's a direct link between poor quality of sleep and weight gain", "url": "https://lifestyle.livemint.com/health/wellness/chronic-sleep-deprivation-weight-loss-maintenance-sleep-hygience-strategies-111705141400978.html", "urlToImage": "https://images.livemint.com/img/2024/01/13/1140x641/milan-gaziev-EyOgUGnnQjo-unsplash_1705142477028_1705142502681.jpg", "publishedAt": "2024-01-15T02:36:00Z", "content": "I have had trouble sleeping last night and barely managed to get in four hours of restless shut-eye. Compounding the problem are the Christmas and New Years Eve excesses, and the fact that I am on th… [+5255 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Global fungal disease deaths doubled in a decade: Study - mid-day.com", "description": "Global fungal disease deaths doubled in a decade Study Though fungal disease has multiple causes, the updated mortality figures nevertheless dwarf deaths", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/global-fungal-disease-deaths-doubled-in-a-decade-study-23329995", "urlToImage": "https://images.mid-day.com/images/images/2024/jan/fungal-infections_d.jpg", "publishedAt": "2024-01-15T02:26:00Z", "content": "Though fungal disease has multiple causes, the updated mortality figures nevertheless dwarf deaths from other single pathogens, killing six times more people than malaria, and almost three times as m… [+2860 chars]"}, {"source": {"id": null, "name": "Bnnbreaking.com"}, "author": "Waqas Arain", "title": "Link Between Early Life Adversity and Rapid Brain Development - BNN Breaking", "description": "Researchers from A*STAR's SICS discover a correlation between early life adversity (ELA) and accelerated brain development in children, underscoring the need for early intervention.", "url": "https://bnnbreaking.com/breaking-news/health/early-life-adversity-linked-to-faster-brain-development-astar-study/", "urlToImage": "https://media.bnn.network/content/uploads/2024/01/early-life-adversity-brain-development-20240115022213.jpg", "publishedAt": "2024-01-15T02:22:00Z", "content": "In a breakthrough development, researchers at A*STAR’s Singapore Institute for Clinical Sciences (SICS) have found a link between early life adversity (ELA) and accelerated brain development in child… [+1445 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akanksha Attri", "title": "Ludhiana’s Shankarpuri residents decry ‘stepmotherly treatment - Hindustan Times", "description": "Residents decry poor conditions of roads in the area, complain of the neighbourhood being ignore during fogging season", "url": "https://www.hindustantimes.com/cities/chandigarh-news/ludhianas-shankarpuri-residents-decry-stepmotherly-treatment-101705259802862.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/01/14/1600x900/A-road-in-poor-state-and-garbage-piled-up-in-the-S_1705259800118.jpg", "publishedAt": "2024-01-15T01:50:10Z", "content": "Residents of Shankarpuri Mohalla in Shivpuri have complained of dilapidated condition of the roads in their locality. \r\nA road in poor state and garbage piled up in the Shankarpuri Mohalla in Ludhian… [+1186 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Three experts decode the popular Mediterranean diet for an Indian's palate - mid-day.com", "description": "The Mediterranean diet was the runaway winner in the list of best diets in 2024. We invited three experts to decode this popular, healthy diet for an Indian pal", "url": "https://www.mid-day.com/mumbai-guide/things-to-do/article/mediterranean-the-indian-way-23329934", "urlToImage": "https://images.mid-day.com/images/images/2024/jan/Fats-food_d.jpg", "publishedAt": "2024-01-15T01:40:00Z", "content": "The Mediterranean diet was the runaway winner in the list of best diets in 2024. We invited three experts to decode this popular, healthy diet for an Indian palate\r\nAdd dairy products, good fats and … [+4839 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "China warns of possible rebound of Covid cases this month: Report - Hindustan Times", "description": "At present, respiratory diseases are still mainly influenza, and the infection of Covid-19 is at a relatively low level in China. | World News", "url": "https://www.hindustantimes.com/world-news/china-warns-of-possible-rebound-of-covid-cases-this-month-report-101705278526833.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/01/15/1600x900/CHINA-HEALTH-VIRUS-4_1670816527063_1670816527063_1705279347477.jpg", "publishedAt": "2024-01-15T00:45:53Z", "content": "The number of patients received at fever clinics in medical institutions in China has witnessed a decline since New Year's Day. However, there is a possibility of a rebound in the COVID-19 infection … [+4065 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Mirrorlights: Loss of cells in pancreas in elderly might cause age-related diabetes: Research - Bangalore Mirror", "description": "A team led by Professor Shuang-Qin Yi of Tokyo Metropolitan University have been studying the phenomenon of pancreatic islet cell loss (ICL), where voids are observed in these islet regions when obse", "url": "https://bangaloremirror.indiatimes.com/opinion/you/mirrorlights-loss-of-cells-in-pancreas-in-elderly-might-cause-age-related-diabetes-research/articleshow/106845717.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-77808,msid-106845673/106845673.jpg", "publishedAt": "2024-01-15T00:30:00Z", "content": "Tokyo Metropolitan University\r\n researchers investigated pancreatic islet cell loss (ICL) in persons who had no prior pancreatic issues. They discovered major trends in the types of cells lost owing … [+1851 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel blood test shows promise in detecting early-stage cancers with high accuracy - News-Medical.Net", "description": "Researchers develop a novel plasma proteome-based test for early detection of multiple cancers, achieving high accuracy in identifying low-abundance protein biomarkers.", "url": "https://www.news-medical.net/news/20240114/Novel-blood-test-shows-promise-in-detecting-early-stage-cancers-with-high-accuracy.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_769048_17051643141365787.jpg", "publishedAt": "2024-01-14T23:23:00Z", "content": "In a recent article published in the journal BMJ Oncology, researchers developed a novel proteome/liquid biopsy-based diagnostic test to detect less abundant plasma proteins, i.e., biomarkers for var… [+5436 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Psychology class: Behold the Ozempic effect on business - Financial Times", "description": "Drug Treatments/Eating Behaviour", "url": "https://www.ft.com/content/561d401f-cdcd-4f56-9b89-17fc78f9b6fb", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fwww.ft.com%2F__origami%2Fservice%2Fimage%2Fv2%2Fimages%2Fraw%2Fhttps%253A%252F%252Fd1e00ek4ebabms.cloudfront.net%252Fproduction%252F465282aa-8a1b-4688-a723-92319c91c203.png%3Fsource%3Dnext-article%26fit%3Dscale-down%26quality%3Dhighest%26width%3D700%26dpr%3D1?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2024-01-14T22:10:56Z", "content": "This article picked by a teacher with suggested questions is part of the Financial Times free schools access programme. Details/registration here.\r\nSpecification: \r\n<ul><li>Eating behaviour, biologic… [+883 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Stress can contribute to state of inflammation that leads to metabolic syndrome - Medical Dialogues", "description": "USA: Inflammatory consequences of stress may contribute to an increased risk for metabolic disease, a recent study published in Brain, Behavior, & Immunity - Health has revealed. The study found...", "url": "https://medicaldialogues.in/psychiatry/news/stress-can-contribute-to-state-of-inflammation-that-leads-to-metabolic-syndrome-123025", "urlToImage": "https://medicaldialogues.in/h-upload/2024/01/05/229363-stress.jpg", "publishedAt": "2024-01-14T21:30:12Z", "content": "USA: Inflammatory consequences of stress may contribute to an increased risk for metabolic disease, a recent study published in Brain, Behavior, &amp; Immunity - Health has revealed. \r\nThe study foun… [+4405 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "Rising Kashmir", "title": "Cardiac health hazards of dense fog and harsh winters-innocuous and unanticipated: Dr Sushil - Rising Kashmir", "description": "Jammu, Jan 14: In view of drastic climatic changes every year with winters and fog more in severity as compared to previous ones, and increased rates of hospitalisations due to cardiovascular diseases Head Department of Cardiology GMCH Jammu Dr Sushil Sharma …", "url": "http://www.risingkashmir.com/cardiac-health-hazards-of-dense-fog-and-harsh-winters-innocuous-and-unanticipated-dr-sushil-28df9a9a-c3b0-4382-9a14-f73b6ae5a9da", "urlToImage": "http://admin.risingkashmir.com/Source/News/bda22870-3c77-4309-8d4b-a3e9973f7c73.jpg", "publishedAt": "2024-01-14T20:14:08Z", "content": "Jammu, Jan 14: In view of drastic climatic changes every year with winters and fog more in severity as compared to previous ones, and increased rates of hospitalisations due to cardiovascular disease… [+3542 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Akshay Kumar Purushan", "title": "Should you be eating eggs everyday? Health benefits explored - Sportskeeda", "description": "Eating eggs everyday might seem like a good move, but it's not all sunshine and rainbows. Eggs are stacked with protein, vitamins, and minerals.", "url": "https://www.sportskeeda.com/health-and-fitness/should-eating-eggs-everyday-health-benefits-explored", "urlToImage": "https://staticg.sportskeeda.com/editor/2024/01/c1e00-17052280564271-1920.jpg", "publishedAt": "2024-01-14T17:30:00Z", "content": "Eating eggs everyday might seem like a good move, but it's not all sunshine and rainbows. Eggs are stacked with protein, vitamins, and minerals. But they're also packed with cholesterol, so folks sta… [+5435 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Sneha Swaminathan", "title": "5 Reasons Why You Must Use Asafoetida (Hing) in Your Cooking - WION", "description": "5 Reasons Why You Must Use Asafoetida (Hing) in Your Cooking", "url": "https://www.wionews.com/web-stories/life-fun/5-reasons-why-you-must-use-asafoetida-hing-in-your-cooking-1705252345708", "urlToImage": null, "publishedAt": "2024-01-14T17:21:34Z", "content": "Asafoetida possesses anti-inflammatory and antimicrobial properties that may contribute to respiratory health. It is traditionally used to relieve respiratory issues such as asthma, bronchitis, and c… [+5 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": null, "title": "How Beets Can Help You Perform Better During Workouts - CNET", "description": "Boost your athletic performance with nature's pre-workout.", "url": "https://www.cnet.com/health/nutrition/how-beets-can-help-you-perform-better-during-workouts/", "urlToImage": "https://www.cnet.com/a/img/resize/5f7d7742eb6db2794fc6f73af87da65e68038f57/hub/2023/01/23/4169cb03-91cb-46b1-80cd-cde0c09d88e1/gettyimages-1178095232.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2024-01-14T16:52:00Z", "content": "You are what you eat, including when it comes to fitness. Foods like whole grains, meats and eggs are popular choices to help fuel your workouts, but other surprising foods can come in handy, like be… [+3577 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Long Covid Patients At A Higher Risk For Digestive Diseases Up To 1 Year: Study - Zee News", "description": "5 Workplace Mental Wellness Trends 2024 In the study, the team from Southern Medical University in China and University of California Los Angeles, US, compared rates of digestive diseases among Covid survivors 30 or more days after infection (112,311), a cont…", "url": "https://zeenews.india.com/health/long-covid-patients-at-a-higher-risk-for-digestive-diseases-up-to-1-year-study-2709699", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2024/01/14/1349175-jn-covid.jpg", "publishedAt": "2024-01-14T16:22:46Z", "content": "Long Covid patients are at a higher risk for digestive diseases, for up to one year, according to a study. The study, published in the journal BMC Medicine, showed that people who suffered both sever… [+2904 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Shivam Verma", "title": "7 benefits of cooking food in mustard oil - DNA India", "description": "Here are 7 benefits of cooking food in mustard oil", "url": "https://www.dnaindia.com/web-stories/lifestyle/7-benefits-of-cooking-food-in-mustard-oil-1705247403385", "urlToImage": null, "publishedAt": "2024-01-14T16:03:32Z", "content": "Mustard oil has a high smoke point, making it suitable for various cooking methods, including deep frying and stir-frying."}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol", "title": "Dark chocolate vs milk chocolate: Which is better? - Moneycontrol", "description": "Chocolate has been shown to decrease inflammation and improve memory, keep your heart healthy, and even boost your mood. But chocolates are also infamous for its high fat and sugar content.", "url": "https://www.moneycontrol.com/web-stories/dark-chocolate-vs-milk-chocolate-which-is-better-for-you-1533407.html", "urlToImage": "https://images.news18.com/webstories/2024/01/cropped-julia-zyablova-EwaJbJvS9io-unsplash-scaled-1.jpg", "publishedAt": "2024-01-14T15:23:21Z", "content": "But despite its health benefits, chocolates are also infamous for its high fat and sugar content. It is also associated with acne, obesity, high blood pressure, coronary artery disease, and diabetes … [+38 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "EMMANUAL", "title": "With increasing age, the brain starts getting old, if you want to make your memory sharp then take help of these methods - News Track English", "description": "As we age, our brains undergo natural changes that can impact memory and cognitive function. However, there are effective methods to keep your memory sharp and enhance overall brain health. In this article, we'll explore valuable insights and practical tips t…", "url": "https://english.newstracklive.com/news/with-increasing-age-the-brain-starts-getting-old-if-you-want-to-make-your-memory-sharp-then-take-help-of-these-methods-sc53-nu371-ta371-1308571-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/health-tips/Jan/14/big_thumb/dfg_65a3a97b2b5ca.jpg", "publishedAt": "2024-01-14T15:22:53Z", "content": "As we age, our brains undergo natural changes that can impact memory and cognitive function. However, there are effective methods to keep your memory sharp and enhance overall brain health. In this a… [+3106 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Sakshi Verma", "title": "Improving digestion to calming nervous system, learn 5 benefits of drinking turmeric milk at night - India TV News", "description": "Drinking turmeric milk at night works as a wonderful tonic for cold problems. Consuming a glass of turmeric milk before sleeping is considered very beneficial for overall health.", "url": "https://www.indiatvnews.com/lifestyle/food/improving-digestion-to-calming-nervous-system-learn-5-benefits-of-drinking-turmeric-milk-at-night-2024-01-14-911810", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/01/file-image-100-1705245269.jpg", "publishedAt": "2024-01-14T15:18:21Z", "content": "Turmeric milk tastes delicious and is also full of health benefits. Since childhood, we have been seeing that in case of minor injuries, viral infections, colds, cough fever, etc., our mothers make u… [+2123 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  WALLA!", "title": "Vegans are less likely to catch COVID - study - The Jerusalem Post", "description": "Plant-based and vegan diets, rich in antioxidants and phytonutrients, are believed to strengthen the immune system and aid in fighting viral infections, potentially reducing the risk of COVID-19.", "url": "https://www.jpost.com/health-and-wellness/coronavirus/article-782119", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/572676", "publishedAt": "2024-01-14T13:43:00Z", "content": "Vegans and vegetarians may be 39% less likely to catch COVID-19, according to a recent study published in BMJ Nutrition Prevention &amp; Health. \r\nAccording to researchers, plant-based diets, which e… [+2573 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "saumya pandey", "title": "Skin Health: Embrace The Nourishing Properties Of This Face Mask | TheHealthSite.com - TheHealthSite", "description": "Papaya seed face masks contain multiple properties that can soothe your skin. TheHealthSite.com", "url": "https://www.thehealthsite.com/beauty/skin-health-embrace-the-nourishing-properties-of-this-face-mask-1054273/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2024/01/image-woman-holding-brush-applying-cream.jpg", "publishedAt": "2024-01-14T12:05:00Z", "content": "Papaya's prowess extends to lightening skin spots and eliminating tan.\r\nPapaya seed face masks contain multiple properties that can soothe your skin.\r\nPapaya, known for its nutritional richness, exte… [+3905 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Heena Sharma", "title": "5 Salads to Eat This Week - WION", "description": "5 Salads to Eat This Week", "url": "https://www.wionews.com/web-stories/life-fun/5-salads-to-eat-this-week-1705232995691", "urlToImage": null, "publishedAt": "2024-01-14T11:58:06Z", "content": "Packed with fresh vegetables like tomatoes, cucumbers, and olives, Greek salad is rich in antioxidants and heart-healthy monounsaturated fats from olive oil. It promotes cardiovascular well-being."}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Khushi Pal", "title": "5 amazing ways mustard oil boosts hair health - Hindustan Times", "description": "Here are 5 advantages of including it in your hair care regimen.", "url": "https://www.hindustantimes.com/web-stories/lifestyle/5-amazing-ways-mustard-oil-boosts-hair-health-101705229386910.html", "urlToImage": null, "publishedAt": "2024-01-14T11:54:32Z", "content": "By Khushi PalPublished Jan 14, 2024\r\nHindustan TimesLifestylePhoto Credits: HT File Photo"}, {"source": {"id": null, "name": "WION"}, "author": "Heena Sharma", "title": "5 Health Benefits of Mutton Paya Soup - WION", "description": "5 Health Benefits of Mutton Paya Soup", "url": "https://www.wionews.com/web-stories/life-fun/5-health-benefits-of-mutton-paya-soup-1705232100361", "urlToImage": null, "publishedAt": "2024-01-14T11:41:49Z", "content": "Mutton Paya Soup (bone broth) is highly rich in vitamins and minerals. The slow-cooking process of mutton bones releases valuable nutrients like calcium, phosphorus, magnesium, and collagen into the … [+5 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Predictions of AI-powered models strictly trial-specific, have no generalisability: Study - ETHealthWorld", "description": "The team of researchers, including those from the universities of Cologne (Germany) and Yale (US), were testing the accuracy of AI-driven models in predicting the response of schizophrenic patients to antipsychotic medication across several independent clinic…", "url": "https://health.economictimes.indiatimes.com/news/health-it/predictions-of-ai-powered-models-strictly-trial-specific-have-no-generalisability-study/106835992", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-106835992,imgsize-39142,width-1200,height=765,overlay-ethealth/health-it/predictions-of-ai-powered-models-strictly-trial-specific-have-no-generalisability-study.jpg", "publishedAt": "2024-01-14T10:50:01Z", "content": "New Delhi: AI-powered prediction models made accurate predictions within the trial they were developed in, but gave \"random predictions\" outside of it, according to a new research. Researchers said t… [+1973 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Sonali Sharma", "title": "6 foods rich in vitamin K - DNA India", "description": "foods rich in vitamin K", "url": "https://www.dnaindia.com/web-stories/health/6-foods-rich-in-vitamin-k-1705224343472", "urlToImage": null, "publishedAt": "2024-01-14T09:41:21Z", "content": "Apart from vitamin K, yogurt is also rich in vitamin B6, vitamin C, iron, and magnesium. It is high in protein and keeps your gut healthy by improving digestion."}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "JN.1 Variant May Trigger Another Devastating COVID-19 Wave: Experts Warn of Increased Hospitalizations De - TheHealthSite", "description": "JN.1 Variant Tsunami Warning: Experts Urge Vigilance as Dominant Variant Poises for Larger COVID Wave. TheHealthSite.com", "url": "https://www.thehealthsite.com/news/jn-1-variant-may-trigger-another-devastating-covid-19-wave-experts-warn-of-increased-hospitalizations-deaths-1054299/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2024/01/JN.1-COVID-Variant-1.jpg", "publishedAt": "2024-01-14T09:04:00Z", "content": "JN.1 Variant May Trigger Another Devastating COVID-19 Wave: Experts Warn of Increased Hospitalizations, Deaths\r\nJN.1 Variant Tsunami Warning: Experts Urge Vigilance as Dominant Variant Poises for Lar… [+3477 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "How to recognise the early signs of Thyroid Cancer - IndiaTimes", "description": "Thyroid cancer originates in the cells of the thyroid gland, a butterfly-shaped organ in the neck. It is often detected through symptoms like neck lum", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/how-to-recognise-the-early-signs-of-thyroid-cancer/articleshow/106833645.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-106833626,width-1070,height-580,imgsize-23534,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-14T08:52:00Z", "content": "Cervical Cancer Awareness Month 2024: Dispelling cervical health myths and tips by Gynecologist Shafalika SB"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "D N INDUJAA", "title": "Otherwise, there may be signs of this serious disease !!! - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "health : Do not ignore these symptoms seen in the body during periods, otherwise...\n\nToday, through this article, we will tell you that do not ignore", "url": "https://www.indiaherald.com/Health/Read/994668080/Otherwise-there-may-be-signs-of-this-serious-disease-", "urlToImage": "https://www.indiaherald.com/imagestore/images/health/movies_news/otherwise-there-may-be-signs-of-this-serious-disease-70a8f01b-37ee-434a-b84b-3d3bebcd1a61-415x250-IndiaHerald.jpg", "publishedAt": "2024-01-14T08:51:24Z", "content": "Today, through this article, we will tell you that do not ignore these symptoms seen on the body during periods. Otherwise, there may be signs of this serious disease\r\nPeriods Symptoms\r\nSome symptoms… [+1538 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Khushi Pal", "title": "5 wonderful reasons to have honey in winter - Hindustan Times", "description": "Here are 5 healthy advantages of having honey this season to help improve overall health.", "url": "https://www.hindustantimes.com/web-stories/lifestyle/5-wonderful-reasons-to-have-honey-in-winter-101705209521441.html", "urlToImage": null, "publishedAt": "2024-01-14T07:41:16Z", "content": "By Khushi PalPublished Jan 14, 2024\r\nHindustan TimesLifestylePhoto Credits: Pexels"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Information Desk", "title": "Cervical Cancer Awareness Month: Vital tests for early detection - India Today", "description": "Early detection is crucial for successful cervical cancer treatment due to its slow progression. Timely screening is essential for women aiming to maintain good health throughout their lives.", "url": "https://www.indiatoday.in/information/story/cervical-cancer-awareness-month-vital-tests-for-early-detection-2488476-2024-01-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202401/karnataka-doctor-illegal-abortion-274449492-16x9.jpg?VersionId=WVHO3cLd_uPCmsqElRYVR1VR0FsKKnKf", "publishedAt": "2024-01-14T07:31:04Z", "content": "Cervical cancer is one of the major health problems in India with a high rate of occurrence among South Asian countries. When detected early, the extent and severity of the disease burden can be redu… [+3145 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Saima Khan", "title": "Want to say bye to your glasses? Try 8 effective exercises to improve eyesight - Sportskeeda", "description": "There are many exercises to improve eyesight if you're struggling with low vision.", "url": "https://www.sportskeeda.com/health-and-fitness/want-say-bye-glasses-try-8-effective-exercises-improve-eyesight", "urlToImage": "https://staticg.sportskeeda.com/editor/2024/01/75cbb-17051765541583-1920.jpg", "publishedAt": "2024-01-14T06:34:00Z", "content": "There are many exercises to improve eyesight if you're struggling with low vision.\r\nWhile eyeglasses and contact lenses may increase the sharpness of your vision, they don't help with inefficiency in… [+4412 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "ANUKRITI SRIVASTAVA", "title": "Unlocking Nature's Secret: Homemade Rosemary Water For Hair Vitality - HerZindagi English", "description": "Rosemary is a popular ingredient used in beauty as well as a hair care product because of its incredible properties. Read on to learn the DIY way to make rosemary water for hair growth.", "url": "https://www.herzindagi.com/beauty/how-to-make-diy-rosemary-water-for-hair-growth-article-261921", "urlToImage": "https://images.herzindagi.info/image/2024/Jan/how-to-make-rosemary-water.jpg", "publishedAt": "2024-01-14T06:30:00Z", "content": "Rosemary is not a new name. It is a popular ingredient used in skincare and haircare products for ages. It has incredible benefits for hair growth. It is known to increase blood circulation and promo… [+1720 chars]"}, {"source": {"id": null, "name": "Lokmattimes.com"}, "author": "Lokmat English Desk", "title": "Tata Memorial Hospital Doctors Discover Low-Cost Drug Dose to Reduce Chemotherapy Side Effects - Lokmat", "description": "Doctors from the renowned cancer care center, Tata Memorial Centre in Parel, Mumbai, have once again demonstrated innovation by devising a smaller and lower-cost dosage of a well-known drug used to control chemotherapy-related vomiting and nausea. Their resea…", "url": "https://www.lokmattimes.com/health/tata-memorial-hospital-doctors-discover-low-cost-drug-dose-to-reduce-chemotherapy-side-effects/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/images/686x514/d259e0c4-32b7-11ed-a51a-9271a4faa378-1663000160784-202307582089_202401672908.jpg", "publishedAt": "2024-01-14T06:09:16Z", "content": "Doctors from the renowned cancer care center, Tata Memorial Centre in Parel, Mumbai, have once again demonstrated innovation by devising a smaller and lower-cost dosage of a well-known drug used to c… [+2349 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Neha Madaan", "title": "Dengue cases among kids on the rise this winter - Times of India", "description": "Paediatricians in Pune are observing an unusual rise of dengue cases among children this winter. Learn more about the factors contributing to this increase and the potential co-infections.", "url": "https://timesofindia.indiatimes.com/city/pune/unusual-rise-of-dengue-cases-among-children-in-pune-this-winter/articleshow/106827094.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-01-14T03:02:00Z", "content": "Traditional South Indian dishes for Pongal celebrations"}, {"source": {"id": null, "name": "Thesouthfirst.com"}, "author": "Chetana Belagere", "title": "Is Parkinson's disease on the rise, especially among the young? Here are the latest insights - South First", "description": "Exploring the surge in Parkinson's disease, particularly among India's young, recent studies highlight genetic factors, lifestyle links.", "url": "https://thesouthfirst.com/news/parkinsons-disease-on-the-rise-especially-among-the-young/", "urlToImage": "https://thesouthfirst.com/wp-content/uploads/2024/01/YOPD.jpg", "publishedAt": "2024-01-14T02:32:04Z", "content": "In recent years, India has witnessed a worrying surge in cases of Parkinson’s disease (PD), especially among younger people. This condition, traditionally linked to the elderly, is now seen in indivi… [+10327 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "saumya pandey", "title": "Food Toxins: How To Identify And Eliminate Them? | TheHealthSite.com - TheHealthSite", "description": "Avoid these food toxins to transform your health and prevent it from other health problems. TheHealthSite.com", "url": "https://www.thehealthsite.com/fitness/food-toxins-how-to-identify-and-eliminate-them-1052283/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2024/01/closeup-chemist-scientist-injecting-organic-tomato-with-pesticides-gmo-test.jpg", "publishedAt": "2024-01-14T02:31:00Z", "content": "Cooking and minimizing smoke can reduce PAHs.\r\nAvoid these food toxins to transform your health and prevent it from other health problems.\r\nPeople often get worried about food items that contain chem… [+2537 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Foods that may provide added nutrition to boost immunity - Good Morning America", "description": "Dietician and author Rachel Beller shares some recipes containing food that may provide added nutrition to boost immunity to combat the flu season.SUBSCRIBE ...", "url": "https://www.youtube.com/watch?v=pn_isvJXg1E", "urlToImage": "https://i.ytimg.com/vi/pn_isvJXg1E/maxresdefault.jpg", "publishedAt": "2024-01-13T19:10:00Z", "content": null}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "News Track", "title": "This Single Factor Will Lead to Weight Loss in Just 10 Days - 5 Health Benefits - News Track English", "description": "If you're looking to control weight and struggling to manage your eating habits, making modifications to your diet is essential. Weight control isn't just about restricting fried, spicy, and oily foods; it also involves incorporating foods that satisfy hunger…", "url": "https://english.newstracklive.com/news/this-one-thing-will-reduce-your-weight-by-several-kilos-in-just-10-days-it-will-have-5-benefits-for-health-sc96-nu915-ta915-ta372-1308413-1.html", "urlToImage": "https://media.newstrack.in/uploads/health-lifestyle/health-tips/Jun/29/big_thumb/weight_62bc08b988d12.JPG", "publishedAt": "2024-01-13T18:59:33Z", "content": "If you're looking to control weight and struggling to manage your eating habits, making modifications to your diet is essential. Weight control isn't just about restricting fried, spicy, and oily foo… [+5775 chars]"}, {"source": {"id": null, "name": "Jagrantv.com"}, "author": "ayushee joshi", "title": "Healthy Diet: Include These Fiber-Rich Foods in Your Meals to Get Amazing Benefits - Jagran TV", "description": "Fiber-Rich Diet: Eating fiber-rich foods at night promotes better digestion as the fiber sticks to the intestine, preventing constipation and promoting regular bowel movements. This helps you get rid of ...", "url": "https://www.jagrantv.com/en-show/healthy-diet-benefits-of-eating-fiber-rich-foods-for-a-healthy-body-rc1048913", "urlToImage": "https://i.ytimg.com/vi/UK_uvkbwwEE/maxresdefault.jpg", "publishedAt": "2024-01-13T18:15:46Z", "content": "Fiber-Rich Diet: Most people in todays fast-paced world suffer from stomach problems such as constipation, gas, and indigestion, which are primarily caused by a lack of fiber in their diet. Fiber aid… [+1248 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Press Trust of India", "title": "Outdoor humidity, temperature during pregnancy found to affect child’s blood pressure - News9 LIVE", "description": "Children with higher blood pressure are more likely to have higher blood pressure as adults, which can increase the risk of heart disease and stroke as well as kidney disease and vascular dementia", "url": "https://www.news9live.com/health/health-news/outdoor-humidity-temperature-during-pregnancy-found-to-affect-childs-blood-pressure-2404437", "urlToImage": "https://images.news9live.com/wp-content/uploads/2024/01/pregnancy.jpg", "publishedAt": "2024-01-13T16:05:30Z", "content": "New Delhi: Exposure to outdoor humidity and temperature levels during pregnancy are associated with blood pressure changes in the children, new study has found. An international team of researchers f… [+2589 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "EMMANUAL", "title": "Magnesium is necessary to keep the nervous system and muscles healthy - News Track English", "description": "In the vast landscape of essential minerals, magnesium emerges as a silent hero, often overlooked but integral to the intricate workings of our bodies. This article aims to delve deep into the fascinating world of magnesium, shedding light on its multifaceted…", "url": "https://english.newstracklive.com/news/magnesium-is-necessary-to-keep-the-nervous-system-and-muscles-healthy-sc53-nu371-ta371-1308493-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/health-tips/Jan/13/big_thumb/fdgdrfg_65a26220e7123.jpeg", "publishedAt": "2024-01-13T15:29:33Z", "content": "In the vast landscape of essential minerals, magnesium emerges as a silent hero, often overlooked but integral to the intricate workings of our bodies. This article aims to delve deep into the fascin… [+5313 chars]"}]}