{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Exploring the prevalence of COVID-19 symptoms in post-acute COVID-19 phase among children and young people - News-Medical.Net", "description": "In a recent study published in PLoS ONE, researchers prospectively followed up with children and young people (CYP) diagnosed with post-coronavirus disease 2019 (COVID-19) condition or long COVID to elucidate long COVID symptom profiles over six months.", "url": "https://www.news-medical.net/news/20230308/Exploring-the-prevalence-of-COVID-19-symptoms-in-post-acute-COVID-19-phase-among-children-and-young-people.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_741119_16783039989684115.jpg", "publishedAt": "2023-03-08T20:16:00Z", "content": "In a recent study published in PLoS ONE, researchers prospectively followed up with children and young people (CYP) diagnosed with post-coronavirus disease 2019 (COVID-19) condition or long COVID to … [+5893 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Genetic adaptations help Amazonian populations resist Chagas infection - Medical Xpress", "description": "Chagas disease affects approximately 6 million people only in Latin America and is one of the leading causes of death in this region. This infectious disease, also called American trypanosomiasis, is caused by the parasite Trypanosoma cruzi (T. cruzi). Howeve…", "url": "https://medicalxpress.com/news/2023-03-genetic-amazonian-populations-resist-chagas.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/genetic-adaptations-he.jpg", "publishedAt": "2023-03-08T19:34:41Z", "content": "Chagas disease affects approximately 6 million people only in Latin America and is one of the leading causes of death in this region. This infectious disease, also called American trypanosomiasis, is… [+3899 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aaron Mok", "title": "OpenAI CEO Sam Altman takes diabetes drug metformin as part of his anti-aging routine - Yahoo Finance", "description": "Altman, whose company is behind ChatGPT, also eats a diet low in sugar, regularly lifts weights, and sleeps in particularly cold environments.", "url": "https://www.businessinsider.com/openai-ceo-sam-altman-takes-diabetes-drug-metformin-slow-aging-2023-3", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/D576SHENX8qN1ARw0KsBsg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/business_insider_articles_888/1b6c8b928e5f24f5c86d34aa69aa786b", "publishedAt": "2023-03-08T19:10:22Z", "content": "OpenAI CEO Sam Altman said he takes diabetes drug metformin as part of his anti-aging regime.Drew Angerer/Getty Images\r\n<ul><li>OpenAI CEO Sam Altman takes the diabetes drug metformin to slow down ag… [+2935 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Potential new therapeutic target for inflammatory diseases such as lupus and sepsis - Science Daily", "description": "Scientists have made an important breakthrough in understanding what goes wrong in our bodies during the progression of inflammatory diseases and -- in doing so -- unearthed a potential new therapeutic target. The scientists have found that an enzyme called f…", "url": "https://www.sciencedaily.com/releases/2023/03/230308112118.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-03-08T18:14:15Z", "content": "Scientists working in the School of Biochemistry and Immunology in the Trinity Biomedical Sciences Institute at Trinity College Dublin have made an important breakthrough in understanding what goes w… [+2793 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Justin Jackson", "title": "160 million years of life lost to obesity in 2 decades - Medical Xpress", "description": "Researchers at the National University in Singapore and colleagues in the US and China undertook a two-decade metabolic analysis of Global Burden of Disease (GBD) reports. They have published their findings in the journal Cell Metabolism.", "url": "https://medicalxpress.com/news/2023-03-million-years-life-lost-obesity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/160-million-years-of-l.jpg", "publishedAt": "2023-03-08T18:00:01Z", "content": "Researchers at the National University in Singapore and colleagues in the US and China undertook a two-decade metabolic analysis of Global Burden of Disease (GBD) reports. They have published their f… [+3866 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Life-threatening side effects of novel cancer immunotherapies could be treatable - Medical Xpress", "description": "Immunotherapy has been shown to greatly improve survival rates for certain types of cancer. However, in some cases, it can lead to an over-activation of the immune system, which can be dangerous. In a recent review by researchers at Karolinska Institutet, pot…", "url": "https://medicalxpress.com/news/2023-03-life-threatening-side-effects-cancer-immunotherapies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/life-threatening-side.jpg", "publishedAt": "2023-03-08T17:48:02Z", "content": "Laboratory tests after immune checkpoint inhibitor (ICI) treatment in a patient with metastatic renal cell carcinoma. (A) Routine blood tests for the indicated markers at the first admission after tr… [+3360 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Childhood respiratory illness associated with higher risk of death in adulthood - ANI News", "description": "According to new research, having a lower respiratory tract infection as a kid increases the chance of dying from respiratory disease as an adult.", "url": "https://www.aninews.in/news/health/childhood-respiratory-illness-associated-with-higher-risk-of-death-in-adulthood20230308231206", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230308160906.jpeg", "publishedAt": "2023-03-08T17:42:00Z", "content": "Washington [US], March 8 (ANI): According to new research, having a lower respiratory tract infection as a kid increases the chance of dying from respiratory disease as an adult.A study, led by resea… [+5614 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Corrie Pelc", "title": "Why some cancer tumors can become resistant to chemotherapy - Medical News Today", "description": "Researchers say it may simply be a random thing when it comes to if cancer tumors become resistant to chemotherapy. However, once they do, it is difficult to undo that mechanism.", "url": "https://www.medicalnewstoday.com/articles/tumor-cells-response-to-chemotherapy-is-driven-by-randomness", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/03/cancer_tumors_GettyImages179803044_Thumb.jpg", "publishedAt": "2023-03-08T17:38:52Z", "content": "<ul><li>About 19 million people globally have cancer, for which many will receive chemotherapy as a treatment. </li><li>Chemotherapy does not always work for every type of cancer or person. </li><li>… [+6071 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Yash Manchanda", "title": "How to Get Started with Bungee Fitness - Sportskeeda", "description": "Bungee fitness, also known as aerial bungee or bungee workout, is an exciting new way to get fit and have fun.", "url": "https://www.sportskeeda.com/health-and-fitness/how-get-started-bungee-fitness", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/03/1822e-16782940344432-1920.jpg", "publishedAt": "2023-03-08T16:59:00Z", "content": "Bungee fitness, also known as aerial bungee or bungee workout, is an exciting new way to get fit and have fun. This innovative form of exercise involves using a specially designed bungee harness to p… [+3826 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How the brain senses a flu infection — and orders the body to rest - Nature.com", "description": "Scientists trace the neurons in the throat that sense infections and relay this information to the brain.", "url": "https://www.nature.com/articles/d41586-023-00675-0", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00675-0/d41586-023-00675-0_24595180.jpg", "publishedAt": "2023-03-08T16:26:10Z", "content": "Particles of influenza virus (blue; artificially coloured) bud from a burst cell.Credit: Lennart Nilsson, Boehringer Ingelheim International GmbH, TT/SPL\r\nA case of influenza can make even the toughe… [+4160 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Group of Neurons Responsible for Behavioural Problems Caused by Chronic Stress: Study - LatestLY", "description": "Get latest articles and stories on Health at LatestLY.  When these POMC neurons become super active, these sort of behavioural problems result and when scientists reduce their activity, it reduces the behaviours. The report was published in the journal Molecu…", "url": "https://www.latestly.com/agency-news/health-news-group-of-neurons-responsible-for-behavioural-problems-caused-by-chronic-stress-study-4924324.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/03/ANI-20230308120234-588x441.jpg", "publishedAt": "2023-03-08T15:50:20Z", "content": "Atlanta [Georgia], March 8 (ANI): Chronic stress can impact our behaviour, leading to problems like depression, reduced interest in things that previously brought us pleasure, even PTSD.\r\nNow scienti… [+5546 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Oxygen groups key to unlocking graphene's antimicrobial potential, say scientists - Phys.org", "description": "The amount of surface oxygen in graphene materials is a key factor in how effective they could be in killing bacteria—a discovery which may help to design safer and more effective products to combat antimicrobial resistance.", "url": "https://phys.org/news/2023-03-oxygen-groups-key-graphene-antimicrobial.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/oxygen-groups-key-to-u.jpg", "publishedAt": "2023-03-08T15:18:45Z", "content": "The amount of surface oxygen in graphene materials is a key factor in how effective they could be in killing bacteriaa discovery which may help to design safer and more effective products to combat a… [+3868 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Nina Bai-Stanford", "title": "Fast heart rates can drive anxiety, not just vice versa - Futurity: Research News", "description": "Intense experiences can raise your heart rate, but new findings with mice show that the opposite is true: heart rate can up anxiety.", "url": "https://www.futurity.org/heart-rates-anxiety-emotion-2886082-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2023/03/heart_rate_anxiety_1600.jpg", "publishedAt": "2023-03-08T15:10:33Z", "content": "When researchers increased the heart rates of mice, the animals showed more anxious behavior.\r\nStanding on the edge of a precipice, losing your way in a dark forest, or running into a crush will quic… [+5981 chars]"}, {"source": {"id": null, "name": "Business Wire"}, "author": null, "title": "SYNAPS Dx Brings El Paso, Texas Marketplace First Highly Accurate Diagnostic Alzheimer's Disease Test for Patients Diagnosed with Dementia - Business Wire", "description": "SYNAPS Dx Brings El Paso, Texas Marketplace First Highly Accurate Diagnostic Alzheimer’s Disease Test for Patients Diagnosed with Dementia", "url": "https://www.businesswire.com/news/home/20230308005046/en/SYNAPS-Dx-Brings-El-Paso-Texas-Marketplace-First-Highly-Accurate-Diagnostic-Alzheimer%E2%80%99s-Disease-Test-for-Patients-Diagnosed-with-Dementia", "urlToImage": "https://mms.businesswire.com/media/20230308005046/en/1646172/23/SYNAPS_DX_LOGO_COLOR_HORIZONTAL.jpg", "publishedAt": "2023-03-08T15:05:00Z", "content": "EL PASO, Texas--(BUSINESS WIRE)--SYNAPS Dx (SDx), a privately held company focused on the research, development and commercialization of a diagnostic test for Alzheimers disease (AD), is pleased to a… [+4367 chars]"}, {"source": {"id": null, "name": "Psychiatryadvisor.com"}, "author": "Jessica Nye, PhD", "title": "Neighborhood Deprivation Increases Mortality Risk in Schizophrenia, Bipolar Disorder - Psychiatry Advisor", "description": "Researchers sought to determine the association between neighborhood deprivation and mortality in patients with schizophrenia and bipolar disorder.", "url": "https://www.psychiatryadvisor.com/home/topics/schizophrenia-and-psychoses/neighborhood-deprivation-mortality-risk-schizophrenia-bipolar-disorder/", "urlToImage": null, "publishedAt": "2023-03-08T15:05:00Z", "content": "Neighborhood deprivation is associated with mortality risk among individuals with schizophrenia and bipolar disorder (BD), according study findings published in the journal Bipolar Disorders.\r\nThis n… [+3550 chars]"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "Diabetes Incidence At Rise In Children, Young Adults: Study - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-Our research suggests a growing population of young adults with diabetes who are at risk of developing complications from the disease", "url": "http://bwhealthcareworld.businessworld.in/article/Diabetes-Incidence-At-Rise-In-Children-Young-Adults-Study/08-03-2023-468209", "urlToImage": "http://static.businessworld.in/article/article_large_image/1573729758_agjnoP_FotoJet_3_.jpg", "publishedAt": "2023-03-08T15:02:51Z", "content": "Our research suggests a growing population of young adults with diabetes who are at risk of developing complications from the diseaseNew findings from researchers at Wake Forest University School of … [+2820 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Mesh shrinkage after transabdominal preperitoneal inguinal hernia repair | Scientific Reports - Nature.com", "description": "Scientific Reports - Mesh shrinkage after transabdominal preperitoneal inguinal hernia repair", "url": "https://www.nature.com/articles/s41598-023-31088-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-31088-8/MediaObjects/41598_2023_31088_Fig1_HTML.jpg", "publishedAt": "2023-03-08T14:51:47Z", "content": "The postoperative recurrence rate of inguinal hernia has recently been greatly reduced by replacing tissue repair methods with mesh repair methods1,2. However, there are still exists some cases of re… [+7414 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Chronic cough in postmenopausal women and its associations to climacteric symptoms - BMC Women's Health - BioMed Central", "description": "Background Postmenopausal women often have chronic cough. Hormonal changes might be affecting lung function and the mucous membrane of the airways, causing hypersensitivity of the cough reflex. Therefore, postmenopausal hormonal changes could play a key role …", "url": "https://bmcwomenshealth.biomedcentral.com/articles/10.1186/s12905-023-02225-2", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12905.jpg", "publishedAt": "2023-03-08T14:47:31Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "Rachael Ajmera", "title": "A Guide To The Best Snacks For People With Diabetes - Forbes", "description": "", "url": "https://www.forbes.com/health/body/best-snacks-for-diabetes/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/x/https://www.forbes.com/health/wp-content/uploads/2023/03/best_snacks_for_diabetes.jpeg.jpg", "publishedAt": "2023-03-08T14:26:14Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Confronting racial and ethnic disparities in diabetic kidney disease - Nature.com", "description": "Diabetes is on the rise globally, mostly in low- and middle-income countries and among minority ethnic groups in wealthier nations. This increase is behind a surge in chronic kidney disease.", "url": "https://www.nature.com/articles/d41586-023-00651-8", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00651-8/d41586-023-00651-8_24098300.jpg", "publishedAt": "2023-03-08T14:22:58Z", "content": "In the United States, people from minority ethnic groups with diabetes have higher rates of kidney disease than white people with diabetes.Credit: Gary Friedman/Los Angeles Times via Getty\r\nNephrolog… [+10109 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "Covid may cause increased chest pain months after infection: Study - The Siasat Daily", "description": "COVID-19 patients may be at increased risk of suffering chest pain in the six months to a year after the infection", "url": "https://www.siasat.com/covid-may-cause-increased-chest-pain-months-after-infection-study-2543010/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/03/Pandemic.jpg", "publishedAt": "2023-03-08T14:13:00Z", "content": "Washington: COVID-19 patients may be at increased risk of suffering chest pain in the six months to a year after the infection, which could be a sign of future cardiovascular complications, according… [+1901 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Gretchen Reynolds", "title": "How your microbiome may influence your motivation to exercise - The Washington Post", "description": "The microbiomes of physically active people can be quite different from those of people who rarely exercise.", "url": "https://www.washingtonpost.com/wellness/2023/03/08/exercise-microbiome-motivation/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QKO2IGGPQYBW5EROZ6HYK27CV4.jpg&w=1440", "publishedAt": "2023-03-08T12:33:57Z", "content": "Comment on this story\r\nYour gut may help motivate you to exercise. Or it might nudge you to skip your workout.\r\nWhich direction you take appears to be influenced by your diet and the health of your m… [+6704 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Skincare tips for Women's Day: Here's how to unlock the secrets to healthy skin - Hindustan Times", "description": "To have a healthy skin could also mean letting go of many age-old myths, deeper understanding of skin issues and the importance of dermatologists. This International Women's Day and Holi 2023, here are expert tips on how to unlock the secrets to healthy skin …", "url": "https://www.hindustantimes.com/lifestyle/health/skincare-tips-for-women-s-day-here-s-how-to-unlock-the-secrets-to-healthy-skin-101678277277491.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/08/1600x900/pexels-monstera-6620882_1678277570719_1678277604161_1678277604161.jpg", "publishedAt": "2023-03-08T12:18:45Z", "content": "Skincare might be the most searched topic by women after weight loss however, the information on the Internet is only skin-deep as the ever-changing weather conditions in India, along with hectic sch… [+3378 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "H3N2 Virus: Over 50 Hospitalised in Uttar Pradesh's Kanpur in One Day - The Weather Channel", "description": "Cases with flu-like symptoms, including high fever, persistent cough and acute respiratory issues, have been reported in Kanpur in large numbers.", "url": "https://weather.com/en-IN/india/health/news/2023-03-08-h3n2-virus-over-50-hospitalised-in-uttar-pradeshs-kanpur", "urlToImage": "https://s.w-x.co/in-hospital_6.jpg", "publishedAt": "2023-03-08T11:52:15Z", "content": "Nearly 50 patients have been admitted in a day at Hallet Hospital in Kanpur after complaining of high fever, persistent cough and shortness of breath.\r\nThe rising number of H3N2 subtype influenza cas… [+1260 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Breakthrough drug works against all the main types of primary bone cancer - News-Medical.Net", "description": "Researchers at the University of East Anglia have developed a new drug that works against all of the main types of primary bone cancer.", "url": "https://www.news-medical.net/news/20230308/Breakthrough-drug-works-against-all-the-main-types-of-primary-bone-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2023-03-08T11:41:00Z", "content": "Researchers at the University of East Anglia have developed a new drug that works against all of the main types of primary bone cancer.\r\nCancer that starts in the bones, rather than cancer that has s… [+4398 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "5 Silent killer diseases in women - Northeast Now", "description": "Heart disease, hypertension, and diabetes are the leading silent killer diseases that most of the people today are suffering.", "url": "http://nenow.in/health/5-silent-killer-diseases-in-women.html", "urlToImage": "https://nenow.in/wp-content/uploads/2023/03/Silent-killer.jpg", "publishedAt": "2023-03-08T11:00:30Z", "content": "A woman takes care of and nurtures a family but they often strike a balance between work, motherhood and endless household duties leading them to ignore their health. \r\nIgnoring health may cause heal… [+1839 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "POSTECH Research Team Develops AI-powered Ultrasound Imaging that Detects Breast Cancer - India Education Diary", "description": "Breast cancer undisputedly has the highest incidence rate in female patients. Moreover, out of the six major cancers, it is the only one that has shown an increasing trend over the past 20 years. The chance of survival would be higher if breast cance", "url": "https://indiaeducationdiary.in/postech-research-team-develops-ai-powered-ultrasound-imaging-that-detects-breast-cancer/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/postech_new_building.jpg?fit=620%2C413&ssl=1", "publishedAt": "2023-03-08T10:06:14Z", "content": "Breast cancer undisputedly has the highest incidence rate in female patients. Moreover, out of the six major cancers, it is the only one that has shown an increasing trend over the past 20 years. The… [+3220 chars]"}, {"source": {"id": null, "name": "Astrazeneca.com"}, "author": null, "title": "Precision medicine in NASH - AstraZeneca", "description": "We are targeting genetic mutations associated with NASH, which are responsible for an approximately four-fold increase in risk of the disease.", "url": "https://www.astrazeneca.com/what-science-can-do/topics/next-generation-therapeutics/precision-medicine-NASH.html", "urlToImage": "https://www.astrazeneca.com/content/dam/az/wscd/disease-understanding/Nucleotide-based-therapies_RGB_Mulb.Gold.jpg", "publishedAt": "2023-03-08T09:31:43Z", "content": "Targeting novel biology using nucleotide therapeutics\r\nAs we uncover novel disease targets, our chemists and biochemists are leveraging new technologies to create the next generation of therapeutics … [+3599 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "International Women’s Day: ‘Made in India’ vaccine is expected to reduce incidence of cervical cancer - News9 LIVE", "description": "In India, the chances of developing cervical cancer significantly rise around the age of 45 years and peak at 55 years of age.", "url": "https://www.news9live.com/health/health-conditions/international-womens-day-made-in-india-vaccine-is-expected-to-reduce-incidence-of-cervical-cancer-au288-2069667", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/02/Cervical-cancer-vaccine.jpg", "publishedAt": "2023-03-08T09:30:32Z", "content": "In India, the chances of developing cervical cancer significantly rise around the age of 45 years and peak at 55 years of age.\r\n<ul><li>In more than 95 per cent of cases, the cause of cancer in these… [+3555 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Deepak Kalra", "title": "Summer can affect your kidneys! Tips to maintain renal health and keep diseases at bay - Health shots", "description": "Did you know summer can take a toll on your kidney health? Here are some expert-recommended tips to take care of your kidneys in summer.", "url": "https://www.healthshots.com/how-to/maintain-your-kidney-health-this-summer-with-these-tips/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/03/08001734/kidneys-1.jpg", "publishedAt": "2023-03-08T09:30:18Z", "content": "You might like waking up to the glistening sunlight at times, going out on picnics when the weather’s nice and blue, and there are clear skies, but it’s can be bad for your health sometimes. The scor… [+3761 chars]"}, {"source": {"id": null, "name": "Forbesindia.com"}, "author": null, "title": "Dr S Bala Vignesh says hypertension: A major risk factor for heart disease - Forbes India", "description": "Effective management of hypertension can reduce the risk of fatal cardiovascular events", "url": "https://www.forbesindia.com/article/doctors-voice/dr-s-bala-vignesh-says-hypertension-a-major-risk-factor-for-heart-disease/83589/1", "urlToImage": "https://www.forbesindia.com/media/images/2023/Mar/img_203949_dr.s.balavignesh-800x600.jpg", "publishedAt": "2023-03-08T08:49:00Z", "content": "Hypertension has severe adverse effects on health, with the most significant impact on the heart. Hypertension is considered a silent killer as it can induce heart failure, heart attack, kidney damag… [+1645 chars]"}, {"source": {"id": null, "name": "Daily Monitor"}, "author": "THE NEW YORK TIMES", "title": "New treatment could help fix heart's 'forgotten valve' - Monitor", "description": "<p>Patients with leaking tricuspid valves in a research trial saw improvements with a procedure that does not require a risky open-heart surgery</p>", "url": "https://www.monitor.co.ug/uganda/news/national/new-treatment-could-help-fix-heart-s-forgotten-valve--4150398", "urlToImage": "https://www.monitor.co.ug/resource/blob/4150410/f21f5a77e1f781f1c1f982cb2d5e1fdf/home03pix-data.jpg", "publishedAt": "2023-03-08T08:38:46Z", "content": "For the first time, patients with damaged tricuspid valves in their hearts might have a safe treatment that actually helps.\r\nMore than one million mostly older Americans have seriously leaking tricus… [+6298 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Jim Cornall", "title": "Dementia in women: challenges and opportunities - Labiotech.eu", "description": "Dr Andrea Pfeifer, CEO of AC Immune, talks about dementia research, how dementia affects women, and why more women are needed in trials.", "url": "https://www.labiotech.eu/trends-news/tackling-dementia-women/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2023/03/shutterstock-1815242756.jpg", "publishedAt": "2023-03-08T08:17:48Z", "content": "Dr Andrea Pfeifer, chief executive officer of AC Immune SA, talks to Labiotech about dementia research, and how dementia affects women. She also addresses how vital research is when it comes to addre… [+5269 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "COVID-19 on depressive symptoms in low vision patients | OPTH - Dove Medical Press", "description": "Examining the association between the impact of COVID-19 and depressive symptoms in patients with low vision and blindness.", "url": "https://www.dovepress.com/impact-of-covid-19-on-depressive-symptoms-among-patients-with-low-visi-peer-reviewed-fulltext-article-OPTH", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-03-08T07:59:23Z", "content": "Introduction\r\nThe COVID-19 pandemic was declared a global crisis by the World Health Organization (WHO) due to its widespread impact globally.1,2 The pandemic has had serious physical effects on peop… [+26038 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Moph Raises Public Awareness To Reduce Prevalence Of Obesity - MENAFN.COM", "description": "(MENAFN - The Peninsula)  The Peninsula  Doha: The Ministry of Public Health (MoPH), in cooperation with Hamad Medical Corporation (HMC) an", "url": "https://menafn.com/1105728916/Moph-Raises-Public-Awareness-To-Reduce-Prevalence-Of-Obesity", "urlToImage": "https://menafn.com/updates/pr/2023-03/08/TP_d0923image_story.jpg", "publishedAt": "2023-03-08T07:58:53Z", "content": "(MENAFN- The Peninsula) The Peninsula Doha: The Ministry of Public Health (MoPH), in cooperation with Hamad Medical Corporation (HMC) and Primary Health Care Cooperation (PHCC), is participating in m… [+1917 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PR Newswire", "title": "Study by SMU researchers reveals positive relationship between people's psychological well-being and their willingness to consume cultivated meat; and the factors that can motivate this willingness - Yahoo Finance", "description": "Researchers from Singapore Management University (SMU) have released a study that reveals a positive relationship between people's psychological well-being...", "url": "https://finance.yahoo.com/news/study-smu-researchers-reveals-positive-075100314.html", "urlToImage": "https://media.zenfs.com/en/prnewswire.com/a2a73c6c52d2d73445fe012b9e72f723", "publishedAt": "2023-03-08T07:51:00Z", "content": "SINGAPORE, March 8, 2023 /PRNewswire/ -- Researchers from Singapore Management University (SMU) have released a study that reveals a positive relationship between people's psychological well-being an… [+5604 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Finding Your Balance: A book that differentiates perimenopause from menopause - Express Healthcare", "description": "Written by Dr Nozer Sheriar, one of Mumbai’s well-known gynecologists and Shonali Sabherwal, a macrobiotic nutritionist and gut expert seeks to introduce women to their own hormones and help them recognise the reality and consequences of menopause as a hormon…", "url": "https://www.expresshealthcare.in/news/finding-your-balance-a-book-that-differentiates-perimenopause-from-menopause/438373/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2023/03/08120557/New-Project-81.jpg", "publishedAt": "2023-03-08T06:36:20Z", "content": "Written by Dr Nozer Sheriar, one of Mumbais well-known gynecologists and Shonali Sabherwal, a macrobiotic nutritionist and gut expert seeks to introduce women to their own hormones and help them reco… [+2094 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "No Smoking Day 2023: 5 Best Lifestyle Changes To Help Resist Tobacco Cravings - India.com", "description": "No Smoking Day 2023: Smoking is a deadly habit and that is a universal fact. This day is a day to remind, spread awareness about effects of smoking and why its is important to make lifestyle changes for a healthy outlook.", "url": "https://www.india.com/health/no-smoking-day-2023-5-best-lifestyle-changes-to-help-resist-tobacco-cravingshow-to-quit-smoking-5933165/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/03/Screenshot-2023-03-08-095958.jpg", "publishedAt": "2023-03-08T05:06:30Z", "content": "No Smoking Day 2023: Smoking is a deadly habit and that is a universal fact. This day is a day to remind, spread awareness about effects of smoking and why its is important to make lifestyle changes … [+2467 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Temperature-stable TB vax found safe, prompted immune response in adults: Study - The Indian Express", "description": "Thermostable vaccines are desirable in settings where maintaining cold or frozen vaccines for long periods can be costly and difficult", "url": "https://indianexpress.com/article/lifestyle/health/temperature-stable-tb-vax-found-safe-adults-study-8484110/", "urlToImage": "https://images.indianexpress.com/2023/03/tuberculosis_200_pixabay.jpg", "publishedAt": "2023-03-08T04:50:02Z", "content": "A clinical trial testing a freeze-dried, temperature-stable experimental tuberculosis (TB) vaccine in healthy adults found that it was safe and stimulated both antibodies and responses from the cellu… [+2965 chars]"}, {"source": {"id": null, "name": "Nutraingredients-asia.com"}, "author": "foodnavigator-asia.com", "title": "Curcumin, vitamin D, fish oil shown to prevent progression to diabetes in pre-diabetics – Thailand trial - FoodNavigator-Asia.com", "description": "The supplementation of curcumin, vitamin D, and fish oil together has shown to reduce the progression to diabetes in pre-diabetic individuals, according to the findings of a 24-week trial conducted in Thailand.", "url": "https://www.nutraingredients-asia.com/Article/2023/03/08/curcumin-vitamin-d-fish-oil-could-prevent-worsening-of-pre-diabetics-study", "urlToImage": "https://www.foodnavigator-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-asia.com/news/research/curcumin-vitamin-d-fish-oil-could-prevent-worsening-of-pre-diabetics-study/16204609-1-eng-GB/Curcumin-vitamin-D-fish-oil-could-prevent-worsening-of-pre-diabetics-study.jpg", "publishedAt": "2023-03-08T03:34:36Z", "content": "Curcumin is well-known for its anti-inflammatory and antioxidant properties, as well as improving insulin resistance and delay the development of type II diabetes.\r\nSimilarly, fish oil, with its anti… [+3072 chars]"}, {"source": {"id": null, "name": "Egypt Independent"}, "author": "CNN", "title": "‘Keto-like’ diet may be associated with a higher risk of heart disease, according to new research - Egypt Independent", "description": "A low-carb, high-fat “keto-like” diet may be linked to higher levels of “bad” cholesterol and double the risk of cardiovascular events such as blocked arteries, heart attacks and strokes, according to", "url": "https://egyptindependent.com/keto-like-diet-may-be-associated-with-a-higher-risk-of-heart-disease-according-to-new-research/", "urlToImage": "https://amayei.nyc3.digitaloceanspaces.com/2023/03/230305145516-heart-disease-stock-restricted.jpg", "publishedAt": "2023-03-08T03:00:00Z", "content": "A low-carb, high-fat keto-like diet may be linked to higher levels of bad cholesterol and double the risk of cardiovascular events such as blocked arteries, heart attacks and strokes, according to ne… [+6829 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "The case for female mice in neuroscience research - EurekAlert", "description": "Findings reveal that female mice have more stable exploratory behavior than male mice", "url": "https://www.eurekalert.org/news-releases/981540", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-03-08T02:03:16Z", "content": "At a glance:\r\n<ul><li>New research suggests female mice show more stable exploratory behavior than male mice, despite hormone cycles</li><li>The results challenge a long-held assumption that hormones… [+11212 chars]"}, {"source": {"id": null, "name": "Nutraingredients-asia.com"}, "author": "nutraingredients-asia.com", "title": "Targeted nutritional support needed to curb negative consequences of morning sickness – Yili-funded study - NutraIngredients-Asia", "description": "Nausea and vomiting in pregnancy (NVP), commonly known as “morning sickness”, could lead to nutrient deficiencies and severe complications for both mother and infant, say Chinese researchers.", "url": "https://www.nutraingredients-asia.com/Article/2023/03/08/targeted-nutritional-support-needed-to-curb-negative-consequences-of-morning-sickness", "urlToImage": "https://www.nutraingredients-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-asia.com/news/research/targeted-nutritional-support-needed-to-curb-negative-consequences-of-morning-sickness/16199020-1-eng-GB/Targeted-nutritional-support-needed-to-curb-negative-consequences-of-morning-sickness.jpg", "publishedAt": "2023-03-08T01:41:15Z", "content": "Findings from previous studies on changes in dietary intake caused by NVP have been inconsistent.\r\nTo investigate the association between NVP and dietary nutrient intake in Chinese pregnant women, a … [+3970 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "SARS-CoV-2 omicron (B.1.1.529)-related COVID-19 sequelae in vaccinated and unvaccinated patients with cancer: results from the OnCovid registry - The Lancet", "description": "Unvaccinated patients with cancer remain highly vulnerable to COVID-19 sequelae irrespective\nof viral strain. This study confirms the role of previous SARS-CoV-2 immunisation\nas an effective measure to protect patients from COVID-19 sequelae, disruption of\nth…", "url": "https://www.thelancet.com/journals/lanonc/article/PIIS1470-2045%2823%2900056-6/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/8c22ef79-a7b4-4c7c-bb60-d8063cc4e5f0/gr1.jpg", "publishedAt": "2023-03-07T23:38:59Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Aarp.org"}, "author": "Kim Painter", "title": "7 Foods That Get a Bad Rap but Are Actually Healthy - AARP", "description": "Are avocados good for you? Do eggs raise cholesterol levels? The answers suggest that these foods — and five other yummy options — get an unfair bad rap.", "url": "https://www.aarp.org/health/healthy-living/info-2023/foods-that-get-an-unfair-bad-rap.html", "urlToImage": "https://cdn.aarp.net/content/dam/aarp/health/healthy-living/2023/03/1140-friedeggspinkbackground.jpg", "publishedAt": "2023-03-07T22:51:25Z", "content": "In addition to healthy unsaturated fats, avocados are surprisingly rich in fiber, Blatner says: Avocados are so smooth and creamy, she says, but they can have 14 grams of fiber. Even half an avocado … [+8825 chars]"}, {"source": {"id": null, "name": "Yalemedicine.org"}, "author": null, "title": "How Robotic Bronchoscopy Helps Diagnose Lung Cancer > News - Yale Medicine", "description": "Yale Medicine interventional pulmonologists discuss robotic bronchoscopy for lung cancer screening.", "url": "https://www.yalemedicine.org/news/robotic-bronchoscopy", "urlToImage": "https://ysm-res.cloudinary.com/image/upload/v1/yms/prod/811c6804-80e0-4b33-bcbe-237f8d822084", "publishedAt": "2023-03-07T21:50:46Z", "content": "When caught early, lung cancer can often be successfully treated. The problem, however, is that there typically arent any symptoms in its early stages. That makes the early detection of lung cancer a… [+2238 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Indian scientists identify better drug treatment for severe scrub typhus - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "NEW DELHI, Mar 6: A team of Indian scientists has identified a significantly more effective treatment for severe scrub typhus – a life-threatening bacterial infection that kills thousands of people every year. The study, published in the New England Journal o…", "url": "https://www.dailyexcelsior.com/indian-scientists-identify-better-drug-treatment-for-severe-scrub-typhus/", "urlToImage": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2023/03/india-scienceet.jpg", "publishedAt": "2023-03-07T21:40:40Z", "content": "NEW DELHI, Mar 6:A team of Indian scientists has identified a significantly more effective treatment for severe scrub typhus – a life-threatening bacterial infection that kills thousands of people ev… [+3525 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "Dr Showkat Shah", "title": "WHAT IS HEART ATTACK? - Greater Kashmir", "description": "Heart attack, also called myocardial infarction,happens when a part of the heart muscle does not get enough blood. (Blood flow to heart is blocked or cut off).", "url": "https://www.greaterkashmir.com/todays-paper/op-ed/what-is-heart-attack", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-05%2F89f348bd-98e7-4dec-889f-0bf9da7e1081%2FHeart_Attack.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-03-07T20:08:33Z", "content": "Symptoms Of heart attack?\r\nThe major symptoms of a heart attack are:Chest pain or discomfort in the center or left side of the chest that last for the more than a few minutes or that goes away and co… [+803 chars]"}, {"source": {"id": null, "name": "B2bchief.com"}, "author": "B2BChief", "title": "When and how to consume protein supplements to maximize their benefits ? | Health - B2BCHIEF", "description": "Are you getting enough protein? From fitness enthusiasts to health-conscious individuals, protein has become a buzzword in the world of nutrition. Protein is an essential macronutrient that plays a vital role in building and repairing muscle tissues, supporti…", "url": "https://b2bchief.com/when-and-how-to-consume-protein-supplements-to-maximize-their-benefits-health/", "urlToImage": null, "publishedAt": "2023-03-07T18:04:00Z", "content": "Are you getting enough protein? From fitness enthusiasts to health-conscious individuals, protein has become a buzzword in the world of nutrition. Protein is an essential macronutrient that plays a v… [+3431 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Jigar Hindocha", "title": "As mercury drops, Pune doctors caution against more cough, cold cases - Hindustan Times", "description": "Existing cases of cough and fever are being attributed to the influenza A subtype H3N2 by scientists from the Indian Council of Medical Research (ICMR)", "url": "https://www.hindustantimes.com/cities/pune-news/as-mercury-drops-pune-doctors-caution-against-more-cough-cold-cases-101678210813847.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/07/1600x900/As-rain-accompanied-by-thunder-in-many-parts-of-th_1678210802773.jpg", "publishedAt": "2023-03-07T17:40:13Z", "content": "As rain accompanied by thunder in many parts of the city on Monday and Tuesday led to a drastic fall in mercury levels with the India Meteorological Department (IMD) Pune recording a minimum temperat… [+3360 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Perception of time linked to heartbeat: Study - ThePrint", "description": "Washington [US], March 7 (ANI): How long does the present last? The answer, according to Cornell University researchers in a recent study, is dependent on your heart. They discovered that our perception of time is not continuous and can extend or decrease wit…", "url": "https://theprint.in/health/perception-of-time-linked-to-heartbeat-study/1426326/", "urlToImage": null, "publishedAt": "2023-03-07T17:14:47Z", "content": "Washington [US], March 7 (ANI): How long does the present last? The answer, according to Cornell University researchers in a recent study, is dependent on your heart. They discovered that our percept… [+3307 chars]"}, {"source": {"id": null, "name": "Indtoday.com"}, "author": "News Desk", "title": "Viral Fever Coupled With Cough, Cold, And Body Pains Doubled In City Hospitals - Ind Today News", "description": "Hyderabad, Mar 7 (Maxim News): The outpatient (OP) numbers have almost doubled in the city hospitals during the last ten days because of the viral fevers coupled with cough and cold and body pains, even as the doctors attribute this to the change in weather c…", "url": "https://indtoday.com/viral-fever-coupled-with-cough-cold-and-body-pains-doubled-in-city-hospitals/", "urlToImage": "https://indtoday.com/wp-content/uploads/2023/03/fever-chk.jpg", "publishedAt": "2023-03-07T15:13:38Z", "content": "Hyderabad, Mar 7 (Maxim News): The outpatient (OP) numbers have almost doubled in the city hospitals during the last ten days because of the viral fever coupled with cough and cold and body pains, ev… [+3996 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: Diet plan, dos and don'ts for diabetics to prevent sugar spikes - Hindustan Times", "description": "With diabetes, it's important to chalk out a diet plan that includes all your meals from breakfast, lunch, dinner and the snacks in between. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-diet-plan-dos-and-don-ts-for-diabetics-to-prevent-sugar-spikes-101678199140107.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/07/1600x900/diabetes_1678199178377_1678199178507_1678199178507.jpg", "publishedAt": "2023-03-07T14:32:22Z", "content": "What you are eating with diabetes can greatly impact your chances of long-term complications related to this metabolic disorder. Uncontrolled sugar levels can wreak havoc with many body processes and… [+3212 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sanchari Ghosh", "title": "Finally, there's hope for long COVID treatment. Here's what it is | Mint - Mint", "description": "Ensitrelvir can shorten symptoms of mild to moderate COVID-19 by about a day", "url": "https://www.livemint.com/news/world/finally-there-s-hope-for-long-covid-treatment-here-s-what-it-is-11678192649508.html", "urlToImage": "https://images.livemint.com/img/2023/03/07/600x338/RT-PCR_1644552122552_1678193237773_1678193237773.jpg", "publishedAt": "2023-03-07T13:30:17Z", "content": "Ensitrelvir, a new antiviral drug, has been shown to shorten symptoms of mild to moderate COVID-19 and moreover, it has the potential to prevent long COVID, study has shown. Here's all you need to kn… [+2696 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Infra", "title": "Green copper is a key metal for EV's and Renewable Energy, says Dr B. Sengupta, Former Member Secretary of C.. - ETInfra.com", "description": "It is a metal with unique properties -- durable, malleable, and corrosion-resistant, and a metal with very high demand, writes Dr B. Sengupta, Former Member Secretary, Central Pollution Control Board.", "url": "https://infra.economictimes.indiatimes.com/news/urban-transportation/green-copper-is-a-key-metal-for-evs-and-renewable-energy-power-says-dr-b-sengupta-former-member-secretary-central-pollution-control-board/98479258", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-98479258,imgsize-155806,width-1200,height-628,overlay-etinfra/green-copper-is-a-key-metal-for-ev-s-and-renewable-energy-says-dr-b-sengupta-former-member-secretary-of-central-pollution-control-board.jpg", "publishedAt": "2023-03-07T12:28:00Z", "content": "Copper is a vital metal that plays a critical role in sectors that drive Indias economy, from power generation and transmission to transportation, construction to electronics. It is a metal with uniq… [+5204 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/alexandra-engler", "title": "The Connection Between The Skin Microbiome & Collagen Production | mindbodygreen - mindbodygreen", "description": "To say that the microbiome has a profound effect on the appearance and health of the skin would be an understatement. Here, how it may affect your collagen.", "url": "https://www.mindbodygreen.com/articles/the-connection-between-the-skin-microbiome-and-collagen-production", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/g33r3eu8ukgjv16s7.jpg", "publishedAt": "2023-03-07T11:29:58Z", "content": "While collagen loss is one of the biggest contributing factors to aging skin, it's certainly not the only one. A lot of factors contribute to the appearance of aging skin. And as a growing body of ev… [+1468 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "CAPED and Roche Diagnostics India unveil Cervical Cancer screening programme on International Women's Day - BSI bureau", "description": "Reaching out to 10,000 women across 5 major  metros to sensitise them about cervical cancer screening and HPV DNA testing", "url": "https://www.biospectrumindia.com/news/92/22752/caped-and-roche-diagnostics-india-unveil-cervical-cancer-screening-programme-on-international-womens-day-.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/cervical_cancer_01_1-22752.png", "publishedAt": "2023-03-07T10:44:43Z", "content": "Reaching out to 10,000 women across 5 major metros to sensitise them about cervical cancer screening and HPV DNA testing\r\nRoche Diagnostics India has announced the signing of a Memorandum of Understa… [+1697 chars]"}, {"source": {"id": null, "name": "Finnoexpert.com"}, "author": null, "title": "Long Covid Patients More Likely to Have Gastrointestinal Problems, Study Finds - Finnoexpert", "description": "The patients became infected during the pandemic’s early waves, testing positive for the coronavirus between March 1, 2020, and Jan. 15, 2021, the", "url": "https://finnoexpert.com/2023/03/07/long-covid-patients-more-likely-to-have-gastrointestinal-problems-study-finds/", "urlToImage": "https://static01.nyt.com/images/2023/03/07/multimedia/07LongCovid1-bhpm/07LongCovid1-bhpm-facebookJumbo.jpg", "publishedAt": "2023-03-07T10:00:27Z", "content": "The patients became infected during the pandemics early waves, testing positive for the coronavirus between March 1, 2020, and Jan. 15, 2021, the overwhelming majority before vaccines were available.… [+2340 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Silicon, gold and copper could help fight COVID-19: Study - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/silicon-gold-and-copper-could-help-fight-covid-19-study/526846.html", "urlToImage": "", "publishedAt": "2023-03-07T09:58:37Z", "content": "Melbourne, Mar 7 (PTI) The spike proteins of the SARS-CoV-2 virus become trapped when they come in contact with silicon, gold and copper, according to a study which also found that electric fields ca… [+685 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Brutal Force Review 2023: Safe Or Not? Results & Reports Shared! - Deccan Herald", "description": "Are you interested in building muscle? You must have been familiar with the Brutal Force supplement. People who want to build their muscles are always looking for high-quality supplements to aid in their muscle-building journey. So, it's not a surprise that t…", "url": "https://www.deccanherald.com/brandspot/pr-spot/brutal-force-review-2023-safe-or-not-results-reports-shared-1197985.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p10-1197985-1678181418.png", "publishedAt": "2023-03-07T09:30:18Z", "content": "Are you interested in building muscle? You must have been familiar with the Brutal Force supplement. People who want to build their muscles are always looking for high-quality supplements to aid in t… [+26888 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Medi Cramp Reviews 2023: Important Alert, User Reviews & Results! - Deccan Herald", "description": "Muscle cramps can be painful and cause unnecessary discomfort to you. Although you may think that it's due to the lack of oxygen in your cells, it could actually require magnesium. The market is filled with a variety of magnesium supplements, however it's dif…", "url": "https://www.deccanherald.com/brandspot/pr-spot/medi-cramp-reviews-2023-important-alert-user-reviews-results-1197973.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p8-1197973-1678180310.png", "publishedAt": "2023-03-07T09:11:50Z", "content": "Muscle cramps can be painful and cause unnecessary discomfort to you. Although you may think that it's due to the lack of oxygen in your cells, it could actually require magnesium.\r\nThe market is fil… [+30386 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Vyvanse Alternative Over The Counter - Best Natural Vyvanse Alternatives For ADHD - Deccan Herald", "description": "Vyvanse is a prescribed medication used to treat ADHD However, it can be costly and some individuals don't like the idea of using an anti-drug class medication or stimulant drugs. This article outlines some of the top organic Vyvanse alternative for those who…", "url": "https://www.deccanherald.com/brandspot/pr-spot/vyvanse-alternative-over-the-counter-best-natural-vyvanse-alternatives-for-adhd-1197969.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1197969-1678180002.png", "publishedAt": "2023-03-07T09:06:42Z", "content": "Vyvanse is a prescribed medication used to treat ADHD However, it can be costly and some individuals don't like the idea of using an anti-drug class medication or stimulant drugs.\r\nThis article outli… [+24711 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Anabolic Steroids Australia - Buy Legal Steroids In Australia For 2023 - Deccan Herald", "description": "In Australia the usage of anabolic steroids is strictly controlled and purchasing steroids with no prescriptions is not legal. Click Here To Buy legal steroids Anabolic steroids are chemical chemicals that simulate their effects on testosterone within the bod…", "url": "https://www.deccanherald.com/brandspot/pr-spot/anabolic-steroids-australia-buy-legal-steroids-in-australia-for-2023-1197963.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1197963-1678179206.png", "publishedAt": "2023-03-07T08:53:26Z", "content": "In Australia the usage of anabolic steroids is strictly controlled and purchasing steroids with no prescriptions is not legal. Click Here To Buy legal steroids\r\nAnabolic steroids are chemical chemica… [+18397 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "What Should Be The Percentage Of Muscle Mass? - Nation World News", "description": "Muscle mass is an important part of the human body, and a person's muscle mass depends on several factors. Gender, age, height, eating habits and level of", "url": "https://nationworldnews.com/what-should-be-the-percentage-of-muscle-mass/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/03/What-should-be-the-percentage-of-muscle-mass.png", "publishedAt": "2023-03-07T01:32:34Z", "content": "Muscle mass is an important part of the human body, and a person’s muscle mass depends on several factors. Gender, age, height, eating habits and level of physical activity are some of the factors th… [+5650 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Vrinda Mundara", "title": "Three harmful, unhealthy food items that can trigger stress in your body - Asianet Newsable ", "description": "While sometimes we tend to eat a lot, at times we eat nothing at all. These are three harmful and unhealthy food items that can trigger stress in your body.", "url": "https://newsable.asianetnews.com/gallery/lifestyle/three-harmful-unhealthy-food-items-that-can-trigger-stress-in-your-body-vma-rr3n4r", "urlToImage": "https://static-ai.asianetnews.com/images/01gtve70jav3ctswqaz7vc93x3/whatsapp-image-2023-03-06-at-17-41-42_1200x630xt.jpg", "publishedAt": "2023-03-07T01:30:35Z", "content": "While sometimes we tend to eat a lot, at times we eat nothing at all. These are three harmful and unhealthy food items that can trigger stress in your body.\r\nImage: Getty Images\r\nWhat you eat can aff… [+1841 chars]"}]}