{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "40% asymptomatic people were found with calcified plaque in heart: Report - News9 LIVE", "description": "Heart Calcium score uses low-dose CT scan to take cross-sections of the blood vessels of the heart...", "url": "https://www.news9live.com/health/health-conditions/40-asymptomatic-people-were-found-with-calcified-plaque-in-heart-report-198350", "urlToImage": "https://media.news9live.com/h-upload/2022/09/26/562625-4972658266185acaf2a96b.jpg", "publishedAt": "2022-09-26T08:04:52Z", "content": "Out of the total 4,000 asymptomatic people who underwent screening for heart calcium score in the last 12 months at NURA, about 1 in 5 (20 per cent) were found a build-up of calcified plaque in their… [+3263 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Scientists Saved Cancer Patient's Life By Using Modified Virus To Kill Tumour - Indiatimes.com", "description": "In an astonishing development, scientists recently saved the life of a cancer patient by deploying a virus. Yep, scientists turned a virus against cancer to kill it.Scientists at the Institute of Cancer Research and the Royal Marsden NHS Foundation Trust repo…", "url": "https://www.indiatimes.com/technology/science-and-future/cancer-patients-life-saved-by-using-modified-virus-to-kill-tumour-580549.html", "urlToImage": "https://im.indiatimes.in/content/2022/Sep/Social-image-9_63315bbb5c8c1.jpg", "publishedAt": "2022-09-26T07:55:06Z", "content": "In an astonishing development, scientists recently saved the life of a cancer patient by deploying a virus. Yep, scientists turned a virus against cancer to kill it.\r\nScientists at the Institute of C… [+2508 chars]"}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Reporter", "title": "Epidemic Hospital With 600 Beds To Be Opened In Pune Soon - Punekar News", "description": "Punekarnews.in is the first and only English language hyper-local news portal of Pune and Pimpri Chinchwad. It was launched in July 2014.", "url": "https://www.punekarnews.in/epidemic-hospital-with-600-beds-to-be-opened-in-pune-soon/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2020/10/lep.jpg", "publishedAt": "2022-09-26T07:32:12Z", "content": "Pune, 26th September 2022: After Corona, the importance of research on epidemic diseases has been highlighted all over the world. The highest number of deaths due to Corona has been reported in the s… [+1859 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Provacyl Review 2022: Is it Legit Andropause Treatment or SCAM Male Menopause Formula - mid-day.com", "description": "Provacyl helps with HGH deficiencies-related symptoms, and it gives you back some precious years of your life, meaning the youthful ones. Growth hormone boosters in 2022 have one thing in common, and that is a natural formula.", "url": "http://www.mid-day.com/brand-media/article/provacyl-review-2022-is-it-legit-andropause-treatment-or-scam-male-menopause-23247594", "urlToImage": "https://images.mid-day.com/images/images/2022/sep/Provacl_d.jpg", "publishedAt": "2022-09-26T07:31:00Z", "content": "Provacyl helps with HGH deficiencies-related symptoms, and it gives you back some precious years of your life, meaning the youthful ones. Growth hormone boosters in 2022 have one thing in common, and… [+11119 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "PTI", "title": "New COVID-like virus found in bats, could infect humans, resist vaccines: Study - Zee Business", "description": "A team led by researchers at Washington State University (WSU), US, found spike proteins from the bat virus, named Khosta-2, can infect human cells and is resistant to both the antibody therapies and blood serum from people vaccinated forS-CoV-2.", "url": "https://www.zeebiz.com/india/news-new-covid-like-virus-found-in-bats-could-infect-humans-resist-vaccines-study-200486", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2022/09/26/202107-covid-vaccine-2-reuters.jpg", "publishedAt": "2022-09-26T07:21:21Z", "content": "A newS-CoV-2-like virus discovered in Russian bats is capable of infecting humans, and is resistant to current vaccines against COVID-19, a study has found.\r\nA team led by researchers at Washington S… [+3250 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Confusion and Hallucination in a Geriatric Patient. Pitfalls of a Rare | CIA - Dove Medical Press", "description": "Confusion and Hallucination in a Geriatric Patient. Pitfalls of a Rare Differential: Case Report of an Anti-LGI1-Encephalitis", "url": "https://www.dovepress.com/confusion-and-hallucination-in-a-geriatric-patient-pitfalls-of-a-rare--peer-reviewed-fulltext-article-CIA", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-09-26T07:16:35Z", "content": "Background\r\nAdmission of geriatric patients to the emergency department (ED) due to acute deterioration has increased by about 46% within a decade.1 Acute illness or injuries can trigger cognitive im… [+32581 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Temasek invests $85 M in Molbio Diagnostics to accelerate work on newer technologies - BSI bureau", "description": "Addressing the critical need gaps in diagnosis globally", "url": "https://www.biospectrumindia.com/news/23/22010/temasek-invests-85-m-in-molbio-diagnostics-to-accelerate-work-on-newer-technologies.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/6-22010.png", "publishedAt": "2022-09-26T06:57:03Z", "content": "Goa-based Molbio Diagnostics, which provides innovative solutions for universal access to high-quality healthcare, has announced that Singapore-based Temasek has invested $85 million in the company. … [+1447 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Warning signs that you might be having a silent heart attack - Times Now", "description": "Even though a silent attack lacks the intensity of a usual heart attack, the symptoms are so mild that they are often mistaken for regular discomfort or other less serious problems. And if left untreated or without medical attention, it rapidly increases the …", "url": "https://www.timesnownews.com/health/warning-signs-that-you-might-be-having-a-silent-heart-attack-article-94448544", "urlToImage": "https://static.tnn.in/thumb/msid-94448544,imgsize-100,width-1280,height-720,resizemode-75/94448544.jpg", "publishedAt": "2022-09-26T06:54:00Z", "content": "Like any other heart attack, a silent attack also cuts off and stops the supply of blood to the heart, causing it to stall. If plaque, consisting of fat, and cholesterol builds in and around the arte… [+52 chars]"}, {"source": {"id": null, "name": "openPR"}, "author": "Eelhoe Skin Tag Remover", "title": "Eelhoe Skin Tag Remover (Wart Remover Ointment) Hoax or Legitimate? - openPR", "description": "Skin tags and ticks are often thought to be harmless but in fact they may indicate a more serious problem Skin tags are small fleshy growths that usually hang from the skin while moles are dark spots on the skin ...", "url": "https://www.openpr.com/news/2748061/eelhoe-skin-tag-remover-wart-remover-ointment-hoax-or", "urlToImage": "https://cdn.openpr.com/V/9/V924460568_g.jpg", "publishedAt": "2022-09-26T06:51:37Z", "content": "Skin tags and ticks are often thought to be harmless, but in fact, they may indicate a more serious problem. Skin tags are small fleshy growths that usually hang from the skin, while moles are dark s… [+6103 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Sleep deprivation can lead to diabetes and heart diseases: Study - News9 LIVE", "description": "A chronic loss of sleep over a longer period can cause deadly inflammation.", "url": "https://www.news9live.com/health/health-conditions/sleep-deprivation-can-lead-to-diabetes-and-heart-diseases-study-198322", "urlToImage": "https://media.news9live.com/h-upload/2022/09/26/562551-sleep.jpg", "publishedAt": "2022-09-26T06:38:59Z", "content": "Not sleeping properly and lack of sleep is a common problem around the globe which is very commonly ignored and not given the attention that it deserves. Good sleep is as vital as food, yet one in fi… [+3659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Weekend warrior workouts: Here's how to make the most of them - The Indian Express", "description": "Each week try to introduce some new exercises or swap the exercises each week – such as using different variations of a squat (such as barbell squats one week then sumo squats the next)", "url": "https://indianexpress.com/article/lifestyle/fitness/weekend-warrior-workouts-heres-how-to-make-the-most-of-them-8168385/", "urlToImage": "https://images.indianexpress.com/2022/09/cover-16.jpg", "publishedAt": "2022-09-26T06:30:18Z", "content": "Most of us know we need to exercise more. Yet finding the time to work out is often easier said than done. For most, the only time we have to exercise is on the weekends.The good news is that so-call… [+5518 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Manya Singh", "title": "Weight Loss: 10 Ayurveda-Backed Herbs That Can Help In Weight-Loss - NDTV Doctor", "description": "Weight Loss: In this article, we discuss various beneficial herbs that have been proven to aid in weight loss.", "url": "https://doctor.ndtv.com/living-healthy/weight-loss-10-ayurveda-backed-herbs-that-can-help-in-weight-loss-3372273", "urlToImage": "https://c.ndtvimg.com/2018-11/ljoc8qjo_ginger-tea_625x300_09_November_18.jpg", "publishedAt": "2022-09-26T05:44:24Z", "content": "Long-term health risks associated with excess body weight include heart disease, diabetes, kidney issues, and others. Gaining weight can have negative effects on a person's mental health and, regrett… [+4200 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "ANI", "title": "Research finds that viruses may have 'eyes and ears' on us - Telangana Today", "description": "A virus's ability to sense its environment, including elements produced by its host, adds \"another layer of complexity to the viral-host interaction,\" says Ivan Erill, professor of biological sciences and senior author on the new paper.", "url": "https://telanganatoday.com/research-finds-that-viruses-may-have-eyes-and-ears-on-us", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2022/09/Research-finds-that-viruses-may-have-eyes-and-ears-on-us.jpg", "publishedAt": "2022-09-26T05:30:34Z", "content": null}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "Mizoram concerned over rapid surge in dengue cases - Northeast Now", "description": "The Mizoram health department is concerned over the rapid increase in dengue cases in the state, a health official said on Sunday.", "url": "http://nenow.in/north-east-news/mizoram/mizoram-concerned-over-rapid-surge-in-dengue-cases.html", "urlToImage": "https://i0.wp.com/nenow.in/wp-content/uploads/2019/09/Malaria.jpg?fit=1030%2C603&ssl=1", "publishedAt": "2022-09-26T05:03:00Z", "content": "AIZAWL: The Mizoram health department is concerned over the rapid increase in dengue cases in the state, a health official said on Sunday.\r\nHe said that 84 dengue cases were detected in August this y… [+2150 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Unlocked: The best breakfasts for diabetics that balance blood sugar levels - Times Now", "description": "Living with diabetes needs you to check your vitals consistently and for that a good, balanced and healthy diet is very important. Read on to know what kind of breakfast – the most important meal of the day a diabetic should have to keep the blood sugar level…", "url": "https://www.timesnownews.com/health/unlocked-the-best-breakfasts-for-diabetics-that-balance-blood-sugar-levels-article-94444767", "urlToImage": "https://static.tnn.in/thumb/msid-94444767,imgsize-100,width-1280,height-720,resizemode-75/94444767.jpg", "publishedAt": "2022-09-26T04:15:49Z", "content": "Doctors say those suffering from diabetes need to manage their carbs, protein, and fibre levels, along with adding a minimum quantity of healthy fats while considering breakfast options."}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Four mental health issues that raise the risk of self-harm. | DH Latest News, DH NEWS, Health & Fitness, Latest News, Diseases & Remedies, NEWS, Life Style, Health , Four mental health issues that raise the risk of self-harm., Borderline personality, - East Coast Daily (English)", "description": "The following four mental health issues might cause someone to engage in self-harm behaviour: Borderline personality A mental condition called borderline personality disorder has a major negative impa", "url": "https://www.eastcoastdaily.in/2022/09/26/four-mental-health-issues-that-raise-the-risk-of-self-harm.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/09/5d03519a2100003711f27c68.jpeg", "publishedAt": "2022-09-26T04:07:00Z", "content": "The following four mental health issues might cause someone to engage in self-harm behaviour:\r\nBorderline personality\r\nA mental condition called borderline personality disorder has a major negative i… [+2570 chars]"}, {"source": {"id": null, "name": "Mims.com"}, "author": "Stephen Padilla", "title": "Lifestyle change lowers T2D risk in women with gestational diabetes mellitus history | Latest news for Doctors, Nurses and Pharmacists | Endocrinology - MIMS", "description": "Each additional optimal modifiable factor among women with a history of gestational diabetes mellitus (GDM) significantly contributes to a reduction i...", "url": "https://specialty.mims.com/topic/lifestyle-change-lowers-t2d-risk-in-women-with-gestational-diabetes-mellitus-history", "urlToImage": "https://pubmiddleware.mims.com/resource/image/9F9EBDD9-79CD-4BE1-B568-A7BB011A1A0F/OriginalThumbnail/THUMBNAIL_shutterstock_549204091.jpg", "publishedAt": "2022-09-26T04:00:59Z", "content": "Each additional optimal modifiable factor among women with a history of \r\ngestational diabetes mellitus (GDM) significantly contributes to a reduction in type 2\r\ndiabetes (T2D) risk, suggests a recen… [+2875 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Deepika Rathod", "title": "Fixing fatigue: How do we improve these symptoms? - The New Indian Express", "description": "We usually suggest that when you work out, your body releases feel-good hormones and the mild symptoms of low energy will come under control but with post-COVID fatigue, workouts make it worse.", "url": "https://www.newindianexpress.com/cities/delhi/2022/sep/26/fixing-fatiguehow-do-we-improve-these-symptoms-2501986.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/9/26/w600X390/Fixing_fatigue.jpg", "publishedAt": "2022-09-26T03:55:00Z", "content": "Of late, many people have been reaching out to me with this common problemlow energy levels and extreme fatigue that has started affecting them post a COVID diagnosis. We usually suggest that when yo… [+5787 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "WHO South-East Asia Region polio-free, accelerated efforts needed in view of increased risks: experts - Afghanistan - ReliefWeb", "description": "News and Press Release in English on Afghanistan and 3 other countries about Health and Epidemic; published on 23 Sep 2022 by WHO", "url": "https://reliefweb.int/report/afghanistan/who-south-east-asia-region-polio-free-accelerated-efforts-needed-view-increased-risks-experts", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/disaster-type/EP.png", "publishedAt": "2022-09-26T03:54:34Z", "content": "The WHO South-East Asia Region sustained its polio-free status despite disruptions caused by COVID-19 pandemic but needs to scale-up measures in view of the persisting and increased risks of polio gl… [+3272 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Potential Benefits of Sodium-Glucose Transporter-2 Inhibitors in the Symptomatic and Functional Status of Patients With Heart Failure: A Systematic Review and Meta-Analysis - Cureus", "description": "This review evaluates the potential benefits of sodium-glucose transporter-2 (SGLT-2) inhibitors on symptom burden/health-related quality of life (HRQoL), functional improvement, hospitalization for heart failure (HHF), cardiovascular mortality (CVM), and all…", "url": "https://www.cureus.com/articles/107852-potential-benefits-of-sodium-glucose-transporter-2-inhibitors-in-the-symptomatic-and-functional-status-of-patients-with-heart-failure-a-systematic-review-and-meta-analysis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/419488/article_river_c0531f8015cf11ed9c0605a015925d95-PRISMA-Flow-Chart.png", "publishedAt": "2022-09-26T03:06:06Z", "content": "Most cardiac pathologies, and many that do not directly involve the heart, e.g., diabetes mellitus or obesity, may result in heart failure (HF) as the end-stage phenotypic expression of the primary d… [+31658 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Health benefits of eating overnight soaked figs | DH NEWS, DH Latest News, Health & Fitness, Latest News, NEWS, Life Style, Food, Health , health and fitness, health benefits of eating overnight soaked figs, health benefits of eating figs, soaked figsz over - East Coast Daily (English)", "description": "Figs that have been dried have a leather-like texture and a sweet flavour. To eat, these are soft and chewy. Figs have no cholesterol or fat. Additionally, there is a balanced ratio of sugar, carbohyd", "url": "https://www.eastcoastdaily.in/2022/09/26/health-benefits-of-eating-overnight-soaked-figs.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/09/img-20220926-wa0004.jpg", "publishedAt": "2022-09-26T03:06:00Z", "content": "Figs that have been dried have a leather-like texture and a sweet flavour. To eat, these are soft and chewy. Figs have no cholesterol or fat.\r\nAdditionally, there is a balanced ratio of sugar, carboh… [+2149 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Shweta Tripathi", "title": "Virus alert, which one is it? - DTNEXT", "description": "Similarity in symptoms between COVID-19, influenza and dengue adds to people’s confusion, as it delays treatment and causes fatalities, especially among those in the high-risk category. Here’s a cheat sheet by Shweta Tripathi", "url": "https://www.dtnext.in/city/2022/09/26/virus-alert-which-one-is-it", "urlToImage": "https://gumlet.assettype.com/dtnext%2F2022-09%2F96b37ccd-0383-4658-84c9-8e7d6ed3c2c0%2Fvirus.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-09-26T02:28:33Z", "content": "CHENNAI: About a month ago, it looked like COVID-19 was inching its way out, albeit reluctantly, when the virus changed its mind and stayed on. Around the same time, dengue crossed over and latched o… [+3914 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Still Short of Breath? Here Are 3 Ways COVID-19 Can Damage Lungs Long Term - ScienceAlert", "description": "\"I just can't do what I used to anymore.\" As pulmonologists and critical care doctors treating patients with lung disease, we have heard many of our patients recovering from COVID-19 tell us this even months after their initial diagnosis.", "url": "https://www.sciencealert.com/still-short-of-breath-here-are-3-ways-covid-19-can-damage-lungs-long-term", "urlToImage": "https://www.sciencealert.com/images/2022/09/CTScanLungRendering.jpg", "publishedAt": "2022-09-26T01:13:46Z", "content": "\"I just can't do what I used to anymore.\"\r\nAs pulmonologists andcritical care doctors treating patients with lung disease, we have heard many of our patients recovering from COVID-19 tell us this eve… [+6466 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Covid-19 Is Linked With Increased Risk Of Type 1 Diabetes In Children And Adolescents: Study - ABP Live", "description": "A total of 4,24,354 children tested positive for Covid-19, over the study period. Among the 1.2 million children in Norway, 990 individuals were diagnosed with new-onset cases of type 1 diabetes.", "url": "https://news.abplive.com/science/covid-19-is-linked-with-increased-risk-of-type-1-diabetes-in-children-and-adolescents-study-1555273", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/09/25/906c77f1cb9d2c49a3cd3fa62d4ab8271664122564756324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-09-25T16:58:14Z", "content": "Covid-19 is linked with an increased risk of new-onset type 1 diabetes in children and adolescents, a new study reports. The research was presented at this year's European Association for the Study o… [+5568 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Maintenance of oral health linked to reduction of risk of infective endocarditis - Medical Dialogues", "description": "Maintenance of oral health is more effective in reducing the  risk of infective endocarditis than...", "url": "https://medicaldialogues.in/dentistry/news/maintenance-of-oral-health-linked-to-reduction-of-risk-of-infective-endocarditis-99641", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/21/185972-download-43.jpg", "publishedAt": "2022-09-25T16:38:17Z", "content": "Maintenance of oral health is more effective in reducing the risk of infective endocarditis than prophylactic antibiotics for dental procedures suggests a recent study published in the International … [+2069 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Tobacco use may not alter histology of buccal mucosa harvested for urethroplasty: Study - Medical Dialogues", "description": "Syracuse,  NY: The researchers in a recent study published in the journal Urology did  not find...", "url": "https://medicaldialogues.in/urology/news/tobacco-use-may-not-alter-histology-of-buccal-mucosa-harvested-for-urethroplasty-study-99555", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/19/181241-seized-tobacco.jpg", "publishedAt": "2022-09-25T16:30:52Z", "content": "Syracuse, NY: The researchers in a recent study published in the journal Urology did not find clear or clinically significant histologic or immunohistochemical (IHC) differences in buccal mucosa of p… [+2490 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Preoperative inflammatory markers prognostic indicators after liver resection - Medical Dialogues", "description": "BRAZIL: In western patients who have undergone liver resection for tumors, preoperative inflammatory ...", "url": "https://medicaldialogues.in/gastroenterology/news/preoperative-inflammatory-markers-prognostic-indicators-after-liver-resection-99553", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/05/182664-hepatocellular-carcinoma.jpg", "publishedAt": "2022-09-25T16:30:37Z", "content": "BRAZIL: In western patients who have undergone liver resection for tumors, preoperative inflammatory markers are beneficial for predicting long-term prognosis, states research published in BMC Surger… [+3520 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Paradox: Patients without diabetes have worse surgical outcomes than diabetics with same hyperglycemia... - Medical Dialogues", "description": "USA: The researchers from the US, in a recent study published in JAMA Surgery, have provided insight ...", "url": "https://medicaldialogues.in/surgery/news/paradox-patients-without-diabetes-have-worse-surgical-outcomes-than-diabetics-with-same-hyperglycemia-levels-jama-99551", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/16/185739-hyperglycemia.jpg", "publishedAt": "2022-09-25T16:30:36Z", "content": "USA: The researchers from the US, in a recent study published in JAMA Surgery, have provided insight into the paradoxical association between Hyperglycemia and surgical complications in diabetic and … [+3429 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Anti-TNF therapy with surgery effectively heals perianal fistulas in Crohn's disease patients: Lancet - Medical Dialogues", "description": "Netherlands: A new study published in The Lancet Gastroenterology & Hepatology found that short-term ...", "url": "https://medicaldialogues.in/surgery/news/anti-tnf-therapy-with-surgery-effectively-heals-perianal-fistulas-in-crohns-disease-patients-lancet-99637", "urlToImage": "https://medicaldialogues.in/h-upload/2022/04/02/173408-crohns-disease.jpg", "publishedAt": "2022-09-25T16:30:14Z", "content": "Netherlands: A new study published in The Lancet Gastroenterology &amp; Hepatology found that short-term anti-TNF medication coupled with surgical closure in patients with Crohn's perianal fistulas r… [+3119 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Investigating factors behind consciousness issues - ThePrint", "description": "Liege [Belgium], September 25 (ANI): A Human Brain Project (HBP) study headed by researchers at the University of Liege in Liege, Belgium, looked at fresh ways that might help patients with serious brain injury or in a coma distinguish between two different n…", "url": "https://theprint.in/health/investigating-factors-behind-consciousness-issues/1142818/", "urlToImage": null, "publishedAt": "2022-09-25T16:17:27Z", "content": "Liege [Belgium], September 25 (ANI): A Human Brain Project (HBP) study headed by researchers at the University of Liege in Liege, Belgium, looked at fresh ways that might help patients with serious b… [+4060 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "BP variability in patients with CAD undergoing PCI associated with poor outcomes - Medical Dialogues", "description": "Blood pressure variability (BPV) is independently associated with higher cardiovascular risks....", "url": "https://medicaldialogues.in/cardiology-ctvs/news/bp-variability-in-patients-with-cad-undergoing-pci-associated-with-poor-outcomes-99493", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/29/184480-percutaneous-coronary-intervention.jpg", "publishedAt": "2022-09-25T15:00:50Z", "content": "Blood pressure variability (BPV) is independently associated with higher cardiovascular risks. However, whether BPV is associated with poor outcomes for coronary artery disease (CAD) patients after p… [+2926 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Psychosocial stressors including abuse linked to Worse Menopausal Symptoms later - Medical Dialogues", "description": "BOSTON: According to research reported in Menopause, The Journal of the North American Menopause...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/psychosocial-stressors-including-abuse-linked-to-worse-menopausal-symptoms-later-99302", "urlToImage": "https://medicaldialogues.in/h-upload/2020/07/01/131120-menopause.jpg", "publishedAt": "2022-09-25T15:00:32Z", "content": "BOSTON: According to research reported in Menopause, The Journal of the North American Menopause Society, women who had a history of violence or economic instability were more likely to experience wo… [+3602 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Shreeja Bhattacharya", "title": "Want To Control Your Appetite? Here Is All That You Need To Know About It - News18", "description": "If you have already tried out these tips and they have not worked for you then it is highly advisable that you go see a professional addressing the same issue.", "url": "https://www.news18.com/news/lifestyle/want-to-control-your-appetite-here-is-all-that-you-need-to-know-about-it-6035509.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/untitled-design-23-2-166411383016x9.png", "publishedAt": "2022-09-25T14:00:00Z", "content": "With the festivities around, all of us are aware of the fact that our cravings might just be getting the better side of us- but have we ever told you about how normal it is to fall prey to your cravi… [+2644 chars]"}, {"source": {"id": null, "name": "Almayadeen.net"}, "author": "Al Mayadeen English", "title": "New cystic fibrosis treatment may end suffering for patients - Al Mayadeen English", "description": "Trikafta/Kaftrio pill treatments are the new breakthrough in cystic fibrosis treatments as it may restore the patients' abilities to live normally again without organ transplants.", "url": "https://english.almayadeen.net/news/health/new-cystic-fibrosis-treatment-may-end-suffering-for-patients", "urlToImage": "https://media-en.almayadeen.net/archive/image/2022/9/25/f8a4ab7c-0b1b-4202-9c84-d026b5d8d544.png?v=2&width=600", "publishedAt": "2022-09-25T13:40:25Z", "content": "Trikafta/Kaftrio pill treatments are the new breakthrough in cystic fibrosis treatments as it may restore the patients' abilities to live normally again without organ transplants.While waiting for a … [+3814 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Cases of obesity amongst children on the rise; tips to help your champ to be the fittest kid in town - Times Now", "description": "There are several factors that could be a reason for obesity and most of these are the lifestyle choices that one makes. From eating unhealthy food to not exercising regularly, the list is endless. Therefore, it is always important to make informed choices. M…", "url": "https://www.timesnownews.com/health/the-rising-number-of-obese-children-is-worrying-tips-that-could-help-prevent-the-condition-among-kids-article-94436354", "urlToImage": "https://static.tnn.in/thumb/msid-94436354,imgsize-100,width-1280,height-720,resizemode-75/94436354.jpg", "publishedAt": "2022-09-25T13:40:00Z", "content": "Sultan director Ali Abbas Zafar, wife Alicia blessed with baby girl; Anushka, Ranveer and more celebs react"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "WORLD ALZHEIMER'S DAY AWARENESS CAMPAIGN | MENAFN.COM - MENAFN.COM", "description": "(MENAFN - YahalaPR)  Hyatt Regency Oryx Doha, on Old Airport road, joined hand in hand with different institutions and people from all corn", "url": "https://menafn.com/1104921188/WORLD-ALZHEIMERS-DAY-AWARENESS-CAMPAIGN", "urlToImage": "https://menafn.com/updates/pr/2022-09/25/pr_9202_f9c272d8_image_story.jpg", "publishedAt": "2022-09-25T13:17:53Z", "content": "(MENAFN- YahalaPR) Hyatt Regency Oryx Doha, on Old Airport road, joined hand in hand with different institutions and people from all corners of the world to raise awareness on Dementia and Alzheimers… [+848 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akanksha Agnihotri", "title": "Diarrhea in children: From causes to symptoms, all that parents need to know - Hindustan Times", "description": "Frequent diarrhea in children can be worrisome for parents. From causes to symptoms, here is all that parents need to know to prevent diarrhea in kids. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diarrhea-in-children-from-causes-to-symptoms-all-that-parents-need-to-know-101664090658241.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/25/1600x900/istockphoto-1170585743-612x612_1664092520458_1664092532858_1664092532858.jpg", "publishedAt": "2022-09-25T11:15:18Z", "content": "Parents often get very concerned when a child gets sick. Diarrhea is a very common problem in children younger than age five. When children suddenly get loose, watery and frequent bowel movements, th… [+2229 chars]"}, {"source": {"id": null, "name": "Colbyechonews.com"}, "author": "cenadmin", "title": "Walnut Consumption Reduces Risk of Heart Disease According to Study – The Colby Echo News - The Colby Echo News", "description": "Walnut consumption may lower the risk of cardiovascular disease by reducing the concentration of inflammatory biomarkers in the blood. These biomarkers are important to the progression of atherosclero", "url": "https://colbyechonews.com/walnut-consumption-reduce-risk-of-heart-disease-according-to-study/", "urlToImage": null, "publishedAt": "2022-09-25T11:07:31Z", "content": "Walnut consumption may lower the risk of cardiovascular disease by reducing the concentration of inflammatory biomarkers in the blood. These biomarkers are important to the progression of atheroscler… [+3089 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Swarna Srikanth", "title": "PCOS awareness month: Is ‘No to motherhood’ a solution? Decode the health condition at various stages of - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/lifestyle/pcos-awareness-month-is-no-to-motherhood-a-solution-decode-the-health-condition-at-various-stages-of-womans-life", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-09/c10d8d11-88a6-406b-a24c-2adba5e14309/Hero_Image.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-09-25T11:03:07Z", "content": "The 'no-to-motherhood' attitude seems to be prevalent in some females now-a-days, who do respect the role of a parent but don't desire to be one. Repeated studies have traced facts that modern women,… [+4253 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "A Single Brain Molecule Can Label Memories As Positive Or Negative: Study - NDTV", "description": "One molecule controls whether the brain will encode memories as positive or negative.", "url": "https://www.ndtv.com/world-news/a-single-brain-molecule-can-label-memories-as-positive-or-negative-study-3376024", "urlToImage": "https://c.ndtvimg.com/2019-11/5bi11llg_brain-function_625x300_26_November_19.jpg", "publishedAt": "2022-09-25T10:44:19Z", "content": "The results indicate that the brain is predisposed to fear by default.\r\nScientists at the Salk Institute for Biological Studies in the United States have identified the brain molecule that causes emo… [+1795 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers suggest metals may help to fight fungal infections - Devdiscourse", "description": "More than one billion people get a fungal infection each year. Although most people are not affected by these infections, over 1.5 million people die as a result of them each year. While more and more fungal strains are being discovered that are resistant to …", "url": "https://www.devdiscourse.com/article/science-environment/2191003-researchers-suggest-metals-may-help-to-fight-fungal-infections", "urlToImage": "/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/25_09_2022_09_54_06_4617788.jpg?width=920&format=jpeg", "publishedAt": "2022-09-25T09:54:21Z", "content": "More than one billion people get a fungal infection each year. Although most people are not affected by these infections, over 1.5 million people die as a result of them each year. While more and mor… [+3586 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Increase in malaria infection linked to amphibian extinction? here's what study shows | Mint - Mint", "description": "The study emphasises on the significance of biodiversity to human health.", "url": "https://www.livemint.com/news/world/increase-in-malaria-infection-linked-to-amphibian-extinction-here-s-what-study-shows-11664096726733.html", "urlToImage": "https://images.livemint.com/img/2022/09/25/600x338/71baa7de-005a-11ec-a5c0-e2376e1e0c6b_1633574791161_1664098315072_1664098315072.jpg", "publishedAt": "2022-09-25T09:33:37Z", "content": "A new study published in the Journal Environmental Research Letter has linked an amphibian extinction in Costa Rica and Panama to an increase in malaria infections.  The study emphasises on the signi… [+3917 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "The cause of autoimmunity in patients with type 1 Diabetes: Research - Hindustan Times", "description": "Corkey believes that the characteristics that make individuals susceptible to autoimmune destruction could also apply to other autoimmune diseases such as toxic shock syndrome and possibly long COVID. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/the-cause-of-autoimmunity-in-patients-with-type-1-diabetes-research-101664096900876.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/25/1600x900/diabetes_care__ashwagandha_1663140947203_1664096956934_1664096956934.jpg", "publishedAt": "2022-09-25T09:21:37Z", "content": "Type 1 diabetes (T1D) is an autoimmune disease in which the pancreas makes little or no insulin. The details of the events that occur during autoimmune destruction of the pancreatic beta-cells have b… [+2105 chars]"}, {"source": {"id": null, "name": "Webindia123.com"}, "author": null, "title": "Study finds gut microbes consume plant sugars as food - Web India 123", "description": "The bacteria in our stomach are fed by a carbohydrate that is frequently found bound to plant proteins, according to researchers.", "url": "https://news.webindia123.com/news/Articles/India/20220925/3986733.html", "urlToImage": null, "publishedAt": "2022-09-25T07:58:34Z", "content": "<tr><td></td></tr><tr><td>\r\nThe bacteria in our stomach are fed by a carbohydrate that is frequently found bound to plant proteins, according to researchers.</td></tr>\r\nThe findings of the study were… [+2164 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "SNS", "title": "Ayurvedic drug 'BGR-34' reduces obesity along with diabetes: AIIMS study - The Statesman", "description": "Led by Dr. Sudhir Chandra Sarangi, Additional Professor, Department of Pharmacology AIIMS, the team reached this conclusion following a study spanning three years.", "url": "https://www.thestatesman.com/india/ayurvedic-drug-bgr-34-reduces-obesity-along-with-diabetes-aiims-study-1503114851.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/09/bgr.jpg", "publishedAt": "2022-09-25T07:44:00Z", "content": "A team of doctors from the country’s premier health research institute All India Institute of Medical Sciences (AIIMS), Delhi has found that the anti-diabetic ayurvedic drug ‘BGR-34’ is effective in … [+2457 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "Sharbani", "title": "Vector Borne diseases: Prevention and management - The Statesman", "description": "With 50 million people affected by dengue every year, causing approximately 4 % of death, according to the World Health Organization (WHO) estimates, it is calling for action to minimize illness and deaths from dengue.", "url": "https://www.thestatesman.com/lifestyle/health/vector-borne-diseases-prevention-and-management-1503114829.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/09/iStock-578121634.jpg", "publishedAt": "2022-09-25T07:33:00Z", "content": "Dengue and chikungunya, the most prevalent of vector-borne diseases, are mosquito-borne viral infections common in warm, tropical climates.\r\nLong incessant rain spell inundating parts of India in Sep… [+8362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "What should patients with long Covid do for their lung health? - The Indian Express", "description": "People who survive Covid-19 can experience long-term consequences: respiratory, neuropsychiatric, cardiovascular, hematologic, gastrointestinal, renal, and endocrine, says a doctor", "url": "https://indianexpress.com/article/lifestyle/health/world-lung-day-2022-improve-lung-function-patients-long-covid-8171225/", "urlToImage": "https://images.indianexpress.com/2022/09/GettyImages-Long-Covid-1200.jpg", "publishedAt": "2022-09-25T07:00:15Z", "content": "The lungs are two of the most important organs that are affected by the coronavirus, which leads to Covid infection in the respiratory system. It has been noticed that while most patients recover com… [+2691 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sangita Baruah", "title": "Cut out the noise for a healthy heart - Hindustan Times", "description": "A connection between noise pollution and cardiovascular disease has been observed in numerous studies. We speak to experts to find out how exposure to loud noise is linked to heart diseases. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/cut-out-the-noise-for-a-healthy-heart-101664086413032.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/25/1600x900/d9cdd9d8-3c98-11ed-8f8e-2ac2a9218f28_1664086411583.jpg", "publishedAt": "2022-09-25T06:13:32Z", "content": "A 65-year-old man recently passed away during his sons baraat procession in Malkangiri town, a 20-year-old died while dancing on Ganesh Utsav in J&amp;K, a performer collapsed on stage in the middle … [+3224 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Left Ventricular Non-compaction in a 40-Year-Old Male With Congenital Hydrocephalus - Cureus", "description": "Left ventricular non-compaction (LVNC) is a rare type of cardiomyopathy resulting from ineffective embryogenesis and is typically recognized shortly after birth. Here, we report a case of LVNC in a 40-year-old male with a history of congenital hydrocephalus w…", "url": "https://www.cureus.com/articles/111432-left-ventricular-non-compaction-in-a-40-year-old-male-with-congenital-hydrocephalus", "urlToImage": "https://assets.cureus.com/uploads/figure/file/443808/article_river_2f11a6202d9b11eda08f51ad26cc7d44-Figure-1.png", "publishedAt": "2022-09-25T05:33:28Z", "content": "Left ventricular non-compaction (LVNC) is a rare type of cardiomyopathy resulting from ineffective embryogenesis and is typically recognized shortly after birth. Here, we report a case of LVNC in a 4… [+8643 chars]"}, {"source": {"id": null, "name": "Udayavani.com"}, "author": "Udayavani", "title": "COVID-19 infection increases risk of long-term brain problems: Study - Udayavani English", "description": "People infected with the SARS-CoV-2 virus are at increased risk of developing a range of neurological conditions in the first year after the infection, according to a large...", "url": "https://www.udayavani.com/english-news/covid-19-infection-increases-risk-of-long-term-brain-problems-study", "urlToImage": "https://www.udayavani.com/wp-content/uploads/2022/09/corona_istock-2-620x291.jpg", "publishedAt": "2022-09-25T05:08:26Z", "content": "Udayavani is now on Telegram.Click hereto join our channel and stay updated with the latest news."}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Trivedi", "title": "Researchers develop a facemask for detecting viral exposure - Zee News", "description": "During recent research, scientists developed a face mask that can detect common respiratory viruses such as influenza and Covid-19 in the air as droplets or aerosols.", "url": "https://zeenews.india.com/health/researchers-develop-a-facemask-for-detecting-viral-exposure-2514033", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/09/25/1094640-untitled-design-33.png", "publishedAt": "2022-09-25T05:02:20Z", "content": "During recent research, scientists developed a face mask that can detect common respiratory viruses such as influenza and Covid-19 in the air as droplets or aerosols. If specific viruses are present … [+2575 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "SARS-CoV-2 Mutations Responsible for Immune Evasion Leading to Breakthrough Infection - Cureus", "description": "Background and objectives: India had faced a devastating second outbreak of COVID-19 infection, in which a majority of the viral sequences were found to be of the B.1.617.2 lineage (Delta-variant). While India and the world focused on vaccination, reports of …", "url": "https://www.cureus.com/articles/114827-sars-cov-2-mutations-responsible-for-immune-evasion-leading-to-breakthrough-infection", "urlToImage": "https://assets.cureus.com/uploads/figure/file/447906/article_river_f145dfa03c7211edaf009f18975d3048-Fig-1.png", "publishedAt": "2022-09-25T03:20:06Z", "content": "Background and objectives: India had faced a devastating second outbreak of COVID-19 infection, in which a majority of the viral sequences were found to be of the B.1.617.2 lineage (Delta-variant). W… [+22770 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Andrea Hargraves", "title": "Said records laboratories to diagnose monkeypox | world and science - brytfmonline.com", "description": "Rio has 992 confirmed cases of monkeypox and 112 probable cases Disclosure / MS The...", "url": "https://www.brytfmonline.com/said-records-laboratories-to-diagnose-monkeypox-world-and-science/", "urlToImage": null, "publishedAt": "2022-09-24T20:47:02Z", "content": "The Ministry of Health said it has registered seven Central Public Health Laboratories (Lacens) to conduct diagnostic tests for monkeypox, also known as monkeypox. From now on, Bahia, Goiás, Santa Ca… [+1373 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "GK HEALTH DESK", "title": "Ask the doctor - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/todays-paper/health-todays-paper/ask-the-doctor", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-05%2F7da4081f-eed9-4050-bf64-5cf37f9d7101%2FNurse_Health_DOctor_Hospital.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-09-24T19:30:00Z", "content": "Who should get the flu (Influenza) vaccination and who should not?\r\nEveryone over the age of 6 months (Especially senior citizens) should get a flu vaccine, except people who have had a serious sever… [+552 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Raven Symone Keto Gummies Reviews FAKE EXPOSED Is it Scam Or Legit? - The Tribune India", "description": "Raven Symone Keto Gummies are weight reduction candies that are loaded with all the intrinsic ingredients to support your fat burning process to produce energy to accelerate weight loss.", "url": "https://www.tribuneindia.com/news/brand-connect/raven-symone-keto-gummies-reviews-fake-exposed-is-it-scam-or-legit-434990", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_683100353.png", "publishedAt": "2022-09-24T18:41:00Z", "content": "Raven Symone Keto Gummies are weight reduction candies that are loaded with all the intrinsic ingredients to support your fat burning process to produce energy to accelerate weight loss.\r\nProduct nam… [+8852 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Sreeja Ramesh", "title": "A herculean task lies ahead for India to end AIDS by 2030 - The Hans India", "description": "Even though it has been more than 5 years since the HIV and AIDS (Prevention and Control) Bill was...", "url": "https://www.thehansindia.com/business/a-herculean-task-lies-ahead-for-india-to-end-aids-by-2030-762965", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/09/24/1313690-ids.jpg", "publishedAt": "2022-09-24T18:32:44Z", "content": "By adopting the UN Sustainable Development Goals (SDGs), governments of over 190 nations, including India, have pledged to end the dreaded disease AIDS by the year 2030. India has also promised to el… [+4932 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds brain disorder causes in Huntington's disease individuals - ANI News", "description": "Washington [US], September 24 (ANI): Huntington's disease (HD) is a genetic brain disorder caused by a mutation in the Huntington gene. It is a neurological disease that has no cure and produces personality changes, dementia symptoms, and uncontrollable convu…", "url": "https://www.aninews.in/news/science/study-finds-brain-disorder-causes-in-huntingtons-disease-individuals20220924233256", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220924175649.jpg", "publishedAt": "2022-09-24T18:02:00Z", "content": "Washington [US], September 24 (ANI): Huntington's disease (HD) is a genetic brain disorder caused by a mutation in the Huntington gene. It is a neurological disease that has no cure and produces pers… [+2317 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Tea consumption may lower risk of developing type 2 diabetes: Study - The Tribune India", "description": "According to a study of over 1 million adults from eight countries, moderate use of black, green, or Oolong tea is associated with a lower risk of developing type 2 diabetes.", "url": "https://www.tribuneindia.com/news/health/tea-consumption-may-lower-risk-of-developing-type-2-diabetes-study-434966", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1896704690.JPG", "publishedAt": "2022-09-24T14:50:00Z", "content": "ANI\r\nWashington, September 24\r\nAccording to a study of over 1 million adults from eight countries, moderate use of black, green, or Oolong tea is associated with a lower risk of developing type 2 dia… [+4764 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bristol: Risk of blood clots remains for almost a year after COVID-19 infection, study suggests - India Education Diary", "description": "The findings suggest that the COVID-19 pandemic may have led to an additional 10,500 cases of heart attacks, strokes and other blood clot complications such as deep vein thrombosis in England and Wales in 2020 alone, although the excess risk to indiv", "url": "https://indiaeducationdiary.in/university-of-bristol-risk-of-blood-clots-remains-for-almost-a-year-after-covid-19-infection-study-suggests/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/University_of_Bristol_logo-2.png?fit=1024%2C309&ssl=1", "publishedAt": "2022-09-24T13:05:54Z", "content": "The findings suggest that the COVID-19 pandemic may have led to an additional 10,500 cases of heart attacks, strokes and other blood clot complications such as deep vein thrombosis in England and Wal… [+4039 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Hayden E. Klein", "title": "Number of T1D Cases Expected to Double Worldwide by 2040 - AJMC.com Managed Markets Network", "description": "In 2040, researchers predict between 13.5 and 17.4 million type 1 diabetes (T1D) cases globally, reflecting a 60% to 107% increase in cases compared with 2021.", "url": "https://www.ajmc.com/view/number-of-t1d-cases-expected-to-double-worldwide-by-2040", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/2007a41032cefe8592304eeae5cfad88801584fc-850x850.png?fit=crop&auto=format", "publishedAt": "2022-09-24T12:06:01Z", "content": "Approximately 8.4 million people around the world lived with type 1 diabetes (T1D) in 2021, and this number is predicted to rise to 17.4 million by 2040, according to a modelling study published in T… [+3359 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Studies show how skin diseases form differently across the body - Zee News", "description": "molecules like ceramides, cholesterol and fatty acids make up the mortar, and cells called keratinocytes are the bricks. The researchers used single-cell sequencing to characterize how the keratinocytes differ at different body sites.", "url": "https://zeenews.india.com/health/studies-show-how-skin-diseases-form-differently-across-the-body-2513875", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/09/24/1094441-untitled-design-32.png", "publishedAt": "2022-09-24T12:01:19Z", "content": "Two recent studies reveal how skin forms differently across different areas of the body from the face and underarms to the palms of our hands and feet. By profiling the changes in the skin, researche… [+4583 chars]"}, {"source": {"id": null, "name": "The Durango Herald"}, "author": "Dr. Matthew A. Clark", "title": "Bivalent COVID-19 vaccine can 'turbo charge' immunity – The Durango Herald - The Durango Herald", "description": "If you are like a lot of people, you may be wondering whether you are due for a COVID-19 vaccine booster? \nThe arrival of COVID-19 vaccines in December 2020 was a critical step in stemming the tide of...", "url": "https://www.durangoherald.com/articles/bivalent-covid-19-vaccine-can-turbo-charge-immunity/", "urlToImage": "https://www.durangoherald.com/wp-content/themes/durango/images/default_article_image_dur.jpeg", "publishedAt": "2022-09-24T12:00:28Z", "content": "If you are like a lot of people, you may be wondering whether you are due for a COVID-19 vaccine booster?\r\nThe arrival of COVID-19 vaccines in December 2020 was a critical step in stemming the tide o… [+2871 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "From Weight Loss to Constipation, Why You Must Drink These 3 Juices Daily? - India.com", "description": "A nutritionist explains the remarkable health benefits of carrot, watermelon, and tulsi juices.", "url": "https://www.india.com/health/from-weight-loss-to-constipation-why-you-must-drink-these-3-juices-daily-5649732/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/09/Carrot-Juice.jpg", "publishedAt": "2022-09-24T09:47:54Z", "content": "Health Benefits of Juice: The majority of us strive to eat healthily and for that, you choose healthy alternatives. Those who cannot eat fruits and vegetables can incorporate juices into their diet. … [+1487 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Lucy Gornall", "title": "I’m a nutritionist – here’s 26 simple ways to make carbs HEALTHY to help you lose weight... - The US Sun", "description": "", "url": "https://www.the-sun.com/health/6293321/ways-to-make-carbs-healthier-weight-loss/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/09/arrabiata-pasta-450991972-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2022-09-24T08:00:00Z", "content": "PASTA, potatoes, pizza, piessome of our favourite foods dont exactly scream out good health. \r\nSo whether youre hoping to improve your general health or simply want to lose a few pounds, a five-chees… [+5347 chars]"}]}