{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Inhale, Exhale, Remember: Uncovering the Breath-Memory Connection - Neuroscience News", "description": "Studies reveal that the rhythm of our breathing can influence neural activity, impacting cognitive functions such as emotional processing and memory recall.", "url": "https://neurosciencenews.com/memory-breathing-23360/", "urlToImage": "https://neurosciencenews.com/files/2023/05/memory-breathing-neurosicence.jpg", "publishedAt": "2023-05-28T22:43:14Z", "content": "Summary: Intricate links between breathing and memory recall have been unraveled by recent scientific research, painting a more complex picture of our cognitive processes.\r\n Studies reveal that the r… [+4554 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "A Rare Type of Hepatocellular Carcinoma Presenting With Cardiac Thrombus - Cureus", "description": "Hepatocellular carcinoma (HCC) is a complication of end stage liver disease. Even rarer is right atrial tumor thrombus burden due to HCC. Common metastatic sites of HCC in descending order are lung, peritoneum, and bone. We present a patient with liver cirrho…", "url": "https://www.cureus.com/articles/154541-a-rare-type-of-hepatocellular-carcinoma-presenting-with-cardiac-thrombus", "urlToImage": "https://assets.cureus.com/uploads/figure/file/616795/article_river_1f8e3b10e21c11ed8b2c3d7f24fc169f-Figure-1.png", "publishedAt": "2023-05-28T21:22:12Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Desk", "title": "Avoid These Green Tea Mistakes To Unlock Its Full Potential - Slurrp", "description": "Many tea enthusiasts unknowingly make certain mistakes that hinder them from experiencing the maximum benefits of this ancient elixir. In this article, we will delve into the common errors to avoid when preparing and consuming green tea, guiding you on a jour…", "url": "https://www.slurrp.com/article/avoid-these-green-tea-mistakes-to-unlock-its-full-potential-1685306035450", "urlToImage": "https://images.slurrp.com/prodarticles/y6jmh8s6ik.webp", "publishedAt": "2023-05-28T20:40:19Z", "content": "Benefits Of Green Tea\r\nCommon Mistakes To Avoid To Have The Perfect Cup Of Green Tea\r\nTo ensure you get the most out of your green tea and optimize its benefits, it's important to avoid some common m… [+709 chars]"}, {"source": {"id": null, "name": "Mirchi.in"}, "author": "Mirchi", "title": "Exploring diseases that lead to diabetes; know the key risk factors - Mirchi Plus", "description": "Know all about the diseases that can increase your risk of developing diabetes. From obesity and metabolic syndrome to pancreatic diseases, Cushings syndrome, and polycystic ovary syndrome (PCOS), understanding these connections is crucial for proactive healt…", "url": "https://mirchi.in/stories/lifestyle/know-all-the-diseases-that-can-lead-to-diabetes/100575461", "urlToImage": "https://static.mirchi.in/thumb/imgsize-8426,msid-100575461,width-800,height-450,resizemode-1/100575461.jpg", "publishedAt": "2023-05-28T20:19:48Z", "content": "As it is known to everyone that diabetes\r\n is a chronic condition characterized by high blood sugar levels. While genetic and lifestyle factors play a significant role in its development, certain dis… [+3352 chars]"}, {"source": {"id": null, "name": "Mirchi.in"}, "author": "Mirchi", "title": "From acne to psoriasis: How sunlight can improve common skin conditions - Mirchi Plus", "description": "Discover the positive impact of sunlight on your skin health. Sun exposure provides a range of benefits, including the synthesis of essential vitamin D, which promotes collagen production, elasticity, and cell repair. To know more, download the Mirchi Plus Ap…", "url": "https://mirchi.in/stories/lifestyle/why-and-how-is-sun-good-for-skin/100575418", "urlToImage": "https://static.mirchi.in/thumb/imgsize-19912,msid-100575418,width-800,height-450,resizemode-1/100575418.jpg", "publishedAt": "2023-05-28T20:04:33Z", "content": "The sun plays a crucial role in maintaining good health, and exposure to sunlight\r\n provides numerous benefits for the skin. While excessive sun exposure can lead to harmful effects such as sunburn, … [+4216 chars]"}, {"source": {"id": null, "name": "Truescoopnews.com"}, "author": "TrueScoop", "title": "Nine Potentially Harmful Foods for our Liver - True Scoop", "description": "Nine Potentially Harmful Foods for our Liver", "url": "https://www.truescoopnews.com/stories/nine-potentially-harmful-foods-for-our-liver", "urlToImage": "https://tsncdn.azureedge.net/newsimagesfull/webstory_20230528194225_1.jpg", "publishedAt": "2023-05-28T19:45:04Z", "content": "Excessive alcohol consumption is the leading cause of liver damage. It can lead to inflammation, fatty liver, hepatitis, and eventually cirrhosis.\r\nFoods high in saturated and trans fats, such as fri… [+1035 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruchika M", "title": "Everything you need to know about rosemary tea: Benefits, recipe, best times and precautions - Sportskeeda", "description": "Are you ready to explore the world of herbal tea and its incredible health benefits? Look no further than rosemary tea.", "url": "https://www.sportskeeda.com/health-and-fitness/everything-need-know-rosemary-tea-benefits-recipe-best-times-precautions", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/05/95eee-16852981529270-1920.jpg", "publishedAt": "2023-05-28T18:57:00Z", "content": "Are you ready to explore the world of herbal tea and its incredible health benefits? Look no further than rosemary tea. This aromatic beverage has been gaining popularity among health enthusiasts and… [+3794 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "STING Like a Bee: MIT's Revolutionary Approach to Cancer Immunotherapy - SciTechDaily", "description": "A cancer vaccine combining checkpoint blockade therapy and a STING-activating drug eliminates tumors and prevents recurrence in mice. MIT researchers have engineered a therapeutic cancer vaccine that targets the STING pathway, vital for immune response to can…", "url": "https://scitechdaily.com/sting-like-a-bee-mits-revolutionary-approach-to-cancer-immunotherapy/", "urlToImage": "https://scitechdaily.com/images/Cancer-Vaccine-Could-Make-Checkpoint-Blockade-Therapies-More-Effective.jpg", "publishedAt": "2023-05-28T18:26:52Z", "content": "ByBendta Schroeder. MIT Koch InstituteMay 28, 2023\r\nBelcher and Hammond Lab researchers developed a cancer vaccine that could make checkpoint blockade therapies more effective for more patients. Cred… [+9665 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruchika M", "title": "Benefits of Banana for Stomach and Gut Health - Sportskeeda", "description": "When it comes to supporting your stomach and gut health, the benefits of bananas stand out the most.", "url": "https://www.sportskeeda.com/health-and-fitness/benefits-banana-stomach-gut-health", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/05/01ad4-16852955067663-1920.jpg", "publishedAt": "2023-05-28T18:09:00Z", "content": "When it comes to supporting your stomach and gut health, the benefits of bananas stand out the most. This wonderful fruit is not only delicious and versatile but also packed with numerous benefits th… [+4723 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Apurva P", "title": "How working on the night shift can affect your health - NewsBytes", "description": "Since night shifts cause sleep loss and disruption to circadian rhythm, they are proven to be detrimental to performance and attentiveness", "url": "https://www.newsbytesapp.com/news/lifestyle/effects-of-working-night-shifts-on-your-health/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l97520230525172521.jpeg", "publishedAt": "2023-05-28T18:00:02Z", "content": "How working on the night shift can affect your health\r\nMay 28, 2023, 11:30 pm2 min read\r\nWorking overnight takes a great toll on your health and wellness when it becomes a routine. \r\n The inherent sl… [+2360 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sheeraz Khan", "title": "Indoor activities to burn calories faster - NewsBytes", "description": "There are plenty of indoor exercises that can help you burn calories faster and stay fit and healthy while escaping the scorching temperatures outdoors. Here are five such indoor activities.", "url": "https://www.newsbytesapp.com/visualstories/lifestyle/indoor-activities-to-burn-calories-faster", "urlToImage": "https://i.cdn.newsbytesapp.com/web/story168484475932593.jpg?tr=w-360", "publishedAt": "2023-05-28T17:50:44Z", "content": "Read more about this here"}, {"source": {"id": null, "name": "Organiser.org"}, "author": "WEB DESK", "title": "Study reveals exercise helps to protect against major brain haemorrhage - Organiser", "description": "According to a study from the University of Gothenburg, regular physical activity and exercise may reduce bleeding in persons suffering from intracerebral", "url": "https://organiser.org/2023/05/28/176111/world/study-reveals-exercise-helps-to-protect-against-major-brain-haemorrhage/", "urlToImage": "https://organiser.org/wp-content/uploads/2023/05/whatsapp-image-2023-05-28-at-5.03.31-pm.jpeg", "publishedAt": "2023-05-28T17:32:53Z", "content": "According to a study from the University of Gothenburg, regular physical activity and exercise may reduce bleeding in persons suffering from intracerebral haemorrhage. The importance of physical acti… [+2843 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Devi Poojari", "title": "Eat Eggs To Nuts, For Long Thick Hair - Slurrp", "description": "While a lot of genetical factors determine one’s personal hair health, encouraging hair growth and thickness can also be done by eating these seven hair-friendly foods to keep it shining and voluminous at all times.", "url": "https://www.slurrp.com/article/eat-eggs-to-nuts-for-long-thick-hair-1685290356537", "urlToImage": "https://images.slurrp.com/prodarticles/soxue9yhgmb.webp", "publishedAt": "2023-05-28T16:19:20Z", "content": ""}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Walking Benefits: How Few Steps Everyday May Improve Brain Function, Delay Alzheimer's - India.com", "description": "Walking is one of the easiest ways to start a healthy physical regime. There are several benefits and according to a latest study, walking may help cognitive functions of senior citizens and delay Alzheimer's.", "url": "https://www.india.com/health/walking-benefits-how-few-steps-everyday-may-improve-brain-function-delay-alzheimers-6076585/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/05/senior-citizen-walking.jpg", "publishedAt": "2023-05-28T16:10:58Z", "content": "Walking is one of the easiest ways to start a healthy physical regime. There are several benefits and according to a latest study, walking may help cognitive functions of senior citizens and delay Al… [+3145 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Devi Poojari", "title": "Regulate Blood Sugar By Drinking These Five Healthy Juices - Slurrp", "description": "While it is always advisable to consume vegetables and fruits in their solid forms, drinking a glass of juice made with either, is the ultimate elixir to regulate blood sugar levels and detoxify.", "url": "https://www.slurrp.com/article/regulate-blood-sugar-by-drinking-these-five-healthy-juices-1685288054641", "urlToImage": "https://images.slurrp.com/prodarticles/gzoocxhrzx.webp", "publishedAt": "2023-05-28T15:42:52Z", "content": "Starting your day with a glass of warm water mixed with the juice of half a lemon is known to have a negligible effect on blood sugar levels as well as aiding digestion. A powerhouse source of vitami… [+163 chars]"}, {"source": {"id": null, "name": "Kashmir Life"}, "author": "Kashmir Life", "title": "Why Metabolic Syndrome Is Rampant In Kashmir? - Kashmir Life", "description": "With culture, situation, market and modernity making people less mobile physically, Kashmir is gradually emerging as the new capital of chronic metabolic syndrome.", "url": "https://kashmirlife.net/kashmirs-metabolic-syndrome-vol-15-issue-08-317095/", "urlToImage": "https://kashmirlife.net/wp-content/uploads/2023/05/Metabolic-Syndrome-e1685265542668.jpg", "publishedAt": "2023-05-28T15:13:32Z", "content": "With culture, situation, market and modernity making people less mobile physically, Kashmir is gradually emerging as the new capital of chronic metabolic syndrome. Women are suffering seriously on th… [+7741 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Vijay Thakkar", "title": "How calf muscles can keep cardiovascular disease at bay - Moneycontrol", "description": "Why the young workforce is seeing cardiovascular diseases, and even death, increasingly? The incidences have escalated post-pandemic and with sedentary lifestyle; good news is that CVDs can be prevented with regular exercise and working on calf muscles.", "url": "https://www.moneycontrol.com/news/health-and-fitness/how-calf-muscles-can-keep-cardiovascular-disease-at-bay-10679581.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/Cardiovascular-health-770x433.jpg", "publishedAt": "2023-05-28T14:16:38Z", "content": "The heart, lungs, blood, blood vessels, and all vital organs in the body make up the cardiovascular or circulatory system. And so, all organs must get oxygen and nutrients to function properly daily,… [+5887 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "US man dies from Powassan virus: Know all about the tick-borne illness - The Indian Express", "description": "Dr Satish Koul, director of Internal Medicine, Fortis Memorial Research Institute, Gurgaon told indianexpress.com that the Powassan virus is generally transmitted to humans through bites by infected deer ticks, groundhog ticks, or squirrel ticks, commonly fou…", "url": "https://indianexpress.com/article/lifestyle/health/powassan-virus-maine-man-death-tick-borne-virus-symptoms-diagnosis-treatment-8633191/", "urlToImage": "https://images.indianexpress.com/2023/05/ticks.jpg", "publishedAt": "2023-05-28T13:40:37Z", "content": "A tick-borne virus called Powassan virus has claimed its first victim in the United States of America. Health officials are alerting people about the deadly tick-borne illness after the Maine Centre … [+2813 chars]"}, {"source": {"id": null, "name": "Indianarrative.com"}, "author": "ANI", "title": "Eating extra sugar makes inflammatory bowel disease worse, new study shows - India Narrative", "description": "According to a recent study from the University of Pittsburgh, in a mouse model of inflammatory bowel disease (IBD), extra sugar inhibits cells that regenerate the colon's lining. The results, which were published in Cellular and Molecular Gastroenterology an…", "url": "https://www.indianarrative.com/health-news/eating-extra-sugar-makes-inflammatory-bowel-disease-worse-new-study-shows-144022.html", "urlToImage": "https://www.indianarrative.com/wp-content/uploads/2023/05/sugar-substitute.jpg", "publishedAt": "2023-05-28T13:31:46Z", "content": "Pittsburgh: According to a recent study from the University of Pittsburgh, in a mouse model of inflammatory bowel disease (IBD), extra sugar inhibits cells that regenerate the colon’s lining. The res… [+4617 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "This spice has more health benefits than meat and veggies - msnNOW", "description": "This spice is more healthy than meat and veggies, here's all you need to know about!", "url": "https://timesofindia.indiatimes.com/life-style/food-news/this-spice-has-more-health-benefits-than-meat-and-veggies/articleshow/100537557.cms", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1bNLMA.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-28T13:30:00Z", "content": "Since ages we have been told about the numerous health benefits of eating veggies, meat, eggs or fish to meet the nutritional requirements of the body. But what if we tell you that there's a secret i… [+1856 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Online Desk, ET HealthWorld", "title": "The Evolving Role of Radiation Therapy in the Management of Rectal Cancer - ETHealthWorld", "description": "Moving forward, ongoing research and clinical trials will further refine our understanding of optimal radiation therapy techniques, treatment durations, and sequencing in the context of rectal cancer. Additionally, efforts should focus on long-term follow-up …", "url": "https://health.economictimes.indiatimes.com/news/industry/the-evolving-role-of-radiation-therapy-in-the-management-of-rectal-cancer/100571212", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100571212,imgsize-119874,width-1200,height=765,overlay-ethealth/industry/the-evolving-role-of-radiation-therapy-in-the-management-of-rectal-cancer.jpg", "publishedAt": "2023-05-28T12:56:51Z", "content": "By Dr Vividha DubeyRectal cancer is a significant health concern worldwide, accounting for a substantial portion of colorectal cancer cases. Over the years, the treatment landscape for rectal cancer … [+4920 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Papaya Benefits on Empty Stomach: 6 Reasons Why This Fruit is a Healthy Start For the Day - India.com", "description": "Weight loss to heart health, papaya has a basketful of benefits and sometimes it is better to eat it on empty stomach.", "url": "https://www.india.com/health/papaya-benefits-on-empty-stomach-6-reasons-why-this-fruit-is-a-healthy-start-for-the-day-6076138/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/05/papaya-fruit.jpg", "publishedAt": "2023-05-28T11:42:35Z", "content": "Weight loss to heart health, papaya has a basketful of benefits and sometimes it is better to eat it on empty stomach.\r\nSummer is here and it is all about staying hydrated, putting up some sunscreen,… [+1818 chars]"}, {"source": {"id": null, "name": "News18"}, "author": null, "title": "Here Is Why You're Not Shedding Weight Despite Your Workout Efforts - msnNOW", "description": "Losing weight can be a challenging journey, a journey that often requires you to give it your all. However, what is especially triggering is when you’re putting in the effort and time to exercise regularly. However, if you’ve been diligently hitting the gym b…", "url": "https://www.news18.com/lifestyle/here-is-why-youre-not-shedding-weight-despite-your-workout-efforts-7939681.html?utm_source=msn&amp;utm_medium=Referral&amp;utm_campaign=msn&amp;comscorekw=msn", "urlToImage": "https://static-entertainment-eus-s-msn-com.akamaized.net/sc/c6/519670.jpg", "publishedAt": "2023-05-28T11:24:17Z", "content": "Losing weight can be a challenging journey, a journey that often requires you to give it your all. However, what is especially triggering is when youre putting in the effort and time to exercise regu… [+3679 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Desk", "title": "Hing To Triphala, 6 Ayurvedic Digestive Drinks You Must Try - Slurrp", "description": "Journey into the realm of ancient wisdom as we explore Ayurvedic digestive elixirs, potent blends of herbs and spices designed to ignite your digestive fire and nurture overall wellness. Discover their remarkable ability to harmonize your digestive system, al…", "url": "https://www.slurrp.com/article/hing-to-triphala-6-ayurvedic-digestive-drinks-you-must-try-1684933646626", "urlToImage": "https://images.slurrp.com/prodarticles/rjnhy85yhm.webp", "publishedAt": "2023-05-28T10:55:54Z", "content": "In the realm of Ayurveda, the ancient Indian system of medicine, digestive health is considered fundamental to overall well-being. The tradition of using Ayurvedic digestive elixirs has been passed d… [+3518 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Desk", "title": "5 Soothing Health Benefits Of Turmeric Milk Tea - Slurrp", "description": "Discover the remarkable benefits of incorporating healthy turmeric milk tea into your daily routine. This golden elixir boasts a multitude of advantages for your well-being. Embrace the wellness potential of this delicious and nutritious drink and unlock a he…", "url": "https://www.slurrp.com/article/5-soothing-health-benefits-of-turmeric-milk-tea-1685034121906", "urlToImage": "https://images.slurrp.com/prodarticles/sdc4j257b4.webp", "publishedAt": "2023-05-28T10:55:54Z", "content": "Are you ready to experience a truly remarkable beverage that combines the goodness of turmeric with the comforting warmth of milk? Look no further than Healthy Turmeric Milk Tea, the golden elixir th… [+2588 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/newsdesk/", "title": "AI Helps Scientists To Discover New Superbug-Killing Antibiotic - India.com", "description": "Amidst the concern about the misuse of Artificial Intelligence tools for spreading misinformation or creating deepfakes, a positive development has surfaced. A team of scientists, using AI technology,", "url": "https://www.india.com/science/artificial-intelligence-scientists-discover-superbug-hospital-bug-antibiotic-6075992/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/05/research.jpg", "publishedAt": "2023-05-28T10:48:59Z", "content": "Amidst the concern about the misuse of Artificial Intelligence tools for spreading misinformation or creating deepfakes, a positive development has surfaced. A team of scientists, using AI technology… [+3117 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Bloomberg", "title": "Can we cure dementia before it starts? He's 84 and he’s trying - Hindustan Times", "description": "Meet Leroy Hood, the octogenarian trying to make Elizabeth Holmes-ian dreams of preventive medicine come true. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/can-we-cure-dementia-before-it-starts-hes-84-and-he-s-trying-101685267374208.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/28/1600x900/brain_ageing_2_1667568611071_1685267444809.jpg", "publishedAt": "2023-05-28T10:47:58Z", "content": "The future of preventive medicine may depend on the continued health of Leroy Hoods brain. In a decades-long career, hes achieved momentous strides in decoding the molecular-level workings of the hum… [+5417 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Editorial Team", "title": "Do Deodorant Rollers Induce Breast Cancer? Expert Reveals The Truth | TheHealthSite.com - TheHealthSite", "description": "Numerous scientific studies have been conducted to investigate the potential connection between deodorant use and breast cancer. Read on. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/do-deodorant-rollers-induce-breast-cancer-expert-reveals-the-truth-981196/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/05/Deodrants.jpg", "publishedAt": "2023-05-28T10:31:00Z", "content": "The American Cancer Society states that there is no scientific basis for the claim that deodorants or antiperspirants increase the risk of breast cancer.\r\nNumerous scientific studies have been conduc… [+3273 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Team Health Shots", "title": "Planning a pregnancy with diabetes? A doctor shares 6 tips - Health shots", "description": "If you're planning a pregnancy with diabetes, your lifestyle habits will need your special attention and doctor's extra care. Check out these tips!", "url": "https://www.healthshots.com/preventive-care/reproductive-care/planning-a-pregnancy-with-diabetes-a-doctor-shares-6-tips/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2021/11/11000021/gestational-diabetes.jpg", "publishedAt": "2023-05-28T10:27:12Z", "content": "A vast population of the country is affected by diabetes, a condition caused by genetic predisposition and lifestyle factors. In either case, elevated blood sugar levels occur when the body fails to … [+4248 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Poor eating habits among students may lead to lifetime of illness: Study - ETHealthWorld", "description": "The study, published recently in Preventive Medicine Reports, was led by Dr Shihui Peng with the School of Medicine at China's Jinan University. While there is well-established research that links unhealthy diets to many chronic diseases, this study aimed to …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/poor-eating-habits-among-students-may-lead-to-lifetime-of-illness-study/100568289", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100568289,imgsize-28568,width-1200,height=765,overlay-ethealth/diagnostics/poor-eating-habits-among-students-may-lead-to-lifetime-of-illness-study.jpg", "publishedAt": "2023-05-28T10:19:23Z", "content": "Washington: A team of researchers warns that poor eating habits formed during post-secondary education may lead to obesity, respiratory diseases, and depression in the future.Dr Joan Bottorff, a Prof… [+3934 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sharmistha Jha", "title": "Mental Health Awareness Month | Love finds a way amidst madness and chaos in Jerry Pinto’s Em and the... - Moneycontrol", "description": "Mental illness can test ones closest relationships - Jerry Pinto's Em and the Big Hoom breaks down what that looks like in a family of four.", "url": "https://www.moneycontrol.com/news/trends/lifestyle/mental-health-awareness-month-love-finds-a-way-amidst-madness-and-chaos-in-jerry-pintos-em-and-the-big-hoom-10678731.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/pexels-riccardo-185801-770x433.jpg", "publishedAt": "2023-05-28T10:12:37Z", "content": "Contains spoilers\r\nAs the month of May, the mental health awareness month, comes to an end, I am left with bigger questions about the possibilities of a life with mental health disorders. What happen… [+4632 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Healthy habits, diet plan to keep a check on thyroid problems - Hindustan Times", "description": "Once detected with thyroid problem, lifestyle changes help in controlling the disease. Here are healthy habits and diet tips to keep a check on thyroid problems | Health", "url": "https://www.hindustantimes.com/lifestyle/health/healthy-habits-diet-plan-to-keep-a-check-on-thyroid-problems-101685267377590.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/28/1600x900/vitalii-pavlyshynets-kcRFW-Hje8Y-unsplash_1685267893281_1685268109509.jpg", "publishedAt": "2023-05-28T10:03:55Z", "content": "Thyroid disease is due to malfunctioning of the thyroid gland and it can be hyperthyroid which means increased production of thyroid hormone where the symptoms may include weight loss, anxiety or ner… [+3904 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "High Uric Acid: 5 Foods to Lower Uric Acid Naturally - India.com", "description": "If you have too much uric acid in your body, it may form crystals that cause inflammation and pain in your joints. Expert reveals 5 foods that can help reduce high uric acid naturally.", "url": "https://www.india.com/lifestyle/high-uric-acid-5-foods-to-lower-uric-acid-naturally-6075831/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/05/Collage-Maker-28-May-2023-02-43-PM-564.jpg", "publishedAt": "2023-05-28T09:14:17Z", "content": "If you have too much uric acid in your body, it may form crystals that cause inflammation and pain in your joints. Expert reveals 5 foods that can help reduce high uric acid naturally.\r\nHigh Uric Aci… [+2361 chars]"}, {"source": {"id": null, "name": "Boldsky.com"}, "author": "Dr Medha Gupta", "title": "How Can Fruits Improve Oral Health? From Increasing Saliva Production To Balancing Oral PH, Know The Benefits - Boldsky", "description": "The benefits of fruits for your overall health cannot be emphasised enough. Good oral health is a reflection of a sound body; your mouth is the entry point for all you eat or drink. Hence, what nourishes the body will also be healthy for the mouth.", "url": "https://www.boldsky.com/health/how-can-fruits-improve-oral-health-know-the-benefits-146386.html", "urlToImage": "https://www.boldsky.com/img/1200x60x675/2023/05/cover-1685162063.jpg", "publishedAt": "2023-05-28T08:35:02Z", "content": "The\r\nbenefits\r\nof\r\nfruits\r\nfor\r\nyour\r\noverall\r\nhealth\r\ncannot\r\nbe\r\nemphasised\r\nenough.\r\nGood\r\noral\r\nhealth\r\nis\r\na\r\nreflection\r\nof\r\na\r\nsound\r\nbody;\r\nyour\r\nmouth\r\nis\r\nthe\r\nentry\r\npoint\r\nfor\r\nall\r\nyou\r\n… [+3949 chars]"}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "Jane McGuire", "title": "Can walking give you abs? We ask an expert - Yahoo Singapore News", "description": "Can walking give you abs? We ask an expert for more information about how to use walking to tone up and get in shape", "url": "https://www.tomsguide.com/news/can-walking-give-you-abs-we-ask-an-expert", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_x9HuN4rOeLWSpcC42R0ig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/toms_guide_826/e457d9dd7f879463dcfecc37c3244e5f", "publishedAt": "2023-05-28T08:30:00Z", "content": "a photo of two women wearing sports bras laughing\r\nWalking is an excellent way to get fitter, tone up, and lose weight its suitable for beginners, you dont need any extra equipment, and its completel… [+4090 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "AI Identifies Five Subtypes of Heart Failure | Weather.com - The Weather Channel", "description": "Using several machine learning methods, they identified five subtypes: early onset, late onset, atrial fibrillation-related, metabolic and cardiometabolic.", "url": "https://weather.com/en-IN/india/health/news/2023-05-27-ai-identifies-five-subtypes-of-heart-failure", "urlToImage": "https://s.w-x.co/in-heart_attack.jpg", "publishedAt": "2023-05-28T07:37:51Z", "content": "Five subtypes of heart failure that could potentially be used to predict future risk for individual patients have been identified using artificial intelligence (AI) tools, according to a new study le… [+2667 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Shilpi Madan", "title": "Are you deficient in Vitamin B12? Here’s how to boost it - Moneycontrol", "description": "Those who have undergone weight-loss surgery usually stand with an impaired body ability to absorb B 12 from food effectively.", "url": "https://www.moneycontrol.com/news/health-and-fitness/are-you-deficient-in-vitamin-b12-heres-how-to-boost-it-10678101.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/Foods-with-Vitamin-B-12-1-770x433.jpg", "publishedAt": "2023-05-28T07:37:48Z", "content": "It is not just the heat that could be sapping you of energy. It could be that sneaky, silent B 12, playing bummer by walking away from your body. While the non-vegetarians have always toasted their a… [+5123 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "Ladyfinger: 7 Incredible health benefits of Okra - Free Press Journal", "description": "Ladyfinger: 7 Incredible health benefits of Okra", "url": "https://www.freepressjournal.in/ampstories/lifestyle/ladyfinger-7-incredible-health-benefits-of-okra", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-05/9748d83f-a12e-40bc-b571-f6589c7a76b5/Untitled_design___2023_05_28T122841_616.png?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-05-28T07:03:23Z", "content": "Prevents anaemia: Since ladyfinger contains high amounts of vitamin K, folate and iron, it is great for promoting blood health and for the treatment and prevention of anaemia"}, {"source": {"id": null, "name": "Webnewsobserver.com"}, "author": "https://www.facebook.com/webnewsobserver", "title": "5 Side effects of drinking lemon water daily on an empty stomach - Web News Observer", "description": "While lemon water is generally considered safe to drink, excessive consumption may cause dental erosion due to the acidic nature of lemon. Lemon water is", "url": "https://webnewsobserver.com/5-side-effects-of-drinking-lemon-water-daily-on-an-empty-stomach/", "urlToImage": "https://webnewsobserver.com/wp-content/uploads/2022/06/lemon-water.png", "publishedAt": "2023-05-28T06:25:05Z", "content": "While lemon water is generally considered safe to drink, excessive consumption may cause dental erosion due to the acidic nature of lemon. Lemon water is generally considered safe for most people, bu… [+3663 chars]"}, {"source": {"id": null, "name": "Newstrailindia.com"}, "author": null, "title": "NEWS TRAIL - News Trail", "description": null, "url": "https://newstrailindia.com/inner.php?id=13139", "urlToImage": "https://newstrailindia.com/uploads/article_image_uploads/photos_136472e3171b616_1685250839_370x270.png", "publishedAt": "2023-05-28T05:14:11Z", "content": "Sowmya Raju | NT\r\nBengaluru: The prevalence of back and neck pain among people aged 18-30 years in India has increased from 20% in 2005 to 30% in 2015, according to a study by the Indian Council of M… [+1278 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Thyroid Storm Masquerading as Multiple Organ Dysfunction Syndrome: Catch Me if You Can - Cureus", "description": "A 65-year-old man presented to the emergency medicine department with altered sensorium, a high-grade fever, and shock. On routine workup, he was diagnosed with acute respiratory distress syndrome with sepsis. Later, it was found that the patient had undetect…", "url": "https://www.cureus.com/articles/159331-thyroid-storm-masquerading-as-multiple-organ-dysfunction-syndrome-catch-me-if-you-can", "urlToImage": "https://assets.cureus.com/uploads/figure/file/634607/article_river_e6eb6f70f2f211edbb2d8d46ee81f3c4-WhatsApp-Image-2023-05-15-at-12.57.10-PM.png", "publishedAt": "2023-05-28T03:50:58Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "‘bladder Cancer Cases On Rise Due To Increase In Tobacco Use’ | Varanasi News - Times of India", "description": "Varanasi: A preceptorship programme on Bladder Cancer was organized at Mahamana Pandit Madan Mohan Malaviya Cancer Centre and Homi Bhabha Cancer Hospi.", "url": "https://timesofindia.indiatimes.com/city/varanasi/bladder-cancer-cases-on-rise-due-to-increase-in-tobacco-use/articleshow/100561880.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-28T03:02:00Z", "content": "In MP's Bandhavgarh, signs of 2,000-year-old 'modern society'"}, {"source": {"id": null, "name": "DNA India"}, "author": "Sonali Sharma", "title": "kadi patta, curry leaves, health benefits of kadi patta - DNA India", "description": "6 health benefits of kadi patta, know why You Should Add curry leaves to Your Diet", "url": "https://www.dnaindia.com/web-stories/lifestyle/6-health-benefits-of-kadi-patta-curry-leaves-1685240166257", "urlToImage": null, "publishedAt": "2023-05-28T02:25:56Z", "content": "May 28, 2023, 07:55AM IST"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Shweta Tripathi", "title": "The inevitability of being influenced - DTNEXT", "description": "Browse through anyone’s social media account, and you’d find hundreds of photos and videos of food items, restaurants and street food – all of them promoted by influencers, or those aspiring to", "url": "https://www.dtnext.in/lifestyle/wellbeing/the-inevitability-of-being-influenced-715387", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/05/27/737015-foodinfluencing.jpg", "publishedAt": "2023-05-28T01:30:27Z", "content": "CHENNAI: Food reviewers and influencers on social media have changed the way how one looks at food on the roadside eateries, cafés, restaurants, bars and clubs. While easy availability of all kinds o… [+6984 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Gym craze among young adults is rising: Here are few dos and don'ts - Indiatimes.com", "description": "​Gym culture is spreading faster in the country. Youngsters, especially, are more attracted to it. Well, it is not bad to indulge in a workout. But what needs to be taken care of is the overindulgence and the mistakes one makes in the gym. Social media valida…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/gym-craze-among-young-adults-is-rising-here-are-few-dos-and-donts/photostory/100548176.cms", "urlToImage": "https://static.toiimg.com/photo/100548207.cms", "publishedAt": "2023-05-28T01:30:00Z", "content": "Gym culture is spreading faster in the country. Youngsters, especially, are more attracted to it. Well, it is not bad to indulge in a workout. But what needs to be taken care of is the overindulgence… [+205 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Robert Abraham", "title": "Change in diet, lifestyle can reduce prevalence of inflammatory bowel disease: Experts - Hindustan Times", "description": "The editorial, published in The Lancet medical journal, highlights the insights of nine experts from across the world, including Dr Vishal Sharma, an associate professor at Chandigarh PGIMER’s gastroenterology department", "url": "https://www.hindustantimes.com/cities/chandigarh-news/experts-emphasize-importance-of-diet-and-lifestyle-changes-to-reduce-inflammatory-bowel-disease-ibd-incidence-in-the-lancet-editorial-101685217325983.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/27/1600x900/The-experts-stressed-on-the-significance-of-making_1685217322062.png", "publishedAt": "2023-05-27T19:55:25Z", "content": "Modifying ones diet and adopting a healthier lifestyle can help decrease the incidence of inflammatory bowel disease (IBD), emphasised experts in an editorial recently published in The Lancet medical… [+2987 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "What Foods Promote 'Good' Gut Bacteria? - Inside Edition", "description": "Maintaining a healthy gut allows the esophagus, stomach and intestines to work together. There are hundreds of species of bacteria in our gut called the gut ...", "url": "https://www.youtube.com/watch?v=3Sgr1tWPhB4", "urlToImage": "https://i.ytimg.com/vi/3Sgr1tWPhB4/maxresdefault.jpg", "publishedAt": "2023-05-27T19:00:01Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Do you know cancers in distant organs change liver function? Study finds - ANI News", "description": "Researchers discovered that cancer frequently sends substances into the bloodstream that pathologically alter the liver, putting it in an inflammatory condition, causing fat to build up, and interfering with its regular detoxification functions.", "url": "https://www.aninews.in/news/science/do-you-know-cancers-in-distant-organs-change-liver-function-study-finds20230527225625", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230527143738.jpeg", "publishedAt": "2023-05-27T17:26:00Z", "content": "New York [US], May 27 (ANI): Researchers discovered that cancer frequently sends substances into the bloodstream that pathologically alter the liver, putting it in an inflammatory condition, causing … [+5278 chars]"}, {"source": {"id": null, "name": "Webnewsobserver.com"}, "author": "https://www.facebook.com/webnewsobserver", "title": "5 Benefits of drinking chia seeds water on an empty stomach - Web News Observer", "description": "Chia seeds are a superfood that has been used for thousands of years. In addition to being a delicious snack, chia seeds are a natural way to maintain good", "url": "https://webnewsobserver.com/benefits-of-drinking-chia-seeds-water-on-an-empty-stomach/", "urlToImage": "https://webnewsobserver.com/wp-content/uploads/2023/03/chia-seeds-water.png", "publishedAt": "2023-05-27T17:10:57Z", "content": "Chia seeds are a superfood that has been used for thousands of years. In addition to being a delicious snack, chia seeds are a natural way to maintain good health. Chia seeds are packed with essentia… [+3933 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Nina Cosdon", "title": "Effectiveness of Bivalent Booster Vaccine in Preventing Severe COVID-19 Outcomes in High-Risk Adults - Contagionlive.com", "description": "There has been a low uptake of bivalent mRNA booster vaccines in older adults, despite a high efficacy of preventing severe and fatal COVID-19.", "url": "https://www.contagionlive.com/view/effectiveness-of-bivalent-booster-vaccine-in-preventing-severe-covid-19-outcomes-in-high-risk-adults", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/e086f0fbc182bbbe3f9c4813ca8d0d742dbd41d5-5261x3527.jpg?fit=crop&auto=format", "publishedAt": "2023-05-27T15:11:25Z", "content": "In the latter part of 2022, the Omicron BA.5 sublineage became the predominant COVID-19 strain worldwide, as evidenced by the sequencing of viral genomes. Since its emergence, Omicron continues to ca… [+5003 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruchika M", "title": "Research reveals surprising facts about artificial sugars and weight loss efforts - Sportskeeda", "description": "If you're looking to cut down on sugar and manage your weight, you may have considered using artificial sugars or sugar substitutes as a healthier alternative.", "url": "https://www.sportskeeda.com/health-and-fitness/research-reveals-surprising-facts-artificial-sugars-weight-loss-efforts", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/05/848ad-16851896704318-1920.jpg", "publishedAt": "2023-05-27T14:36:00Z", "content": "If you're looking to cut down on sugar and manage your weight, you may have considered using artificial sugars or sugar substitutes as a healthier alternative.\r\nHowever, recent guidelines from the Wo… [+2756 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "7 expert tips to help your pet live a healthy and long life - Hindustan Times", "description": "From a balanced diet to regular veterinary check-ups, these simple tips can help your furry friend live a long and disease-free life.", "url": "https://www.hindustantimes.com/lifestyle/pet/7-expert-tips-to-help-your-pet-live-a-healthy-and-long-life-101685194429927.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/27/1600x900/dog_1685194477970_1685194488858.jpg", "publishedAt": "2023-05-27T14:30:18Z", "content": "Who doesn't want their pet to be around for the longest time possible and be hale and hearty during their entire lifetime? A healthy lifestyle and regular veterinary check-ups can keep your pet in th… [+3154 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Preventing Heat Strokes To Improving Eyesight, Benefits Of Watermelon Juice In Summer - News18", "description": "Watermelon juice is abundant in fibre, amino acids like l-citrulline and carotenoids like lycopene while being low in carbs and calories.", "url": "https://www.news18.com/lifestyle/preventing-heat-strokes-to-improving-eyesight-benefits-of-watermelon-juice-in-summer-7934509.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/viral-viral-news-9-168519460316x9.jpg", "publishedAt": "2023-05-27T13:37:11Z", "content": "Summer appetite and eating habits frequently alter due to the heated environment and the influence of heat on our bodies. Food consumption is adjusted to keep our bodies cool and light while deprivin… [+1570 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Prasad Shirvalkar", "title": "Chronic pain can be objectively measured using brain signals—new research - Medical Xpress", "description": "Using a brain implant that can record neural signals over many months, my research team and I have discovered objective biomarkers of chronic pain severity in four patients with chronic pain as they went about their daily lives.", "url": "https://medicalxpress.com/news/2023-05-chronic-pain-brain-signalsnew.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/chronic-pain.jpg", "publishedAt": "2023-05-27T13:14:26Z", "content": "Using a brain implant that can record neural signals over many months, my research teamand I have discovered objective biomarkers of chronic pain severity in four patients with chronic pain as they w… [+4795 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Serum neutrophil gelatinase-associated lipocalin and lactate level during surgery predict acute kidney injury and early allograft dysfunction after liver transplantation | Scientific Reports - Nature.com", "description": "Scientific Reports - Serum neutrophil gelatinase-associated lipocalin and lactate level during surgery predict acute kidney injury and early allograft dysfunction after liver transplantation", "url": "https://www.nature.com/articles/s41598-023-34372-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-34372-9/MediaObjects/41598_2023_34372_Fig1_HTML.png", "publishedAt": "2023-05-27T12:43:16Z", "content": null}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "What is Japanese Natto and how its consumption can reduce stress - mid-day.com", "description": "Japanese natto is made from softened soybeans that have been boiled or steam-fermented with a bacteria known as Bacillus subtilis var. natto", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/what-is-japanese-natto-and-how-its-consumption-can-reduces-stress-23288944", "urlToImage": "https://images.mid-day.com/images/images/2023/may/nattomid_d.jpg", "publishedAt": "2023-05-27T11:57:00Z", "content": "Japanese natto is made from softened soybeans that have been boiled or steam-fermented with a bacteria known as Bacillus subtilis var. natto\r\nImage for representational purposes only. Photo Courtesy:… [+2204 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Nikita Toppo", "title": "7 Vegetarian High Fibre Food To Include In Your Diet - Slurrp", "description": "Fibre is an essential compound for our body. It helps in keeping the digestive system clean and healthy. Fibre is also beneficial in promoting weight loss, lowering blood sugar, fighting constipation and boosting heart health. So, here are seven high fibre ve…", "url": "https://www.slurrp.com/article/apples-to-barley-7-vegetarian-high-fibre-food-to-include-in-your-diet-1685186548671", "urlToImage": "https://images.slurrp.com/prodarticles/86bso0dtjfv.webp", "publishedAt": "2023-05-27T11:37:39Z", "content": "So, here are seven high fibre vegetarian foods you must add in your diet:"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "Weekend reads: A Nobel winner's seventh retraction; Stanford's president fights back; what should go into a retraction notice - Retraction Watch", "description": "Would you consider a donation to support Weekend Reads, and our daily work? The week at Retraction Watch featured: Three journals’ web domains expired. Then major indexes pointed to hijac…", "url": "https://retractionwatch.com/2023/05/27/weekend-reads-a-nobel-winners-seventh-retraction-stanfords-president-fights-back-what-should-go-into-a-retraction-notice/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2021/07/rw.jpeg", "publishedAt": "2023-05-27T11:00:00Z", "content": "Would you consider a donation to support Weekend Reads, and our daily work?\r\nThe week at Retraction Watch featured:\r\nOur list of retracted or withdrawn COVID-19 papers is up to more than 300. There a… [+784 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Long COVID symptoms acquire firmer definition, threshold for diagnosis - EastMojo", "description": "After examining nearly 10,000 patients, researchers have outlined 12 symptoms that most set apart those with and without long COVID, the post-infection set of conditions that can affect nearly every tissue and organ in the body", "url": "http://www.eastmojo.com/world/2023/05/27/long-covid-symptoms-acquire-firmer-definition-threshold-for-diagnosis/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2023/02/Untitled-design-4-7.png?fit=1920%2C1080&ssl=1", "publishedAt": "2023-05-27T08:30:00Z", "content": "New Delhi: After examining nearly 10,000 patients, most of whom had COVID-19, researchers have outlined 12 symptoms that most set apart those with and without long COVID, the post-infection set of co… [+4330 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Sarah Palmer", "title": "Keep calm and eat kimchi: These are some of the best foods for tackling stress - Euronews", "description": "Which foods can help combat stress? Here are seven superfoods that have proven results.", "url": "https://www.euronews.com/next/2023/05/27/keep-calm-and-eat-kimchi-these-are-some-of-the-best-foods-for-tackling-stress", "urlToImage": "https://static.euronews.com/articles/stories/07/63/31/64/1000x563_cmsv2_02960e1d-0e62-5c6a-a74a-2dd1ebb50f90-7633164.jpg", "publishedAt": "2023-05-27T08:01:57Z", "content": "Which foods can help combat stress? Here are seven superfoods that have proven results.\r\n Stress-eaters, step forwards. Its easy to have a binge at the end of a bad day, or when youre especially burn… [+3905 chars]"}, {"source": {"id": null, "name": "Image.ie"}, "author": "IMAGE, IMAGE", "title": "Do you suffer from recurring UTIs? Your gut health may be the cause - image.ie", "description": "Irish pharmacist Oonagh O’Hagan breaks down everything we need to know about UTIs – causes, symptoms and treatments.", "url": "https://www.image.ie/self/do-you-suffer-from-recurring-utis-your-gut-health-may-be-the-cause-754282", "urlToImage": "https://imageirl.imageresizer.io/IwhtGiJVl2-s1280x720-q85.jpg", "publishedAt": "2023-05-27T08:00:32Z", "content": "What is a Urinary Tract Infection?\r\nA UTI most often occurs when bacteria infect the urinary tract, which can lead to uncomfortable symptoms. When bad bacteria bypass the bodys immune response, it ca… [+1465 chars]"}, {"source": {"id": null, "name": "Theindianpanorama.news"}, "author": "@theindpanorama", "title": "Over 800 million people globally may suffer back pain by 2050: Lancet study — The Indian Panorama - The Indian Panorama", "description": "Health | More than 840 million people worldwide will suffer back pain by 2050, largely due to population increase and the ageing people, according to a modelling", "url": "https://www.theindianpanorama.news/health/over-800-million-people-globally-may-suffer-back-pain-by-2050-lancet-study/", "urlToImage": null, "publishedAt": "2023-05-27T07:27:02Z", "content": "More than 840 million people worldwide will suffer back pain by 2050, largely due to population increase and the ageing people, according to a modelling study published in the Lancet Rheumatology jou… [+2122 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Jigyasa Sahay", "title": "Weight Loss: 8 Refreshing Drinks to Lower Belly Fat - India.com", "description": "Here are some summer drinks to help reduce belly fat.", "url": "https://www.india.com/webstories/health/weight-loss-8-refreshing-drinks-to-lower-belly-fat-6073666/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/05/bell-fat-drink2.jpeg", "publishedAt": "2023-05-27T07:12:47Z", "content": "Weight loss is not easy, but a dedicated regime makes it easier. It is better to consult professional before making changes in diet\r\nWeight loss is not just one thing. It is a combination of exercise… [+878 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Researchers Implement AI To Advance Drug Delivery System For Glaucoma And Other Chronic Diseases - India Education Diary", "description": "Wilmer Eye Institute, Johns Hopkins Medicine researchers say they have used artificial intelligence models and machine-learning algorithms to successfully predict which components of amino acids that make up therapeutic proteins are most likely to sa", "url": "https://indiaeducationdiary.in/researchers-implement-ai-to-advance-drug-delivery-system-for-glaucoma-and-other-chronic-diseases/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/peptide-ensign-newsroom-1024x576.jpg", "publishedAt": "2023-05-27T06:36:44Z", "content": "Wilmer Eye Institute, Johns Hopkins Medicine researchers say they have used artificial intelligence models and machine-learning algorithms to successfully predict which components of amino acids that… [+5623 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18 Travel Desk", "title": "The Growing Trend of Fermented Foods - CNBCTV18", "description": "Fermented foods are made by the process of fermentation, which is a natural process that uses microorganisms to convert carbohydrates into alcohol, acids, or other compounds. This process gives fermented foods their characteristic flavours and textures, and i…", "url": "https://www.cnbctv18.com/travel/food-and-drinks/the-growing-trend-of-fermented-foods-16779241.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2023/05/yoghurt-1019x573.jpg", "publishedAt": "2023-05-27T06:22:55Z", "content": "Fermented foods are made by the process of fermentation, which is a natural process that uses microorganisms to convert carbohydrates into alcohol, acids, or other compounds. This process gives ferme… [+1180 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Pfizer & Apollo launch Centre of Excellence for adult vaccination in Hyderabad - BSI bureau", "description": "To support and educate patients on the long-term benefits of vaccination for a wide range of diseases", "url": "https://www.biospectrumindia.com/news/98/23154/pfizer-apollo-launch-centre-of-excellence-for-adult-vaccination-in-hyderabad.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/1-23154.png", "publishedAt": "2023-05-27T05:02:27Z", "content": "To support and educate patients on the long-term benefits of vaccination for a wide range of diseases\r\nPfizer India, in collaboration with Apollo Hospital, has launched a Centre of Excellence (CoE) f… [+1157 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shifa Khan", "title": "Spices for wellness: How an Indian diet supports healthy ageing - Indiatimes.com", "description": "Indian diet and spices can help delay ageing. Read on to know more.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/spices-for-wellness-how-an-indian-diet-supports-healthy-ageing/photostory/100502125.cms", "urlToImage": "https://static.toiimg.com/photo/100502164.cms", "publishedAt": "2023-05-27T01:30:00Z", "content": "As we age, what we eat can impact our health, so it's important to put some thought into what we eat and drink. By embracing your cultural dishes which are prepared through locally and organically so… [+1511 chars]"}]}