{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "MedPage Today"}, "author": "Zaina Hamza", "title": "WHO: 650 Unusual Kids' Hepatitis Cases; Liver Cancer and DAAs; Shingles Risk in UC - Medpage Today", "description": "News and commentary from the world of gastroenterology and hepatology", "url": "https://www.medpagetoday.com/gastroenterology/generalgastroenterology/99012", "urlToImage": "https://assets.medpagetoday.net/media/images/99xxx/99012.jpg", "publishedAt": "2022-06-02T16:33:40Z", "content": "The World Health Organization announced that 650 cases of the unexplained severe acute hepatitis in children have been reported across 33 nations.\r\nMeanwhile, the New York Times profiled one of the 1… [+1694 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pandemic not over yet! Monkeypox cases rise over 550, infections spreading undetected, claims WHO - DNAIndiaNews", "description": "After claiming that the monkeypox infections, now spread to about 30 countries with more than 550 confirmed cases, can be contained, the World Health Organis...", "url": "https://www.youtube.com/watch?v=flsYyYn6IgU", "urlToImage": "https://i.ytimg.com/vi/flsYyYn6IgU/hqdefault.jpg", "publishedAt": "2022-06-02T16:10:32Z", "content": null}, {"source": {"id": null, "name": "WION"}, "author": "Moohita Kaur Garg", "title": "Amid Monkeypox outbreak, WHO warns about rising number of 'zoonotic' diseases. Here's what it means - WION", "description": "World Health Organization's emergencies director Mike Ryan has warned that outbreaks of endemic diseases such as Monkeypox and Lassa fever are becoming more persistent and frequent than ever.\r\n\r\nAs climate change contributes to the rapidly changing weather, a…", "url": "https://www.wionews.com/photos/amid-monkeypox-outbreak-who-warns-about-rising-number-of-zoonotic-diseases-heres-what-it-means-484510", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/photo_page/public/2022/06/02/267377-new-wion-41.jpg", "publishedAt": "2022-06-02T16:07:27Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Two cases of MIS-C after laboratory-confirmed SARS-CoV-2 breakthrough infections in fully vaccinated adolescent patients - News-Medical.Net", "description": "Researchers investigated whether COVID-19 vaccination effectively protected adolescents in the United States from multisystem inflammatory syndrome (MIS).", "url": "https://www.news-medical.net/news/20220602/Two-cases-of-MIS-C-after-laboratory-confirmed-SARS-CoV-2-breakthrough-infections-in-fully-vaccinated-adolescent-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_715574_1654181851531525.jpg", "publishedAt": "2022-06-02T15:07:00Z", "content": "In a recent study published in Emerging Infectious Diseases, researchers investigated whether coronavirus disease 2019 (COVID-19) vaccination effectively protected adolescents in the United States (U… [+4963 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "Women should exercise in the morning, men in evening: Study - The Siasat Daily", "description": "New York: It has been traditionally said that exercising is more beneficial during morning hours. Turns out, the effectiveness of exercise depends on sex, according to a study. The study, published in Frontiers in Physiology, showed that for women doing exerc…", "url": "https://www.siasat.com/women-should-exercise-in-the-morning-men-in-evening-study-2340194/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/11/exercise-_nov27.jpg", "publishedAt": "2022-06-02T14:10:00Z", "content": "New York: It has been traditionally said that exercising is more beneficial during morning hours. Turns out, the effectiveness of exercise depends on sex, according to a study.\r\nThe study, published … [+2619 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Deep Shukla", "title": "Cancer-killing virus injected into human for the first time in new clinical trial - Medical News Today", "description": "In a new clinical trial, a participant received an experimental anticancer drug called CF33-hNIS, or Vaxinia. This novel therapy involves using an oncolytic virus, a type of virus that can infect and kill cancer cells without harming healthy tissue.", "url": "https://www.medicalnewstoday.com/articles/cancer-killing-virus-injected-into-human-for-the-first-time-in-new-clinical-trial", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/06/virus-petri-dish-cance-thumb.jpg", "publishedAt": "2022-06-02T13:50:24Z", "content": "<ul><li>A recent clinical trial has started evaluating the safety and tolerability of a novel therapy involving a virus that can infect and kill human cancer cells.</li><li>The novel therapy called V… [+5834 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "NephroPlus busts myths associated with dialysis - ETHealthWorld", "description": "Although people receiving this therapy can continue with their lives normally, yet there are many myths about the treatment and what it does to your life.", "url": "https://health.economictimes.indiatimes.com/news/industry/nephroplus-busts-myths-associated-with-dialysis/91966299", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91966299,imgsize-1054541,width-1200,height-628,overlay-ethealthworld/nephroplus-busts-myths-associated-with-dialysis.jpg", "publishedAt": "2022-06-02T13:39:00Z", "content": "Hyderabad: Chronic Kidney Disease is a significant cause of morbidity and mortality worldwide. A recent WHO study reveals that chronic kidney disease is among the top 10 causes of death globally. Oth… [+3520 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "5 amazing coconut water and malai recipes to beat the heat - Hindustan Times", "description": "Not just coconut water, its malai or meat is packed with nutrients too. Here are 5 summer-special coconut water and malai recipes that you must try at home.", "url": "https://www.hindustantimes.com/lifestyle/recipe/5-amazing-coconut-water-and-malai-recipes-to-beat-the-heat-101654175981346.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/02/1600x900/coconut_recipes_thumb_1654176887854_1654176896820.jpg", "publishedAt": "2022-06-02T13:38:43Z", "content": "In the scorching summer heat, there is nothing quite as refreshing and cooling as coconut water with its natural electrolytes like potassium, sodium and manganese and amazing rehydration properties. … [+4585 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "A warning on India's high percentage of heart diseases in wake of KK's demise | Mint - Mint", "description": "Doctors say people get predisposed to coronary artery diseases due to genetic factors. Further, a sedentary lifestyle and lack of exercise also contribute to the disease", "url": "https://www.livemint.com/news/india/a-warning-on-india-s-high-percentage-of-heart-diseases-in-wake-of-kk-s-demise-11654172995687.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/heart_diseases_india_1654176382817_1654176383004.jpg", "publishedAt": "2022-06-02T13:27:38Z", "content": "As the whole nation mourns the death of famed singer KK, who passed away due to cardiac arrest recently, top health experts have warned about India's predisposition to heart diseases.  According to e… [+3345 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: How does COVID pneumonia look like, know the basic symptoms - Times of India", "description": "COVID pneumonia is a serious health condition which can wreak havoc on the lungs. It is one of the severe cases of COVID attack which can be fatal. COVID pneumonia is different from pneumonia as in the former the coronavirus takes over both the lungs at the s…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-how-does-covid-pneumonia-look-like-know-the-basic-symptoms/photostory/91963095.cms", "urlToImage": "https://static.toiimg.com/photo/91963224.cms", "publishedAt": "2022-06-02T12:30:00Z", "content": "\"In pneumonia, the lungs become filled with fluid and inflamed, leading to breathing difficulties. For some people, breathing problems can become severe enough to require treatment at the hospital wi… [+572 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "Monkeypox cases due to the side effect of AstraZenecaCovishield vaccine? Answer is here - Zee News", "description": "The global rise in monkeypox cases has led to a rash of social media posts, many claiming the chimpanzee adenovirus vector used in AstraZeneca s Covid vaccine, which has partnered with India to produce Covishield, is behind the outbreak and some suggesting th…", "url": "https://zeenews.india.com/world/monkeypox-cases-due-to-the-side-effect-of-astrazeneca/covishield-vaccine-answer-is-here-2469843.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/02/1049394-astrazeneca-monkeypox.png", "publishedAt": "2022-06-02T12:25:37Z", "content": "Monkeypox outbreak: The global rise in monkeypox cases has led to a rash of social media posts, many claiming the chimpanzee adenovirus vector used in AstraZeneca's Covid vaccine, which has partnered… [+3556 chars]"}, {"source": {"id": null, "name": "Webnewsobserver.com"}, "author": "https://www.facebook.com/webnewsobserver", "title": "7 Things that you should never eat on an empty stomach - Web News Observer", "description": "Fruits, oats, and other cereals. Most of us know what to eat on an empty stomach. However, how many of us know what not to consume on empty stomach? Not many,", "url": "https://webnewsobserver.com/7-things-that-you-should-never-eat-on-an-empty-stomach/", "urlToImage": "https://blaze.webnewsobserver.com/wp-content/uploads/2022/06/7-food-items-you-should-not-consume-on-an-empty-stomach-3.png", "publishedAt": "2022-06-02T11:09:44Z", "content": "Fruits, oats, and other cereals. Most of us know what to eat on an empty stomach. However, how many of us know what not to consume on empty stomach? Not many, for sure. Well, while there is a list of… [+3474 chars]"}, {"source": {"id": null, "name": "Updatenews360.com"}, "author": null, "title": "First case of monkeypox confirmed in Hungary - Updatenews360", "description": "Spread the loveHungarian health authorities have confirmed the country’s first case of monkeypox in a...", "url": "https://www.updatenews360.com/english/international/first-case-of-monkeypox-confirmed-in-hungary/", "urlToImage": "https://www.updatenews360.com/english/wp-content/uploads/2022/06/monkeypox.jpg", "publishedAt": "2022-06-02T10:45:13Z", "content": "Hungarian health authorities have confirmed the country’s first case of monkeypox in a 38-year-old man.\r\nThe disease does not spread easily, only through close contact, said the chief medical officer… [+477 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "How to recognise signs of mental disorder; psychiatrist offers tips - Hindustan Times", "description": "Mental disorders can be incredibly complex and unique. They often manifest themselves in different ways in different people. Here's how to recognise signs. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/how-to-recognise-signs-of-mental-disorder-psychiatrist-offers-tips-101654165234403.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/02/1600x900/mental_health_disorder_thumb_1654165330789_1654165343008.jpg", "publishedAt": "2022-06-02T10:26:31Z", "content": "Recognising mental illnesses is not easy as they can manifest differently in different people and even people who are diagnosed with the same mental disorder may exhibit an entirely different set of … [+2988 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "A biomarker in liquid biopsy for lung cancer can be reliable than tumour biopsy: Study - ThePrint", "description": "New York [US], June 2 (ANI): Mount Sinai researchers have proven that a simple blood test called a liquid biopsy can be a stronger predictor of whether cancer immunotherapy will work for a patient with lung cancer than an invasive tumour biopsy technique. The…", "url": "https://theprint.in/health/a-biomarker-in-liquid-biopsy-for-lung-cancer-can-be-reliable-than-tumour-biopsy-study/980699/", "urlToImage": null, "publishedAt": "2022-06-02T10:13:47Z", "content": "New York [US], June 2 (ANI): Mount Sinai researchers have proven that a simple blood test called a liquid biopsy can be a stronger predictor of whether cancer immunotherapy will work for a patient wi… [+2709 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "DH Web Desk", "title": "SII to launch India’s first indigenous HPV vaccine against cervical cancer - Deccan Herald", "description": "In a major push in the fight against cervical cancer, the Serum Institute of India (SII) is set to launch India’s first indigenous Human Papillomavirus (HPV) vaccine. According to a Livemint report, the Pune-based drugmaker hopes to introduce the vaccine in t…", "url": "https://www.deccanherald.com/national/sii-to-launch-india-s-first-indigenous-hpv-vaccine-against-cervical-cancer-1114604.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/06/02/human-papilloma-virus-inoculation-1-1099815-1649692502-1114604-1654162729.jpg", "publishedAt": "2022-06-02T09:38:49Z", "content": "In a major push in the fight against cervical cancer, the Serum Institute of India (SII) is set to launch Indias first indigenous Human Papillomavirus (HPV) vaccine. According to a Livemintreport, th… [+1259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "This ultrathin fuel cell could power body implants with electricity from blood glucose - The Indian Express", "description": "This fuel cell can convert the glucose in your blood into electricity so that medical implants and other in-body sensors can be powered without using batteries.", "url": "https://indianexpress.com/article/technology/science/this-ultrathin-fuel-cell-could-power-body-implants-with-electricity-from-blood-glucose-7949044/", "urlToImage": "https://images.indianexpress.com/2022/06/MIT_Sugar-Battery-01-press_0.jpg", "publishedAt": "2022-06-02T09:32:23Z", "content": "Engineers at MIT and the Technical University of Munich have designed a new type of glucose fuel cell that measures just 400 nanometres thick this means it is thinner than a sheet of paper that is ab… [+3216 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "West Nile fever: Common symptoms; how is it different from Malaria - Hindustan Times", "description": "West Nile virus is spread to humans through the bite of an infected female mosquito. The symptoms are mild and last a few days.  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/west-nile-fever-causes-common-symptoms-treatment-how-is-it-different-from-malaria-101654158175598.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/02/1600x900/4bf2cb16-d4db-11ec-ae80-64fe22456763_1652682434816_1654158415313.jpg", "publishedAt": "2022-06-02T08:32:36Z", "content": "A 47-year-old man from Kerala's Thrissur district, died of West Nile fever on Sunday after which the health department of the state is taking measures to control mosquito breeding. West Nile virus is… [+4907 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Shortage of anti-rabies serum in government hospitals in state - The Tribune India", "description": "Government hospitals in the state are running short of life-saving anti-rabies serum (ARS)&mdash; a costly medicine, given in a grade-3 bite. Consequent upon the shortage, poor patients have to pay a hefty price from their own pocket for the serum dose. Over …", "url": "https://www.tribuneindia.com/news/patiala/shortage-of-anti-rabies-serum-in-government-hospitals-in-state-400384", "urlToImage": "https://www.tribuneindia.com/images/Logo_eng.png", "publishedAt": "2022-06-02T07:41:00Z", "content": "Tribune News Service\r\nKaram Prakash\r\nPatiala, June 1\r\nGovernment hospitals in the state are running short of life-saving anti-rabies serum (ARS)— a costly medicine, given in a grade-3 bite. Consequen… [+1251 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Medtronic India unveils Pipeline Vantage Embolization Device with shield technology to treat Brain... - Medical Dialogues", "description": "Cerebral or brain aneurysm is a condition where there is a ballooning or weakening of the inside...", "url": "https://medicaldialogues.in/news/industry/medical-devices/medtronic-india-unveils-pipeline-vantage-embolization-device-with-shield-technology-to-treat-brain-aneurysms-93850", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/02/177766-pipeline-vantage.jpg", "publishedAt": "2022-06-02T07:09:35Z", "content": "Mumbai: India Medtronic Private Limited, a wholly-owned subsidiary of Medtronic plc a healthcare technology company, has announced the launch of CE marked fourth-generation flow diverter, Pipeline Va… [+2968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "K Srinath Reddy", "title": "Why has aspirin advice for heart protection changed? - The Indian Express", "description": "The recent change in guidelines, to dis-favour the routine use of aspirin, takes into account the reduction in anticipated benefits due to the increased protection being offered by other drugs and non-drug measures.", "url": "https://indianexpress.com/article/lifestyle/health/aspirin-heart-protection-risk-prevention-america-guidelines-7948784/", "urlToImage": "https://images.indianexpress.com/2022/06/asprin-1200.jpg", "publishedAt": "2022-06-02T07:00:58Z", "content": "For many decades, aspirin was advised to prevent heart attacks, both for those who had pre-existing cardiovascular disease (CVD) and for preventing coronary heart disease (CHD). Baby aspirin (low dos… [+9649 chars]"}, {"source": {"id": null, "name": "Apnlive.com"}, "author": "Tarannum Jahan", "title": "Heart Disease: Know difference between Cardiac Arrest, Heart Attack - APN Live", "description": "Renowned singer KK also died of heart attack on Tuesday. He was 53 years old. He was repeatedly seen wiping sweat during a live concert in Kolkata. After the performance was over, a video has surfaced all over the internet, in which KK can be seen not feeling…", "url": "https://apnlive.com/lifestyle/cardiac-arrest-heart-attack-kk/", "urlToImage": "https://d2r2ijn7njrktv.cloudfront.net/apnlive/uploads/2022/06/02120246/611eb6f534808700196832c8.webp", "publishedAt": "2022-06-02T06:48:50Z", "content": "It is very important to take care of cleanliness during the period. Maintaining hygiene during periods can reduce the risk of infection. Lack of hygiene during periods is a big problem for women heal… [+2350 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "New strategy may reduce fatigue after Covid vaccination: Study - The Week", "description": "Subcutaneous injection of the Covid-19 vaccines may reduce the adverse post-vaccination effects, such as fatigue, while still providing similar immune-system responses, according to a study in mice. Currently, mRNA-based Covid-19 vaccines are injected deep in…", "url": "https://www.theweek.in/news/health/2022/06/02/new-strategy-may-reduce-fatigue-after-covid-vaccination--study.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/2/10/empty-vials-of-Covishield-vaccine-vaccination-center-for-the-Covid-19-pti.jpg", "publishedAt": "2022-06-02T06:36:27Z", "content": "Subcutaneous injection of the Covid-19 vaccines may reduce the adverse post-vaccination effects, such as fatigue, while still providing similar immune-system responses, according to a study in mice.\r… [+2767 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stephen Moss", "title": "Geese, skuas, cranes and even foxes: avian flu takes growing toll on wildlife - The Guardian", "description": "One ecologist counted 160 dead wild birds while walking round a Scottish loch, and figures from other countries are just as worrying", "url": "https://amp.theguardian.com/environment/2022/jun/02/geese-skuas-cranes-foxes-avian-flu-takes-growing-toll-on-wildlife-aoe", "urlToImage": null, "publishedAt": "2022-06-02T06:30:00Z", "content": "The age of extinctionOne ecologist counted 160 dead wild birds while walking round a Scottish loch, and figures from other countries are just as worrying\r\nAs he walked along the shoreline of a Highla… [+5354 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How To Manage Kids With Asthma; Tips For Parents - News18", "description": "India is one of the leading countries in terms of concentrations of air pollution caused by various sources of exhaustion.", "url": "https://www.news18.com/news/lifestyle/how-to-manage-kids-with-asthma-tips-for-parents-5277613.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/asthma-165159853316x9.jpg", "publishedAt": "2022-06-02T06:08:17Z", "content": "Asthma is a chronic condition that can affect people of all ages. Asthma, among kids, is also becoming a major concern for parents these days.\r\nIf your kid is suffering from this chronic condition, t… [+1292 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "What should a diabetic keep in mind when having pumpkin? - The Indian Express", "description": "With a high GI, at 75, it is believed that pumpkin is not good for diabetes patients., said Preety Tyagi, a nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-patients-pumpkins-benefits-7941185/", "urlToImage": "https://images.indianexpress.com/2020/07/pumpkin-seeds-1200.jpg", "publishedAt": "2022-06-02T05:20:29Z", "content": "Diabetes, a condition caused by insufficient insulin in the blood or lack of proper movement of the same, has today become increasingly common in people of all age groups. It is one of the most commo… [+3226 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "K1 Keto life (Reviews) Beware of Shark Tank Scams Before Buy! - The Tribune India", "description": "Are you also looking to decrease weight to make your body attractive? Well, being overweight is one of the major causes that can cause several health problems. In modern society, people are eating lots of glucose and carbohydrates which tend to cause excessiv…", "url": "https://www.tribuneindia.com/news/brand-connect/k1-keto-life-reviews-beware-of-shark-tank-scams-before-buy-400338", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_1844081162.jpg", "publishedAt": "2022-06-02T04:56:00Z", "content": "Are you also looking to decrease weight to make your body attractive? Well, being overweight is one of the major causes that can cause several health problems. In modern society, people are eating lo… [+6318 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Amid monkeypox scare, Delhi directs govt hospitals to be on alert - India Today", "description": "A day after the Centre issued an advisory, the Delhi government directed all the hospitals to be on alert for any early symptoms of monkeypox.", "url": "https://www.indiatoday.in/cities/delhi/story/delhi-news-monkeypox-government-hospitals-on-alert-1957322-2022-06-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Monkeypox-647x363.jpeg?dIPbVRlOHs0jqsOFurunr_QjIRAEe0vj", "publishedAt": "2022-06-02T04:53:18Z", "content": "All the government hospitals in Delhi on Wednesday were directed to be on alert for any early symptoms of monkeypox and to ensure prompt reporting.\r\nThe Delhi government directed the hospitals a day … [+1452 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Brain cell activity is responsible for central nervous system disorder outcomes - ANI News", "description": "Los Angeles (California) [US], June 2 (ANI): According to a research led by the investigators at the Cedars-Sinai Medical Center, brain cell activities and the spinal cord is responsible for regulating the body's response to the central nervous systems (CNS) …", "url": "https://www.aninews.in/news/health/brain-cell-activity-is-responsible-for-central-nervous-system-disorder-outcomes20220602101800", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/650x350_nervous_system_overview_slideshow2022060204111220220602044714.jpg", "publishedAt": "2022-06-02T04:48:00Z", "content": "ANI | Updated: Jun 02, 2022 10:18 IST\r\nLos Angeles (California) [US], June 2 (ANI): According to a research led by the investigators at the Cedars-Sinai Medical Center, brain cell activities and the … [+3796 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Most difficult nutrients to get and how you can fix that - Times of India", "description": "To live a wholesome life, you need to eat right! A healthy, balanced diet is key to maintaining your overall health and fitness. However, even a plate full of nutrient-dense foods does not provide your body with all the vitamins and minerals it needs. While y…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/most-difficult-nutrients-to-get-and-how-you-can-fix-that/photostory/91941956.cms", "urlToImage": "https://static.toiimg.com/photo/91942027.cms", "publishedAt": "2022-06-02T03:30:00Z", "content": "To live a wholesome life, you need to eat right! A healthy, balanced diet is key to maintaining your overall health and fitness.\r\nHowever, even a plate full of nutrient-dense foods does not provide y… [+618 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Chetana Belagere", "title": "Asymptomatic Covid patients less likely to spread infection - The New Indian Express", "description": "Virologists in India say it may not be correct to completely dismiss the possibility of spread by asymptomatic patients.", "url": "https://www.newindianexpress.com/cities/bengaluru/2022/jun/02/asymptomatic-covid-patients-less-likely-to-spread-infection-2460750.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/6/1/w600X390/COVID_Gurugram.jpg", "publishedAt": "2022-06-02T01:42:00Z", "content": "BENGALURU: Asymptomatic Covid-19 patients were so far considered silent spreaders, however, a study claimed that people infected with SARS-CoV-2 but with no symptoms, are 66% less likely to pass on t… [+2756 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Finding the Biological Roots for the Pathological Social Withdrawal Known as 'Hikikomori' - Neuroscience News", "description": "Hikikomori is a mental health disorder identified as a pathological social withdrawal. Researchers have discovered a number of biomarkers in the blood associated with hikikomori.", "url": "https://neurosciencenews.com/hikikomori-social-withdrawal-biomarker-20722/", "urlToImage": "https://neurosciencenews.com/files/2022/06/social-isolation-biology-neurosinces-public.jpg", "publishedAt": "2022-06-01T23:25:32Z", "content": "Summary: Hikikomori is a mental health disorder identified as a pathological social withdrawal. Researchers have discovered a number of biomarkers in the blood associated with hikikomori.\r\nSource: Ky… [+6372 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Engineers Develop Nanoparticles That Cross the Blood-Brain Barrier - Neuroscience News", "description": "Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles can get into tumors and kill glioblastoma brain cancer cells.", "url": "https://neurosciencenews.com/bbb-nanoparticles-glioblastoma-20718/", "urlToImage": "https://neurosciencenews.com/files/2022/06/bbb-nanoparticles-neurosinces-public.jpg", "publishedAt": "2022-06-01T21:34:41Z", "content": "Summary: Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles … [+6811 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Africans see inequity in monkeypox response elsewhere - Daily Pioneer", "description": "As health authorities in Europe and elsewhere roll out vaccines and drugs to stamp out the biggest monkeypox outbreak beyond Africa, some doctors acknowledge an ugly reality: The resources to slow the disease's spread have long been available, just not to the…", "url": "https://www.dailypioneer.com/2022/world/africans-see-inequity-in-monkeypox-response-elsewhere.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-06-01T18:38:31Z", "content": "As health authorities in Europe and elsewhere roll out vaccines and drugs to stamp out the biggest monkeypox outbreak beyond Africa, some doctors acknowledge an ugly reality: The resources to slow th… [+899 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Diabetes: High blood sugar can affect vital organs, tips to keep your kidneys healthy - Times Now", "description": "Look around and you’ll find several people who suffer from diabetes. Diabetes is a major cause of kidney diseases and hence it is important that people with diabetes keep a regular check on their kidney health.", "url": "https://www.timesnownews.com/health/diabetes-high-blood-sugar-can-affect-vital-organs-tips-to-keep-your-kidneys-healthy-article-91945681", "urlToImage": "https://static.tnn.in/thumb/msid-91945681,imgsize-100,width-1280,height-720,resizemode-75/91945681.jpg", "publishedAt": "2022-06-01T17:16:18Z", "content": "KK death: 'ACs not working, 7000 people in auditorium against capacity of 3000' - BJP MP writes to Amit Shah"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Hearing Outcomes of Infants Born to Mothers With Active COVID-19 Infection - Cureus", "description": "Introduction\r\n\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and the ramifications on infant hearing. This retrospective s…", "url": "https://www.cureus.com/articles/99081-hearing-outcomes-of-infants-born-to-mothers-with-active-covid-19-infection", "urlToImage": "https://assets.cureus.com/uploads/figure/file/380347/article_river_b291b230d80d11eca5df6d9ad78e20f8-image.png", "publishedAt": "2022-06-01T17:13:32Z", "content": "Introduction\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and… [+22369 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research: Diet unlikely to ease osteoarthritis, rheumatoid arthritis progression - ANI News", "description": "Washington [US], June 1 (ANI): A review of the existing scientific evidence has found that diet is unlikely to make any difference in the progression of osteoarthritis and rheumatoid arthritis.", "url": "https://www.aninews.in/news/health/research-diet-unlikely-to-ease-osteoarthritis-rheumatoid-arthritis-progression20220601214649", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/Arthritis_june2022010215540720220601155659.jpg", "publishedAt": "2022-06-01T16:16:00Z", "content": "ANI | Updated: Jun 01, 2022 21:46 IST\r\nWashington [US], June 1 (ANI): A review of the existing scientific evidence has found that diet is unlikely to make any difference in the progression of osteoar… [+3954 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Anna Gora", "title": "The best vegan sources of protein to include in your diet - Livescience.com", "description": "These eight vegan sources of protein can help you to lose weight and build muscle", "url": "https://www.livescience.com/the-best-vegan-sources-of-protein", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CgobpYZBAEHxX2etwY75wT-1200-80.jpg", "publishedAt": "2022-06-01T16:00:04Z", "content": "If you’ve just decided to go vegan, you’re probably wondering where to find the best vegan sources of protein. No wonder – for most people, switching to a plant-based lifestyle means completely overh… [+11655 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "This one food can help reduce diabetes type 2 and LDL levels naturally - Times of India", "description": "There’s no denying that the high triglyceride levels and insulin imbalance are some of the major reasons why disorders like type 2 diabetes and high cholesterol happen, but did you know just modifying your diet with this one food can fix it all! Yes, it's tru…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/this-one-food-can-help-reduce-diabetes-and-cholesterol-naturally/photostory/91944245.cms", "urlToImage": "https://static.toiimg.com/photo/91944286.cms", "publishedAt": "2022-06-01T14:30:00Z", "content": "There are several ways to include oats in your diet given below:\r\nOats smoothie and shake: \r\nMake your fruit and vegetable smoothies and shakes healthier and heavy by adding soaked oats. This will he… [+738 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Lorraine L. Janeczko, MPH", "title": "TDF Use in HBV-HIV Coinfection Linked With Kidney, Bone Issues - Medscape", "description": "Kidney function and bone turnover may worsen in patients who are coinfected with HBV and HIV and take tenofovir disoproxil fumarate (TDF), researchers report.", "url": "https://www.medscape.com/viewarticle/974867", "urlToImage": "https://img.medscape.com/thumbnail_library/ht_190510_truvada_800x450.jpg", "publishedAt": "2022-06-01T14:11:03Z", "content": "Patients coinfected with hepatitis B virus (HBV) and human immunodeficiency virus (HIV) who take tenofovir disoproxil fumarate (TDF) may have worsening renal function and bone turnover, according to … [+6041 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Reasons Behind Delayed or Irregular Menstrual Cycle - News18", "description": "The common causes can range from hormonal imbalances to serious medical conditions", "url": "https://www.news18.com/news/lifestyle/reasons-behind-delayed-or-irregular-menstrual-cycle-5277601.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/periods-163855917716x9.jpg", "publishedAt": "2022-06-01T13:38:22Z", "content": "There are many factors from changes in sleeping cycle to stress which can affect the menstrual cycle. Being pregnant is a possible reason for a missed period but there are also other factors that aff… [+1933 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Ayurveda tips to improve metabolism; dos and don'ts you must remember - Hindustan Times", "description": "Having a slow metabolism not only leads to weight gain but a series of health issues from skin troubles, hair loss, chronic fatigue, to unhealthy cravings. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/ayurveda-tips-to-improve-metabolism-dos-and-don-ts-you-must-remember-101654088955078.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/metabolism_1654089069171_1654089079489.jpg", "publishedAt": "2022-06-01T13:15:43Z", "content": "Having a good metabolism is important for the healthy functioning of the body. It is the process by which your body converts what you consume into energy. Having a slow metabolism not only leads to w… [+2452 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Swine flu outbreak: 3 H1N1 cases detected in Madhya Pradesh's Indore | Mint - Mint", "description": "Two men and a woman, who have been infected with the H1N1 virus, are undergoing treatment at a local hospital and their condition is said to be stable.", "url": "https://www.livemint.com/news/india/swine-flu-outbreak-3-h1n1-cases-detected-in-madhya-pradesh-s-indore-11654088428696.html", "urlToImage": "https://images.livemint.com/img/2022/06/01/600x338/Swine_Flu_1654089009996_1654089010178.PNG", "publishedAt": "2022-06-01T13:11:30Z", "content": "Three persons have been found to be infected with swine flu in Madhya Pradesh's Indore and they are currently undergoing treatment for the same, a state health official informed on Wednesday.   Chief… [+1426 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid caused collateral damage to global cardiac services: Study - ETHealthWorld", "description": "Disruption to cardiac services during the Covid-19 pandemic has caused a \"global collateral damage\" that may have lasting ramifications, according to a study published on Tuesday.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-caused-collateral-damage-to-global-cardiac-services-study/91941996", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91941996,imgsize-1079511,width-1200,height-628,overlay-ethealthworld/covid-caused-collateral-damage-to-global-cardiac-services-study.jpg", "publishedAt": "2022-06-01T13:00:00Z", "content": "London, Disruption to cardiac services during the Covid-19 pandemic has caused a \"global collateral damage\" that may have lasting ramifications, according to a study published on Tuesday.In the paper… [+3241 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Twitching can be a Warning Sign of Cancer, Look for These Symptoms - News18", "description": "Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywhere in the body", "url": "https://www.news18.com/news/lifestyle/twitching-can-be-a-warning-sign-of-cancer-look-for-these-symptoms-5273911.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/world-cancer-day-164821611916x9.png", "publishedAt": "2022-06-01T12:58:35Z", "content": "A dreadful disease, cancer can affect any part of the human body including blood, bones, lungs or liver. Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywher… [+1778 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Bowl Method Can Help You Keep Your Calorie Intake In Check - News18", "description": "The bowl method simply involves choosing a small bowl to measure the portions of your food to prevent you from overeating", "url": "https://www.news18.com/news/lifestyle/how-bowl-method-can-help-you-keep-your-calorie-intake-in-check-5290369.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/untitled-design-8-165408126916x9.png", "publishedAt": "2022-06-01T11:02:14Z", "content": "Losing weight and going for a lean look is something almost everyone desires. While many of you may be training regularly in the gym and trying to shed those extra kilos, your diet plays an equally i… [+1573 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Eleanor Bird, M.S.", "title": "Monkeypox treatment: Smallpox antiviral shows promise - Medical News Today", "description": "A study looking at seven previous cases of monkeypox in the U.K. suggests that tecovirimat, an antiviral used against smallpox, may also treat monkeypox.", "url": "https://www.medicalnewstoday.com/articles/monkeypox-small-study-points-to-a-promising-antiviral", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/05/Antiviral-pills-factory-monkeypox-thumb.jpg", "publishedAt": "2022-06-01T11:00:33Z", "content": "<ul><li>In a new study, researchers describe seven cases of monkeypox that occurred in the United Kingdom between 2018 and 2021, the first cases of in-hospital and household transmission outside of A… [+6851 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Science has proof of how bad diet can lead to bad memory - ThePrint", "description": "Campus Voice is an initiative by ThePrint where young Indians get an opportunity to express their opinions on a prevalent issue.", "url": "https://theprint.in/campus-voice/science-has-proof-of-how-bad-diet-can-lead-to-bad-memory/976669/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2019/10/bacon-burger-beef-burger.jpg", "publishedAt": "2022-06-01T09:16:56Z", "content": "Strong immunity building is a drawing-room conversation in every house, especially after Covid. Despite an increased interest in the concept of immunity, most of the time we fail to put a stop to our… [+3836 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Queen Mary University of London: Queen Mary researchers receive prestigious MRC grant for collaborative research project to better understand human disease - India Education Diary", "description": "This funding is a result of MRC’s competitive multimodal research funding call, which awards £7 million over three years to seven new collaborative research projects that aim to gain a greater understanding of human disease. These research projects w", "url": "https://indiaeducationdiary.in/queen-mary-university-of-london-queen-mary-researchers-receive-prestigious-mrc-grant-for-collaborative-research-project-to-better-understand-human-disease/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/Queen-Mary-University-of-London.jpg", "publishedAt": "2022-06-01T08:46:17Z", "content": "This funding is a result of MRCs competitive multimodal research funding call, which awards £7 million over three years to seven new collaborative research projects that aim to gain a greater underst… [+1645 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: 8 Sweet Snacks Safe For Diabetics - NDTV", "description": "Eating something delicious if you are craving something sweet is not ideal if you have diabetes. Here are sweet snacks completely safe for diabetics.", "url": "https://www.ndtv.com/health/diabetes-8-sweet-snacks-safe-for-diabetics-3026251", "urlToImage": "https://c.ndtvimg.com/2020-05/i3hiuje8_chia-pudding_625x300_08_May_20.jpg", "publishedAt": "2022-06-01T06:43:01Z", "content": "Chia pudding is a healthy and sweet snack for diabetics\r\nDiabetes is caused as a response to resistance to insulin in the cells. Insulin is the hormone that helps regulate the glucose levels in the b… [+3415 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Thyroid: Types of disorders, risk factors, symptoms, tests - Hindustan Times", "description": "Here's all you need to know about thyroid hormones in normal health and disease conditions, the types of disorders due to imbalance in thyroid hormones, their symptoms and protocol for testing of thyroid diseases | Health", "url": "https://www.hindustantimes.com/lifestyle/health/thyroid-types-of-disorders-due-to-imbalance-in-thyroid-hormones-risk-factors-symptoms-protocol-for-testing-of-thyroid-diseases-101654063659006.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/FTzTfeQXsAMtjXR_1654064055678_1654064078267.jpg", "publishedAt": "2022-06-01T06:25:51Z", "content": "The thyroid gland, located in the front of the neck, is the main source of thyroid hormones in the body and hypothalamic thyrotropin-releasing hormone (TRH) stimulates thyroid-stimulating hormone (TS… [+6465 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Acute stress may hamper body’s fight against Covid, influenza: Study - EastMojo", "description": "Washington: Acute stress may impair the body's ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a", "url": "http://www.eastmojo.com/world/2022/06/01/acute-stress-may-hamper-bodys-fight-against-covid-influenza-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/05/Untitled-design-8-13.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-06-01T06:10:00Z", "content": "Washington: Acute stress may impair the bodys ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a study conducted in mice.\r\nThe research, published … [+3621 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "IIT-D study reveals mechanisms driving SARS-CoV-2 evolution in humans - BioSpectrum India", "description": "The results lay the necessary groundwork for future studies", "url": "https://www.biospectrumindia.com/news/58/21351/iit-d-study-reveals-mechanisms-driving-sars-cov-2-evolution-in-humans.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/shutterstock_281615630-21351.jpg", "publishedAt": "2022-06-01T05:56:28Z", "content": "A team of researchers at the Indian Institute of Technology Delhi (IIT-D) has discovered the existence of temporal variations in selection pressures during SARS-CoV-2 evolution and adaptation to the … [+1222 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Esha Chainani", "title": "The Issue With Seeing PCOS As Just a 'Period Problem' - The Swaddle", "description": "People think of PCOS as a purely physical problem that occurs a few days a month, as opposed to a chronic condition that reduces the overall quality of life.", "url": "https://theswaddle.com/the-issue-with-seeing-pcos-as-just-a-period-problem/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/06/PCOS-Editorials-min.png", "publishedAt": "2022-06-01T03:48:00Z", "content": "I constantly feel like Im a fat waste of space. These were the exact words Rekha*, 23 said when asked about her mental health during my consultation with her. \r\nAs a gynecologist in Mumbai specializi… [+8623 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "Paint your plate with colour: A meal packed with phytonutrients - Hindustan Times", "description": "From the health benefits of phytonutrients to the quantity of consumption that should be followed, here is all that you need to know. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/paint-your-plate-with-colour-a-meal-packed-with-phytonutrients-101654055021107.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/veggies_1653488130974_1654055055020.jpg", "publishedAt": "2022-06-01T03:46:30Z", "content": "Phytonutrients are natural compounds found in fruits, vegetables and whole grain products which helps in working with other essential nutrients in promoting good health. Phytonutrients come with mult… [+2335 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Eye health tips: Excessive heat can harm your eyes. Here's how to keep them safe - Hindustan Times", "description": "The eyes are one of the most commonly affected body parts during summers as the scorching heat of the sun is extremely harmful for eye health. As a result, extra care and attention to the eyes are required during this time. Follow these guidelines to keep the…", "url": "https://www.hindustantimes.com/lifestyle/health/eye-health-tips-excessive-heat-can-harm-your-eyes-here-s-how-to-keep-them-safe-in-summers-101654052006488.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/pexels-engin-akyurt-1552583_1654052488738_1654052509381.jpg", "publishedAt": "2022-06-01T03:12:32Z", "content": "Health experts insist that extra care and attention to the eyes are required during this time as people are battling not only intense heat waves but also the diseases that come with them as the mercu… [+5419 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Does coffee protect against liver cancer, melanomas, oral and pharyngeal cancers OR causes the disease? A doct - Times Now", "description": "Dr Prasad Kasbekar, Consultant Surgical Oncologist, Masina Hospital, Byculla, Mumbai cites that studies suggest that coffee is not associated with cancers in general. A few studies have been associating coffee with the risk of bladder cancer and lung cancer, …", "url": "https://www.timesnownews.com/health/does-coffee-protect-against-liver-cancer-melanomas-oral-and-pharyngeal-cancers-or-causes-the-disease-a-doctor-explains-article-91929025", "urlToImage": "https://static.tnn.in/thumb/msid-91929025,imgsize-100,width-1280,height-720,resizemode-75/91929025.jpg", "publishedAt": "2022-06-01T01:15:45Z", "content": "Stocks to track in trade for June 02, 2022: RIL, Greaves Cotton, NMDC, Yes Bank, Religare, PDS"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Kendall K. Morgan", "title": "Could over-the-counter pain relievers be making your back pain worse? - Fortune", "description": "New science suggests that taking anti-inflammatory medicine to treat back pain may backfire.", "url": "https://fortune.com/2022/05/31/anti-inflammatory-medicines-increase-risk-chronic-low-back-pain/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2022/05/GettyImages-1148111575-e1654014334374.jpg?resize=1200,600", "publishedAt": "2022-05-31T22:30:00Z", "content": "Skip to Content"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Acute Myocardial Infarction After COVID-19 Vaccination: A Case Report - Cureus", "description": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine across the globe, various cases were reported with thrombotic ev…", "url": "https://www.cureus.com/articles/94893-acute-myocardial-infarction-after-covid-19-vaccination-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/362096/article_river_a05d5a90bc9e11ecb6c169d390228567-Figure-1.png", "publishedAt": "2022-05-31T17:39:04Z", "content": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine acro… [+12842 chars]"}]}