{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Healthy eating: Do we need portion control? A nutritionist on tips to eat right - Hindustan Times", "description": "While portion control is considered a healthy way to curb overeating and maintaining a healthy weight, it could also mean not following body cues and eating mechanically rather than mindfully. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/healthy-eating-do-we-need-portion-control-a-nutritionist-on-tips-to-eat-right-101662364658986.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/05/1600x900/portion_control_1662364896743_1662364910878_1662364910878.jpg", "publishedAt": "2022-09-05T08:06:03Z", "content": "Portion control is a method of eating where one consumes a specific amount of food while being conscious about the calorie intake. While portion control is considered a healthy way to curb overeating… [+1572 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "How a walk or jog daily between 20 and 40 minutes can lower the risk of heart failure by over 60 per cent - The Indian Express", "description": "UK study only reinforces the need to make physical activity a habit instead of vigorously working out every once in a while. You cannot work out a lot for a month and then discontinue. Your activity has to be consistent and reasonable that can easily be accom…", "url": "https://indianexpress.com/article/lifestyle/health-specials/how-a-walk-or-jog-daily-between-20-and-40-minutes-can-lower-the-risk-of-heart-failure-by-over-60-per-cent-8132027/", "urlToImage": "https://images.indianexpress.com/2022/09/walking-759-getty-images.jpg", "publishedAt": "2022-09-05T08:01:38Z", "content": "You just need 150 to 300 minutes of walking or 75 to 100 minutes of jogging every week to reduce your risk of heart failure by two-thirds. According to a UK study that tracked 95,000 people, moderate… [+3390 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Pretoria: Study reveals aggressive prostate cancer linked to ancestral heritage - India Education Diary", "description": "Two pioneering studies published simultaneously today in Nature and Genome Medicine have identified genetic signatures explaining ethnic differences in the severity of prostate cancer, particularly in sub-Saharan Africa.Through genetic sequencing of", "url": "https://indiaeducationdiary.in/university-of-pretoria-study-reveals-aggressive-prostate-cancer-linked-to-ancestral-heritage/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/download-11-2.jpg?fit=275%2C183&ssl=1", "publishedAt": "2022-09-05T07:58:19Z", "content": "Two pioneering studies published simultaneously today in Nature and Genome Medicine have identified genetic signatures explaining ethnic differences in the severity of prostate cancer, particularly i… [+5236 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Legionnaires' disease claims fifth life in Argentina: officials - ETHealthWorld", "description": "An Argentine laboratory identified the disease as Legionnaires' after ruling out Covid-19, flu and hantavirus.", "url": "https://health.economictimes.indiatimes.com/news/industry/legionnaires-disease-claims-fifth-life-in-argentina-officials/93997686", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93997686,imgsize-162520,width-1200,height-628,overlay-ethealthworld/legionnaires-disease-claims-fifth-life-in-argentina-officials.jpg", "publishedAt": "2022-09-05T07:45:00Z", "content": "Buenos Aires: Legionnaires' disease has claimed a fifth life among patients and staff at a clinic in northern Argentina, provincial health officials announced Sunday.The health ministry in Tucuman pr… [+868 chars]"}, {"source": {"id": null, "name": "Techpluto.com"}, "author": "Prashant Sharma", "title": "Health Challenges Faced by Entrepreneurs - TechPluto", "description": "As an entrepreneur, your health is always at risk. Here are some of the health challenges faced by entrepreneurs and how to overcome them.", "url": "https://www.techpluto.com/health-challenges-faced-by-entrepreneurs/", "urlToImage": "http://www.techpluto.com/wp-content/uploads/2022/09/getty_177556195_222561.jpg", "publishedAt": "2022-09-05T06:20:26Z", "content": "There’s nothing easy about being an entrepreneur. Not only do you have to be creative and come up with new ideas, but you also have to be passionate and driven to make them happen. And on top of all … [+11398 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Diabetes: Foods and beverages to avoid if you have high blood sugar - Times Now", "description": "While medications are important to control the rising level, diet and lifestyle too play a crucial role in curbing high blood sugar levels. Therefore, it is a necessity that you keep a check on what you are eating or drinking so that it does not lead to sugar…", "url": "https://www.timesnownews.com/health/diabetes-foods-and-beverages-to-avoid-if-you-have-high-blood-sugar-article-93995496", "urlToImage": "https://static.tnn.in/thumb/msid-93995496,imgsize-100,width-1280,height-720,resizemode-75/93995496.jpg", "publishedAt": "2022-09-05T05:08:55Z", "content": "Fruit juices are a big no for people with diabetes. These beverages can lead to a rise in the blood sugar levels due to the presence of added sugar in them. Moreover, the fructose present in them mak… [+22 chars]"}, {"source": {"id": null, "name": "Newsdayexpress.com"}, "author": "Bhagyashree", "title": "If all the measures fail then start drinking these 5 drinks, bad cholesterol will start decreasing - News Day Express", "description": "What is cholesterol? Cholesterol is a wax-like substance that helps make cells and hormones for the body. However, too much cholesterol can dilate, harden", "url": "https://www.newsdayexpress.com/lifestyle/health/if-all-the-measures-fail-then-start-drinking-these-5-drinks-bad-cholesterol-will-start-decreasing/", "urlToImage": "https://static.langimg.com/thumb/msid-93995608,width-680,resizemode-3/93995608.jpg", "publishedAt": "2022-09-05T04:58:51Z", "content": "What is cholesterol? Cholesterol is a wax-like substance that helps make cells and hormones for the body. However, too much cholesterol can dilate, harden and block your arteries, leading to blood cl… [+2904 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "AI model detects COVID-19 infection in people’s voices - News-Medical.Net", "description": "Artificial intelligence (AI) can be used to detect COVID-19 infection in people's voices by means of a mobile phone app, according to research to be presented on Monday at the European Respiratory Society International Congress in Barcelona, Spain.", "url": "https://www.news-medical.net/news/20220905/AI-model-detects-COVID-19-infection-in-peoplee28099s-voices.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/futuristic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg", "publishedAt": "2022-09-05T04:45:00Z", "content": "Artificial intelligence (AI) can be used to detect COVID-19 infection in people's voices by means of a mobile phone app, according to research to be presented on Monday at the European Respiratory So… [+9649 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Bats pose little zoonotic danger to humans, study says - News-Medical.Net", "description": "A new Tel Aviv University study rejects assertions, according to which the origin of the COVID-19 outbreak is in bats. According to the study, bats have a highly effective immune system that enables them to deal relatively easily with viruses considered letha…", "url": "https://www.news-medical.net/news/20220905/Bats-pose-little-zoonotic-danger-to-humans-study-says.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/antibody_in_pink_and_red_background_selective_focus_3d_art_-_Mirror-Images_A1_71b890c58eb74b42a6490cfe1b003dce-620x480.jpg", "publishedAt": "2022-09-05T04:33:00Z", "content": "A new Tel Aviv University study rejects assertions, according to which the origin of the COVID-19 outbreak is in bats. According to the study, bats have a highly effective immune system that enables … [+4166 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Anticovid Treatments That Should No Longer Be Used - Nation World News", "description": "In the world, more than 600 million people have been diagnosed with COVID-19 since the start of the pandemic and more than 6.4 million people have lost the", "url": "https://nationworldnews.com/anticovid-treatments-that-should-no-longer-be-used/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/09/Anticovid-treatments-that-should-no-longer-be-used.jpg", "publishedAt": "2022-09-05T04:03:16Z", "content": "In the world, more than 600 million people have been diagnosed with COVID-19 since the start of the pandemic and more than 6.4 million people have lost the battle to this virus. Effective vaccines ha… [+3705 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Low testosterone associated with increased risk of COVID 19 hospitalization for men - Medical Dialogues", "description": "Among men diagnosed with COVID-19, those with low testosterone levels are more likely to become...", "url": "https://medicaldialogues.in/mdtv/medicine/videos/low-testosterone-associated-with-increased-risk-of-covid-19-hospitalization-for-men-98573", "urlToImage": "https://medicaldialogues.in/images/logo.png", "publishedAt": "2022-09-05T03:45:54Z", "content": "Isra Zaman\r\nB.Sc Life Sciences, M.Sc Biotechnology, B.Ed"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A mother's diet during pregnancy is linked to her child's food preferences - News-Medical.Net", "description": "Researchers examine the relationship between the quality of the mother’s diet during pregnancy and with appetitive traits of offspring at five years.", "url": "https://www.news-medical.net/news/20220904/A-mothers-diet-during-pregnancy-is-linked-to-her-childs-food-preferences.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_724237_16623414219644029.jpg", "publishedAt": "2022-09-05T01:40:00Z", "content": "Diet during pregnancy is an important factor in determining the health of the developing fetus and neonate after birth. However, there is little known about how diet quality during pregnancy affects … [+5132 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Most Common Food Allergies - Nation World News", "description": "An allergy to a particular food occurs when the body reacts to a harmless protein found in that food. The reaction usually occurs soon after eating the food.", "url": "https://nationworldnews.com/most-common-food-allergies/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/09/most-common-food-allergies-450x300.jpg", "publishedAt": "2022-09-05T01:32:42Z", "content": "The reaction usually occurs soon after eating the food. These reactions can range from mild to severe.\r\n An allergy to a particular food occurs when the body reacts to a harmless protein found in tha… [+3632 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The brain and fat communicate directly - News-Medical.Net", "description": "Researchers examine the sensory innervation of fat cells within subcutaneous fat deposits.", "url": "https://www.news-medical.net/news/20220904/The-brain-and-fat-communicate-directly.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_724236_16623399268581869.jpg", "publishedAt": "2022-09-05T01:30:00Z", "content": "With rising rates of obesity and related metabolic diseases being reported worldwide, researchers have struggled to understand the functional status of fatty tissue in the body in relation to overall… [+6829 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sounak Mukhopadhyay", "title": "Monkeypox vaccines: India puts emergency buying on hold for now - here’s why | Mint - Mint", "description": "The Central government has decided to postpone making an emergency purchase of the monkeypox vaccine.", "url": "https://www.livemint.com/news/india/monkeypox-vaccines-india-puts-emergency-buying-on-hold-for-now-here-s-why-11662339735313.html", "urlToImage": "https://images.livemint.com/img/2022/09/05/600x338/monkeypox_sampling_1658402347598_1662339953770_1662339953770.jpg", "publishedAt": "2022-09-05T01:09:09Z", "content": "According to those with knowledge of the situation, India has chosen to delay purchasing the monkeypox vaccine on an emergency basis for the time being because the number of cases reported across the… [+2373 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Catherine Caruso", "title": "How To Eat Healthy When You're Dealing With Depression - Health Digest", "description": "When you&#039;re depressed, it can be hard to maintain a healthy and well-balanced diet. For some people with depression, this means not getting enough nutrients.", "url": "https://www.healthdigest.com/988301/how-to-eat-healthy-when-youre-dealing-with-depression/", "urlToImage": "https://www.healthdigest.com/img/gallery/how-to-eat-healthy-when-youre-dealing-with-depression/l-intro-1661959308.jpg", "publishedAt": "2022-09-05T01:00:00Z", "content": "Fortunately, there are a few steps you can take to help you eat healthier when you're feeling depressed. According to WebMD, cooking and sharing a meal with a friend or loved one can help improve you… [+876 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "A Clinical Encounter With Pickwickian Syndrome - Cureus", "description": "The clinical syndrome described in the literature as \"Pickwickian syndrome\" is characterized by a combination of sleep-disordered breathing, obesity, and daytime hypercapnia; the condition is also known as obesity hypoventilation syndrome (OHS). This syndrome…", "url": "https://www.cureus.com/articles/112896-a-clinical-encounter-with-pickwickian-syndrome", "urlToImage": "https://assets.cureus.com/uploads/figure/file/439217/article_river_45ac3dd0229911edb2b54b2df0f3673a-clinical-image-reupload-1.png", "publishedAt": "2022-09-05T00:29:35Z", "content": "The clinical syndrome described in the literature as \"Pickwickian syndrome\" is characterized by a combination of sleep-disordered breathing, obesity, and daytime hypercapnia; the condition is also kn… [+11837 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Sleeping Habits Increase The Risk Of Heart Disease By 54 Percent. - Nation World News", "description": "Sleeping less than seven hours or more than eight hours can harden the arteries and lead to heart disease or stroke. According to one study, the incidence of", "url": "https://nationworldnews.com/sleeping-habits-increase-the-risk-of-heart-disease-by-54-percent/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/09/Sleeping-habits-increase-the-risk-of-heart-disease-by-54.jpg", "publishedAt": "2022-09-04T23:54:36Z", "content": "People who ignore this risk factor are at increased risk of heart disease or stroke.\r\nSleeping less than seven hours or more than eight hours can harden the arteries and lead to heart disease or stro… [+8167 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Patients hail new treatment for drug-resistant TB - Japan Today", "description": "Volodymyr celebrated a major milestone on Aug 31 -- it's his final day of taking a new treatment hailed as a turning point in the fight against drug-resistant tuberculosis. The 25-year-old doctor in Ukraine's capital Kyiv said he had nasty neurological side e…", "url": "https://japantoday.com/category/features/health/'beginning-of-the-end'-patients-hail-new-treatment-for-drug-resistant-tb", "urlToImage": null, "publishedAt": "2022-09-04T20:06:00Z", "content": "Volodymyr celebrated a major milestone on Aug 31 -- it's his final day of taking a new treatment hailed as a turning point in the fight against drug-resistant tuberculosis.\r\nThe 25-year-old doctor in… [+3875 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "M. Sai Gopal", "title": "Sewage surveillance system to help track monkeypox, dengue in Hyderabad - Telangana Today", "description": "Taking the robust wastewater surveillance model to the next level, the researchers have already started tracking other infectious diseases like monkeypox, dengue in small and medium-sized urban centres in India.", "url": "https://telanganatoday.com/sewage-surveillance-system-to-help-track-monkeypox-dengue-in-hyderabad", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2022/09/Monkeypox.jpg", "publishedAt": "2022-09-04T18:58:51Z", "content": null}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Fatima Shakeel", "title": "This Is The Fascinating Reason Mosquitoes Always Seem To Find You Wherever You Go - Wonderful Engineering", "description": "Advertisement Every year, around 700,000 people die as a result of the viruses transmitted by mosquitoes. The diseases include dengue, Zika, yellow fever, and chikungunya. Thus, in order to determine the factors that attract mosquitoes to human blood, a resea…", "url": "https://wonderfulengineering.com/this-is-the-fascinating-reason-mosquitoes-always-seem-to-find-you-wherever-you-go/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/08/ezgif-2-4f1b1a8965.jpg", "publishedAt": "2022-09-04T18:50:12Z", "content": "Every year, around 700,000 people die as a result of the viruses transmitted by mosquitoes. The diseases include dengue, Zika, yellow fever, and chikungunya. Thus, in order to determine the factors t… [+2552 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Promising Therapy for Hard-To-Treat Depression: Deep Brain Stimulation - SciTechDaily", "description": "A study finds that deep brain stimulation to areas of the brain associated with reward and motivation could be used as a potential treatment for depression. According to researchers at the University of Texas Health Science Center at Houston, deep brain stimu…", "url": "https://scitechdaily.com/a-promising-therapy-for-hard-to-treat-depression-deep-brain-stimulation/", "urlToImage": "https://scitechdaily.com/images/Brain-Pain-Depression.jpg", "publishedAt": "2022-09-04T18:45:21Z", "content": "The National Institutes of Health estimate that in 2020, approximately 21.0 million individuals had at least one major depressive episode in the United States.\r\nA study finds that deep brain stimulat… [+3409 chars]"}, {"source": {"id": null, "name": "Youthistaan.com"}, "author": "Nalin Bisht", "title": "Lack of sleep is also a disease, what to do? - Youthistaan", "description": "One third of the adults in our country are suffering from insomnia and out of these 6 from 10 Seriously, then. A person who is unable to sleep at all three nights in a week for three consecutive month", "url": "https://youthistaan.com/lack-of-sleep-is-also-a-disease-what-to-do/", "urlToImage": "https://www.nayaindia.com/wp-content/uploads/2022/04/doctor.jpg", "publishedAt": "2022-09-04T18:41:27Z", "content": "One third of the adults in our country are suffering from insomnia and out of these 6 from 10 Seriously, then. A person who is unable to sleep at all three nights in a week for three consecutive mont… [+5445 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Swapnil Mishra", "title": "Mumbai: Amid rise in humidity, fungal infection also on rise - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/mumbai-amid-rise-in-humidity-fungal-infection-also-on-rise", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2020-08/0b09824f-6b11-4976-b021-204fff7863eb/virus_4835301_1920.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-09-04T17:17:00Z", "content": "One out of every five patients who visit the clinics suffer from a fungal infection, of which, 50 per cent of patients are becoming resistant to treatment despite being treated for over six months. C… [+2168 chars]"}, {"source": {"id": null, "name": "Thenewtoday.gd"}, "author": "Humphrey Mcgee", "title": "A perfectly valid list of reasons why I can't exercise today - The New Today Newspaper", "description": "Leave a comment on this storyCommentPhysical activity is more important than ever during the Covid-19 pandemic. Inadequate physical activity is a global", "url": "https://thenewtoday.gd/a-perfectly-valid-list-of-reasons-why-i-cant-exercise-today/", "urlToImage": null, "publishedAt": "2022-09-04T16:19:16Z", "content": "Leave a comment on this story\r\nComment\r\nPhysical activity is more important than ever during the Covid-19 pandemic. Inadequate physical activity is a global health problem and has been called an epid… [+3021 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Kacie Goff", "title": "5 Foods to Eat for a Healthier Heart - CNET", "description": "Diet is one of the most important contributors to heart health. Here's what to add to your shopping list.", "url": "https://www.cnet.com/health/nutrition/5-foods-to-eat-for-a-healthier-heart/", "urlToImage": "https://www.cnet.com/a/img/resize/a846130803ca6ce10be0a751e10b704fadac46db/2022/09/01/fe5b5b6e-ece0-4653-984d-e76c7e3b6eef/gettyimages-161754720.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-09-04T16:00:03Z", "content": "You're probably at least generally aware that heart health is important for your overall well-being and your longevity. Without a heart that's capable of efficiently pumping blood everywhere it needs… [+6363 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Nitesh Kumar Sahoo", "title": "COVID-19 drugs causing side effects, no antibiotics without doctor consultation: RMRC study - OTV News", "description": "Though the patients recovered from Covid, the 'bad' bacteria that entered to lungs through the throat caused side effects.", "url": "https://odishatv.in/news/covid-19/covid-19-drugs-causing-side-effects-no-antibiotics-without-doctor-consultation-rmrc-study-184718", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1662301953.webp", "publishedAt": "2022-09-04T14:35:47Z", "content": "In a first in the country, the Regional Medical Research Centre (RMRC) in Bhubaneswar has found in its new study that the medicines used for treating COVID-19 patients are causing side effects for wh… [+2454 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Midodrine is modestly effective for prevention of vasovagal syncope: Meta-analysis - Medical Dialogues", "description": "Canada: Midodrine is effective for the significant prevention of vasovagal syncope (VVS) in...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/midodrine-is-modestly-effective-for-prevention-of-vasovagal-syncope-meta-analysis-98545", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/03/184908-vasovagal-syncope.jpg", "publishedAt": "2022-09-04T14:30:18Z", "content": "Canada: Midodrine is effective for the significant prevention of vasovagal syncope (VVS) in controlled settings but in clinical settings, its efficacy is much more modest, says a recent study publish… [+2518 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Fiona Callingham", "title": "Visceral fat: Certain amount of protein needed with every meal to burn belly fat - expert - Express", "description": "HAVING visceral fat is necessary to keep our bodies functioning properly. Unlike subcutaneous fat, which you can see under the skin, visceral fat is stored deep in the belly - acting as protection and insulation for our organs. However, too much of it can be …", "url": "https://www.express.co.uk/life-style/health/1664539/visceral-fat-how-get-rid-of-protein-with-every-meal-burns-fat", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/1664539_1.jpg", "publishedAt": "2022-09-04T14:05:08Z", "content": null}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Arterial stiffness indirectly raises BP in adolescence via insulin resistance pathway - Medical Dialogues", "description": "Globally efforts are being put for screening, identification, and early diagnosis of hypertension...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/arterial-stiffness-indirectly-raises-bp-in-adolescence-via-insulin-resistance-pathway-98542", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/03/184919-bp.jpg", "publishedAt": "2022-09-04T14:00:53Z", "content": "Globally efforts are being put for screening, identification, and early diagnosis of hypertension for prevention of its sequelae from early life.Researchers have recently shown that arterial stiffnes… [+3161 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Frailty Index ranks over SOFA in predicting 3-month mortality in Sepsis - Medical Dialogues", "description": "New research published in the Journal of the Association of Physicians of India found that the...", "url": "https://medicaldialogues.in/critical-care/news/frailty-index-ranks-over-sofa-in-predicting-3-month-mortality-in-sepsis-98540", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/25/123543-sepsis-1.jpg", "publishedAt": "2022-09-04T14:00:29Z", "content": "New research published in the Journal of the Association of Physicians of India found that the frailty index was superior to sequential organ failure assessment (SOFA) and the other prognostic marker… [+2492 chars]"}, {"source": {"id": null, "name": "Starofmysore.com"}, "author": "Author", "title": "Adult vaccination programme launched at Apollo BGS Hospitals - Star of Mysore", "description": "Mysore/Mysuru: Apollo BGS Hospitals, Mysuru, launched the Adult Vaccination programme for adults above 18 years as a defence mechanism against infections recently. The vaccines offered are Influenza, Pneumococcal, Tdap (Diphtheria, Tetanus and Pertussis). “Va…", "url": "https://starofmysore.com/adult-vaccination-programme-launched-at-apollo-bgs-hospitals/", "urlToImage": "https://starofmysore.com/wp-content/uploads/2022/09/news-9-1-Adult-Vaccination-programme.jpg", "publishedAt": "2022-09-04T13:58:52Z", "content": "Mysore/Mysuru: Apollo BGS Hospitals, Mysuru, launched the Adult Vaccination programme for adults above 18 years as a defence mechanism against infections recently. The vaccines offered are Influenza,… [+2387 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Diabetes cure at home? Experts say that a common vegetable found in every home can reverse blood sugar spikes - Times Now", "description": "According to the findings presented at the 97th annual meeting of The Endocrine Society, the extract of an onion bulb can lower blood sugar levels. When given to patients along with the antidiabetic drug metformin, it was deemed effective for treating diabete…", "url": "https://www.timesnownews.com/health/diabetes-cure-at-home-experts-say-that-a-common-vegetable-found-in-every-home-can-reverse-blood-sugar-spikes-article-93985879", "urlToImage": "https://static.tnn.in/thumb/msid-93985879,imgsize-100,width-1280,height-720,resizemode-75/93985879.jpg", "publishedAt": "2022-09-04T13:14:21Z", "content": "AP EAMCET 2022 Counselling: Minimum qualifying marks in AP Inter Exams relaxed as one time measure, details"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "7 Ways You're Ruining Your Liver Without Even Realizing It — Eat This Not That - Eat This, Not That", "description": "The liver performs over 500 vital jobs for us daily without a break, so taking care of the liver is essential for overall health.", "url": "https://www.eatthis.com/ways-youre-ruining-your-liver-without-realizing-it/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/woman-stomach-pain-fatty-liver-disease-e1653525051663.jpg?quality=82&strip=all", "publishedAt": "2022-09-04T12:02:09Z", "content": "The liver is a three pound organ that performs over 500 vital jobs for us daily without a break, so taking care of the liver is essential for overall health. The liver performs important duties like … [+5867 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Food items to add to your daily routine to prevent hair fall and maintain the volume of your tresses - Times Now", "description": "Hair fall is one of the most common problems one faces in their lifetime. Trying out various products to nourish your hair might work but it is always essential to give the required nutrients for your hair to grow healthy and strong. Here's looking at five su…", "url": "https://www.timesnownews.com/lifestyle/food-items-to-add-to-your-daily-routine-to-prevent-hair-fall-and-maintain-the-volume-of-your-tresses-article-93983472", "urlToImage": "https://static.tnn.in/thumb/msid-93983472,imgsize-100,width-1280,height-720,resizemode-75/93983472.jpg", "publishedAt": "2022-09-04T11:45:01Z", "content": "Seema Sajdeh leaves son Nirvaan upset as she removes 'Khan' nameplate, star kid says, 'We're a family of...'"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Are Sleep-deprived Teens The Heart Patients Of The Future? - Nation World News", "description": "September 04, 2022 | , Reading Time: 4 minutes", "url": "https://nationworldnews.com/are-sleep-deprived-teens-the-heart-patients-of-the-future/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/09/Are-sleep-deprived-teens-the-heart-patients-of-the-future.png", "publishedAt": "2022-09-04T11:29:12Z", "content": "According to the study, patients who sleep poorly are more likely to have cardiometabolic risk factors.\r\n The mean age of study participants was 12 years. Photo: Shutterstock.loss teen According to a… [+3142 chars]"}, {"source": {"id": null, "name": "Sakshi.com"}, "author": "Sakshi Post", "title": "Your Body Sugar Levels Can Be Reversed, Deets Inside - Sakshi Post", "description": "Nowadays, most of the people are suffering from Diabetes and it is of two types - Type 1 diabetes and......", "url": "https://english.sakshi.com/news/lifestyle/your-body-sugar-levels-can-be-reversed-deets-inside-160494", "urlToImage": "https://english.sakshi.com/sites/default/files/article_images/2022/09/4/Sugar-1662288249.jpg", "publishedAt": "2022-09-04T10:44:09Z", "content": "Nowadays, most of the people are suffering from Diabetes and it is of two types - Type 1 diabetes and Type 2 diabetes. The main difference between type 1 and type 2 diabetes is that type 1 diabetes i… [+2216 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Is Omicron More Infectious Than Other COVID-19 Variants? - SciTechDaily", "description": "Researchers discovered which mutations of the Omicron SARS-CoV-2 virus make it more efficient at infecting cells and evading antibodies by using virus-like particles. As the Omicron variant of SARS-CoV-2 quickly spread throughout the world earlier this year, …", "url": "https://scitechdaily.com/why-is-omicron-more-infectious-than-other-covid-19-variants/", "urlToImage": "https://scitechdaily.com/images/Coronavirus-Mutation-COVID-Variant.gif", "publishedAt": "2022-09-04T10:18:20Z", "content": "ByGladstone InstitutesSeptember 4, 2022\r\nThe Omicron variant of SARS-CoV-2 spreads more easily than the other main variants but also causes less severe illness and death.\r\nResearchers discovered whic… [+8446 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Nirmal Jovial", "title": "Aquaporin 4 for a healthier brain - The Week", "description": "Cleaning up the toxic waste that gets accumulated in internal organs is not easy", "url": "https://www.theweek.in/health/more/2022/09/04/aquaporin-4-for-a-healthier-brain.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/more/images/2022/9/4/shutterstock_1401474617.jpg", "publishedAt": "2022-09-04T09:32:00Z", "content": "A simple bath may help you clean up your outer body. However, cleaning up the toxic waste that gets accumulated in your brain or other internal organs is not that easy. When a toxic protein like amyl… [+2737 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Compromised insulin production in early stages of type 2 diabetes can lead to obesity: Study - Hindustan Times", "description": "According to the new study, if insulin production is compromised, as is the case in the early stages of type 2 diabetes, this can contribute to obesity. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/compromised-insulin-production-in-early-stages-of-type-2-diabetes-can-lead-to-obesity-study-101662280759417.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/04/1600x900/1_(1)_1661080346344_1662281099439_1662281099439.jpg", "publishedAt": "2022-09-04T08:50:08Z", "content": "Obesity increases the chance of a sugar metabolism imbalance and potentially diabetes. A study group at the University of Basel has recently demonstrated that the contrary is also true: inadequacies … [+3126 chars]"}, {"source": {"id": null, "name": "Cityspidey.com"}, "author": null, "title": "Best foods for regulating blood sugar levels! - CitySpidey.com", "description": "Apple protects you from diabetes and helps to regulate blood sugar levels", "url": "https://www.cityspidey.com/news/18888/best-foods-for-regulating-blood-sugar-levels", "urlToImage": "https://cityspideynews.s3.amazonaws.com/uploads/spidey/202209/cover--best-foods-for-high-blood-sugar-1662275265.webp", "publishedAt": "2022-09-04T07:14:30Z", "content": "Diet plays a very important role in maintaining the blood sugar levels. People must be conscious about what they consume if they are conscious about their blood sugar levels. If you want to regulate … [+1656 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Rachel Fairbank", "title": "Going from sedentary lifestyle to workout schedule comparable to 'smoking versus not smoking' - The Irish Times", "description": "Researchers found that while doing either aerobic exercise or strength training was associated with a lower risk of dying, regularly doing both was associated with an even lower mortality risk", "url": "https://www.irishtimes.com/health/your-fitness/2022/09/04/going-from-sedentary-lifestyle-to-workout-schedule-comparable-to-smoking-versus-not-smoking/", "urlToImage": "https://www.irishtimes.com/resizer/xg5tTC7W8hcQF8C-K892pYywOFM=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/AJR37G5H2ZHV5GF4CHET6JLFZM.jpg", "publishedAt": "2022-09-04T06:32:14Z", "content": "Regular physical activity has many known health benefits, one of which is that it might help you live longer. But whats still being determined are the types and duration of exercise that offer the mo… [+4968 chars]"}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Editor", "title": "Pune: Alarm Raised As Dengue Cases Spiked Suddenly - Punekar News", "description": "Pune, 4th September 2022: With a sharp rise in dengue fever cases, intermittent rainfall, continuing construction, and a lack of water in some areas of the city, have created ideal breeding grounds for dengue mosquitoes. Pune Municipal Corporation (PMC) healt…", "url": "https://www.punekarnews.in/pune-alarm-raised-as-dengue-cases-spiked-suddenly/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2022/07/Dengue-Cases-In-Pune.jpeg", "publishedAt": "2022-09-04T05:46:31Z", "content": "Pune, 4th September 2022: With a sharp rise in dengue fever cases, intermittent rainfall, continuing construction, and a lack of water in some areas of the city, have created ideal breeding grounds f… [+1973 chars]"}, {"source": {"id": null, "name": "Newsdeal.in"}, "author": "Rihan", "title": "Battling thyroid disease? Here are some ways to manage your symptoms - NewsDeal", "description": "Your thyroid produces and creates hormones that are involved in numerous bodily processes. Therefore, thyroid disease is characterized by the overproduction or underproduction of these critical hormon", "url": "https://newsdeal.in/battling-thyroid-disease-here-are-some-ways-to-manage-your-symptoms/", "urlToImage": "https://i3.wp.com/cdn.dnaindia.com/sites/default/files/styles/third/public/2022/09/04/2535833-untitled-design-91.png", "publishedAt": "2022-09-04T04:42:33Z", "content": "Your thyroid produces and creates hormones that are involved in numerous bodily processes. Therefore, thyroid disease is characterized by the overproduction or underproduction of these critical hormo… [+1662 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "4 Things To Look Out For While Buying Packaged Food - NDTV Food", "description": "It is always advised to read and understand the food labels while buying any type of packaged meal. Here are some points to keep in mind.", "url": "https://food.ndtv.com/food-drinks/4-things-to-look-out-for-while-buying-packaged-food-3313952", "urlToImage": "https://c.ndtvimg.com/2021-03/sd6099no_packaged-food_625x300_09_March_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-09-04T04:16:28Z", "content": "What's common between a bag of chips and a packaged tea-time cake? They're both considered to be junk food. Junk food is a term given to foods that have a low nutritional value and high calorific val… [+4485 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": null, "title": "Kovid-19: The Third And Fourth Doses Of The Vaccine Are Important - Nation World News", "description": "Nation World News is the fastest emerging news website covering all the latest news, world’s top stories, science news entertainment sports cricket’s latest discoveries, new technology gadgets, politics news, and more.", "url": "https://nationworldnews.com/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/07/Nation.jpg", "publishedAt": "2022-09-04T03:55:23Z", "content": "Nation World News is the fastest emerging news website covering all the latest news, worlds top stories, science news entertainment sports crickets latest discoveries, new technology gadgets, politic… [+57 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Anjana A", "title": "Here are five 'wonder seeds' to balance your hormones | DH Latest News, DH NEWS, Latest News, NEWS, News, News, Mobile Apps , hormones, balance, wonder seeds - East Coast Daily (English)", "description": "Hormones, which are chemical messengers, play a crucial part in our general well-being, regulating everything from our menstrual cycle to controlling our hunger. In addition to other health problems,", "url": "https://www.eastcoastdaily.in/2022/09/04/here-are-five-wonder-seeds-to-balance-your-hormones.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/09/aa11psdn.jpg", "publishedAt": "2022-09-04T03:53:00Z", "content": "Hormones, which are chemical messengers, play a crucial part in our general well-being, regulating everything from our menstrual cycle to controlling our hunger. In addition to other health problems,… [+1448 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Sweetened Weight Loss Superfood Contains Fiber And Lowers Cholesterol - Nation World News", "description": "Superfoods are a great option to include in your daily dishes. , Fotolia", "url": "https://nationworldnews.com/sweetened-weight-loss-superfood-contains-fiber-and-lowers-cholesterol/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/09/Sweetened-Weight-Loss-Superfood-Contains-Fiber-and-Lowers-Cholesterol.jpg", "publishedAt": "2022-09-04T02:12:05Z", "content": "Superfoods are multi-asset products that have become particularly popular due to the large number of benefits they provide to the body. More and more people are choosing a healthier lifestyle and wan… [+3390 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Dengue surfaces early, Chandigarh sees 40 cases in 2 months - The Tribune India", "description": "Dengue cases have started surfacing in the city early with 40 cases having been recorded in the past two months.", "url": "https://www.tribuneindia.com/news/chandigarh/dengue-surfaces-early-chandigarh-sees-40-cases-in-2-months-428367", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1081741910.jpg", "publishedAt": "2022-09-04T01:01:00Z", "content": "Tribune News Service\r\nChandigarh, September 3\r\nDengue cases have started surfacing in the city early with 40 cases having been recorded in the past two months.\r\nDr Suman Singh, Director, Health Servi… [+1749 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Rick Lange, MD, Texas Tech; Elizabeth  Tracey", "title": "Seeking COVID Variants in Sewage; MI Risk and Adenovirus COVID Vaccines - Medpage Today", "description": "Also in TTHealthWatch: traumatic brain injury and markers of severity", "url": "https://www.medpagetoday.com/podcasts/healthwatch/100524", "urlToImage": "https://assets.medpagetoday.net/media/images/100xxx/100524.jpg", "publishedAt": "2022-09-03T18:57:49Z", "content": "TTHealthWatch is a weekly podcast from Texas Tech. In it, Elizabeth Tracey, director of electronic media for Johns Hopkins Medicine in Baltimore, and Rick Lange, MD, president of the Texas Tech Unive… [+13740 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Shaikh Azizur Rahman", "title": "Protest in India Over HIV Drug Shortage Ends After 42 Days - Voice of America - VOA News", "description": "Government has reportedly resumed the supply of life-saving antiretroviral therapy drugs to the country’s 2.3 million HIV-infected", "url": "https://www.voanews.com/a/protest-in-india-over-hiv-drug-shortage-ends-after-42-days/6729785.html", "urlToImage": "https://gdb.voanews.com/09ae0000-0a00-0242-34f4-08da8db897f3_cx0_cy2_cw0_w1200_r1.jpg", "publishedAt": "2022-09-03T14:49:25Z", "content": "A protest by a group of HIV-positive people in New Delhi, demanding a regular supply of life-saving antiretroviral therapy drugs across the country, ended this week, after 42 days, as the government … [+3314 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "World Leukemia Day 2022: Signs and symptoms of leukemia in newborn babies - Hindustan Times", "description": "World Leukemia Day 2022: Congenital leukemia occurs in the womb even before a baby is born. Here are signs and symptoms of this rare cancer. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/world-leukemia-day-2022-signs-and-symptoms-of-leukemia-in-newborn-babies-101662213524311.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/03/1600x900/infant_leukemia_1662213689051_1662213704658_1662213704658.jpg", "publishedAt": "2022-09-03T14:05:24Z", "content": "World Leukemia Day 2022: Congenital leukemia is a rare cancer that is present at birth and signs and symptoms appear within a month of an infant's life. Congenital leukemia occurs in the womb even be… [+2488 chars]"}, {"source": {"id": null, "name": "Lokmattimes.com"}, "author": "Lokmat English Desk", "title": "21 years old girl dies due to Swine flu - Lokmat", "description": "Lokmat News Network\nAurangabad, Sept 3:\nSwine flu is spreading its tentacles in the district. A 21-year-old girl from the rural area died due to Swine flu on September 1. It is the second death due to Swine flu in the district. The health department now has t…", "url": "https://www.lokmattimes.com/aurangabad/21-years-old-girl-dies-due-to-swine-flu/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/images/686x514/aurangabad_202009112995.jpg", "publishedAt": "2022-09-03T13:40:11Z", "content": "Lokmat News Network\r\nAurangabad, Sept 3: \r\nSwine flu is spreading its tentacles in the district. A 21-year-old girl from the rural area died due to Swine flu on September 1. It is the second death du… [+771 chars]"}, {"source": {"id": null, "name": "Lokmattimes.com"}, "author": "ANI", "title": "Nitric oxide 'scavengers' are used to treat triple-negative breast cancer: Researchers - Lokmat", "description": "A potential novel therapeutic strategy for treating triple-negative breast cancer is being investigated by researchers. In Professor Abhay Pandit's lab, CRAM doctoral candidate Amir Abdo Alsharabasy is developing nitric oxide scavengers as part of a novel the…", "url": "https://www.lokmattimes.com/technology/nitric-oxide-scavengers-are-used-to-treat-triple-negative-breast-cancer-researchers/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/ANI-20220903094947_202209.jpg", "publishedAt": "2022-09-03T12:09:15Z", "content": "A potential novel therapeutic strategy for treating triple-negative breast cancer is being investigated by researchers. In Professor Abhay Pandit's lab, CRAM doctoral candidate Amir Abdo Alsharabasy … [+3141 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Press Trust of India", "title": "Monkeypox alert: Traveller from West Africa detected for new strain of virus, reports UK - News9 LIVE", "description": "The UK Health Security Agency (UKHSA) said preliminary genomic sequencing indicates that this new...", "url": "https://www.news9live.com/health/health-conditions/monkeypox-alert-traveller-from-west-africa-detected-for-new-strain-of-virus-reports-uk-193596", "urlToImage": "https://media.news9live.com/h-upload/2022/09/03/551445-monkey-pox-test-tubes-labelled-monkeypox-virus-positive-reu.jpg", "publishedAt": "2022-09-03T11:40:32Z", "content": "A new strain of monkeypox linked to an individual diagnosed with the virus after recent travel to West Africa has been identified in the UK, health officials have said. The UK Health Security Agency … [+1868 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Fluxactive Complete Reviews (Canada or USA) Fluxactive Complete For Sale Must Read Before Buying - The Tribune India", "description": "Prostate issues can be painful and difficult to deal with. Some men opt for medications that help relieve symptoms, but these are not always effective. That is why many men choose to take dietary supplements to help them manage their prostate health. The Flux…", "url": "https://www.tribuneindia.com/news/brand-connect/fluxactive-complete-reviews-canada-or-usa-fluxactive-complete-for-sale-must-read-before-buying-428241", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1243935960.jpg", "publishedAt": "2022-09-03T10:57:00Z", "content": "Prostate issues can be painful and difficult to deal with. Some men opt for medications that help relieve symptoms, but these are not always effective. That is why many men choose to take dietary sup… [+10044 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Joaquin Victor Tacla", "title": "Scientists Claim That They Are Close to Creating an Insulin Tab - Tech Times", "description": "Insulin could be taken orally, thanks to a new scientific breakthrough.", "url": "https://www.techtimes.com/articles/280060/20220903/scientists-claim-close-insulin-tab.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/410877/douniamag-britain-eu-politics-brexit-health-diabetes.jpg", "publishedAt": "2022-09-03T10:43:00Z", "content": "The development of an oral insulin pill that is easy to take has advanced significantly, according to a group of Canadian experts. Their recent study shows that rats given that took a dissolvable pil… [+2720 chars]"}, {"source": {"id": null, "name": "Mercopress.com"}, "author": null, "title": "Dr. Tedros hopeful about future of monkeypox - MercoPress", "description": "World Health Organization Director-General Tedros Adhanom Ghebreyesus Friday told reporters that the recent decline in monkeypox cases in North America and Europe proved that shows that the current outbreak of the malady can be stopped.", "url": "https://en.mercopress.com/2022/09/03/dr.-tedros-hopeful-about-future-of-monkeypox", "urlToImage": "https://en.mercopress.com/data/cache/noticias/90033/600x315/ted.jpg", "publishedAt": "2022-09-03T10:26:00Z", "content": "Saturday, September3rd2022 - 10:26 UTC\r\n“With the right measures, this is an outbreak that can be stopped,” Ghebreyesus said\r\nWorld Health Organization Director-General Tedros Adhanom Ghebreyesus Fri… [+2391 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Multidrug-Resistant Musculoskeletal Tuberculosis: An Aggressive Clinical, Radiological and Molecular Confirmation With Genotypic Drug Susceptibility Testing Approach - Cureus", "description": "Introduction\r\n\r\nIncreasing evidence suggests that musculoskeletal tuberculosis (MSTB) causes significant morbidity due to the late presentation of symptoms and lack of accurate diagnosis. We aimed to assess the utility of two modalities, viz. radiology and mo…", "url": "https://www.cureus.com/articles/106299-multidrug-resistant-musculoskeletal-tuberculosis-an-aggressive-clinical-radiological-and-molecular-confirmation-with-genotypic-drug-susceptibility-testing-approach", "urlToImage": "https://assets.cureus.com/uploads/figure/file/415849/article_river_c0ccf320071811ed8465c3256c598cab-flow-chart-Cureus--finalized.png", "publishedAt": "2022-09-03T10:22:41Z", "content": "Introduction\r\nIncreasing evidence suggests that musculoskeletal tuberculosis (MSTB) causes significant morbidity due to the late presentation of symptoms and lack of accurate diagnosis. We aimed to a… [+24461 chars]"}, {"source": {"id": null, "name": "Rentonreporter.com"}, "author": "Wire Service", "title": "Protetox Reviews: Bad Side Effects Risk? Customer Complaints Exposed! - Renton Reporter", "description": "<p>Weight reduction and proper weight management are no joke. Having a lot of belly fat can not only make you feel bad, but it can be very harmful to various processes of your body. With high fat, maintaining heart health can become a challenge. It can also l…", "url": "https://www.rentonreporter.com/marketplace/protetox-reviews-bad-side-effects-risk-customer-complaints-exposed/", "urlToImage": "https://www.rentonreporter.com/wp-content/uploads/2022/09/30285121_web1_M1-REN-20220903-Protetox-Teaser.jpg", "publishedAt": "2022-09-03T08:30:00Z", "content": "Weight reduction and proper weight management are no joke. Having a lot of belly fat can not only make you feel bad, but it can be very harmful to various processes of your body. With high fat, maint… [+18557 chars]"}, {"source": {"id": null, "name": "NewsX"}, "author": null, "title": "Antiviral drug tecovirimat effective in treatment of monkeypox symptoms, find researchers - NewsX", "description": "Using the antiviral tecovirimat to treat monkeypox skin lesions and symptoms appears to be both safe and effective, according to a UC Davis Health study. The", "url": "https://www.newsx.com/health/monkeypox.html", "urlToImage": "https://www.newsx.com/wp-content/uploads/2022/08/monkeypox-death-570745-GlGi64Ok.jpg", "publishedAt": "2022-08-30T19:07:45Z", "content": "Using the antiviral tecovirimat to treat monkeypox skin lesions and symptoms appears to be both safe and effective, according to a UC Davis Health study. The study is one of the first to examine and … [+3919 chars]"}]}