{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Researchers find hereditary factors in new type of eating disorder - Hindustan Times", "description": "A twin study exploring this relatively new type of eating disorder found that hereditary factors had a significant impact on ARFID. The study was conducted by researchers at Karolinska Institutet. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/researchers-find-hereditary-factors-in-new-type-of-eating-disorder-101675331557936.html", "urlToImage": "https://images.hindustantimes.com/img/2023/02/02/1600x900/_a368872a-2194-11ea-8c10-7db3e225203f_1675331581682_1675331581682.jpg", "publishedAt": "2023-02-02T09:55:32Z", "content": "A twin study exploring this relatively new type of eating disorder found that hereditary factors had a significant impact on ARFID. The study was conducted by researchers at Karolinska Institutet. (A… [+3021 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "The Microbiome-Gut-Brain axis regulates social cognition & craving in young binge drinkers - The Lancet", "description": "In conclusion, this research demonstrates alterations in the gut microbiome of young\nbinge drinkers (BDs) and identifies early biomarkers of craving. Associations between\nemotional processing and microbiome composition further support the growing literature\no…", "url": "https://www.thelancet.com/journals/ebiom/article/PIIS2352-3964(23)00007-5/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/fb958d51-91b9-4f7c-995b-f13bd63a1dff/gr3.jpg", "publishedAt": "2023-02-02T09:20:02Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "AI tools aid the discovery of super tight-binding antibodies - Drug Target Review", "description": "An artificial intelligence (AI) strategy developed by US scientists could accelerate the development of new antibody drugs.", "url": "https://www.drugtargetreview.com/news/108197/ai-tools-aid-the-discovery-of-super-tight-binding-antibodies/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/AI-antibody.jpg", "publishedAt": "2023-02-02T08:56:10Z", "content": "Posted: 2 February 2023 | Izzy Wood (Drug Target Review) | No comments yet\r\nAn AI strategy developed by US scientists could accelerate the development of new antibody drugs.\r\nScientists at University… [+3086 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bone Health: Add These Superfoods Rich In Calcium For Strong Bones - NDTV", "description": "Calcium is an integral nutrient for the maintenance of your bones. Add these calcium-rich foods to your diet for strong and healthy bones.", "url": "https://www.ndtv.com/health/bone-health-add-these-superfoods-rich-in-calcium-for-strong-bones-3746224", "urlToImage": "https://c.ndtvimg.com/2022-04/l0apc2s_calcium-rich-food_625x300_11_April_22.jpg", "publishedAt": "2023-02-02T08:26:00Z", "content": "Calcium-rich foods can boost the health of our bones\r\nBones provide a variety of functions in the body, including anchoring muscles, protecting organs, and creating structure. While it's crucial to d… [+3876 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can bad smells make you feel faint, out of breath? - The Indian Express", "description": "“Many people who are negatively affected by a certain smell, instantly feel better when they are away from the surroundings where the smell is present,” said Dr Bindumathi P L, Sr. Consultant - Internal Medicine, Aster CMI Hospital, Bangalore.", "url": "https://indianexpress.com/article/lifestyle/health/can-bad-odour-make-you-sick-bad-smell-nausea-8380156/", "urlToImage": "https://images.indianexpress.com/2023/01/body-odour_1200_getty.jpg", "publishedAt": "2023-02-02T07:00:26Z", "content": "Do you ever feel a burning sensation in your throat, coupled with nausea and dizziness when exposed to certain odours? Well, you are not alone. That is because an odour or smell can trigger different… [+3339 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Many young people don't believe they are at risk for heart disease, survey finds - News-Medical.Net", "description": "February is American Heart Month and a new national survey commissioned by The Ohio State University Wexner Medical Center found that even though heart attacks are increasingly common in younger people, many don't believe they are at risk for heart disease.", "url": "https://www.news-medical.net/news/20230202/Many-young-people-dont-believe-they-are-at-risk-for-heart-disease-survey-finds.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2023-02-02T06:56:00Z", "content": "February is American Heart Month and a new national survey commissioned by The Ohio State University Wexner Medical Center found that even though heart attacks are increasingly common in younger peop… [+5842 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Experiencing Rapid Mood Swings? Try Adding These Food Items To Your Diet - NDTV", "description": "Nutritionist Nmami Agarwal shares a post on Instagram highlighting the connection between mood swings and nutrition.", "url": "https://www.ndtv.com/health/experiencing-rapid-mood-swings-try-adding-these-food-items-to-your-diet-3746048", "urlToImage": "https://c.ndtvimg.com/2021-04/835n54u_healthy-diet_625x300_13_April_21.jpg", "publishedAt": "2023-02-02T06:53:00Z", "content": "A nutritious diet can help improve your mental health\r\nWith so much happening inside the body, you fail to understand the causes and consequences of every little thing. Well, you may have heard your … [+2169 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Rommel Tickoo", "title": "Vitamin D from the sun: Why exposing ourselves 10 minutes every morning or the first half of the day is still the best way to tackle deficiency - The Indian Express", "description": "A recent survey found that nearly 76 per cent or one in three Indians suffers from Vitamin D deficiency, mostly youngsters. That’s because we stay longer in a conditioned, indoor environment than the outdoors, says Dr Rommel Tickoo, Director, Internal Medicin…", "url": "https://indianexpress.com/article/health-wellness/vitamin-d-from-the-sun-why-exposing-ourselves-10-minutes-every-morning-or-the-first-half-of-the-day-is-still-the-best-way-to-tackle-deficiency-8419072/", "urlToImage": "https://images.indianexpress.com/2023/02/healingtouch_HS1200.jpg", "publishedAt": "2023-02-02T06:30:03Z", "content": "Despite living in a tropical country and having sunshine most part of the year, Indians still do not get enough sunlight and suffer from Vitamin D deficiency. A recent survey by an online drug pharma… [+4843 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "Social isolation linked to dementia risk factors says a study in Canada - Business Insider India", "description": "According to a new study published in the open-access journal PLOS ONE by Kimia Shafighi of McGill University in Canada and colleagues, social lifestyle determinants,", "url": "https://www.businessinsider.in/science/health/news/social-isolation-linked-to-dementia-risk-factors-says-a-study-in-canada/articleshow/97543910.cms", "urlToImage": "https://www.businessinsider.in/photo/97543910/social-isolation-linked-to-dementia-risk-factors-says-a-study-in-canada.jpg?imgsize=1511728", "publishedAt": "2023-02-02T06:23:00Z", "content": "According to a new study published in the open-access journal PLOS ONE by Kimia Shafighi of McGill University in Canada and colleagues, social lifestyle determinants, including social isolation\r\n, ar… [+2594 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Varicose veins: THIS unhealthy habit can increase your risk - Times of India", "description": "You may have come across several diseases and infections, but have you ever heard of venous disease? Vein disease occurs when the walls of the veins get damaged and pose problems in the way of the circulatory system. The function of the vein is to carry blood…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/varicose-veins-this-unhealthy-habit-can-increase-your-risk/photostory/97523201.cms", "urlToImage": "https://static.toiimg.com/photo/97523221.cms", "publishedAt": "2023-02-02T05:30:00Z", "content": "While varicose veins are not considered a serious medical condition, they can cause complications if accompanied by severe, continuous pain and swelling. Although rare, the Mayo Clinic shares that ul… [+288 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Phenq Complete Meal Shake - is Phenq Safe - Phenq Stores - Phenq Free Trial - Deccan Herald", "description": "Following the outbreak and ravaged the nation, it caused a lot of damage for many people's physical as well as mental health. As a result, the amount of people struggling with weight gain has increased dramatically. The good thing is that you don't have to be…", "url": "https://www.deccanherald.com/brandspot/pr-spot/phenq-complete-meal-shake-is-phenq-safe-phenq-stores-phenq-free-trial-1187057.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1187057-1675314945.png", "publishedAt": "2023-02-02T05:15:45Z", "content": "Following the outbreak and ravaged the nation, it caused a lot of damage for many people's physical as well as mental health. As a result, the amount of people struggling with weight gain has increas… [+20369 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "SARS-CoV-2 variants of concern found in deer in US: Study - EastMojo", "description": "Washington: Scientists have found white-tailed deer, the most abundant large mammal in North America, are harbouring SARS-CoV-2 variants that were once", "url": "http://www.eastmojo.com/world/2023/02/02/sars-cov-2-variants-of-concern-found-in-deer-in-us-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/07/COVID-19.png?fit=1920%2C1080&ssl=1", "publishedAt": "2023-02-02T05:10:00Z", "content": "Washington: Scientists have found white-tailed deer, the most abundant large mammal in North America, are harbouring SARS-CoV-2 variants that were once widely circulated, but no longer found in human… [+3097 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Healthy Diet Tips: 6 Nutritionist-Approved Milk Substitutes For Your Daily Calcium Fix - NDTV Food", "description": "We found some healthy milk substitutes that can be considered ideal for your daily calcium fix. These food tips are shared by a nutritionist.", "url": "https://food.ndtv.com/health/healthy-diet-tips-6-nutritionist-approved-milk-substitutes-for-your-daily-calcium-fix-3745803", "urlToImage": "https://c.ndtvimg.com/2023-02/do149t0o_calcium_625x300_02_February_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-02-02T05:05:38Z", "content": "Milk has been a staple for all since ages. However, over the years, we have seen more and more people eliminating milk (and milk products) from their diet. Ever wondered why? While some have societal… [+3915 chars]"}, {"source": {"id": null, "name": "Lww.com"}, "author": null, "title": "Scientists Discover a New Brain Layer in the Subarachnoid... : Neurology Today - LWW Journals", "description": "An abstract is unavailable.", "url": "https://journals.lww.com/neurotodayonline/fulltext/2023/02020/scientists_discover_a_new_brain_layer_in_the.2.aspx", "urlToImage": "https://images.journals.lww.com/neurotodayonline/SocialThumb.00132985-202302020-00002.figure1.jpeg", "publishedAt": "2023-02-02T05:04:27Z", "content": "Article In Brief\r\nThe newly uncovered subarachnoidal lymphatic-like membrane's location close to the brain could an another option exists for modulating the immune system and protecting it against tr… [+10124 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Dr Kakoli Lahkar", "title": "Tackling the late effects of cancer - The New Indian Express", "description": "The number of cancer survivors has increased tremendously over the past three decades with improvements in healthcare to detect and provide therapeutic treatment", "url": "https://www.newindianexpress.com/cities/bengaluru/2023/feb/02/tackling-the-late-effects-ofcancer-2543516.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2023/2/2/w600X390/TACKLING_.jpg", "publishedAt": "2023-02-02T04:28:00Z", "content": "BENGALURU:  As per international statistics, with current treatment techniques, almost two out of three cancers are curable. However, being cured is often not the end of the road for most cancer surv… [+8766 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Bird flu 'spills over' to otters and foxes in UK - BBC", "description": "Scientists will monitor the virus, but UK health chiefs say the risk to the public is very low.", "url": "https://www.bbc.com/news/science-environment-64474594", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/D513/production/_127174545_32d50d59-bd2f-42a2-a05c-0622cdbdcea0.jpg", "publishedAt": "2023-02-02T03:53:28Z", "content": "The largest ever outbreak of bird flu is spilling over into mammals, including otters and foxes in the UK.\r\nFigures released to the BBC show the virus has led to the death of about 208 million birds … [+6266 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Study Suggests Adding Milk to Coffee May Have Anti-Inflammatory Benefits - News18", "description": "While you may think that adding milk only changes the taste of the coffee, a recent study suggests something else.", "url": "https://www.news18.com/news/lifestyle/study-suggests-adding-milk-to-coffee-may-have-anti-inflammatory-benefits-6971137.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/untitled-design-93-167526112016x9.png", "publishedAt": "2023-02-02T03:00:42Z", "content": "A steaming cup of hot coffee is what most people prefer to kick off their day. A cup of coffee gives us energy for the day and helps us get ready for the tasks that lie ahead. Everyone likes their co… [+1976 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "COVID-19 is a leading cause of death in children in the US, study finds - WSWS", "description": "The findings come as recent CDC sero-prevalence data indicate nearly 100 percent of American children have been infected with SARS-CoV-2.", "url": "https://www.wsws.org/en/articles/2023/02/02/txae-f02.html", "urlToImage": "https://www.wsws.org/asset/0a02d574-fdd6-4af5-9297-74351bb97ca4?rendition=1600x900", "publishedAt": "2023-02-02T02:57:02Z", "content": "A study published in the Journal of the American Medical Association, (JAMA) on Monday shows that COVID-19 is a leading cause of death among children ages 0-19 in the United States.\r\nBy analyzing dea… [+9270 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Study reveals impact of hyper-palatable foods - Times of India", "description": "Findings from experts at the National Institutes of Health (NIH) and the University of Kansas may offer more precise instructions regarding the food you place on your plate if reducing weight was one of your 2023 resolutions. Researchers tried to identify whi…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/study-reveals-impact-of-hyper-palatable-foods/videoshow/97539806.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/97539806/size-70008/97539806.jpg", "publishedAt": "2023-02-02T02:52:58Z", "content": "Findings from experts at the National Institutes of Health (NIH) and the University of Kansas may offer more precise instructions regarding the food you place on your plate if reducing weight was one… [+569 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Marburg vaccine shows promising results in first-in-human study - Indiatimes.com", "description": "The Marburg virus (MARV) experimental vaccine was safe and elicited an immunological response in a tiny, first-in-human clinical study, according to a recently published paper in The Lancet. The vaccine may one day be a crucial weapon in combating Marburg vir…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/marburg-vaccine-shows-promising-results-in-first-in-human-study/videoshow/97539796.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/97539796/size-45660/97539796.jpg", "publishedAt": "2023-02-02T02:52:34Z", "content": "The Marburg virus\r\n (MARV) experimental vaccine was safe and elicited an immunological response in a tiny, first-in-human clinical study\r\n, according to a recently published paper in The Lancet. The … [+829 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by India TV Entertainment Desk", "title": "Fizzy drinks, processed meals may be linked to increased risk of cancer, claims a study - India TV News", "description": "The study states that every 10 per cent increase in ultra-processed food in a person's diet resulted in a 2 per cent increase in cancer overall, and a 19 per cent increase in ovarian cancer specifically.", "url": "https://www.indiatvnews.com/health/fizzy-drinks-processed-meals-may-be-linked-to-increased-risk-of-cancer-claims-study-brest-ovarian-2023-02-02-844118", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/02/food-3-1675305863.jpg", "publishedAt": "2023-02-02T02:45:05Z", "content": "Ultra-processed foods such as fizzy drinks, mass-produced packaged bread, many ready meals and most breakfast cereals, may be linked to an increased risk of developing cancer. Higher consumption of t… [+1898 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Can doing household chores help you stay free from health risks? - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/health/fitness/can-doing-household-chores-help-you-stay-free-from-health-risks-111675261996842.html", "urlToImage": "https://images.livemint.com/img/2023/02/01/1140x641/fitness_movement_1675262158380_1675262169894_1675262169894.jpg", "publishedAt": "2023-02-02T02:41:24Z", "content": "Wearables have had a huge impact on our lives, ranging from the frequency and how much we exercise, sleep, eat, drink, sit and, even, how much we move. Over the years, wearable tech has taken tremend… [+4255 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Follow these tips to stay protected from common flu - OrissaPOST", "description": "With every other person in the city complaining of flu and cold, masking up may be the best thing you can do not just for yourself but others around you. By continuing the usage of masks if you feel any flu like symptoms, you are looking out for other people …", "url": "https://www.orissapost.com/follow-these-tips-to-stay-protected-from-common-flu/", "urlToImage": "https://i0.wp.com/www.orissapost.com/wp-content/uploads/2021/11/Flu.jpg?fit=806%2C525&ssl=1", "publishedAt": "2023-02-02T01:30:49Z", "content": "With every other person in the city complaining of flu and cold, masking up may be the best thing you can do not just for yourself but others around you. By continuing the usage of masks if you feel … [+3340 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Immunocompromised patients more likely to die if hospitalized with COVID-19, study confirms - News-Medical.Net", "description": "People with weakened immune systems remain more likely to die if hospitalized with COVID-19 than patients with normal immune systems, a new UK study has confirmed.", "url": "https://www.news-medical.net/news/20230201/Immunocompromised-patients-more-likely-to-die-if-hospitalized-with-COVID-19-study-confirms.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2023-02-02T01:17:00Z", "content": "People with weakened immune systems remain more likely to die if hospitalized with COVID-19 than patients with normal immune systems, a new UK study has confirmed.\r\nPrevious studies have compared in-… [+2511 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Efficacy and safety of the SGLT2 inhibitor empagliflozin versus placebo and the DPP-4 inhibitor linagliptin versus placebo in young people with type 2 diabetes (DINAMO): a multicentre, randomised, double-blind, parallel group, phase 3 trial - The Lancet", "description": "Empagliflozin provided clinically relevant placebo-corrected reductions in HbA1c,\nwhereas linagliptin did not, and might offer a new treatment option for young people\nwith type 2 diabetes.", "url": "https://www.thelancet.com/journals/landia/article/PIIS2213-8587(22)00387-4/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/25f37280-b0ea-48ec-bd27-ea8f7eb371bf/gr1a.jpg", "publishedAt": "2023-02-01T23:30:58Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Sam Jarman", "title": "mRNA could train our blood cells to stop chronic inflammation - Freethink", "description": "A new study has identified the substance used by our white blood cells to reduce inflammation when it is no longer needed.", "url": "https://www.freethink.com/health/chronic-inflammation", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/01/chronic-inflammation-thumb.jpg?resize=1200,630", "publishedAt": "2023-02-01T23:00:00Z", "content": null}, {"source": {"id": null, "name": "Biopharmadive.com"}, "author": "Delilah Alvarado", "title": "FDA to convene advisers on review of RSV vaccines from GSK, Pfizer - BioPharma Dive", "description": "The agency is currently assessing applications filed by the two companies for what they hope will become the first vaccines against the virus in older adults.", "url": "https://www.biopharmadive.com/news/fda-advisory-committee-rsv-vaccine-gsk-pfizer/641783/", "urlToImage": "https://www.biopharmadive.com/imgproxy/h-ekdrHDlSu5b7Zf5MSsM3Bk_PTC7ev-dsDvsIfmLlQ/crop:5600:3164/g:nowe:0:538/rs:fill:770:435:0/bG9jYWw6Ly8vZGl2ZWltYWdlL0dldHR5SW1hZ2VzLTEyMjc3MTA1MDkuanBn.jpg", "publishedAt": "2023-02-01T22:22:02Z", "content": "Dive Brief:\r\n<ul><li>The Food and Drug Administration on Wednesday said it will consult a group of vaccine and infectious disease experts on its review of two experimental vaccines for infections cau… [+2084 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "What Is False Hypoglycemia And How Is It Identified? - Nation World News", "description": "False hypoglycemia is a phenomenon that can be confusing and worrying for people with diabetes.,", "url": "https://nationworldnews.com/what-is-false-hypoglycemia-and-how-is-it-identified/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/02/What-is-false-hypoglycemia-and-how-is-it-identified.jpg", "publishedAt": "2023-02-01T21:04:04Z", "content": "False hypoglycemia is a phenomenon that can be confusing and worrying for people with diabetes.,\r\nIt is a condition in which a person presents symptoms of hypoglycemia, such as cold sweat, weakness, … [+1854 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Christina Jackson", "title": "Cancer Vaccines Get Structural Remake - Inside Precision Medicine", "description": "Researchers have combined chemistry and nanotechnology to change the structural location of adjuvants and antigens on and within a nanoscale cancer vaccine to boost potency and performance.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/cancer-vaccines-get-structural-remake/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2020/03/Vaccine-1135748611-e1663600065499.jpg", "publishedAt": "2023-02-01T20:13:40Z", "content": "Researchers from the International Institute for Nanotechnology (IIN) at Northwestern University have combined chemistry and nanotechnology to change the structural location of adjuvants and antigens… [+4112 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Weight loss could be early predictor of Alzheimer’s disease in Down syndrome individuals: Research - ThePrint", "description": "Washington [US], February 1 (ANI): Unintentional weight loss in people with Down syndrome may predict the onset of Alzheimer’s disease long before typical cognitive symptoms like memory loss and dementia are apparent. As many as 90 per cent of people with Dow…", "url": "https://theprint.in/science/weight-loss-could-be-early-predictor-of-alzheimers-disease-in-down-syndrome-individuals-research/1348750/", "urlToImage": null, "publishedAt": "2023-02-01T18:16:31Z", "content": "Washington [US], February 1 (ANI): Unintentional weight loss in people with Down syndrome may predict the onset of Alzheimer’s disease long before typical cognitive symptoms like memory loss and deme… [+4118 chars]"}, {"source": {"id": null, "name": "Harvard School of Engineering and Applied Sciences"}, "author": "BWH Communications", "title": "Migraine history may be marker of pregnancy risks - Harvard Gazette", "description": "Brigham and Women's study finds increased odds of preterm delivery, other complications.", "url": "https://news.harvard.edu/gazette/story/2023/02/migraine-history-may-be-marker-of-pregnancy-risks/", "urlToImage": "https://news.harvard.edu/wp-content/uploads/2023/02/20230201_preg_mig-1200x630.jpg", "publishedAt": "2023-02-01T18:04:28Z", "content": "Researchers at Brigham and Womens Hospital have found that women with prepregnancy migraine had a greater risk of complications, including preterm delivery, gestational hypertension, and pre-eclampsi… [+4802 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Elissa Wolfson, The Science Advisory Board assistant editor", "title": "University of Missouri researchers say specific long-COVID symptoms fewer than expected - The Science Board", "description": "University of Missouri (MU) researchers have reported an unexpected discovery: people experiencing persistent COVID-19 effects -- known as long COVID -- are susceptible to developing only seven symptoms from a list of 47 top-reported long COVID symptoms for u…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=5215", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_can/2023_01_18_21_16_1665_woman_mask_anxiety_covid_social.jpg", "publishedAt": "2023-02-01T17:32:12Z", "content": "The NIH-funded research, published recently in Open Forum Infectious Diseases, furthers ongoing knowledge of COVID-19's lasting impacts.\r\nThe team reviewed real-world data from electronic medical rec… [+2611 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Most Common Questions Answered - Loma Linda University Health", "description": "Have questions about cardiovascular disease or want to learn more about how to manage your blood pressure, cholesterol or diabetes? Dr. Pooja Swamy an assist...", "url": "https://www.youtube.com/watch?v=PSNQoGhq_uI", "urlToImage": "https://i.ytimg.com/vi/PSNQoGhq_uI/maxresdefault.jpg", "publishedAt": "2023-02-01T16:00:19Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Could novel lineages eventually dominate the viral population? - News-Medical.Net", "description": "A new study puts forward a bottom-up approach to quickly predict whether a lineage will dominate the viral population, at a particular geographical location.", "url": "https://www.news-medical.net/news/20230201/Could-novel-lineages-eventually-dominate-the-viral-population.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_737558_16752662034219718.jpg", "publishedAt": "2023-02-01T15:57:00Z", "content": "Epidemiological surveillance can now be conducted in close to real-time owing to current viral genomic sequencing efforts. The challenge is to identify variants that could pose potential threats, wit… [+5414 chars]"}, {"source": {"id": null, "name": "Clinical Trials Arena"}, "author": "GlobalData Healthcare", "title": "Cervical cancer trials decrease for 2022 - Clinical Trials Arena", "description": "Cervical cancer is the fourth most common cancer in women, with a five-year survival rate of 66%, and is mostly caused by HPV infection.", "url": "http://www.clinicaltrialsarena.com/comment/cervical-cancer-trials-decrease/", "urlToImage": "https://www.clinicaltrialsarena.com/wp-content/uploads/sites/22/2023/02/cervical-cancer.jpg", "publishedAt": "2023-02-01T15:53:01Z", "content": "This week focuses on cervical cancer prevention in the UK. Since last years Cervical Cancer Trials Peak for 2021 analyst briefing, GlobalData has recorded a decrease in the number of cervical cancer … [+1630 chars]"}, {"source": {"id": null, "name": "Advisory.com"}, "author": null, "title": "Can these viruses increase your risk of dementia? - The Daily Briefing", "description": "", "url": "https://www.advisory.com/daily-briefing/2023/02/01/viruses-dementia", "urlToImage": null, "publishedAt": "2023-02-01T15:34:54Z", "content": "At least 22 viral infections were associated with an increased risk of neurodegenerative diseases, including Alzheimer's and dementia, according to a new study published in Neuron. However, the resea… [+3752 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Pat Tanumihardja", "title": "Balinese spice mix turns leftover chicken into a delicious souvenir - The Washington Post", "description": "This recipe for a shredded chicken dish was inspired by a trip to Bali and the spice mix prevalent there.", "url": "https://www.washingtonpost.com/food/2023/02/01/bali-shredded-chicken-recipe/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZOTDQKKA6HQ2WTOUG5PIIVZABE.jpg&w=1440", "publishedAt": "2023-02-01T15:13:18Z", "content": "Comment on this story\r\nIn Bali, this simple dish is usually served with a scoop of rice and a side of fresh vegetables called lalapan food writer Pat Tanumihardja prefers sliced cucumbers and tomatoe… [+3595 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brain: You Must Look Out For These Signs Of Brain Tumour - NDTV", "description": "Read on as we examine some of the signs of brain tumours you must look out for.", "url": "https://www.ndtv.com/health/brain-you-must-look-out-for-these-signs-of-brain-tumour-3744424", "urlToImage": "https://c.ndtvimg.com/2021-07/2iq4gmsk_brain-_625x300_21_July_21.jpg", "publishedAt": "2023-02-01T14:44:28Z", "content": "Watching out for signs of brain tumour promotes early diagnosis\r\nBoth children and adults can develop benign or malignant (cancerous) brain tumours. Brain tumours can affect your brain function wheth… [+4135 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "Groundbreaking Biomaterial Injected Intravenously Repairs Cells and Tissue Damaged by Heart Attack and TBI - HospiMedica", "description": "Following a heart attack, there is development of scar tissue, which affects muscle function and can result in congestive heart failure. Now, a newly-developed biomaterial that can be injected intravenously reduces inflammation in tissue and encourages cell a…", "url": "https://www.hospimedica.com/critical-care/articles/294796125/groundbreaking-biomaterial-injected-intravenously-repairs-cells-and-tissue-damaged-by-heart-attack-and-tbi.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2023-02-01/SDD-294796125.jpg", "publishedAt": "2023-02-01T14:33:39Z", "content": "Following a heart attack, there is development of scar tissue, which affects muscle function and can result in congestive heart failure. However, there is still no established treatment available for… [+4258 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Algarve Keto Gummies [Enhanced Keto Gummies] Reviews Truth! Best Keto Gummies for Weight Loss? - The Tribune India", "description": "By placing your body into the metabolic condition known as ketosis, Algarve Keto Gummies assist your body in using fat stores as opposed to carbohydrates for energy. You may expect to lose weight securely and healthily because to the formula's active ingredie…", "url": "https://www.tribuneindia.com/news/brand-connect/algarve-keto-gummies-enhanced-keto-gummies-reviews-truth-best-keto-gummies-for-weight-loss-475661", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/2/2023_2$largeimg_901820215.png", "publishedAt": "2023-02-01T14:13:00Z", "content": "By placing your body into the metabolic condition known as ketosis, Algarve Keto Gummies assist your body in using fat stores as opposed to carbohydrates for energy. You may expect to lose weight sec… [+7526 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Kavita Verma", "title": "A new vaccine to fight fungal infections has passed clinical trials - Interesting Engineering", "description": "Invasive fungal infections have recently become a significant concern due to the increasing resistance to antifungal drugs.", "url": "https://interestingengineering.com/health/new-vaccine-to-fight-fungal-infections", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/02/01/image/jpeg/BsXbJE2tq81rOUxhYe4osOpokZvA00BNhdoyAJmd.jpg", "publishedAt": "2023-02-01T13:57:00Z", "content": "The researchers used various immune-compromised models, mirroring drug regimens that are common among transplant recipients, people with HIV, and cancer patients groups that are among the most vulner… [+1227 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Airway microbiota 'unlikely to be a strong target' in severe childhood asthma/wheeze - Healio", "description": "Children with asthma/wheeze demonstrated a strong relationship between age and airway microbiota, with a modest difference observed based on asthma severity, according to study results published in Annals of the American Thoracic Society.&ldquo;Little is stil…", "url": "https://www.healio.com/news/pulmonology/20230201/airway-microbiota-unlikely-to-be-a-strong-target-in-severe-childhood-asthmawheeze", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/pulmonology/i/inhaler-child_adobe.jpg", "publishedAt": "2023-02-01T13:22:20Z", "content": "Children with asthma/wheeze demonstrated a strong relationship between age and airway microbiota, with a modest difference observed based on asthma severity, according to study results published in A… [+4167 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "K3 Spark Mineral: Weight Loss Supplement, Diet! - Deccan Herald", "description": "Research has shown that one-third of American adults are obese or overweight. Six out of ten Americans are struggling to shed weight. Obesity is linked to numerous health issues. Apart from affecting your appearance, weight gain can have a negative impact on …", "url": "https://www.deccanherald.com/brandspot/pr-spot/k3-spark-mineral-weight-loss-supplement-diet-1186828.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p3-1186828-1675256865.png", "publishedAt": "2023-02-01T13:07:45Z", "content": "Research has shown that one-third of American adults are obese or overweight. Six out of ten Americans are struggling to shed weight. Obesity is linked to numerous health issues. Apart from affecting… [+26734 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Buttermilk or curd, yoghurt: What you should have (and avoid) - The Indian Express", "description": "\"It is best to stick with sweet buttermilk if someone has digestive issues like constipation, gastric or acid reflux, etc,\" said Dr Yogini Patil, BAMS and nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/heres-why-you-should-choose-buttermilk-over-curd-and-yoghurt-8132340/", "urlToImage": "https://images.indianexpress.com/2022/09/curd.jpg", "publishedAt": "2023-02-01T12:00:17Z", "content": "Despite coming from the same source — milk — many a time, experts suggest consuming buttermilk instead of curd or yoghurt. But, why is it so, and what is the difference (or similarity) between the th… [+3514 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Minnesota research examines maternal safety outside the clinical setting - India Education Diary", "description": "Most policy, research and clinical efforts to reduce maternal mortality focus on clinical risk factors and the quality of hospital-based care for pregnant people, but a new study examines maternal safety outside the clinical setting. Intimate partner", "url": "https://indiaeducationdiary.in/university-of-minnesota-research-examines-maternal-safety-outside-the-clinical-setting/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/02/Unews-Image-Templates-3_2-31.png?fit=900%2C600&ssl=1", "publishedAt": "2023-02-01T11:45:09Z", "content": "Most policy, research and clinical efforts to reduce maternal mortality focus on clinical risk factors and the quality of hospital-based care for pregnant people, but a new study examines maternal sa… [+2919 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Postoperative analgesic medication after thyroid surgery | IJGM - Dove Medical Press", "description": "Emerging evidence supports the use of non-opioid and other alternative analgesic strategies in outpatient thyroid and parathyroid surgery.", "url": "https://www.dovepress.com/patterns-of-prescribing-postoperative-analgesic-medication-after-thyro-peer-reviewed-fulltext-article-IJGM", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-02-01T11:18:56Z", "content": "Background\r\nPain is defined as “an unpleasant sensory and emotional experience associated with actual or potential tissue damage, or described in terms of such damage”.1 Surgery triggers a wide range… [+19359 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Gold Coast Keto Maggie Beer Australia Review - Gold Coast Keto Capsules AU Scam Or Keto Gummies Australia Fake & Trusted Results? - mid-day.com", "description": "Gold Coast Keto Capsules A ketogenic diet also known as the \"keto diet\" is an extremely low-fat, low-carbohydrate, and high-fat food plan that's been proven to aid in weight loss and help improve certain health issues.", "url": "https://www.mid-day.com/brand-media/article/gold-coast-keto-maggie-beer-australia-review-gold-coast-keto-capsules-au-scam-23268326", "urlToImage": "https://images.mid-day.com/images/images/2023/feb/Top-Reviews1_d.jpg", "publishedAt": "2023-02-01T10:32:00Z", "content": "Gold Coast Keto Capsules A ketogenic diet also known as the \"keto diet\" is an extremely low-fat, low-carbohydrate, and high-fat food plan that's been proven to aid in weight loss and help improve cer… [+9570 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Chhavi", "title": "Menstrual Symptoms Hurt Workplace Productivity Of Many Women, UVA Health Study Finds - Medical Dialogues", "description": "Menstrual Symptoms Hurt Workplace Productivity Of Many Women, UVA Health Study Finds", "url": "https://medicaldialogues.in/photo-stories/menstrual-symptoms-hurt-workplace-productivity-of-many-women-uva-health-study-finds-229", "urlToImage": "https://medicaldialogues.in/h-upload/2023/02/01/200170-amp-stories-cover-70.jpg", "publishedAt": "2023-02-01T09:32:42Z", "content": "MENSTRUAL SYMPTOMS HURT WORKPLACE PRODUCTIVITY OF MANY WOMEN, UVA HEALTH STUDY FINDS\r\nThe researchers have published their findings in Digital Health. The research team included Sonia Ponzo, Aidan Wi… [+97 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Neurotonix: 2023 [Updated] Harmful Side Effects or Effective Ingredients? Resulting in Fraud or Safety? - mid-day.com", "description": "Neurotonix Reviews - NeuroTonix is a unique blend of probiotics, plant extracts, and vitamins combined to create a powerful formula to support the health and cognitive function of the brain and nervous system.", "url": "https://www.mid-day.com/brand-media/article/neurotonix-2023-updated-harmful-side-effects-or-effective-ingredients-result-23268307", "urlToImage": "https://images.mid-day.com/images/images/2023/feb/Nurotonix12_d.jpg", "publishedAt": "2023-02-01T08:55:00Z", "content": "Neurotonix Reviews - NeuroTonix is a unique blend of probiotics, plant extracts, and vitamins combined to create a powerful formula to support the health and cognitive function of the brain and nervo… [+15320 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "John Sterling", "title": "Type 1 Diabetes May Be Treatable with Immunological Drug - Genetic Engineering & Biotechnology News", "description": "Swedish researchers have begun a clinical study on an approved drug for treating psoriasis that will be tested on patients who were recently diagnosed with type 1 diabetes. The theory is that the drug could preserve the patient’s remaining insulin production.", "url": "https://www.genengnews.com/topics/translational-medicine/type-1-diabetes-my-be-treatable-with-immunological-drug/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2023/01/GettyImages-1360140296-scaled.jpg", "publishedAt": "2023-02-01T08:00:28Z", "content": "Swedish researchers have begun a clinical study on an approved drug for treating psoriasis that will be tested on patients who were recently diagnosed with type 1 diabetes. The theory is that the dru… [+5116 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Fasting Sugar Level 125 But Hb1ac Normal, Is It A Sign Of Diabetes? - News18", "description": "According to WHO reports, more than 8 crore people in India are suffering from diabetes.", "url": "https://www.news18.com/news/lifestyle/fasting-sugar-level-125-but-hb1ac-normal-is-it-a-sign-of-diabetes-6965959.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/dibates-167523436416x9.jpg", "publishedAt": "2023-02-01T06:53:33Z", "content": "Diabetes is a chronic disease increasing at an alarming rate. According to the statistics of the World Health Organisation, more than 42.2 million people in the world are suffering from diabetes. Of … [+2546 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Erectile dysfunction: Causes, symptoms, prevention, treatment of sexual disorder - Hindustan Times", "description": "Erectile dysfunction is becoming an epidemic that is hurting males of the younger generation and can also have a negative impact on relationships and marriages. Here are the causes, symptoms, negative effects, prevention tips and effective treatments of this …", "url": "https://www.hindustantimes.com/lifestyle/health/erectile-dysfunction-in-males-causes-symptoms-prevention-tips-effective-treatments-of-this-sexual-disorder-in-men-101675232725015.html", "urlToImage": "https://images.hindustantimes.com/img/2023/02/01/1600x900/pexels-mart-production-7699538_1675232956917_1675232982533_1675232982533.jpg", "publishedAt": "2023-02-01T06:45:51Z", "content": "Erectile dysfunction is a sexual disorder that affects a significant portion of the male population and in recent years, it has become an increasingly prevalent problem among the younger generation w… [+3232 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Oxandrolone Buy - Oxandrolone Price Oxandrolone Buy - Oxandrolone Side Effects Or Effects - Deccan Herald", "description": "What exactly is Anavar Oxandrolone? Anavar Oxandrolone (Oxandrolone) is an anabolic steroid that is taken orally, invented in 1962 in order to help increase the growth of lean muscles for people suffering from muscle-wasting disorders. Another major goal in c…", "url": "https://www.deccanherald.com/brandspot/pr-spot/oxandrolone-buy-oxandrolone-price-oxandrolone-buy-oxandrolone-side-effects-or-effects-1186665.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1186665-1675229954.png", "publishedAt": "2023-02-01T05:39:14Z", "content": "What exactly is Anavar Oxandrolone?\r\nAnavar Oxandrolone (Oxandrolone) is an anabolic steroid that is taken orally, invented in 1962 in order to help increase the growth of lean muscles for people suf… [+35482 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers discover two separate reservoirs of latent HIV in patients - ANI News", "description": "When HIV patients get antiviral medication (ART), their viral levels are reduced to the point that a conventional blood test cannot detect the virus. However, once ART is discontinued, detectable HIV resurfaces, infecting new cells. The cells that release the…", "url": "https://www.aninews.in/news/health/researchers-discover-two-separate-reservoirs-of-latent-hiv-in-patients20230201094919", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230201031850.jpg", "publishedAt": "2023-02-01T04:19:00Z", "content": "Chappel Hill (North Carolina) [US], February 1 (ANI): When HIV patients get antiviral medication (ART), their viral levels are reduced to the point that a conventional blood test cannot detect the vi… [+2439 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Aryan Bajaj", "title": "Best fat burner for women for safe and effective results - Sportskeeda", "description": "Finding the best fat burner for women can be quite a task. Fat burners are a popular way for women to lose weight, but with so many options available, it can be difficult to know which one to choose.", "url": "https://www.sportskeeda.com/health-and-fitness/best-fat-burner-women-safe-effective-results", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/02/52946-16751915507221-1920.jpg", "publishedAt": "2023-02-01T03:30:00Z", "content": "Finding the best fat burner for women can be quite a task. Fat burners are a popular way for women to lose weight, but with so many options available, it can be difficult to know which one to choose.… [+5899 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Best Ayurvedic home remedies to make your vision stronger - Indiatimes.com", "description": "​Here are some crucial ayurvedic solutions to enhance your vision.​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/wellness/best-ayurvedic-home-remedies-to-make-your-vision-stronger/photostory/97502580.cms", "urlToImage": "https://static.toiimg.com/photo/97502643.cms", "publishedAt": "2023-02-01T03:30:00Z", "content": "“Regularly, twice a day, wash your eyes with Triphala water. Triphala eyewash is incredibly effective at treating eye conditions and preserving eyesight. Dry eyes, computer vision syndrome, cataracts… [+747 chars]"}, {"source": {"id": null, "name": "openPR"}, "author": "1-800-792-5285", "title": "Sepsis Diagnostics Market By 2030 | Analysis by Key Players Focusing on Growth Strategies - Thermo Fisher Scie - openPR", "description": "Sepsis is the body s extreme reaction to infection This is a life threatening medical emergency Sepsis occurs when an existing infection sets off a chain reaction throughout the body Infections leading to sepsis most commonly begin in the lungs ...", "url": "https://www.openpr.com/news/2907603/sepsis-diagnostics-market-by-2030-analysis-by-key-players", "urlToImage": "https://cdn.openpr.com/W/2/W201466663_g.jpg", "publishedAt": "2023-02-01T02:45:00Z", "content": "Sepsis Diagnostics Market\r\nSepsis is the body's extreme reaction to infection. This is a life-threatening medical emergency. Sepsis occurs when an existing infection sets off a chain reaction through… [+6832 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Pune Municipal Corporation targets routine vaccine of 10,000 kids in three months - Times of India", "description": "The civic body is now planning to administer the measles vaccine and other jabs part of the routine immunisation programme to at least 10,000 childre", "url": "https://timesofindia.indiatimes.com/city/pune/pune-municipal-corporation-targets-routine-vaccine-of-10000-kids-in-three-months/articleshow/97508143.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97508211,width-1070,height-580,imgsize-41168,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-02-01T02:26:00Z", "content": ""}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "SMSala", "title": "Cervical Cancer: Stages, Symptoms, Causes, Prevention and Treatment - Rising Kashmir", "description": "DR.SUMAN LAL\n&nbsp;\nCervical cancer is a form of a life-threatening cancer which starts in the cells of the cervix. The cervix is referred to as the entrance to the uterus (or the womb). Most cervical cancer cases are caused due to infection from high-risk hu…", "url": "http://risingkashmir.com/cervical-cancer-stages-symptoms-causes-prevention-and-treatment-253ea299-b105-4eec-a00b-5fdbada8e418", "urlToImage": "http://admin.risingkashmir.com/Source/News/e4406efe-d058-44b3-ab22-7111add58ba9.jpg", "publishedAt": "2023-01-31T22:18:02Z", "content": "DR.SUMAN LAL\r\nCervical cancer is a form of a life-threatening cancer which starts in the cells of the cervix. The cervix is referred to as the entrance to the uterus (or the womb). Most cervical canc… [+4004 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Healthy lifestyle can cut CVD risk in patients with FH - Healio", "description": "A healthy lifestyle was associated with reduced risk for CVD among adults with familial hypercholesterolemia regardless of their familial hypercholesterolemia mutation status, researchers reported.&ldquo;DNA is not destiny; it is not deterministic for familia…", "url": "https://www.healio.com/news/cardiology/20230131/healthy-lifestyle-can-cut-cvd-risk-in-patients-with-fh", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/cardiology/h/hypercholesterolemia_adobestock.jpg", "publishedAt": "2023-01-31T19:26:19Z", "content": "Source/Disclosures\r\n Disclosures: \r\nThe study authors report no relevant financial disclosures. Santos reports receiving consultant, research and speaking fees from Abbott, Ache, Amgen, Amryt, AstraZ… [+3712 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Benefits of a Weighted Blanket - ABC4 Utah", "description": "Benefits of a Weighted Blanket", "url": "https://www.youtube.com/watch?v=UMUeYBM8RTo", "urlToImage": "https://i.ytimg.com/vi/UMUeYBM8RTo/maxresdefault.jpg", "publishedAt": "2023-01-31T19:23:15Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Moderate-to-vigorous physical activity promotes good-quality sleep - News-Medical.Net", "description": "An adequate amount of good-quality sleep is essential for the physical and emotional well-being of humans. For instance, good-quality sleep helps improve the outcomes of various diseases, including cardiovascular and metabolic disorders, mental diseases, and …", "url": "https://www.news-medical.net/news/20230131/Moderate-to-vigorous-physical-activity-promotes-good-quality-sleep.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Physical_Activity-620x480.jpg", "publishedAt": "2023-01-31T17:03:00Z", "content": "An adequate amount of good-quality sleep is essential for the physical and emotional well-being of humans. For instance, good-quality sleep helps improve the outcomes of various diseases, including c… [+3265 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brain: 5 Foods To Eat & 5 Foods To Avoid For Good Brain Health - NDTV", "description": "In this article, we share our list of the best and worst foods for brain health.", "url": "https://www.ndtv.com/health/brain-5-foods-to-eat-5-foods-to-avoid-for-good-brain-health-3740610", "urlToImage": "https://c.ndtvimg.com/2022-06/10vn8akg_brain-foods_650x400_14_June_22.jpg", "publishedAt": "2023-01-31T15:04:32Z", "content": "Certain foods can help boost the health of our brain\r\nOne of the most significant organs in your body is your brain. It maintains all of your body's processes running smoothly, including your heart p… [+4645 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Srishti Singh Sisodia", "title": "Cervical cancer: Expert tells WION about symptoms to be kept in check and a few preventive measures - WION", "description": "Cervical cancer: Expert tells WION about symptoms to be kept in check and a few preventive measures", "url": "https://www.wionews.com/entertainment/lifestyle/news-cervical-cancer-expert-tells-wion-about-symptoms-to-be-kept-in-check-and-a-few-preventive-measures-557634", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/01/31/329318-cervical-cancer.png", "publishedAt": "2023-01-31T13:58:04Z", "content": "Cervical cancer means an abnormal and uncontrolled growth in the cervix, it can be in the form of an ulcer or tumour. It is a type of cancer that occurs in the cells of the cervix, which is the entra… [+5259 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Cleanest Body Reviews 2023 Updated – Is It Legit or Cheap Ingredients? - Deccan Herald", "description": "Water is vital for the human body, so it's not surprising that many people are worried regarding the purity of their drinking water. What are you going to do to realize that you're more likely to become obese since your tap water is contaminated with mutated …", "url": "https://www.deccanherald.com/brandspot/pr-spot/cleanest-body-reviews-2023-updated-is-it-legit-or-cheap-ingredients-1186388.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1186388-1675169750.png", "publishedAt": "2023-01-31T12:55:50Z", "content": "Water is vital for the human body, so it's not surprising that many people are worried regarding the purity of their drinking water. What are you going to do to realize that you're more likely to bec… [+28958 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Provitalize Reviews - What Is Provitalize - Better Body Provitalize - Deccan Herald", "description": "The majority of people want a more flatter stomach, a radiant face and a well-balanced body. A certain manufacturer promises all of these but is it real? In this Provitalize review, I've attempted to address these issues and have included some most important …", "url": "https://www.deccanherald.com/brandspot/pr-spot/provitalize-reviews-what-is-provitalize-better-body-provitalize-1186328.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1186328-1675159206.png", "publishedAt": "2023-01-31T10:00:06Z", "content": "The majority of people want a more flatter stomach, a radiant face and a well-balanced body. A certain manufacturer promises all of these but is it real?\r\nIn this Provitalize review, I've attempted t… [+25638 chars]"}]}