{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Carbs, sugary diets may cause poor oral health, says research - Hindustan Times", "description": "A new study on postmenopausal women finds links between widely consumed foods and the diversity and composition of oral bacteria. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/carbs-sugary-diets-may-cause-poor-oral-health-says-research-101668257652521.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/12/1600x900/_e41b9462-6262-11e8-a998-12ee0acfa260_1668257837578_1668257837578.jpg", "publishedAt": "2022-11-12T13:02:12Z", "content": "A new study on postmenopausal women finds links between widely consumed foods and the diversity and composition of oral bacteria. Scientists from the University at Buffalo have shown how eating certa… [+3316 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "World Diabetes Day 2022: Diabetes complications to watch out for in kids - Hindustan Times", "description": "Diabetes in kids can lead to many complications and could be life-threatening too requiring hospitalisation. Here's all you want to know. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/world-diabetes-day-2022-diabetes-complications-to-watch-out-for-in-kids-simple-lifestyle-changes-101668256140801.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/12/1600x900/diabetes_in_kids_1668256371836_1668256394115_1668256394115.jpg", "publishedAt": "2022-11-12T12:42:06Z", "content": "Diabetes in children is on rise due to sedentary lifestyle and unhealthy food choices in the past few years. Pandemic era too contributed to this growing trend considering many kids were restricted t… [+3376 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI", "title": "Premature death linked to consumption of ultra processed food: Studys - Business Standard", "description": "In Brazil reducing UPF consumption by 10 per cent to 50 per cent could potentially prevent 5900 to 29300 premature deaths annually", "url": "https://www.business-standard.com/article/current-affairs/premature-death-linked-to-consumption-of-ultra-processed-food-study-122111200923_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-11/12/full/1605201093-7273.jpg", "publishedAt": "2022-11-12T12:24:00Z", "content": "Recent studies have shown that ultra-processed foods (UPFs), ready-to-eat or heat industrial formulations made with ingredients taken from foods or synthesised in laboratories, are gradually replacin… [+4027 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "How humans feel pain of others: A deep analysis - ThePrint", "description": "Amsterdam [Netherlands], November 12 (ANI): A recent study from the Netherlands Institute for Neuroscience used recordings from human patients’ neurons to demonstrate how the insula, a part of the brain important for our own emotions, is directly affected by …", "url": "https://theprint.in/health/how-humans-feel-pain-of-others-a-deep-analysis/1213071/", "urlToImage": null, "publishedAt": "2022-11-12T12:14:01Z", "content": "Amsterdam [Netherlands], November 12 (ANI): A recent study from the Netherlands Institute for Neuroscience used recordings from human patients’ neurons to demonstrate how the insula, a part of the br… [+6144 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "faith geiger", "title": "These Are The Best Snacks To Boost Heart Health This Fall, Experts Say - Yahoo Life", "description": "Discover 4 tasty and healthy snacks to keep your heart in good shape, only on SheFinds.", "url": "https://www.shefinds.com/collections/best-snacks-boost-heart-health-fall/", "urlToImage": "https://www.shefinds.com/files/2022/11/pumpkin-muffings-top-with-pepita-seeds-1.jpg", "publishedAt": "2022-11-12T12:00:22Z", "content": "It’s no secret that your diet plays a major role in your cardiovascular health. For starters, limiting your intake of things like red meat, fatty fried foods, and high-sugar snacks is a must if you w… [+3246 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Pills to make way diabetes and cancer injections - Times Now", "description": "A new research conducted by UC Riverside has says it will soon be possible to manage ailments like diabetes and cancer totally on pills, rather than using injection and needles owing to a chemical tag that would make them easer to enter the bloodstream throug…", "url": "https://www.timesnownews.com/health/pills-to-make-way-diabetes-and-cancer-injections-article-95473216", "urlToImage": "https://static.tnn.in/thumb/msid-95473216,imgsize-100,width-1280,height-720,resizemode-75/95473216.jpg", "publishedAt": "2022-11-12T11:37:00Z", "content": "Researchers have developed a chemical \"tag\" that can be attached to medications, enabling them to enter the bloodstream through the intestines"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "World Diabetes Day 2022: Best and worst time to eat dinner for diabetics - Hindustan Times", "description": "World Diabetes Day 2022: Eating late at night can spike sugar levels. Here's all you want to know about the right time to eat dinner for people with diabetes. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/world-diabetes-day-2022-best-and-worst-time-to-eat-dinner-for-diabetics-revealed-by-expert-101668251121936.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/12/1600x900/healthy_dinner_1668251264588_1668251276002_1668251276002.jpg", "publishedAt": "2022-11-12T11:20:11Z", "content": "World Diabetes Day 2022: The timing of your meal can play a big role in managing your blood sugar levels. This is especially true in case of dinner time which could be the deciding factor behind stab… [+4133 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Scientists repurpose cancer immunotherapy technique for variant-proof Covid treatment - The Week", "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI", "url": "https://www.theweek.in/wire-updates/international/2022/11/12/lst4-virus-cell-therapy-treatment.html", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2022-11-12T11:15:05Z", "content": "Washington, Nov 12 (PTI) Scientists have adapted what is typically a cancer therapeutic technique, CAR-T cell therapy, for the purpose of eliminating the SARS-CoV-2 virus, according to a study.The te… [+2031 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Popular dietary supplements may increase cancer risk: Study - Deccan Herald", "description": "Intake of popular commercial dietary supplements like nicotinamide riboside (NR), a form of vitamin B3, could actually increase the risk of serious diseases, including cancer, a new study has found. The team of researchers discovered that high levels of NR co…", "url": "https://www.deccanherald.com/science-and-environment/popular-dietary-supplements-may-increase-cancer-risk-study-1161705.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/12/thinkstockphotos-682880934-1-1161705-1668250375.jpg", "publishedAt": "2022-11-12T10:52:55Z", "content": "Intake of popular commercial dietary supplements like nicotinamide riboside (NR), a form of vitamin B3, could actually increase the risk of serious diseases, including cancer, a new study has found.\r… [+3198 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UCL: Personalising whole genome sequencing doubles diagnosis of rare diseases - India Education Diary", "description": "In 2018, the UK’s department of health announced an NHS Genomic Medicine Service, which allows patients with rare diseases to have their entire genetic code read in the hope of providing a much-needed diagnosis.However, the interpretation of this dat", "url": "https://indiaeducationdiary.in/ucl-personalising-whole-genome-sequencing-doubles-diagnosis-of-rare-diseases/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/ucl.png?fit=768%2C480&ssl=1", "publishedAt": "2022-11-12T09:03:41Z", "content": "In 2018, the UKs department of health announced an NHS Genomic Medicine Service, which allows patients with rare diseases to have their entire genetic code read in the hope of providing a much-needed… [+4251 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Alzheimer's disease can be diagnosed before patients experience symptoms: Study - Hindustan Times", "description": "People suffering from Alzheimer's disease can be identified before they experience any symptoms and it's also possible to predict who will deteriorate within the next few years, suggests the findings of a large study led by Lund University in Sweden. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/alzheimers-disease-can-be-diagnosed-before-patients-experience-symptoms-study-101668242949397.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/12/1600x900/_a6a8f328-a1e0-11e8-9345-8d51f8ed9678_1668243132587_1668243132587.jpg", "publishedAt": "2022-11-12T08:54:45Z", "content": "People suffering from Alzheimer's disease can be identified before they experience any symptoms and it's also possible to predict who will deteriorate within the next few years, suggests the findings… [+3371 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UCL: Increasing children’s immunity to deadly diseases through improved vaccine strategy - India Education Diary", "description": "Research led by UCL in partnership with the University of Liverpool (UoL), the Malawi Ministry of Health, and the Malawi Liverpool Wellcome Programme (MLW), has shown that the current pneumococcal conjugate vaccine (PCV) schedule in Malawi – as offer", "url": "https://indiaeducationdiary.in/ucl-increasing-childrens-immunity-to-deadly-diseases-through-improved-vaccine-strategy/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/ucl.png?fit=768%2C480&ssl=1", "publishedAt": "2022-11-12T08:15:50Z", "content": "Research led by UCL in partnership with the University of Liverpool (UoL), the Malawi Ministry of Health, and the Malawi Liverpool Wellcome Programme (MLW), has shown that the current pneumococcal co… [+4914 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UCL: Shorter treatment effective for drug-resistant tuberculosis - India Education Diary", "description": "The study, published by The Lancet, found that a six-month treatment regimen including injections and a nine-month regimen taken only in tablets, both of which used the new drug bedaquiline, were more effective than a nine-month regimen that until tw", "url": "https://indiaeducationdiary.in/ucl-shorter-treatment-effective-for-drug-resistant-tuberculosis/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/ucl.png?fit=768%2C480&ssl=1", "publishedAt": "2022-11-12T08:15:50Z", "content": "The study, published by The Lancet, found that a six-month treatment regimen including injections and a nine-month regimen taken only in tablets, both of which used the new drug bedaquiline, were mor… [+3643 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "Precautions people with PCOS can take to reduce diabetes risk - India Today", "description": "Most PCOS-affected women who have a body mass index (BMI) of over 25 are at a high risk of developing diabetes. Doctors suggest making various lifestyle changes to reduce the risk.", "url": "https://www.indiatoday.in/health/story/precautions-people-with-pcos-can-take-to-reduce-diabetes-risk-2296034-2022-11-12", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/gettyimages-1316977154--sixteen_nine.jpg?VersionId=f0erT0blqqmCrJKZyXRYfc_9dwcdaf7r", "publishedAt": "2022-11-12T07:43:03Z", "content": "By Daphne Clarance: There has been a link between Polycystic Ovary Syndrome (PCOS) and diabetes. Since both these diseases are metabolic disorders, many women who have PCOS and often succumb to poor … [+2842 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: First ever clinical trial of lab-grown red blood cell transfusion - India Education Diary", "description": "Cambridge researchers are taking part in the world’s first clinical trial of red blood cells that have been grown in a laboratory for transfusion into another person.If our trial is successful, it will mean that patients who currently require regular", "url": "https://indiaeducationdiary.in/university-of-cambridge-first-ever-clinical-trial-of-lab-grown-red-blood-cell-transfusion/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg?fit=400%2C400&ssl=1", "publishedAt": "2022-11-12T07:31:55Z", "content": "Cambridge researchers are taking part in the worlds first clinical trial of red blood cells that have been grown in a laboratory for transfusion into another person.\r\nIf our trial is successful, it w… [+5821 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Trivedi", "title": "World Pneumonia Day: Know THESE 10 facts about the respiratory disease - Zee News", "description": "Pneumonia is a serious, potentially life-threatening lung infection that can strike both children and adults.  It is the single biggest infectious killer of adults and children, with an annual mortality rate of roughly 2.5 million adults and children globally.", "url": "https://zeenews.india.com/health/world-pneumonia-day-know-these-10-facts-about-the-respiratory-disease-2534236", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/12/1115935-untitled-design-2022-11-12t121640.103.png", "publishedAt": "2022-11-12T06:49:00Z", "content": "World Pneumonia Day 2022: Pneumonia is a serious, potentially life-threatening lung infection that can strike both children and adults.  It is the single biggest infectious killer of adults and child… [+2859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World Diabetes Day 2022: 7 Food Groups To Avoid If You Are A Pre-Diabetic - NDTV", "description": "If your blood sugar level is greater than usual, you may have pre-diabetes. If you are pre-diabetic, keep reading to learn which items you should eliminate from your diet.", "url": "https://www.ndtv.com/health/world-diabetes-day-2022-7-food-groups-to-avoid-if-you-are-a-pre-diabetic-3512408", "urlToImage": "https://c.ndtvimg.com/2021-03/elhm2aa8_junk-food_625x300_22_March_21.jpg", "publishedAt": "2022-11-12T06:26:26Z", "content": "World Diabetes Day 2022: Junk food is unhealthy due to high levels of sodium, sugar and saturated fat\r\nDiabetes is a significant contributor to renal disease, heart attacks, strokes, blindness, and l… [+4508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "No let up in dengue cases despite winter nearing, tally crosses 400 in Gurgaon - The Indian Express", "description": "According to the health department, the worst affected areas come under the primary health centres in Wazirabad and Gurgaon village. The cases are likely to subside in the coming weeks.", "url": "https://indianexpress.com/article/delhi/no-let-up-in-dengue-cases-despite-winter-nearing-tally-crosses-400-in-gurgaon-8264234/", "urlToImage": "https://images.indianexpress.com/2022/08/ch806778.jpg", "publishedAt": "2022-11-12T05:48:13Z", "content": "Despite the winter season fast approaching, dengue cases continue to rise with over 419 cases being reported this year the highest in the district in six years. No dengue-related fatalities have been… [+1998 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Amalajobitha", "title": "You Have Only 15 Seconds. Spot All 13 Hidden Faces In This Optical Illusion Image - News - News", "description": "Can you Spot All 13 Hidden Faces? The Internet seems to have an insatiable hunger for them, and new optical illusions attract children to adults every day and boost their eagerness to play it. Recently there was an Optical Illusion: Can you Spot All 13 Hidden…", "url": "https://latestnews.fresherslive.com/articles/you-have-only-15-seconds-spot-all-13-hidden-faces-in-this-optical-illusion-image-1097345", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/11/12/you-have-only-15-seconds-spot-all-13-hidden-faces-in-this-optical-illusion-image-636f219d1f620-1668227485.jpg", "publishedAt": "2022-11-12T04:56:44Z", "content": "What Is Optical Illusion?\r\nOptical illusion, also known as Visual Illusion, is a kind of illusion caused by the visual system within visual perception. They are characterized by visual perception, wh… [+2090 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Expresso Health Updates Of The Week - The Indian Express", "description": "In this Expresso Health Updates Of The Week bulletin, we talk about actor Dia Mirza, who is extremely passionate about nature and its many benefits and healing properties. She recently took to Instagram to share a few pictures of her son Avyaan Azaad Rekhi en…", "url": "https://indianexpress.com/audio/expresso-entertainment-update/expresso-health-updates-of-the-week-12-8156155-8169292-8179156-8189949-8209412-8209422-8223999-8231958-8250463-8263587/8263587/", "urlToImage": "https://images.indianexpress.com/2022/04/Expresso-health-1200x630-1.jpg", "publishedAt": "2022-11-12T04:00:33Z", "content": "You are listening to the Expresso Health Update. Here is the latest news from the world of Health, brought to you by The Indian Express.\"Let's begin with news on actor Dia Mirza, who is extremely pas… [+6095 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Prevalence of Trigger Factors and Associated Disorders in Tension-type Headache - Medical Dialogues", "description": "Headache is most common pain suffered by  many. Tension-type headache is the most common primary headache disorder. As  per the Global Burden of Disease Study 2010, Tension-type headache is the ...", "url": "https://medicaldialogues.in/mdtv/neurology-neurosurgery/videos/prevalence-of-trigger-factors-and-associated-disorders-in-tension-type-headache-102213", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/12/190689-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-13.jpg", "publishedAt": "2022-11-12T04:00:16Z", "content": "Headache is most common pain suffered by many. Tension-type headache is the most common primary headache disorder. As per the Global Burden of Disease Study 2010, Tension-type headache is the second … [+2056 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Sudden Rise of Uric Acid Levels in a Patient with Chronic Kidney Disease: Is a Common Food to Blame? - Medical Dialogues", "description": "Chronic kidney disease (CKD) is often  characterized  with slightly raised serum  uric acid levels. Earlier, this urate level was thought to be an innocent  biochemical marker of kidney...", "url": "https://medicaldialogues.in/mdtv/nephrology/videos/sudden-rise-of-uric-acid-levels-in-a-patient-with-chronic-kidney-disease-is-a-common-food-to-blame-102212", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/12/190686-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-11.jpg", "publishedAt": "2022-11-12T03:45:22Z", "content": "Chronic kidney disease (CKD) is often characterized with slightly raised serum uric acid levels. Earlier, this urate level was thought to be an innocent biochemical marker of kidney dysfunction. But … [+2725 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "Chances of Finding the Direct Ancestor of COVID Virus Very Poor - NewsClick", "description": "COVID virus probably shared an ancestor with the coronaviruses found in bats more recently than was thought.", "url": "https://www.newsclick.in/chances-finding-direct-ancestor-COVID-virus-poor", "urlToImage": "https://www.newsclick.in/sites/default/files/2022-08/covid242.jpg", "publishedAt": "2022-11-12T03:00:00Z", "content": "The pandemic coronavirus SARS-CoV-2 originated in bats and made a jump into humansscientists know this. However, an enduring mystery of the pandemic is the exact origin of this virus and how this clo… [+4433 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Mumbai sees three-fold rise in measles - mid-day.com", "description": "From 37 cases in 2019, the city’s measles count has reached 109 this year; Centre’s team lands in Mumbai, to visit Govandi today to review situation", "url": "https://www.mid-day.com/mumbai/mumbai-news/article/mumbai-sees-three-fold-rise-in-measles-23255125", "urlToImage": "https://images.mid-day.com/images/images/2022/nov/Govandi-vaccine_d.jpg", "publishedAt": "2022-11-12T01:55:00Z", "content": "From 37 cases in 2019, the citys measles count has reached 109 this year; Centres team lands in Mumbai, to visit Govandi today to review situation\r\nBMC health officials screen children in Govandi on … [+2471 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Well-equipped gut-friendly bacteria hold promise for improving IBD treatments - News-Medical.Net", "description": "Like elite firefighters headed into the wilderness to combat an uncontrolled blaze, probiotic bacteria do a better job quelling gut inflammation when they're equipped with the best gear.", "url": "https://www.news-medical.net/news/20221111/Well-equipped-gut-friendly-bacteria-hold-promise-for-improving-IBD-treatments.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/9/Digital_composite_of_highlighted_red_painful_intestine_of_woman__health_care_%26__-_mi_viri_M1_e6797484d65c4349af727c0f40f1116a-620x480.jpg", "publishedAt": "2022-11-12T01:32:00Z", "content": "Like elite firefighters headed into the wilderness to combat an uncontrolled blaze, probiotic bacteria do a better job quelling gut inflammation when they're equipped with the best gear.\r\nA new study… [+3983 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Anonymous", "title": "Living with paranoid schizophrenia - Deccan Herald", "description": "As tears rolled down my face, my husband asked, “Should I love you like a poodle?” I hoped he would urge me to stay and reassure me that everything was fine and that he loved me and our five-year-old daughter. I was being sent to my mother’s house without my …", "url": "https://www.deccanherald.com/special-features/living-with-paranoid-schizophrenia-1161511.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/12/schizo-1161511-1668216592.jpg", "publishedAt": "2022-11-12T01:29:52Z", "content": "As tears rolled down my face, my husband asked, Should I love you like a poodle? I hoped he would urge me to stay and reassure me that everything was fine and that he loved me and our five-year-old d… [+12500 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals change in symptoms before and after start of dialysis in older patients with kidney failure - News-Medical.Net", "description": "In a study published in CJASN that included older adults with kidney failure, symptoms related to their condition worsened in the year before patients started dialysis but stabilized after dialysis initiation.", "url": "https://www.news-medical.net/news/20221111/Study-reveals-change-in-symptoms-before-and-after-start-of-dialysis-in-older-patients-with-kidney-failure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Dialysis-620x480.jpg", "publishedAt": "2022-11-12T00:28:00Z", "content": "In a study published in CJASN that included older adults with kidney failure, symptoms related to their condition worsened in the year before patients started dialysis but stabilized after dialysis i… [+2361 chars]"}, {"source": {"id": null, "name": "Hepmag.com"}, "author": null, "title": "Poor-Quality Sleep Linked to Fatty Liver Disease - Hep Treatment News", "description": "People with a tendency to be active later in the day may be at greater risk for severe NAFLD.", "url": "https://www.hepmag.com/article/poorquality-sleep-linked-fatty-liver-disease", "urlToImage": "https://cdn3.poz.com/131400_iStock-1257145596.jpg_79033219-89dd-4297-b6a6-d6110c6ae8f4_x2.jpg", "publishedAt": "2022-11-11T23:59:41Z", "content": "Disturbed nighttime sleep, daytime napping and snoring are associated with an increased risk of metabolic-associated fatty liver disease (MAFLD), according to research published in the Journal of Cli… [+5153 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Covid reinfection raises death risk: Study - msnNOW", "description": "According to a study published in Nature Medicine, compared to no reinfection, reinfection with Covid adds to the risk of complications associated with pulmonary, cardiovascular, haematological, diabetes, gastrointestinal, kidney, mental health, musculoskelet…", "url": "http://timesofindia.indiatimes.com/india/covid-reinfection-raises-death-risk-study/articleshow/95461129.cms", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA140CCV.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-11T21:27:00Z", "content": "NEW DELHI: Does reinfection add to long-Covid risk? Yes, it does. According to a study published in Nature Medicine, compared to no reinfection, reinfection with Covid adds to the risk of complicatio… [+1469 chars]"}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Long recovery, brain damage, effect of stressors with long COVID - CIDRAP", "description": "Two of the 4 new studies show that SARS-CoV-2 can profoundly damage the brain for months.", "url": "https://www.cidrap.umn.edu/news-perspective/2022/11/long-recovery-brain-damage-effect-stressors-long-covid", "urlToImage": "https://www.cidrap.umn.edu/sites/default/files/styles/thumbnail/public/images/news/tired_woman_at_train_window-frerieke.jpg?itok=c_NfKe1I", "publishedAt": "2022-11-11T19:59:32Z", "content": "Four new long-COVID studies reveal that 10% of French patients infected early in the pandemic still had symptoms 1 year later, SARS-CoV-2 can profoundly damage the brain for months, and very stressfu… [+5792 chars]"}, {"source": {"id": null, "name": "Mdanderson.org"}, "author": "Cynthia DeMarco", "title": "Cervical cancer symptoms: What to look for and when to see a doctor - MD Anderson Cancer Center", "description": "What are the symptoms of cervical cancer? Three patients share what they experienced, and gynecologic cancer surgeon Jolyn Sharpe Taylor, M.D., weighs in on when to see a doctor.", "url": "https://www.mdanderson.org/cancerwise/cervical-cancer-symptoms--what-to-look-for-and-when-to-see-a-doctor.h00-159544479.html", "urlToImage": "https://www.mdanderson.org/cancerwise/2022/11/cervical-cancer-symptoms--what-to-look-for-and-when-to-see-a-doctor/jcr:content/blog/adaptiveimage.resize.702.404.jpg", "publishedAt": "2022-11-11T16:07:30Z", "content": "Like many women diagnosed with cervical cancer\r\n, Linda Ryan\r\n didnt initially have any symptoms\r\n. So, she didnt know she had the disease until a routine Pap test came back abnormal\r\n after a well-w… [+4013 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Need appropriate steps to ensure Indian scientists are worthy of a Nobel Prize: Dr Himmatrao Bawaskar - The Indian Express", "description": "The expert in a letter titled, ‘Nomination for Nobel Prizes: Is it possible for Indian Scientists' published online on The Lancet on Friday said, \"Research productivities of India’s research institutes should be monitored closely.\"", "url": "https://indianexpress.com/article/cities/pune/science-free-corruption-political-administrative-interference-himmatrao-bawaskar-8263193/", "urlToImage": "https://images.indianexpress.com/2022/01/Himmatrao-Bawaskar.jpg", "publishedAt": "2022-11-11T15:55:11Z", "content": "Known for his research on path-breaking treatment for scorpion stings, Padma Shri awardee Dr Himmatrao Bawaskar in a letter to the editor published in The Lancet on Friday said that science should be… [+2786 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Why you should not ignore constipation, receding hairline, weight gain, stiffness, and weak memory - The Indian Express", "description": "\"The easiest and quickest way to ascertain the deficiency is a urine test. Results may be obtained in a matter of minutes, although it isn't as precise as some other tests,\" said Dr Ashoka Varshini Panga", "url": "https://indianexpress.com/article/lifestyle/health/iodine-deficiency-symptoms-causes-diagnosis-treatment-8250026/", "urlToImage": "https://images.indianexpress.com/2022/11/thyroid_1200_getty.jpg", "publishedAt": "2022-11-11T15:20:08Z", "content": "Worldwide, there are two billion individuals who suffer from iodine deficiency, according to World Health Organization (WHO). “It’s more prevalent in poor nations where individuals might not have eno… [+3618 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Addition of Sleep deprivation to treatment of depression may not enhance outcomes - Medical Dialogues", "description": "The addition of sleep deprivation to treatment packages  leads to enhanced depressive outcomes suggests a recent study published in the Sleep  Medicine Reviews    Sleep deprivation, alone or in...", "url": "https://medicaldialogues.in/psychiatry/news/addition-of-sleep-deprivation-to-treatment-of-depression-may-not-enhance-outcomes-102069", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/29/189330-download-4.jpg", "publishedAt": "2022-11-11T14:30:13Z", "content": "The addition of sleep deprivation to treatment packages leads to enhanced depressive outcomes suggests a recent study published in the Sleep Medicine ReviewsSleep deprivation, alone or in combination… [+1706 chars]"}, {"source": {"id": null, "name": "Farm and Dairy"}, "author": "Other News", "title": "Tracing tomatoes’ health benefits to gut microbes - Farm and Dairy", "description": "Two weeks of eating a diet heavy in tomatoes increased the diversity of gut microbes and altered gut bacteria toward a more favorable profile in young pigs.", "url": "https://www.farmanddairy.com/news/tracing-tomatoes-health-benefits-to-gut-microbes/745420.html", "urlToImage": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2019/07/22172509/tomato-2643774_1280-e1563830731882.jpg", "publishedAt": "2022-11-11T14:20:09Z", "content": "Two weeks of eating a diet heavy in tomatoes increased the diversity of gut microbes and altered gut bacteria toward a more favorable profile in young pigs, researchers found.\r\nAfter observing these … [+4092 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Prima Slim Review: Will PrimaSlim Work For You or Cheap Diet Pills? - The Tribune India", "description": "Losing weight safely and naturally can be challenging as many medications, supplements, and surgeries claim to help people attain that ideal weight but do nothing. While maintaining a healthy lifestyle, the right supplement can greatly improve your weight los…", "url": "https://www.tribuneindia.com/news/brand-connect/prima-slim-review-will-primaslim-work-for-you-or-cheap-diet-pills-450006", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_601622987.jpg", "publishedAt": "2022-11-11T13:12:00Z", "content": "Losing weight safely and naturally can be challenging as many medications, supplements, and surgeries claim to help people attain that ideal weight but do nothing. While maintaining a healthy lifesty… [+9700 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Amarose Skin Tag Remover Reviews: Legit or Scam Skin Tag Remover? - mid-day.com", "description": "People care about their skin and are willing to spend as much money as they can to get the best high-quality products that can work like magic. This is the reason why the skin care industry is making billions and is one of the most dynamic industries.", "url": "https://www.mid-day.com/brand-media/article/amarose-skin-tag-remover-reviews-legit-or-scam-skin-tag-remover-23255066", "urlToImage": "https://images.mid-day.com/images/images/2022/nov/Amarose_d.jpg", "publishedAt": "2022-11-11T13:07:00Z", "content": "People care about their skin and are willing to spend as much money as they can to get the best high-quality products that can work like magic. This is the reason why the skin care industry is making… [+5822 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Researchers find experimental cancer vaccine shows promise in animals - Times of India", "description": "Investigators from the National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health have reported an experimental therapeutic cancer vaccine induced two distinct and desirable immune system responses that led to sig…", "url": "https://timesofindia.indiatimes.com/videos/news/researchers-find-experimental-cancer-vaccine-shows-promise-in-animals/videoshow/95455176.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-95455176,imgsize-40500.cms", "publishedAt": "2022-11-11T12:51:54Z", "content": "Nov 11, 2022, 06:21PM ISTSource: ANIInvestigators from the National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health have reported an experimental thera… [+660 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Researchers find difference in brains of boys, girls with binge eating disorder - Times of India", "description": "A team of researchers from the Keck School of Medicine at USC conducted the first known comparison of the brains of boys and girls with binge eating disorder and discovered notable changes in brain structure between the sexes. The research was recently publis…", "url": "https://timesofindia.indiatimes.com/videos/news/researchers-find-difference-in-brains-of-boys-girls-with-binge-eating-disorder/videoshow/95455096.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-95455096,imgsize-57830.cms", "publishedAt": "2022-11-11T12:49:38Z", "content": "Nov 11, 2022, 06:19PM ISTSource: ANIA team of researchers from the Keck School of Medicine at USC conducted the first known comparison of the brains of boys and girls with binge eating disorder and d… [+560 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Pelvic Floor Strong Reviews - Alex Miller Bladder Leakage Method - The Tribune India", "description": "Pelvic Floor Strong is a self-help program by Alex Miller, a fitness expert, and expert on women's health, that helps women strengthen their pelvic floor muscles. With the help of this workout plan, women can learn how to strengthen their pelvic floor using a…", "url": "https://www.tribuneindia.com/news/brand-connect/pelvic-floor-strong-reviews-alex-miller-bladder-leakage-method-449993", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_2147292686.jpg", "publishedAt": "2022-11-11T12:43:00Z", "content": "Pelvic Floor Strong is a self-help program by Alex Miller, a fitness expert, and expert on women's health, that helps women strengthen their pelvic floor muscles. With the help of this workout plan, … [+11115 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "UTIFIX Reviews - PureHealth Research UTI FIX Urinary Tract Infection Support - The Tribune India", "description": "Having painful urination is not normal. Urinary tract infections or UTIs disrupt the urinary system and cause pain, burning sensations, urge to pee frequently, or bloody urine.", "url": "https://www.tribuneindia.com/news/brand-connect/utifix-reviews-purehealth-research-uti-fix-urinary-tract-infection-support-449987", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_556733976.jpg", "publishedAt": "2022-11-11T12:28:00Z", "content": "Having painful urination is not normal. Urinary tract infections or UTIs disrupt the urinary system and cause pain, burning sensations, urge to pee frequently, or bloody urine.\r\nThis infection result… [+8672 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Does Radiation From 5G Cell Phones Increase The Risk Of Cancer? Expert Answers - News18", "description": "The frequency of the second, third and fourth-generation cell phones remains in the range of 0.7 to 2.7 GHz", "url": "https://www.news18.com/news/lifestyle/does-radiation-from-5g-cell-phones-increase-the-risk-of-cancer-expert-answers-6363433.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/001-27-166816936116x9.png", "publishedAt": "2022-11-11T12:23:48Z", "content": "The introduction of the 5G network in India is not without its share of controversies. Environmentalists have opposed it from the start, claiming that the fifth generation could emit radiation that m… [+1538 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "ACT invests 3.2 crore towards catalysing accessible & affordable cancer care in India - Express Healthcare", "description": "ACT For Health will provide catalytic grant funding, accelerate scale of the solutions by providing key network interventions, and enable widespread ecosystem adoption", "url": "https://www.expresshealthcare.in/news/act-invests-3-2-crore-towards-catalysing-accessible-affordable-cancer-care-in-india/436949/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/02/02122810/admin-ajax-4-1.jpg", "publishedAt": "2022-11-11T12:03:19Z", "content": "ACT For Health will provide catalytic grant funding, accelerate scale of the solutions by providing key network interventions, and enable widespread ecosystem adoption\r\nACT, a non-profit venture phil… [+2812 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Diabetes incidence high among 40-60 years age group: Tata 1mg - ETHealthWorld", "description": "In addition to the genetic predisposition, the main culprits for causing a surge in diabetes cases in India are unhealthy lifestyle factors like lack of physical activity, excessive fast-food consumption, smoking, and alcohol consumption.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/diabetes-incidence-high-among-40-60-years-age-group-tata-1mg/95452774", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95452774,imgsize-1271217,width-1200,height-628,overlay-ethealthworld/diabetes-incidence-high-among-40-60-years-age-group-tata-1mg.jpg", "publishedAt": "2022-11-11T11:50:00Z", "content": "New Delhi: Ahead of World Diabetes Day on November 14, Tata 1mg shared that one-third of the people who tested for HbA1c at Tata 1mg Labs, were found to have diabetes, with the highest incidence repo… [+2635 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[#SCAM ] Pro Bio Keto Gummies Reviews Exposed Consumer ALERT Price Ingredients Cost Where to buy? - Deccan Herald", "description": "Love Your Body with Pro Bio Keto Gummies . Pro Bio Keto Gummies  according to the manufacturer, are a secure dietary supplement that you can use in addition to a ketogenic diet to help you reach and maintain ketosis and lose weight more quickly.", "url": "https://www.deccanherald.com/brandspot/pr-spot/scam-pro-bio-keto-gummies-reviews-exposed-consumer-alert-price-ingredients-cost-where-to-buy-1161428.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1161428-1668163456.png", "publishedAt": "2022-11-11T10:42:37Z", "content": "Love Your Body with Pro Bio Keto Gummies . Pro Bio Keto Gummies  according to the manufacturer, are a secure dietary supplement that you can use in addition to a ketogenic diet to help you reach and … [+16327 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Personalised cell 'editing' used to treat cancer patients for first time: Study - Devdiscourse", "description": "Read more about Personalised cell 'editing' used to treat cancer patients for first time: Study on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2247434-personalised-cell-editing-used-to-treat-cancer-patients-for-first-time-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_11_2022_15_22_21_3448603.jpg?width=920&format=jpeg", "publishedAt": "2022-11-11T10:09:24Z", "content": "Scientists have, for the first time, used CRISPR technology to insert genes that allow immune cells to attack cancer cells, potentially leaving normal cells unharmed and increasing the effectiveness … [+2994 chars]"}, {"source": {"id": null, "name": "Tellychakkar"}, "author": null, "title": "Dandruff Myths and dealing with it - Tellychakkar", "description": "But we can’t seem to understand how to solve the problem. It is a social embarrassment at times when dandruff makes an appearance out of your hair and onto your clothes every now and then. That’s when you dread wearing a black top or a dark coloured outfit fo…", "url": "https://www.tellychakkar.com/lifestyle/fashion/dandruff-myths-and-dealing-it-221111", "urlToImage": "https://www.tellychakkar.com/sites/www.tellychakkar.com/files/images/story/2022/11/11/dandruff.jpg", "publishedAt": "2022-11-11T09:32:00Z", "content": "MUMBAI: Dandruff has been around for as long as we know. It affects more than 50% of the world population and yet we dont know if its simply a disease or a disorder. Medical stores and supermarkets h… [+2392 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dengue: Foods To Eat When Recovering From Dengue Fever - NDTV", "description": "Dengue fever: A healthy diet can help you recover well from dengue fever. Here's a list of foods and drinks that can aid in fast recovery.", "url": "https://www.ndtv.com/health/dengue-foods-to-eat-when-recovering-from-dengue-3510465", "urlToImage": "https://c.ndtvimg.com/2020-07/mpllimko_coconut-water_625x300_14_July_20.jpg", "publishedAt": "2022-11-11T09:22:00Z", "content": "Dengue fever: Coconut water is a rich source of salts and minerals, which prevent dehydration\r\nWhile dengue cases have suddenly increased in recent months in Delhi and many other states, including We… [+4320 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bath: Birth cohort study reveals the mental health burden of trauma in childhood - India Education Diary", "description": "Findings from a major birth cohort study in Brazil suggest that children exposed to life threatening or horrifying events, such as witnessing someone die, or experiencing serious injury or sexual violence, are almost twice as likely to develop psychi", "url": "https://indiaeducationdiary.in/university-of-bath-birth-cohort-study-reveals-the-mental-health-burden-of-trauma-in-childhood/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/University-of-Bath.png?fit=360%2C180&ssl=1", "publishedAt": "2022-11-11T08:35:56Z", "content": "Findings from a major birth cohort study in Brazil suggest that children exposed to life threatening or horrifying events, such as witnessing someone die, or experiencing serious injury or sexual vio… [+3291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Prof. K Srinath Reddy", "title": "Why you shouldn't go for HRT after menopause and save your heart - The Indian Express", "description": "Women can and should maintain their blood vessels healthy after menopause through their own efforts, even though nature is no longer putting in an extra effort. Mechanically replacing female sex hormones does not mimic nature’s fine tuned balance and can caus…", "url": "https://indianexpress.com/article/lifestyle/health-specials/hrt-menopause-heart-women-health-tips-8262313/", "urlToImage": "https://images.indianexpress.com/2022/11/Reddy-menopause.jpg", "publishedAt": "2022-11-11T07:06:25Z", "content": "Before menopause, women have a lower risk of cardiovascular disease than men. This has been well established in many studies across the world. On the assumption that female sex hormones are mainly re… [+6169 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Diabetes: Exercise can help you maintain blood sugar levels; adopt THESE workouts in daily routine - DNA India", "description": "Muscles can utilize your blood glucose without insulin intervention when you`re doing physical activity.", "url": "https://www.dnaindia.com/health/report-diabetes-exercise-can-help-you-maintain-blood-sugar-levels-adopt-these-workouts-in-daily-routine-3001338", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/11/11/2553168-aerobics.jpg", "publishedAt": "2022-11-11T06:57:00Z", "content": "Physical activity or a regular workout regime is a key element in managing type 2 diabetes. Until recently studies showing the significance of exercise to manage diabetes were very less. However, now… [+5526 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Chronic cough: 5 common reasons why you can't stop coughing - Hindustan Times", "description": "Dry cough can silently ruin your health whether you are recovering from a Covid infection or facing the ill effects of air pollution. Here are common reasons why your cough just won't go away. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/chronic-cough-5-common-reasons-why-you-can-t-stop-coughing-101668149345914.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/11/1600x900/chronic_coughing_1668149392272_1668149404053_1668149404053.jpg", "publishedAt": "2022-11-11T06:55:41Z", "content": "Persistent or chronic coughs are becoming quite common nowadays. Covid, pollution, asthma, tuberculosis - there is a long list of factors that's may be making our cough last for longer than it should… [+2585 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Vitamins to Boost Testosterone Supplement - Vitamins That Increase Testosterone - Deccan Herald", "description": "Today, the majority of individuals struggle to lead ideal sensual lives for a variety of reasons. Low erection and hormonal imbalances are two major contributors to the poor sensual life. The males are unable to give their partners results that are satisfacto…", "url": "https://www.deccanherald.com/brandspot/pr-spot/vitamins-to-boost-testosterone-supplement-vitamins-that-increase-testosterone-1161355.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1161355-1668148769.png", "publishedAt": "2022-11-11T06:39:29Z", "content": "Today, the majority of individuals struggle to lead ideal sensual lives for a variety of reasons. Low erection and hormonal imbalances are two major contributors to the poor sensual life. The males a… [+16613 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Vaamanaa Sethi", "title": "Lung blockages, growth retardation and allergies — This is how air pollution is affecting your child’s health - Business Insider India", "description": "Air pollution affects not just the lungs but the skin, eyes, nose, kidney and even the brain in both children and adults, say doctors and experts. Bronchitis", "url": "https://www.businessinsider.in/india/news/lung-blockages-growth-retardation-and-allergies-this-is-how-air-pollution-is-affecting-your-childs-health/articleshow/95442684.cms", "urlToImage": "https://www.businessinsider.in/photo/95442684/lung-blockages-growth-retardation-and-allergies-this-is-how-air-pollution-is-affecting-your-childs-health.jpg?imgsize=988484", "publishedAt": "2022-11-11T05:23:00Z", "content": "Every year with the onset of winters, toxic smog and pollutants\r\n surround the national capital and neighbouring regions leading to various health problems including cough, cold, sore throat, and wat… [+3188 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "Nosh on these 5 winter superfoods to improve digestion and immunity - Health shots", "description": "Add these superfoods for better digestion to your diet during the winter season. They’ll keep your immunity strong as well!", "url": "https://www.healthshots.com/healthy-eating/superfoods/5-winter-superfoods-for-better-digestion-and-immunity/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/10122723/winter-foods.jpg", "publishedAt": "2022-11-11T05:00:52Z", "content": "Winter is almost here and you can feel it in the air! And this is the time when due to cold weather, eating unsafe, and decreased activity one’s gut health can go for a toss. According to Ayurveda, t… [+3255 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Covid infection changes genetic material of cells: Study - EastMojo", "description": "Washington: Scientists have shown for the first time that infection by SARS-CoV-2 changes the functioning of host cell RNA, according to a study.The", "url": "http://www.eastmojo.com/coronavirus-updates/2022/11/11/covid-infection-changes-genetic-material-of-cells-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/Untitled-design-2022-08-16T125503.137.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-11-11T04:50:00Z", "content": "Washington: Scientists have shown for the first time that infection by SARS-CoV-2 changes the functioning of host cell RNA, according to a study.\r\nThe scientists at the Federal University of Sao Paul… [+3968 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sumi Sukanya Dutta", "title": "This test package promises faster and better diagnosis of PCOS in women - Moneycontrol", "description": "Polycystic ovary syndrome is a common endocrine disorder predominantly affecting women of reproductive age. Clinical manifestations are diverse, including overproduction of some male hormones, lack of ovulation, infertility, hair loss and increased risk of me…", "url": "https://www.moneycontrol.com/news/trends/this-test-package-promises-faster-and-better-diagnosis-of-pcos-in-women-9493771.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/blood_samples_pharma_lab_720-770x433.jpg", "publishedAt": "2022-11-11T04:21:47Z", "content": "Diagnosing polycystic ovary syndrome (PCOS), one of the commonest chronic hormonal conditions in women, has become easier with Veera Health, a major digital therapeutics platform for managing the ail… [+2647 chars]"}, {"source": {"id": null, "name": "Awazthevoice.in"}, "author": "shaista fatima", "title": "Study reveals muscle strength tied to biological age - Awaz The Voice", "description": "Each person ages differently Due to a variety of intrinsic and extrinsic circumstances two year olds who have lived the same number of years may have distinct biological ages resulting in various rates of ageing and varying levels of risk for disease and earl…", "url": "https://www.awazthevoice.in/health-news/study-reveals-muscle-strength-tied-to-biological-age-17370.html", "urlToImage": "https://www.awazthevoice.in/upload/news/1668137490Untitled(3).webp", "publishedAt": "2022-11-11T03:31:33Z", "content": "Michigan \r\nEach person ages differently. Due to a variety of intrinsic and extrinsic circumstances, two 50-year-olds who have lived the same number of years may have distinct biological ages, resulti… [+4592 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Preventive cardiology pioneer Lewis Kuller dies at 88 - Deccan Herald", "description": "Dr Lewis Kuller, a top public health researcher and a leading figure in preventive cardiology, could trace his interest in the field to when he was a medical resident in New York’s Brooklyn borough in the early 1960s, responding by ambulance to emergency call…", "url": "https://www.deccanherald.com/science-and-environment/preventive-cardiology-pioneer-lewis-kuller-dies-at-88-1161306.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/11/kuller-1161306-1668136888.jpg", "publishedAt": "2022-11-11T03:21:28Z", "content": "Dr Lewis Kuller, a top public health researcher and a leading figure in preventive cardiology, could trace his interest in the field to when he was a medical resident in New Yorks Brooklyn borough in… [+6973 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Lisa O’Mary", "title": "High Blood Pressure Increases Risk of Severe COVID: Study - WebMD", "description": "Research has already linked high blood pressure with an increased risk of developing a severe case of COVID-19. Now, a new study out of the United Kingdom identifies at what level high blood pressure can help predict a life-threatening case of the virus.", "url": "https://www.webmd.com/hypertension-high-blood-pressure/news/20221110/high-blood-pressure-severe-covid-study", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/article_thumbnails/blog_posts-doctors/1800x1200_blood-pressure-cuff.jpg", "publishedAt": "2022-11-10T19:32:06Z", "content": "Nov. 10, 2022 Research has already linked high blood pressure with an increased risk of a severe case of COVID-19. Now, a new study out of the United Kingdom identifies at what level high blood press… [+1524 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "OPTION: Feasible to replace aspirin with indobufen in DAPT after PCI - Healio", "description": "CHICAGO &mdash; In patients who had PCI with a drug-eluting stent, dual antiplatelet therapy with indobufen plus clopidogrel was noninferior to DAPT with aspirin plus clopidogrel, according to the results of the OPTION trial.      Junbo Ge, MD, FACC, FAHA, fr…", "url": "https://www.healio.com/news/cardiac-vascular-intervention/20221110/option-feasible-to-replace-aspirin-with-indobufen-in-dapt-after-pci", "urlToImage": "https://www.healio.com/~/media/slack-news/cardiology/misc/lth/lth-og-and-social-images/interventional-cardiologist_adobe-stock.jpg", "publishedAt": "2022-11-10T18:33:28Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nCHICAGO — In patients who had PCI with a… [+4410 chars]"}, {"source": {"id": null, "name": "Vt.edu"}, "author": null, "title": "Beauty is only skin deep. As it turns out, so is disease detection. - Virginia Tech Daily", "description": "Professor Masoud Agah has received a National Science Foundation grant to develop a novel skin sensor that provides insight into an individual's health.", "url": "https://vtx.vt.edu/articles/2022/11/Beauty-is-only-skin-deep-it-turns-out-so-is-disease-detection-agah-nsf-skin-sensor.html", "urlToImage": "https://vtx.vt.edu/content/dam/vtx_vt_edu/articles/2022/11/Masoud-Agah-lab.jpg.transform/l-medium/image.jpg", "publishedAt": "2022-11-10T17:25:53Z", "content": "The ultimate goal of this new skin sensor parallels that of an at-home COVID test. Consumers have come to expect minimally invasive, affordable, and convenient options for health care needs. Devices … [+3921 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Shuvangi Sen Chaudhury", "title": "How Long It Takes To Run A Mile And How It Can Help You Lose Weight? - Sportskeeda", "description": "If you’re running to lose weight, it’s going to work as long as you maintain a calorie deficit diet.", "url": "https://www.sportskeeda.com/health-and-fitness/how-long-it-takes-to-run-a-mile-and-how-it-can-help-you-lose-weight", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/ad195-16680984414753-1920.jpg", "publishedAt": "2022-11-10T17:08:47Z", "content": "If youre running to lose weight, its going to work as long as you maintain a calorie deficit diet. However, you should understand that everyone has their own running pace, fitness levels, and stamina… [+3137 chars]"}, {"source": {"id": null, "name": "Pulmonologyadvisor.com"}, "author": "melissaalvarez", "title": "Low-Dose ICS for Mild Asthma Prevents Small Drop in FEV1 Seen in High Altitudes - Pulmonology Advisor", "description": "What precautions are needed to protect individuals with mild, seasonal asthma from high altitude conditions?", "url": "https://www.pulmonologyadvisor.com/home/topics/asthma/low-dose-ics-for-mild-asthma-prevents-drop-in-fev1-at-high-altitudes/", "urlToImage": null, "publishedAt": "2022-11-10T16:55:00Z", "content": "Low-dose inhaled corticosteroid (ICS) treatment in individuals with mild, seasonal asthma prevents a decrease in pulmonary function in response to high altitude (HA) environmental factors, according … [+3387 chars]"}, {"source": {"id": null, "name": "Oncologynurseadvisor.com"}, "author": "Stephan Cho", "title": "Stigma May Be a Barrier to Lung Cancer Advocacy Among Patients - Oncology Nurse Advisor", "description": "Results of a cross-sectional survey explain why patients with lung cancer may be reluctant to get involved in advocacy.", "url": "https://www.oncologynurseadvisor.com/home/cancer-types/lung-cancer/lung-cancer-stigma-advocacy-among-patients-barrier-treatment-risk/", "urlToImage": "https://www.oncologynurseadvisor.com/wp-content/uploads/sites/13/2021/11/elderly-female-patient_G_1321302502.jpg", "publishedAt": "2022-11-10T15:50:00Z", "content": "Stigma may be an important barrier to patients with lung cancer becoming involved in advocacy. These findings were published in Oncology Nursing Forum.\r\nLung cancer is the second most common cancer i… [+2057 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Brian Consiglio-Missouri", "title": "Key mutations make monkeypox stronger and smarter - Futurity: Research News", "description": "Like COVID-19, mutations have allowed monkeypox to get smarter, spreading quickly and evading drugs. New research digs into key mutations.", "url": "https://www.futurity.org/monkeypox-virus-mutations-2827492-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/11/monkeypox-virus-mutations-1600.jpg", "publishedAt": "2022-11-10T14:50:42Z", "content": "Researchers have identified the specific mutations in the monkeypox virus that contribute to its continued infectiousness.\r\nMonkeypox has infected more than 77,000 people in more than 100 countries w… [+3928 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Microvascular complications have synergistic negative effect on all cause mortality among diabetics - Medical Dialogues", "description": "Italy: A recent study published in Cardiovascular Diabetology has shown the synergistic, long-term, and adverse effects of diabetic microvascular complications (MVC) on mortality in both type 1...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/microvascular-complications-have-synergistic-negative-effect-on-all-cause-mortality-among-diabetics-102035", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/01/189596-diabetes-care.jpg", "publishedAt": "2022-11-10T14:15:00Z", "content": "Italy: A recent study published in Cardiovascular Diabetology has shown the synergistic, long-term, and adverse effects of diabetic microvascular complications (MVC) on mortality in both type 1 diabe… [+2752 chars]"}]}