{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Humans are now planning to build stone walls on Moon using robots. Here`s why - WION", "description": "Humans are now planning to build stone walls on Moon using robots. Heres why", "url": "https://www.wionews.com/science/humans-are-now-planning-to-build-stone-walls-on-moon-using-robots-heres-why-746300", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/08/01/446947-moon-wall.png", "publishedAt": "2024-08-01T12:23:42Z", "content": "A team of Swiss researchers have proposed using an autonomous, robotic hydraulic excavator for building a dry stone wall which will work as a blast shield and protect the launch pad on the moon.\r\nThe… [+2303 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Stunning close-up timelapse of bus-sized rocket part captured by space debris monitor: Watch - WION", "description": "Stunning close-up timelapse of bus-sized rocket part captured by space debris monitor: Watch", "url": "https://www.wionews.com/science/stunning-close-up-timelapse-of-bus-sized-rocket-part-captured-by-space-debris-monitor-watch-746283", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/08/01/446940-spacejunk.png", "publishedAt": "2024-08-01T11:22:09Z", "content": "Space junk is quietly littering the universe above us, and a Japanese company Astroscale is on a mission to identify and remove them. Now, it has taken stunning close-ups and timelapse of an 11-metre… [+1644 chars]"}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Reuters", "title": "NASA's DART mission sheds light on asteroid formation, history | Daily Sabah - Daily Sabah", "description": "In the moments before NASA&#039;s DART spacecraft slammed into the asteroid Dimorphos in a landmark planetary defense test in 2022, it took high-resolution...", "url": "https://www.dailysabah.com/life/science/nasas-dart-mission-sheds-light-on-asteroid-formation-history", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2024/08/01/thumbs/800x531/339512.jpg", "publishedAt": "2024-08-01T07:16:00Z", "content": "This website uses cookies. \r\nCookies are used for the purpose of performing advertising and marketing activities on our sites.\r\nThese cookies work by identifying the browsers and devices of the user.… [+91908 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Sridhar Sivasubbu & Vinod Scaria", "title": "Zombies in our genes helped us evolve, and could help battle cancers - The Hindu", "description": "Retroviruses can reshape human genomes, influencing evolution, placental development, cancer, and more.", "url": "https://www.thehindu.com/sci-tech/science/endogenous-retroviruses-zombie-genes-evolution-cancer-breakthroughs/article68467605.ece", "urlToImage": "https://th-i.thgim.com/public/incoming/603utp/article68468152.ece/alternates/LANDSCAPE_1200/IMG_28TH-SCI_DNA_2_1_Q88AQSPK.jpg", "publishedAt": "2024-08-01T00:00:00Z", "content": "Viruses are ubiquitous entities that have long plagued humans, often presenting in pesky, self-limiting infections, like a bout of the common cold. While most viral encounters are transient and merel… [+6969 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Hubble spots a stunning spiral galaxy shining in the 'Little Lion' (image) - Space.com", "description": "NGC 3430 gets its moment in the spotlight!", "url": "https://www.space.com/hubble-classic-spiral-galaxy-ngc3430", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XDKYPr8E2JxnAszCVJrXQE-1200-80.png", "publishedAt": "2024-07-31T21:00:17Z", "content": "Hubble has just dropped more galactic eye candy!\r\nFrom its vantage point in low-Earth orbit, the Hubble Space Telescope recently captured an intricate portrait of the NGC 3430 galaxy, a classic spira… [+3981 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Most stunning pictures of the moon shared by NASA - The Times of India", "description": "The Moon has always fascinated humanity, and NASA has captured some of the most breathtaking images of our celestial neighbor. These images not only showcase the Moon’s beauty but also provide valuable scientific insights. Here are some of the most stunning p…", "url": "https://timesofindia.indiatimes.com/etimes/trending/most-stunning-pictures-of-the-moon-shared-by-nasa/photostory/112175469.cms", "urlToImage": "https://static.toiimg.com/photo/112175487.cms", "publishedAt": "2024-07-31T16:59:44Z", "content": "APODs September 30, 2023, entry, A Harvest Moon Over Tuscany, showcases the Full Moon rising behind cypress trees in Tuscany, Italy. The image, taken on September 28, captures the warm hues of the Ha… [+248 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Helsinki Astronomers Discover Unique Rotation Profile of Star V889 Herculis - India Education Diary", "description": "The Sun rotates the fastest at the equator, whereas the rotation rate slows down at higher latitudes and is the slowest as the polar regions. But a nearby Sun-like star V889 Herculis, some 115 light years away in the constellation of Hercules, rotate", "url": "https://indiaeducationdiary.in/university-of-helsinki-astronomers-discover-unique-rotation-profile-of-star-v889-herculis/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2024/07/tahti-pyorimisliike-drupal.jpg-1024x640.webp", "publishedAt": "2024-07-31T10:11:34Z", "content": "The Sun rotates the fastest at the equator, whereas the rotation rate slows down at higher latitudes and is the slowest as the polar regions. But a nearby Sun-like star V889 Herculis, some 115 light … [+4710 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Harish Dugh", "title": "If Asteroid Apophis threatened to crash on Earth, 10 things NASA could do vs God of Destruction - News9 LIVE", "description": "If an asteroid strike is imminent, as it once seemed with the 'God of Destruction' Asteroid Apophis, what will NASA do? 10 things it may look at to get rid of the asteroid strike threat..", "url": "https://www.news9live.com/science/bta-asteroid-apophis-threat-crash-earth-10-things-nasa-do-god-of-destruction-2637738", "urlToImage": "https://images.news9live.com/wp-content/uploads/2024/07/asteroid-apophis-image.jpg", "publishedAt": "2024-07-31T06:02:57Z", "content": "If Asteroid Apophis strike was confirmed, to destroy this threat, NASA and other space agencies could have done these 10 things. Note, some solutions are outlandish others may prove counter-productiv… [+4034 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Girish Linganna", "title": "Antenna modifications, orbital constraints set back Indo-US NISAR launch to 2025 - Asianet Newsable", "description": "NASA announced the delay of the joint US-Indian NISAR radar imaging satellite launch to at least February 2025 due to ongoing antenna work and orbital constraints. The antenna required a special coating to withstand high temperatures. Once the antenna is rein…", "url": "https://newsable.asianetnews.com/world/antenna-modifications-orbital-constraints-set-back-indo-us-nisar-launch-to-2025-vkp-shgzpn", "urlToImage": "https://static-ai.asianetnews.com/images/01j1hh77zjybx2wz51xdxjpb4x/tamil-news--52-_1200x630xt.jpg", "publishedAt": "2024-07-31T04:12:59Z", "content": "NASA announced the delay of the joint US-Indian NISAR radar imaging satellite launch to at least February 2025 due to ongoing antenna work and orbital constraints. The antenna required a special coat… [+3409 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "undefined, Insights Editor", "title": "How effective are scientific interventions in coral restoration, and what challenges do these methods face in ensuring long-term ecological resilience of coral reefs? - Insights IAS", "description": "Topic: Oceanography Q1. How effective are scientific interventions in coral restoration, and what challenges do these methods face in ensuring long-term ecological resilience of coral reefs? 15M Difficulty level: Moderate Reference: DTE Why the question: Clim…", "url": "https://www.insightsonindia.com/2024/07/31/how-effective-are-scientific-interventions-in-coral-restoration-and-what-challenges-do-these-methods-face-in-ensuring-long-term-ecological-resilience-of-coral-reefs/", "urlToImage": null, "publishedAt": "2024-07-31T03:07:32Z", "content": "Q1. How effective are scientific interventions in coral restoration, and what challenges do these methods face in ensuring long-term ecological resilience of coral reefs? 15MWhy the question:\r\nClimat… [+1346 chars]"}]}