{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm fury! Multiple solar flare explosions cause nonstop BLACKOUTS on Earth - HT Tech", "description": "Sunspot complex AR3293-3296 has turned unstable and has been crackling with strong solar flares. The strong ultraviolet radiation from the eruptions has resulted in rolling series of blackouts on Earth. Is another major solar storm coming?", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-fury-multiple-solar-flare-explosions-geomagnetic-storm-cause-nonstop-blackouts-on-earth-71683174365722.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/04/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1683174445537.jpg", "publishedAt": "2023-05-04T04:31:18Z", "content": "The minor geomagnetic storm, which was supposed to be sparked by multiple coronal mass ejections (CMEs), has passed us by without causing much concern. However, a new development on the Sun has begun… [+2395 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN", "title": "NASA's Hubble Space Telescope captures extraordinarily bright interacting galaxies - CGTN", "description": "NASA's Hubble Space Telescope has captured a new image of extraordinarily bright interacting galaxies known as AM 1214-255, the U.S. space agency said Wednesday.", "url": "https://news.cgtn.com/news/2023-05-04/NASA-s-Hubble-captures-extraordinarily-bright-interacting-galaxies-1jwD5sVcsla/index.html", "urlToImage": "https://news.cgtn.com/news/2023-05-04/NASA-s-Hubble-captures-extraordinarily-bright-interacting-galaxies-1jwD5sVcsla/img/4ec2ae717a414ccdbe27e416d74443d5/4ec2ae717a414ccdbe27e416d74443d5-750.png", "publishedAt": "2023-05-04T03:40:03Z", "content": "NASA's Hubble Space Telescope has captured a new image of extraordinarily bright interacting galaxies known as AM 1214-255, the U.S. agency said Wednesday.\r\nThese galaxies contain active galactic nuc… [+445 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Gaurvi Narang", "title": "Astronomers witness Sun-like star ‘swallow a planet’ for 1st time, confirming Earth’s fate in 5 bn yrs - ThePrint", "description": "Lead author of the study, conducted by researchers at MIT in collaboration with Harvard and Caltech, and published in Nature, says the discovery tells us 'where we are going'.", "url": "https://theprint.in/science/astronomers-witness-sun-like-star-swallow-a-planet-for-1st-time-confirming-earths-fate-in-5-bn-yrs/1553233/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/05/star-and-sun.jpg", "publishedAt": "2023-05-04T01:30:33Z", "content": "New Delhi: Astronomers have for the first time observed a Sun-like star swallowing a planet in “one big gulp”, finally confirming a fundamental prediction about stars and their planets.\r\nEarth, too, … [+4016 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lori Dajose", "title": "Pressure required to launch a rock from Mars into space much lower than thought, discovers study - Phys.org", "description": "In August 1865, a 10-pound rock fell from space to Earth, landing with a bang in the remote village of Sherghati, India. After being recovered by witnesses to the event, the stone passed into the possession of a local British magistrate who endeavored to iden…", "url": "https://phys.org/news/2023-05-pressure-required-mars-space-thought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-mysterious-origins.jpg", "publishedAt": "2023-05-03T20:47:09Z", "content": "In August 1865, a 10-pound rock fell from space to Earth, landing with a bang in the remote village of Sherghati, India. After being recovered by witnesses to the event, the stone passed into the pos… [+5442 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "Gravitational Lensing is Helping to Nail Down Dark Matter - Universe Today", "description": "Using gravitational lenses, a team of astronomers showed how axions could be the particle that makes up Dark Matter.", "url": "https://www.universetoday.com/161198/gravitational-lensing-is-helping-to-nail-down-dark-matter/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/01/STScI-H-p2005b-d-1280x720-1.jpg", "publishedAt": "2023-05-03T20:26:55Z", "content": "According to the most widely-accepted cosmological model, the majority of the mass in our Universe (roughly 85%) consists of “Dark Matter.” This elusive, invisible mass is theorized to interact with … [+4989 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Engineers May Pull Plug on Struggling Artemis CubeSat - Gizmodo", "description": "The Luna-H Map cubesat launched on board the Artemis 1 mission in November 2022, but failed to fire its engines shortly after its delayed liftoff.", "url": "https://gizmodo.com/engineers-may-pull-plug-struggling-artemis-cubesat-1850400290", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8a6f288caaec7487a403df1cb685779a.jpg", "publishedAt": "2023-05-03T20:25:00Z", "content": "A shoebox-sized satellite may soon meet its untimely death after failing to fire its thrusters. The cubesat may have been compromised as it excessively waitedfor launch on board NASAs Space Launch Sy… [+2668 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New catalyst transforms carbon dioxide into sustainable byproduct: The carbon capture method works by using carbon to make acetic acid - Science Daily", "description": "-Electrocatalyst achieves record-breaking selectivity toward desired product, a key step in expanding production -Acetic acid, found in vinegar, is traditionally extracted from fossil fuels for use in paint and other product feedstock.", "url": "https://www.sciencedaily.com/releases/2023/05/230503121328.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-03T20:05:24Z", "content": "The need to capture CO2 and transport it for permanent storage or conversion into valued end uses is a national priority recently identified in the Bipartisan Infrastructure Law to move toward net-ze… [+6079 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "SpaceX Falcon Heavy lights up the night sky in these incredible launch photos - Space.com", "description": "The powerful rocket blasted off from the launch pad at NASA's Kennedy Space Center on Sunday, April 30.", "url": "https://www.space.com/spacex-falcon-heavy-6th-launch-april-2023-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HFs2F8kCJ3ZFk7djE64FUL-1200-80.jpg", "publishedAt": "2023-05-03T19:00:41Z", "content": "Nobody ever said rocket launches couldn't be photogenic. \r\nThe moment SpaceX's Falcon Heavy rocket blasted off from NASA's historic Kennedy Space Center in Florida on Sunday, April 30 has been immort… [+4176 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Impey", "title": "AI is helping astronomers make new discoveries and learn about the universe faster than ever before - Phys.org", "description": "The famous first image of a black hole just got two times sharper. A research team used artificial intelligence to dramatically improve upon its first image from 2019, which now shows the black hole at the center of the M87 galaxy as darker and bigger than th…", "url": "https://phys.org/news/2023-05-ai-astronomers-discoveries-universe-faster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/ai-is-helping-astronom.jpg", "publishedAt": "2023-05-03T17:38:04Z", "content": "The famous first image of a black hole just got two times sharper. A research team used artificial intelligence to dramatically improve upon its first image from 2019, which now shows the black hole … [+6576 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Metavalent chemical bond holds key to enhance the thermoelectric performance in quantum materials - India Education Diary", "description": "Metavalent bonding—a new type of chemical bonding in solids, can be used to tailor the thermoelectric performance in quantum materials and efficiently convert waste heat to electricity, which could show a new direction for the country’s newly launche", "url": "https://indiaeducationdiary.in/metavalent-chemical-bond-holds-key-to-enhance-the-thermoelectric-performance-in-quantum-materials/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2023-05-03T17:27:54Z", "content": "Metavalent bondinga new type of chemical bonding in solids, can be used to tailor the thermoelectric performance in quantum materials and efficiently convert waste heat to electricity, which could sh… [+4358 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tracey Peake", "title": "Studying fundamentals of water as a solvent could lead to greener cellulose-based products - Phys.org", "description": "Water isn't just a universal solvent that remains unaffected by its interactions. New publications from North Carolina State University show that water can change its solubility characteristics depending upon what it interacts with. Specifically, when water i…", "url": "https://phys.org/news/2023-05-fundamentals-solvent-greener-cellulose-based-products.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/studying-fundamentals.jpg", "publishedAt": "2023-05-03T17:19:02Z", "content": "Water isn't just a universal solvent that remains unaffected by its interactions. New publications from North Carolina State University show that water can change its solubility characteristics depen… [+4244 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Sydney student selected for 10-week NASA internship - India Education Diary", "description": "An aspiring space leader from the University of Sydney and SmartSat CRC is one of two Australian PhD students taking part in a prestigious ten-week internship program at NASA’s Jet Propulsion Laboratory (JPL) in California.Anne Bettens, a PhD student", "url": "https://indiaeducationdiary.in/university-of-sydney-selected-for-10-week-nasa-internship/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/04/University-of-Sydney.png", "publishedAt": "2023-05-03T17:12:54Z", "content": "An aspiring space leader from the University of Sydney and SmartSat CRC is one of two Australian PhD students taking part in a prestigious ten-week internship program at NASAs Jet Propulsion Laborato… [+3353 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "524-foot Asteroid, larger than London Eye, to come scarily close after King Charles coronation - HT Tech", "description": "A monstrously large asteroid, which is as large as 524-foot, much bigger than the London Eye, is set to get very close to Earth just after the coronation of King Charles.", "url": "https://tech.hindustantimes.com/tech/news/524foot-asteroid-larger-than-london-eye-to-come-scarily-close-after-king-charles-coronation-nasa-71683132619292.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/03/1600x900/SPACE-ASTRONOMY-ASTEROID-0_1683132681194_1683132743473.jpg", "publishedAt": "2023-05-03T17:04:40Z", "content": "A massive and dangerous 524-foot Asteroid, which is estimated to be larger than the London Eye, is set to come terrifuyingly close to Earth just a day after King Charles coronation in the UK. The Lon… [+1798 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "NASA's Voyager Space Probe's Reserve Power, And The Intricacies Of RTG-Based Power Systems - Hackaday", "description": "Launched in 1977, the Voyager 1 and 2 space probes have been operating non-stop for over 45 years, making their way from Earth to our solar system’s outer planets and beyond. Courtesy of the …", "url": "https://hackaday.com/2023/05/03/nasas-voyager-space-probes-reserve-power-and-the-intricacies-of-rtg-based-power-systems/", "urlToImage": "https://hackaday.com/wp-content/uploads/2022/05/voyager_feat.jpg", "publishedAt": "2023-05-03T17:00:00Z", "content": "Launched in 1977, the Voyager 1 and 2 space probes have been operating non-stop for over 45 years, making their way from Earth to our solar system’s outer planets and beyond. Courtesy of the radioiso… [+9011 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "NASA Extracts Oxygen From Simulated Moon Dust - Futurism", "description": "Researchers at NASA's Johnson Space Center have successfully extracted oxygen from simulated lunar soil inside a vacuum chamber.", "url": "https://futurism.com/the-byte/nasa-extracts-oxygen-moon-dust", "urlToImage": "https://wp-assets.futurism.com/2023/05/nasa-extracts-oxygen-moon-dust.jpg", "publishedAt": "2023-05-03T16:28:41Z", "content": "\"This is a big step for developing the architecture to build sustainable human bases on other planets.\"\r\nOxygen Squad\r\nResearchers at NASA's Johnson Space Center have successfully extracted oxygen fr… [+2089 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA Animation Sizes Up the Biggest Black Holes - NASA Goddard", "description": "Editor’s Note: A previous version of this video mislabeled the orbit of Saturn as the orbit of Jupiter.This new NASA animation highlights the “super” in supe...", "url": "https://www.youtube.com/watch?v=8GnSFAZD8YY", "urlToImage": "https://i.ytimg.com/vi/8GnSFAZD8YY/hqdefault.jpg", "publishedAt": "2023-05-03T15:45:09Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Single-molecule valve: Breakthrough in nanoscale control: On the horizon: A paradigm shift revolutionizing chemical and biochemical synthesis - Science Daily", "description": "A research group has succeeded in regulating the flow of single molecules in solution by opening and closing the nanovalve mounted on the nanofluidic device by applying external pressure. The research group fabricated a device with a ribbon-like, thin, soft g…", "url": "https://www.sciencedaily.com/releases/2023/05/230503100051.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-03T15:13:53Z", "content": "Scientists dream of using tiny molecules as building blocks to construct things, similar to how we build things with mechanical parts. However, molecules are incredibly small -- around one hundred mi… [+2402 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN", "title": "Airbus unveils futuristic space station concept - CGTN", "description": "European aerospace giant Airbus has unveiled a new concept space habitat. The multi-purpose orbital module named LOOP will be more spacious and comfortable than existing space stations. Designed for a four-person crew, the LOOP module hosts three floors,", "url": "https://news.cgtn.com/news/2023-05-03/Airbus-unveils-futuristic-space-station-concept-1jvMDnf8KnC/index.html", "urlToImage": "https://news.cgtn.com/news/2023-05-03/Airbus-unveils-futuristic-space-station-concept-1jvMDnf8KnC/img/42de15f2b6f147be959284bb0f7bacf5/42de15f2b6f147be959284bb0f7bacf5-1280.jpeg", "publishedAt": "2023-05-03T14:40:53Z", "content": "European aerospace giant Airbus has unveiled a new concept space habitat. The multi-purpose orbital module named LOOP will be more spacious and comfortable than existing space stations. Designed for … [+266 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Tech Explorist", "title": "Distant gas clouds found with leftovers of the first stars - Tech Explorist", "description": "Using ESO’s Very Large Telescope (VLT), researchers have found for the first time the fingerprints left by the explosion of the first stars in the", "url": "https://www.techexplorist.com/distant-gas-clouds-found-with-leftovers-of-the-first-stars/59770/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/chemical-elements-distant-gas-cloud.jpg", "publishedAt": "2023-05-03T14:19:08Z", "content": "Using ESOs Very Large Telescope (VLT), researchers have found for the first time the fingerprints left by the explosion of the first stars in the Universe. They detected three distant gas clouds whos… [+4724 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astro Alchemy: Neutron Star Mergers and the Birth of Heavy Elements - SciTechDaily", "description": "The merging of neutron stars, generating potent gamma-ray bursts (GRBs), is crucial for the creation of heavy elements in the universe. However, a 2021 discovery necessitates incorporating long burst GRBs, previously associated with black hole formation, into…", "url": "https://scitechdaily.com/astro-alchemy-neutron-star-mergers-and-the-birth-of-heavy-elements/", "urlToImage": "https://scitechdaily.com/images/Neutron-Stars-Collide-scaled.jpg", "publishedAt": "2023-05-03T14:02:24Z", "content": "ByNASAMay 3, 2023\r\nIn this illustration, two neutron stars begin to merge, blasting a jet of high-speed particles and producing a cloud of debris. Credit: Sonoma State Univ./A. Simonnet; NASA\r\nThe me… [+4449 chars]"}, {"source": {"id": null, "name": "Finnoexpert.com"}, "author": null, "title": "Bats, cheetahs and hippos unlock mysteries of the human genome - Finnoexpert", "description": "Humans like to think we have a monopoly on understanding ourselves — that explanations for all our inner workings, including when things go awry, lie within", "url": "https://finnoexpert.com/2023/05/03/bats-cheetahs-and-hippos-unlock-mysteries-of-the-human-genome/", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/dna-770x433.jpg", "publishedAt": "2023-05-03T12:25:04Z", "content": "Humans like to think we have a monopoly on understanding ourselves  that explanations for all our inner workings, including when things go awry, lie within our genetic code. We might like to think th… [+5925 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Study Warns Of Risk On Twilight From Climate Change - India Education Diary", "description": "Life in the ocean’s “twilight zone” could decline dramatically due to climate change, new research suggests.The twilight zone (200m to 1,000m deep) gets very little light but is home to a wide variety of organisms and billions of tonnes of organic ma", "url": "https://indiaeducationdiary.in/study-warns-of-risk-on-twilight-from-climate-change/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/microscope.jpg", "publishedAt": "2023-05-03T12:16:33Z", "content": "Life in the oceans twilight zone could decline dramatically due to climate change, new research suggests.\r\nThe twilight zone (200m to 1,000m deep) gets very little light but is home to a wide variety… [+3163 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Kavita Verma", "title": "ShadowCam: NASA's hypersensitive optical camera images lunar south pole region - Interesting Engineering", "description": "NASA's ShadowCam, a highly sensitive optical camera, is gathering data for humanity's first-ever journey to the lunar South Pole region.", "url": "https://interestingengineering.com/science/shadowcam-nasas-hypersensitive-optical-camera-images-lunar-south-pole-region", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/05/03/image/jpeg/jfEzgLzDpkBFiyGJUBS6E8navF816j62ymLFVd4D.jpg", "publishedAt": "2023-05-03T12:08:00Z", "content": "In preparation for Artemis III, NASA is gathering information to aid humanity's first-ever journey to the lunar South Pole region. One method being used is the utilization of a highly sensitive optic… [+590 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Early-universe prequel to a huge galaxy cluster - EarthSky", "description": null, "url": "https://earthsky.org/space/early-universe-prequel-to-huge-galaxy-cluster/", "urlToImage": "https://earthsky.org/upl/2023/05/Webb_reveals_early-Universe_prequel_to_huge_galaxy_cluster-sq-e1683053886216.jpeg", "publishedAt": "2023-05-03T12:01:30Z", "content": "The European Space Agency (ESA) said this week: “The 7 galaxies highlighted in this image have been confirmed to be at a distance that astronomers refer to as redshift 7.9, which correlates to 650 mi… [+3751 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Liverpool experts address global crop growing challenge - India Education Diary", "description": "A study led by University of Liverpool scientists has revealed a new way to improve crop growth, meeting a significant challenge to increase crop productivity in a changing climate with a growing population.With global levels of carbon dioxide (CO2)", "url": "https://indiaeducationdiary.in/university-of-liverpool-experts-address-global-crop-growing-challenge/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/nature_comms_news.jpg", "publishedAt": "2023-05-03T11:51:23Z", "content": "A study led by University of Liverpool scientists has revealed a new way to improve crop growth, meeting a significant challenge to increase crop productivity in a changing climate with a growing pop… [+1752 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CIO", "title": "Structured exploration enables biological brains to learn more quickly than AI - ETCIO", "description": "Researchers at the Sainsbury Wellcome Centre and Gatsby Computational Neuroscience Unit at UCL found the instinctual exploratory runs that animals carry out are not random. These purposeful actions allow mice to learn a map of the world efficiently. The study…", "url": "https://cio.economictimes.indiatimes.com/news/business-analytics/structured-exploration-enables-biological-brains-to-learn-more-quickly-than-ai/99958451", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-99958451,imgsize-11708,width-1200,height=765,overlay-etcio/business-analytics/structured-exploration-enables-biological-brains-to-learn-more-quickly-than-ai.jpg", "publishedAt": "2023-05-03T09:38:23Z", "content": "Washington : Neuroscientists have discovered how exploratory behaviour helps animals learn their spatial surroundings more efficiently. Their findings might help in the development of better AI agent… [+3464 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Fish thought to help reefs have poop that's deadly to corals - EurekAlert", "description": "Rice University marine biologists found the feces of fish that were long thought to promote healthy reefs can damage and, in some cases, kill corals in controlled experiments, possibly due to high levels of coral pathogens. Conversely, the feces of coral pred…", "url": "https://www.eurekalert.org/news-releases/987942", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/cda20e5b-e4be-45e4-a35e-c271d2dd8fa4/Rendition/thumbnail/Content/Public", "publishedAt": "2023-05-03T09:19:38Z", "content": "image: A coral-eating butterflyfish on a Moorea reef in July 2019. (Photo by Carsten Grupstra)view more \r\nCredit: Credit: Carsten Grupstra\r\nHOUSTON – (May 2, 2023) – Feces from fish that are typicall… [+7719 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Stem Cells Use Wrinkles To Divide - Technology Networks", "description": "The new method could improve the cryopreservation of cells, tissue culture and 3D cell models used for a variety of applications, including research, medical therapies and agriculture.", "url": "https://www.technologynetworks.com/cell-science/news/method-developed-to-store-advanced-cell-models-372853", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/372853/method-developed-to-store-advanced-cell-models-372853-640x360.jpg?cb=20230503", "publishedAt": "2023-05-03T08:21:15Z", "content": "A method to store advanced cell models has been developed by researchers at the University of Warwick.\r\nThe technology, which was shared in the journal JACS Au, could improve the cryopreservation of … [+2615 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Million-year-old Relationship Revealed Of Feathered Dinosaurs And Feather-feeding Beetles - India Education Diary", "description": "New fossils in amber reveal that beetles fed on the feathers of dinosaurs about 105 million years ago. The exquisite specimens show one of the best supported examples of a close interaction between vertebrates and arthropods in the fossil record. The", "url": "https://indiaeducationdiary.in/million-year-old-relationship-revealed-of-feathered-dinosaurs-and-feather-feeding-beetles/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/01_SleepingSeals03_Jessica-Kendall-Bar-edited-2-1024x491.jpg", "publishedAt": "2023-05-03T07:54:56Z", "content": "New fossils in amber reveal that beetles fed on the feathers of dinosaurs about 105 million years ago. The exquisite specimens show one of the best supported examples of a close interaction between v… [+5232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Webb telescope detects water around alien ‘super-Earth’ but origin of water unknown - The Indian Express", "description": "The James Webb Space Telescope has detected water around a rocky exoplanet but where did this water vapour come from and how can it exist where it does?", "url": "https://indianexpress.com/article/technology/science/webb-telescope-water-super-earth-8589103/", "urlToImage": "https://images.indianexpress.com/2023/05/Exoplanet-water-atmosphere-20230503.jpg", "publishedAt": "2023-05-03T07:53:52Z", "content": "The exoplanet GJ 486 b is a rocky world like Earth that is about 30 per cent larger and about three times as massive. It orbits a red dwarf star very closely, with a year on the planet taking about 1… [+3512 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Solar eruptions may have sparked life on Earth, new study reveals - Devdiscourse", "description": "Read more about Solar eruptions may have sparked life on Earth, new study reveals on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2438086-solar-eruptions-may-have-sparked-life-on-earth-new-study-reveals", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_05_2023_12_29_16_7951726.jpg?width=920&format=jpeg", "publishedAt": "2023-05-03T07:39:38Z", "content": "Credits: NASA's Goddard Space Flight Center\r\nA new study suggests that the first building blocks of life on Earth may have been formed by eruptions from the Sun. The research team found that high-ene… [+2332 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Ultramassive black hole discovered that is 30 billion times bigger than the Sun - indy100", "description": "A new ultramassive black hole has been discovered, and we’re not even going to try to get our heads around its scale. The enormous object observed for the first time is 30 billion times bigger than the Sun and is located hundreds of millions of light-years aw…", "url": "https://www.indy100.com/science-tech/ultramassive-black-hole-larger-sun-2659944464", "urlToImage": "https://www.indy100.com/media-library/astronomers-capture-first-image-of-a-black-holes-relativistic-jet.jpg?id=33574025&width=1200&height=600&coordinates=0%2C136%2C0%2C104", "publishedAt": "2023-05-03T07:34:23Z", "content": "A new ultramassive black hole has been discovered, and were not even going to try to get our heads around its scale. \r\nThe enormous object observed for the first time is 30 billion times bigger than … [+2164 chars]"}, {"source": {"id": null, "name": "Vigyanprasar.gov.in"}, "author": "", "title": "Study demonstrates gold-catalyzed fundamental organometallic steps - Vigyan Prasar", "description": "http://vigyanprasar.gov.in/isw/images/Study-demonstrates-gold-catalyzed-fundamental-organometallic-steps.jpg", "url": "https://vigyanprasar.gov.in/isw/Study-demonstrates-gold-catalyzed-fundamental-organometallic-steps.html", "urlToImage": "http://vigyanprasar.gov.in/isw/images/Study-demonstrates-gold-catalyzed-fundamental-organometallic-steps.jpg", "publishedAt": "2023-05-03T07:05:05Z", "content": "Metal-catalyzed Heck reaction, the reaction between alkenes with aryl halides to synthesize styrenyl products, is a discovery of great significance. The revelation got Richard F. Heck, Ei-ichi Negish… [+2394 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "\"Golden\" fossils reveal origins of exceptional preservation - Tech Explorist", "description": "All that glitters is not gold, even in the case of fossils.", "url": "https://www.techexplorist.com/golden-fossils-reveal-origins-exceptional-preservation/59792/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/Posidonia-Shale-Lagerstatte.jpg", "publishedAt": "2023-05-03T06:59:18Z", "content": "The marine fossil record demonstrates that biomineralized materials are more common than the remains of labile (non-biomineralized) tissues. This is because of the physiological, chemical, and biolog… [+3856 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Mushrooms pass on electrical messages after rains on wood wide webs - News9 LIVE", "description": "Scientists monitoring mushrooms with electrodes discovered the activity increased after rainfall", "url": "https://www.news9live.com/science/mushrooms-pass-on-electrical-messages-after-rains-on-wood-wide-webs-au941-2125358", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/05/023_mushrooms_and_their_postrain_electrical_conversations_fig1.jpg", "publishedAt": "2023-05-03T06:33:55Z", "content": "Scientists monitoring mushrooms with electrodes discovered the activity increased after rainfall\r\nThe roots of ectomycorrhizal fungi known as mycelia form vast networks around forest tree roots, abso… [+1912 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "May 2023 to Bring Us a Rare Lunar Eclipse, Aquariid Meteor Shower, And More! | Weather.com - The Weather Channel", "description": "A rare penumbral lunar eclipse will grace the night sky and not one, but two, meteor showers reach their peaks this month!", "url": "https://weather.com/en-IN/india/space/news/2023-05-02-may-2023-to-bring-us-rare-lunar-eclipse-aquariid-meteor-shower", "urlToImage": "https://s.w-x.co/in-meteor_shower%281%29_0.jpg", "publishedAt": "2023-05-03T06:23:37Z", "content": "Summer is here and so is our enthusiasm to make the most of the vacation period. But with May being almost unbearably hot, stepping out during the day might not be the smartest thing to do. Luckily f… [+3685 chars]"}, {"source": {"id": null, "name": "Alarabiya.net"}, "author": "Al Arabiya English", "title": "Saudi-crewed Axiom space mission delayed: ISS - Al Arabiya English", "description": "The Axiom 2 space mission featuring two Saudi astronauts, including the first Arab woman in space, has been postponed.NASA, Axiom Space and SpaceX are “wor", "url": "https://english.alarabiya.net/News/saudi-arabia/2023/05/03/Saudi-crewed-Axiom-space-mission-delayed-ISS", "urlToImage": "https://vid.alarabiya.net/images/2023/03/10/894fa55a-1ba3-4694-838b-e80180d50db1/894fa55a-1ba3-4694-838b-e80180d50db1_16x9_600x338.jpg", "publishedAt": "2023-05-03T06:19:00Z", "content": "The Axiom 2 space mission featuring two Saudi astronauts, including the first Arab woman in space, has been postponed.\r\nNASA, Axiom Space and SpaceX are working together to identify the best availabl… [+1665 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 3 May 2023: The stunning Centaurus A Galaxy - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is the elliptical galaxy NGC 5128, also known as Centaurus A, which is the closest active galaxy to Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-3-may-2023-the-stunning-centaurus-a-galaxy-71683094041916.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/03/1600x900/centaurus_a_1683094232374_1683094245561.jpg", "publishedAt": "2023-05-03T06:11:38Z", "content": "Stars, which illuminate the darkness of space, are formed in a giant cloud of dust and gas in space, known as a Nebula. The age, distribution, and composition of the stars in a galaxy trace the histo… [+1817 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Education Desk", "title": "Explore exciting career opportunities in Space Science - India Today", "description": "This article will explore the diverse and exciting career opportunities available in space science.", "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/explore-exciting-career-opportunities-in-space-science-2367844-2023-05-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202305/capture-sixteen_nine.png?VersionId=kSkLuESaq1A8PDMtRFeIEVfDRwRm2khm", "publishedAt": "2023-05-03T06:04:49Z", "content": "By India Today Education Desk: Exploring the vast and mysterious universe beyond our planet has long been a subject of fascination for humanity. Space exploration has yielded abundant scientific know… [+4717 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Abhishek Awasthi", "title": "Cold War 2030: China, US in space race, Beijings next-gen rocket to take humans to the Moon by 2030 - Firstpost", "description": "A next-generation rocket to transport an improved crew spaceship has been developed by China while work is being done on a lunar lander. “By 2030, it is without a doubt possible for the Chinese to walk on the Moon. That is not a problem”", "url": "https://www.firstpost.com/world/cold-war-2030-china-us-in-space-race-beijings-next-gen-rocket-to-take-humans-to-the-moon-by-2030-12539992.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/05/download-24.jpeg", "publishedAt": "2023-05-03T05:32:16Z", "content": "China seems to be catching up with the United States in the race to send its people on the Moon before any other country in the world.\r\nEven though, NASA has already given out details of its Artemis … [+1502 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Education", "title": "Big Bang theory explained: How did the universe begin? - Times of India", "description": "Learning with TOI News: The Big Bang theory explains the origin of the universe through a massive explosion that occurred about 13.8 billion years ago. The universe started a", "url": "https://timesofindia.indiatimes.com/education/learning-with-toi/big-bang-theory-explained-how-did-the-universe-begin/articleshow/99950572.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-99950625,width-1070,height-580,imgsize-77988,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-03T04:55:00Z", "content": "Top 10 Summer Camp Activities You Can Plan"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "ESA is struggling to deploy ice penetrating radar antenna on JUICE spacecraft - News9 LIVE", "description": "The RIME antenna has not deployed as planned, but ESA continues to troubleshoot the issue", "url": "https://www.news9live.com/science/esa-is-struggling-to-deploy-ice-penetrating-radar-antenna-on-juice-spacecraft-au941-2125187", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/05/Testing_Juice_s_RIME_antenna_in_the_Hertz_facility_pillars-Cropped.jpg", "publishedAt": "2023-05-03T03:58:41Z", "content": "The RIME antenna has not deployed as planned, but ESA continues to troubleshoot the issue\r\nThe European Space Agency (ESA) is troubleshooting an issue that has prevented the deployment of the Radar f… [+1780 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Saturn's rings are shrinking and boffins will use the Webb 'scope to find out why - The Register", "description": "They go down, down, down, with the burning pull of gravity ... or do they?", "url": "https://www.theregister.com/2023/05/03/saturn_shrinking_rings/", "urlToImage": "https://regmedia.co.uk/2023/05/02/saturn_shutterstock.jpg", "publishedAt": "2023-05-03T02:58:00Z", "content": "Astronomers will direct NASA's James Webb Space Telescope to peer at Saturn in an attempt to discern when its iconic rings might vanish.\r\nSaturn is the most recognizable planet in the Solar System th… [+1789 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "SpaceX to launch 56 Starlink satellites into orbit on Thursday: Watch live - Devdiscourse", "description": "Read more about SpaceX to launch 56 Starlink satellites into orbit on Thursday: Watch live on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2437852-spacex-to-launch-56-starlink-satellites-into-orbit-on-thursday-watch-live", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_02_2023_10_33_43_09215.jfif?width=920&format=jpeg", "publishedAt": "2023-05-03T02:54:26Z", "content": "SpaceX is gearing up for the Falcon 9 launch of a new batch of Starlink internet satellites on Thursday, May 4 at 3:34 a.m. ET (07:34 UTC). The mission will carry 56 Starlink satellites to low-Earth … [+1161 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN", "title": "Astronauts to relocate SpaceX spacecraft's docking port on space station - CGTN", "description": "Four crew members aboard the International Space Station will relocate their SpaceX Dragon spacecraft's docking port this weekend, to make way for the arrival of an upcoming cargo spacecraft, according to the U.S. National Aeronautics and Space Administration…", "url": "https://news.cgtn.com/news/2023-05-03/Astronauts-to-shift-SpaceX-spacecraft-s-docking-port-on-space-station-1juNh1BdEMU/index.html", "urlToImage": "https://news.cgtn.com/news/2023-05-03/Astronauts-to-shift-SpaceX-spacecraft-s-docking-port-on-space-station-1juNh1BdEMU/img/36687506c44546159348529fa3a3290d/36687506c44546159348529fa3a3290d-750.png", "publishedAt": "2023-05-03T02:03:30Z", "content": "Four crew members aboard the International Space Station will relocate their SpaceX Dragon spacecraft's docking port this weekend, to make way for the arrival of an upcoming cargo spacecraft, accordi… [+730 chars]"}, {"source": {"id": null, "name": "Newsd.in"}, "author": "Newsd", "title": "International Sun Day 2023: Date, History, Activities and Facts - Newsd.in", "description": "On Sun Day, we celebrate the solitary star that illuminates our planet, while also highlighting the immense energy potential that we have yet to fully realise. Former U.S. President Jimmy Carter instituted this annual holiday in 1978 to promote solar energy a…", "url": "https://newsd.in/international-sun-day/", "urlToImage": "https://newsd.in/wp-content/uploads/2023/05/International-Sun-Day.jpg", "publishedAt": "2023-05-02T19:42:16Z", "content": "International Sun Day 2023: International Sun Day is annually observed on May 3. Many people believe that the Sun began everything, but we can all agree that it provides light and heat to Earth. On S… [+4081 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Selects Emily Nelson as Chief Flight Director - NASA", "description": "NASA has named Emily Nelson its new chief flight director, leading the group that directs human spaceflight missions from the Mission Control Center at the agency’s Johnson Space Center in Houston.", "url": "https://www.nasa.gov/press-release/nasa-selects-emily-nelson-as-chief-flight-director", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/emily_nelson_.jpg", "publishedAt": "2023-05-02T18:18:25Z", "content": null}, {"source": {"id": null, "name": "Theglobestalk.com"}, "author": "https://m.facebook.com/theglobestalk/?ref=bookmarks", "title": "The Magic of E=mc²: How the Human Body Mirrors the Universe's Most Famous Equation - The Globe's Talk", "description": "Albert Einstein’s equation E=mc² is arguably one of the most famous equations in the history of science. This formula describes the relationship between mass", "url": "https://theglobestalk.com/emc%c2%b2-how-human-body-mirrors-universes-most-famous-equation/", "urlToImage": "https://theglobestalk.com/wp-content/uploads/2023/05/images-1-1.jpeg", "publishedAt": "2023-05-02T17:56:02Z", "content": "Albert Einsteins equation E=mc² is arguably one of the most famous equations in the history of science. This formula describes the relationship between mass (m) and energy (E), they are interchangeab… [+5182 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "China's malfunctioning Mars rover may have found evidence of recent water on the Red Planet - Livescience.com", "description": "Data from China's unresponsive Zhurong rover suggests that Mars had snow and frost as recently as 400,000 years ago.", "url": "https://www.livescience.com/space/mars/chinas-malfunctioning-mars-rover-may-have-found-evidence-of-recent-water-on-the-red-planet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4Mb5fN92aq9b35cdsKwNyg-1200-80.jpg", "publishedAt": "2023-05-02T17:32:24Z", "content": "Mars may have had liquid water on its surface as recently as 400,000 years ago, data from China's Zhurong rover suggests. \r\nResearchers used three of the craft's instruments to sample sand dunes from… [+2897 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Janvi Kapur", "title": "Skin Hunger: What You Need to Know about Touch Starvation - Sportskeeda", "description": "Skin hunger is a new term for something very basic to us -- physical connection. It is an intense, agonizing yearning for another person to be physically present with you.", "url": "https://www.sportskeeda.com/health-and-fitness/skin-hunger-what-you-need-know-touch-starvation", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/05/b023f-16830407490473-1920.jpg", "publishedAt": "2023-05-02T16:59:00Z", "content": "Skin hunger is a new term for something very basic to us -- physical connection. It is an intense, agonizing yearning for another person to be physically present with you. Our skin is our largest sen… [+5051 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Aliens might find us through Earth`s mobile tower signals, says a study - WION", "description": "Aliens might find us through Earths mobile tower signals, says a study", "url": "https://www.wionews.com/science/aliens-might-find-us-through-earths-mobile-tower-signals-says-a-study-588284", "urlToImage": "http://cdn.wionews.com/sites/default/files/2018/09/12/31859-alien1-20171103111635.jpg", "publishedAt": "2023-05-02T16:49:31Z", "content": "Anything with 'aliens' in its title these days most often tends to be more sensational than scientific. The topic has been on human civilization's mind for centuries and technology developed, we have… [+1781 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Randy Koster: Modeling the Ways of Water - NASA", "description": "Goddard research scientist Dr. Randy Koster uses computer modeling to help understand how the many systems of our home planet are connected - especially the ones fueled by water.", "url": "https://www.nasa.gov/feature/goddard/2023/randy-koster-modeling-the-ways-of-water", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/stars_0.jpg", "publishedAt": "2023-05-02T16:18:45Z", "content": null}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Fossil Find in California Shakes Up the Natural History of Cycad Plants - Technology Networks", "description": "Researchers are trying to solve one of those fundamental puzzles: how a dividing stem cell portions out its membrane during the process of division.", "url": "https://www.technologynetworks.com/cell-science/news/how-stem-cells-use-wrinkles-to-divide-372834", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/372834/how-stem-cells-use-wrinkles-to-divide-372834-640x360.jpg?cb=20230502", "publishedAt": "2023-05-02T15:46:30Z", "content": "What seems like a straightforward task for a cell  dividing in two is actually an intricate series of engineering puzzles. A dividing cell needs to maneuver its insides so that the right components w… [+3368 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Grim Images Show Helpless Star Disappearing Into Black Hole - msnNOW", "description": "Stellar Meal Astronomers have spotted a helpless star as it was being devoured by a black hole, emitting a bright flash as its last gasp of life before disappearing forever into the singularity. This epic form of stellar destruction — death by black hole — is…", "url": "https://futurism.com/the-byte/grim-images-star-disappearing-black-hole", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1aDJ7R.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-02T15:31:43Z", "content": "© Provided by Futurism\r\n A poor star some 173 million light years succumbed to the gaping maw of a black hole, dying in what's known as a tidal disruption event.\r\nStellar Meal\r\nAstronomers have spott… [+2612 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "New Algorithm Precisely Predicts Beam's Distribution of Particle Positions in Accelerators - AZoQuantum", "description": "Whenever SLAC National Accelerator Laboratory's linear accelerator is on, packs of around a billion electrons each travel together at nearly the speed of light through metal piping.", "url": "https://www.azoquantum.com/News.aspx?newsID=9548", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ThumbForNews_9548_16830280568542718.jpg", "publishedAt": "2023-05-02T13:16:00Z", "content": "Whenever SLAC National Accelerator Laboratory's linear accelerator is on, packs of around a billion electrons each travel together at nearly the speed of light through metal piping. These electron bu… [+3683 chars]"}, {"source": {"id": null, "name": "Aircosmosinternational.com"}, "author": null, "title": "Deimos and Mars in the eye of Al-Amal - Air & Cosmos - International", "description": "Each weekend, an image that made the news or caught our attention. On March 10, the UAE probe Al-Amal provided superb pictures of the planet Mars and its small moon Deimos, reopening an old debate on the origins of the two Martian satellites.", "url": "https://aircosmosinternational.com/article/deimos-and-mars-in-the-eye-of-al-amal-3825", "urlToImage": "https://fra1.digitaloceanspaces.com/rewyer/4dc607ixno/media/22c2535b41c40a176f309c243a6ebeb415176d6af7897e57e02e827078d4b952", "publishedAt": "2023-05-02T12:49:08Z", "content": "On orbit since February 9th, 2021 around the Red Planet, the Emirati probe Al-Amal (Hope, in Arabic, Hope in English) passed on March 10 at a distance of 104 km from Deimos, the smaller and more dist… [+4840 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Move over `hangry`, these spiders start losing vision when they get hungry - WION", "description": "Move over hangry, these spiders start losing vision when they get hungry", "url": "https://www.wionews.com/science/move-over-hangry-these-spiders-start-losing-vision-when-they-get-hungry-588190", "urlToImage": "http://cdn.wionews.com/sites/default/files/2020/10/14/164836-the-spiders-supper.jpg", "publishedAt": "2023-05-02T11:39:07Z", "content": "We all know 'hangry'. That feeling when we want to destroy the world without a reason and then realise that was just because we were hungry. Even a light snack makes the picture rosier. In our urge t… [+2725 chars]"}, {"source": {"id": null, "name": "Expatguideturkey.com"}, "author": "Ece Nagihan", "title": "Russia Will Support International Space Station Until 2028 - Expat Guide Turkey", "description": "Russia, which suffered a serious embargo from the USA and EU countries after its invasion of Ukraine, was preparing to leave the International Space Station, but apparently this will not happen until", "url": "https://expatguideturkey.com/russia-will-support-international-space-station-until-2028/", "urlToImage": "https://expatguideturkey.com/wp-content/uploads/2023/05/russia-will-support-international-space-station-until-2028.webp", "publishedAt": "2023-05-02T11:36:42Z", "content": "Russia, which suffered a serious embargo from the USA and EU countries after its invasion of Ukraine, was preparing to leave the International Space Station, but apparently this will not happen until… [+2003 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "Massive radio array to search for ET signals from other civilizations - Space Daily", "description": "Mountain View CA (SPX) May 02, 2023 - \r\nOne of the world's most powerful radio telescope arrays is joining the hunt for signals from other galactic civilizations. The National Science Foundation's Karl G. Jansky Very Large Array (VLA), si", "url": "https://www.spacedaily.com/reports/Massive_radio_array_to_search_for_ET_signals_from_other_civilizations_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/jansky-very-large-array-vla-radio-astronomy-telescope-hg.jpg", "publishedAt": "2023-05-02T11:32:23Z", "content": "Massive radio array to search for ET signals from other civilizationsby Staff WritersMountain View CA (SPX) May 02, 2023\r\nOne of the world's most powerful radio telescope arrays is joining the hunt f… [+4124 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Lunar Eclipse 2023: Will first Chandra Grahan of the year be visible in India? Check date and time - msnNOW", "description": "The first lunar eclipse of the year 2023 is taking place on Friday, May 5, 2023. This lunar eclipse will start at 8.45 pm and end at 1 am.", "url": "https://www.dnaindia.com/lifestyle/report-lunar-eclipse-2023-will-first-chandra-grahan-of-the-year-be-visible-in-india-check-date-and-time-3039408", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/04/30/2587479-untitled-design-2023-04-30t070408.758.jpg", "publishedAt": "2023-05-02T11:08:14Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Apr 30, 2023, 07:04 AM ISTA total of 4 eclipses are going to happen in the year 2023. Of these, two are solar eclipses and two ar… [+1806 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "MIT scientists innovated automatically thin transistors to make denser computer chips - Tech Explorist", "description": "A new low-temperature growth and fabrication technology could lead to denser and more powerful chips.", "url": "https://www.techexplorist.com/automatically-thin-transistors-make-denser-computer-chips/59752/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/8-inch-CMOS-wafer.jpg", "publishedAt": "2023-05-02T11:03:34Z", "content": "Two-dimensional (2D) materials are promising candidates for future electronics. Although promising results on the wafer-scale synthesis of monolayer molybdenum disulfide (MoS2) have already been repo… [+5346 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Zoya Zaidi", "title": "Auroras spotted in India: Why it’s rare - NewsBytes", "description": "A geomagnetic storm sparked brilliant auroras, seen for the first time in India. Captured by IAO, the celestial spectacle occurred at low latitudes on April 22.", "url": "https://www.newsbytesapp.com/visualstories/science/auroras-spotted-in-india-why-its-rare", "urlToImage": "https://i.cdn.newsbytesapp.com/web/story168302357579988.png?tr=w-360", "publishedAt": "2023-05-02T10:40:14Z", "content": "Auroras spotted in India:Why its rare"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "West Antarctica Ice Sheet retreated far inland after end of last ice age, regained since - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/west-antarctica-ice-sheet-retreated-far-inland-after-end-of-last-ice-age-regained-since/562265.html", "urlToImage": "", "publishedAt": "2023-05-02T10:08:46Z", "content": "New Delhi, May 2 (PTI) New research has found that 6,000 years ago, the grounded edge of the West Antarctic Ice Sheet may have been as far as 250 kilometres inland from its current location, suggesti… [+452 chars]"}, {"source": {"id": null, "name": "Finnoexpert.com"}, "author": null, "title": "Who Will Have the Last Word on the Universe? - Finnoexpert", "description": "The End is coming, in maybe 100 billion years. Is it too soon to start freaking out?", "url": "https://finnoexpert.com/2023/05/02/who-will-have-the-last-word-on-the-universe/", "urlToImage": "https://static01.nyt.com/images/2023/04/28/science/00SCI-OUTTHERE-ENDISNIGH/00SCI-OUTTHERE-ENDISNIGH-facebookJumbo.jpg", "publishedAt": "2023-05-02T07:00:10Z", "content": "How did we humans get into this fix? The universe as we know it originated in a fiery burst 13.8 billion years ago and has been flying apart ever since. Astronomers argued for decades about whether i… [+1621 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 2 May 2023: Flat Martian rocks shot by Curiosity Rover - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Flat rock hills on the surface of Mars, captured by the Curiosity Rover.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-2-may-2023-flat-martian-rocks-shot-by-curiosity-rover-71683010410398.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/mars_1683010589607_1683010598261.jpg", "publishedAt": "2023-05-02T06:57:41Z", "content": "Mars, popularly known as the Red Planet, has captured the attention of astronomers, scientists and sci-fi geeks for decades. This is mainly due to its fascinating geographical features such as myster… [+1906 chars]"}, {"source": {"id": null, "name": "iTech Post"}, "author": "John Paul M. Joaquin", "title": "China To Put Its Astronauts on the Moon by 2030 - iTech Post", "description": "How ready is China to put its astronauts on the Moon's surface? Operational Chinese moon bases could be operational by 2030.  A China Central Television (CCTV) report recently mentioned that the country plans to put Chinese astronauts on the surface of the Mo…", "url": "https://www.itechpost.com/articles/117484/20230502/china-put-astronauts-moon-2030.htm", "urlToImage": "https://1401700980.rsc.cdn77.org/data/images/full/110533/china-sets-new-rules-for-ai-generated-content-regulation.jpg", "publishedAt": "2023-05-02T06:10:00Z", "content": "Operational Chinese moon bases could be operational by 2030.\r\nA China Central Television (CCTV) report recently mentioned that the country plans to put Chinese astronauts on the surface of the Moon b… [+2736 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Seismic Shift: NASA's InSight Mission Unlocks Secrets of Mars' Core - SciTechDaily", "description": "In 2021, a pair of quakes sent seismic waves deep into the Red Planet’s core, giving scientists the best data yet on its size and composition. Using seismic data from NASA's InSight Mars lander, scientists have made the first direct observations of another pl…", "url": "https://scitechdaily.com/a-seismic-shift-nasas-insight-mission-unlocks-secrets-of-mars-core/", "urlToImage": "https://scitechdaily.com/images/InSight-Lander-on-Mars-1-scaled.jpg", "publishedAt": "2023-05-02T05:37:34Z", "content": "ByJet Propulsion LaboratoryMay 1, 2023\r\nAn artist illustration of the InSight lander on Mars. InSight, short for Interior Exploration using Seismic Investigations, Geodesy and Heat Transport, is desi… [+9521 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Physicists explored microscopic filament behavior - Tech Explorist", "description": "Particle shape can be used to create a material that forms an extremely low-density glass.", "url": "https://www.techexplorist.com/physicists-explored-microscopic-filament-behavior/59709/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/Fluorescent-microscopy.jpg", "publishedAt": "2023-05-02T05:33:19Z", "content": "The dynamics and mechanics of materials made of polymers are significantly influenced by geometry and topology. For instance, the characteristics of flexible polymers with ring, branching, or star sh… [+3318 chars]"}, {"source": {"id": null, "name": "Travelandtourworld.com"}, "author": "Pappu", "title": "NSW eager to cash in on 2028 solar eclipse tourism potential - Travel And Tour World ", "description": "Tourism operators in regional New South Wales are eager to take advantage of the numerous tourism prospects afforded by a total solar eclipse in five years, ABC News reported. On July 22, 2028, the eclipse is anticipated to travel over …", "url": "https://www.travelandtourworld.com/news/article/nsw-eager-to-cash-in-on-2028-solar-eclipse-tourism-potential/", "urlToImage": "#", "publishedAt": "2023-05-02T04:27:09Z", "content": "Home » NSW eager to cash in on 2028 solar eclipse tourism potential\r\n&amp;nbspTuesday, May 2, 2023 \r\nTourism operators in regional New South Wales are eager to take advantage of the numerous tourism … [+2431 chars]"}]}