{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Study unveils properties of the rapidly rotating magnetic star HD 345439 - Phys.org", "description": "Using the Nanshan One-meter Wide-field Telescope (NOWT), Chinese astronomers have performed multi-color photometric observations of a rapidly rotating magnetic star known as HD 345439. Results of this observational campaign, published Nov. 1 on the arXiv pre-…", "url": "https://phys.org/news/2022-11-unveils-properties-rapidly-rotating-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/study-unveils-properti.jpg", "publishedAt": "2022-11-09T14:00:01Z", "content": "Using the Nanshan One-meter Wide-field Telescope (NOWT), Chinese astronomers have performed multi-color photometric observations of a rapidly rotating magnetic star known as HD 345439. Results of thi… [+3260 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA delays Artemis 1 launch again, this time due to tropical storm Nicole - The Indian Express", "description": "NASA's Artemis 1 mission will be delayed again, this time due to concerns surrounding tropical storm Nicole. The SLS rocket and Orion spacecraft will remain on the launchpad through the storm.", "url": "https://indianexpress.com/article/technology/science/nasa-artemis-1-launch-delayed-november-16-8258927/", "urlToImage": "https://images.indianexpress.com/2022/11/NASA-Artemis-1-launch-postponed-20221109.jpg", "publishedAt": "2022-11-09T12:56:11Z", "content": "NASA is now targeting the Artemis 1 launch to happen during a two-hour window that opens at 1.04 AM EST (11.34 AM IST) on November 16. If all goes according to plan, the Artemis 1 mission should spla… [+2190 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers propose a deep antibody-antigen interaction algorithm to accelerate the identification of potential therapeutic antibodies - News-Medical.Net", "description": "Researchers used a deep antibody-antigen interaction (DeepAAI) algorithm to understand the antibody representations of unseen antibodies to accelerate the discovery of novel antibodies with potential therapeutic applications.", "url": "https://www.news-medical.net/news/20221109/Researchers-propose-a-deep-antibody-antigen-interaction-algorithm-to-accelerate-the-identification-of-potential-therapeutic-antibodies.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_730539_16679963409153724.jpg", "publishedAt": "2022-11-09T12:24:00Z", "content": "In a recent study published in Nature Machine Intelligence, a team of researchers used a deep antibody-antigen interaction (DeepAAI) algorithm to understand the antibody representations of unseen ant… [+5161 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Sounds of the stars: how scientists are listening in on space - Nature.com", "description": "In astronomy, the use of sound instead of light is breaking down barriers to participation and providing insight into the Universe.", "url": "https://www.nature.com/articles/d41586-022-03597-5", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-03597-5/d41586-022-03597-5_23687328.jpg", "publishedAt": "2022-11-09T11:30:17Z", "content": "The Perseus cluster contains thousands of galaxies in a cloud of super-heated gas. A tweet from NASA about the sound of the black hole at its centre has been played millions of times.Credit: NASA/CXC… [+5457 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Watch | Robotic arm catches cargo ship with food, supplies for astronauts - India Today", "description": "The Canadarm-2 captured the Cygnus spacecraft carrying dozens of new scientific experiments and food for astronauts.", "url": "https://www.indiatoday.in/science/story/watch-robotic-canadaarm-catches-cargo-ship-with-food-supplies-on-space-station-2295277-2022-11-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/cygnus-sixteen_nine.jpg?VersionId=DXZWdNOtbKOZThL_ZEJtxtxMaL1nAlNJ", "publishedAt": "2022-11-09T11:05:01Z", "content": "By India Today Web Desk: Days after a solar panel glitch worried engineers on Earth, Northrop Grumman's Cygnus cargo resupply spacecraft has arrived at the International Space Station. The spacecraft… [+1713 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Ocean microbes get their diet through a surprising mix of sources, study finds - India Education Diary", "description": "One of the smallest and mightiest organisms on the planet is a plant-like bacterium known to marine biologists as Prochlorococcus. The green-tinted microbe measures less than a micron across, and its populations suffuse through the upper layers of th", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-ocean-microbes-get-their-diet-through-a-surprising-mix-of-sources-study-finds/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg?fit=600%2C400&ssl=1", "publishedAt": "2022-11-09T10:22:23Z", "content": "One of the smallest and mightiest organisms on the planet is a plant-like bacterium known to marine biologists as Prochlorococcus. The green-tinted microbe measures less than a micron across, and its… [+6153 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Oldest Planetary Debris in Our Galaxy – Remnants of Destroyed Solar System - SciTechDaily", "description": "A new study puts an age to a faint white dwarf star of over ten billion years Engulfed remains of recently orbiting planetesimals make this the oldest dead star with an evolved planetary system Provides insight into the formation and evolution of asteroids, i…", "url": "https://scitechdaily.com/astronomers-discover-oldest-planetary-debris-in-our-galaxy-remnants-of-destroyed-solar-system/", "urlToImage": "https://scitechdaily.com/images/White-Dwarf-Accreting-Debris-scaled.jpg", "publishedAt": "2022-11-09T10:12:55Z", "content": "ByUniversity of WarwickNovember 9, 2022\r\nArtists impression of the old white dwarfs WDJ2147-4035 and WDJ1922+0233 surrounded by orbiting planetary debris, which will accrete onto the stars and pollut… [+7140 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Electricity Generated From Heat by Crystals - Technology Networks", "description": "To convert heat into electricity, easily accessible materials from harmless raw materials open up new perspectives in the development of safe and inexpensive so-called thermoelectric materials.", "url": "https://www.technologynetworks.com/applied-sciences/news/electricity-generated-from-heat-by-crystals-367447", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367447/electricity-generated-from-heat-by-crystals-367447-640x360.jpg?cb=20221109", "publishedAt": "2022-11-09T10:09:42Z", "content": "To convert heat into electricity, easily accessible materials from harmless raw materials open up new perspectives in the development of safe and inexpensive so-called thermoelectric materials. A syn… [+2807 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "What Does Earth Look Like From Moon During A Lunar Eclipse? - Indiatimes.com", "description": "Ever wondered what our stunning Earth looks like from space during a lunar eclipse? We got you covered!On Tuesday, November 8, Earthlings were treated to the Blood Moon, or in other words, a total lunar eclipse. During this time, the Moon takes on a reddish h…", "url": "https://www.indiatimes.com/technology/science-and-future/earth-from-moon-during-lunar-eclipse-584286.html", "urlToImage": "https://im.indiatimes.in/content/2022/Nov/FBImage-10_636b63796bff1.jpg", "publishedAt": "2022-11-09T08:22:29Z", "content": "Ever wondered what our stunning Earth looks like from space during a lunar eclipse? We got you covered!\r\nOn Tuesday, November 8, Earthlings were treated to the Blood Moon, or in other words, a total … [+2080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "James Webb Space Telescope resumes science operations after glitch - The Indian Express", "description": "James Webb Space Telescope Glitch: After spending weeks investigating an issue with the JWST's “medium-resolution spectroscopy” (MRS) mode, Webb teams have defined a new set of operational procedures that will allow the telescope to return to science observat…", "url": "https://indianexpress.com/article/technology/science/james-webb-space-telescope-miri-mrs-glitch-8258002/", "urlToImage": "https://images.indianexpress.com/2022/11/James-Webb-MRS-mode-20221109.jpg", "publishedAt": "2022-11-09T06:58:13Z", "content": "MIRI mechanism issue\r\nOn August 24, Webb engineers discovered that a grating wheel mechanism which supports the telescopes medium-resolution spectroscopy (MRS) mode was showing signs of increased fri… [+2376 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "A new quantum phase discovered for developing hybrid materials - Tech Explorist", "description": "The structural phase transition is driven by an acoustic soft mode.", "url": "https://www.techexplorist.com/a-new-quantum-phase-discovered-for-developing-hybrid-materials/54762/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/BaAl2O4.jpg", "publishedAt": "2022-11-09T06:53:58Z", "content": "Crystalline solids that exhibit the typical phase transition involve a change in the crystal structure. Such structural phase transitions usually occur at finite temperatures. However, controlling th… [+2452 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Isro plans to return to Mars, explore dark side of the moon - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/smart-living/innovation/isro-plans-to-return-to-mars-explore-dark-side-of-the-moon-111667974767117.html", "urlToImage": "https://images.livemint.com/img/2022/11/09/1140x641/PTI06-30-2022-000248B-0_1656598087688_1667975084785_1667975084785.jpg", "publishedAt": "2022-11-09T06:31:31Z", "content": "Dehradun: After missions to the moon and Mars, the Indian Space Research Organisation (ISRO) has now set its eyes on Venus and also plans to explore the dark side of the moon in collaboration with Ja… [+1792 chars]"}, {"source": {"id": null, "name": "Alarabiya.net"}, "author": "Al Arabiya English", "title": "In pictures: Moon turns blood-red in last total lunar eclipse until 2025 - Al Arabiya English", "description": "The last total lunar eclipse until 2025 turned the moon blood-red on Tuesday.Dubbed the Beaver Blood Moon lunar eclipse - as it occurs during November’s Fu", "url": "https://english.alarabiya.net/life-style/2022/11/09/In-pictures-Moon-turns-blood-red-in-last-total-lunar-eclipse-until-2025", "urlToImage": "https://vid.alarabiya.net/images/2022/11/09/db8b499e-3147-4f26-8953-97bd2379ff3d/db8b499e-3147-4f26-8953-97bd2379ff3d_16x9_600x338.jpg", "publishedAt": "2022-11-09T05:30:00Z", "content": "The last total lunar eclipse until 2025 turned the moon blood-red on Tuesday.\r\nDubbed the Beaver Blood Moon lunar eclipse - as it occurs during Novembers Full Beaver Blood Moon - the celestial specta… [+1169 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Photo gallery: Blood moon total lunar eclipse - KHON2 News", "description": "Late Monday, Nov. 7 and early Tuesday, Nov. 8, the world witnessed a blood moon total lunar eclipse.Hawaii News, Hawaii Weather, Hawaii SportsSee more of the...", "url": "https://www.youtube.com/watch?v=ejbqNDFvrSM", "urlToImage": "https://i.ytimg.com/vi/ejbqNDFvrSM/maxresdefault.jpg", "publishedAt": "2022-11-09T02:34:56Z", "content": null}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Earth’s oldest stromatolites and the search for life on Mars - ThePrint", "description": "Washington [US], November 9 (ANI): The earliest morphological traces of life on Earth are often highly controversial, both because non-biological processes can produce relatively similar structures and because such fossils have often been subjected to advance…", "url": "https://theprint.in/science/earths-oldest-stromatolites-and-the-search-for-life-on-mars/1205600/", "urlToImage": null, "publishedAt": "2022-11-08T23:13:27Z", "content": "Washington [US], November 9 (ANI): The earliest morphological traces of life on Earth are often highly controversial, both because non-biological processes can produce relatively similar structures a… [+2354 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Astronomers spot the exposed inner core of an 'oddball' star by accident - Space.com", "description": "The stripped core of a star that was 12 times as massive as the sun was discovered by chance during a stage of stellar evolution that lasts the blink of a cosmic eye.", "url": "https://www.space.com/first-ever-detection-star-core", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rdoMpcUFMsHxPE8i5mq6GM-1200-80.jpg", "publishedAt": "2022-11-08T20:00:37Z", "content": "The exposed core of a massive star has been observed for the first time, a discovery that has been described as purely \"serendipitous\" by the team that chanced upon it.\r\nThough the cores of stars are… [+4916 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Shuvangi Sen Chaudhury", "title": "5 Exercises That Burn Most Fat At Gym To Lose Love Handles - Sportskeeda", "description": "One of the most common aspects of weight loss is to lose love handles. Unfortunately, there isn’t a specific exercise you can do to reduce fat from love handles.", "url": "https://www.sportskeeda.com/health-and-fitness/5-exercises-that-burn-most-fat-at-gym-to-lose-love-handles", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/16a46-16679162004850-1920.jpg", "publishedAt": "2022-11-08T20:00:00Z", "content": "One of the most common aspects of weight loss is to lose love handles. Unfortunately, there isnt a specific exercise you can do to reduce fat from love handles.\r\nIn fact, you cant target any particul… [+3330 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Ultrathin solar cells promise improved satellite performance: Radiation damage to photovoltaics in orbit can be reduced by making the cells thinner - Science Daily", "description": "As low Earth orbit becomes more cluttered, it becomes increasingly necessary to use middle Earth orbits, and radiation-tolerant cell designs will be needed. Making photovoltaics thinner should increase their longevity because the charge carriers have less far…", "url": "https://www.sciencedaily.com/releases/2022/11/221108120003.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-08T19:56:11Z", "content": "Most space satellites are powered by photovoltaic cells that convert sunlight to electricity. Exposure to certain types of radiation present in orbit can damage the devices, degrading their performan… [+2754 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Jim Cornall", "title": "Google and Meta AI could boost research and drug discovery - Labiotech.eu", "description": "Alpha Fold 2 is a neural network developed by Deep Mind, a Google-owned AI company solving the 3D structure of proteins.", "url": "https://www.labiotech.eu/trends-news/google-meta-ai-cancer-research-drug-discovery/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2022/11/shutterstock-1176407731.jpg", "publishedAt": "2022-11-08T19:52:36Z", "content": "Encoded in the DNA, a protein may be represented as a thread of hundreds of individual molecules called amino acids, linked together. \r\nDepending on the particular amino acids combination, a protein … [+3469 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "IceCube detects high-energy neutrinos from an active galactic nucleus – Physics World - physicsworld.com", "description": "Observation lifts the veil on violent processes near supermassive black hole", "url": "https://physicsworld.com/a/icecube-detects-high-energy-neutrinos-from-an-active-galactic-nucleus/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/11/Messier-77-as-seen-by-Hubble.jpg", "publishedAt": "2022-11-08T17:26:15Z", "content": "Particle accelerator: IceCube has detected 79 high-energy neutrinos from the Messier 77 galaxy, which appears in this image from the Hubble Space Telescope. (Courtesy: NASA/ESA/A van der Hoeven)\r\nHig… [+4895 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How does a skeleton move? A new tracking method to quantify skeletal kinematics in freely moving rodents - Phys.org", "description": "How can we measure a skeleton's motion in a furry animal as it moves through its environment? Researchers at the Max Planck Institute for Neurobiology of Behavior have developed a method to quantify skeletal motion in freely moving rodents in a new level of a…", "url": "https://phys.org/news/2022-11-skeleton-tracking-method-quantify-skeletal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/how-does-a-skeleton-mo.jpg", "publishedAt": "2022-11-08T15:03:08Z", "content": "How can we measure a skeleton's motion in a furry animal as it moves through its environment? Researchers at the Max Planck Institute for Neurobiology of Behavior have developed a method to quantify … [+4762 chars]"}, {"source": {"id": null, "name": "Scitation.org"}, "author": "Brazil Rachel author aut", "title": "Galactic archaeologists trace the evolution of the Milky Way - Physics Today", "description": "<p>Improved methods of estimating the ages of stars, combined with new precision position and velocity data, are yielding insights into the major events that shaped our galaxy billions of years ago...", "url": "https://physicstoday.scitation.org/do/10.1063/PT.6.1.20221108a/full/", "urlToImage": "https://physicstoday.scitation.org/action/showOpenGraphArticleImage?doi=10.1063/PT.6.1.20221108a&id=media/highlight-2.jpg", "publishedAt": "2022-11-08T14:50:15Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "NASA needs a new moon car for off-roading astronauts at the lunar south pole - Space.com", "description": "The contracting for the next moon buggy for Artemis has begun.", "url": "https://www.space.com/nasa-needs-a-new-moon-car-for-off-roading-astronauts-at-the-lunar-south-pole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oPw5iqShUmBDoahA2w4dNB-1200-80.jpg", "publishedAt": "2022-11-08T14:45:59Z", "content": "The search for the next-gen buggy for the upcoming Artemis moon missions has begun.\r\nWhile the previous lunar vehicles, used during the 1970s Apollo missions, were designed for the relatively balmy c… [+3704 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Jeff Nagle", "title": "Astronomers capture startling new detail of the first black hole - Inverse", "description": "Cygnus X-1 has intrigued astronomers since it was discovered — and IXPE is uncovering its secrets.", "url": "https://www.inverse.com/science/ixpe-cygnus-x-1", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/11/7/ee4b3fd5-0d4f-49ed-b86c-40ca4416b68c-getty-112717078.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-11-08T14:30:25Z", "content": "As matter \r\nswirls violently down toward the event horizon of a black hole, it forms an accretion disk, heating plasma to millions of degrees and blasting X-rays into space. But what exactly does the… [+5090 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "GHRSS survey finds four new pulsars - Phys.org", "description": "Astronomers report the detection of four new pulsars using the Giant Metrewave Radio Telescope (GMRT) as part of the GMRT High Resolution Southern Sky (GHRSS) survey. The finding was detailed in a research paper published October 29 on the arXiv pre-print rep…", "url": "https://phys.org/news/2022-11-ghrss-survey-pulsars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/ghrss-survey-finds-fou.jpg", "publishedAt": "2022-11-08T14:27:03Z", "content": "Astronomers report the detection of four new pulsars using the Giant Metrewave Radio Telescope (GMRT) as part of the GMRT High Resolution Southern Sky (GHRSS) survey. The finding was detailed in a re… [+3418 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Observation of a new type of self-generated current in magnetized plasmas - Phys.org", "description": "Nuclear fusion has drawn attention in the era of carbon neutrality because it produces no carbon emission or radioactive waste.", "url": "https://phys.org/news/2022-11-self-generated-current-magnetized-plasmas.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/observation-of-a-self.jpg", "publishedAt": "2022-11-08T13:43:03Z", "content": "Nuclear fusion has drawn attention in the era of carbon neutrality because it produces no carbon emission or radioactive waste.\r\nA tokamak, a torus-shaped nuclear fusion device, needs an electric cur… [+3712 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Meteor showers provide scientific clues to researchers - Economic Times", "description": "According to the Axios report, the research of meteor showers helped government space agencies and private space corporations maintain the safety of their spacecraft.", "url": "https://economictimes.indiatimes.com/news/international/us/meteor-showers-provide-scientific-clues-to-researchers/articleshow/95382793.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95382788,width-1070,height-580,imgsize-4442,overlay-economictimes/photo.jpg", "publishedAt": "2022-11-08T13:14:00Z", "content": "A recent article published by Axios Space claimed that meteor showers deliver scientific clues to researchers on Earth. The articles stated that meteors brought data related to their parent asteroids… [+1582 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "Scientists Are Uncovering Ominous Waters Under Antarctic Ice - WIRED", "description": "A super-pressurized, 290-mile-long river is running under the ice sheet. That could be bad news for sea-level rise.", "url": "https://www.wired.com/story/scientists-are-uncovering-ominous-waters-under-antarctic-ice/", "urlToImage": "https://media.wired.com/photos/6369829cfb8d8044171209b0/191:100/w_1280,c_limit/Antartica_river_science_GettyImages-160869357.jpg", "publishedAt": "2022-11-08T13:00:00Z", "content": "Its not a tremendous amount of melt per square foot. But over an area thats the size of two large European countries, that scales up. What we concluded is the melting is really smallit's like a milli… [+2935 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Ancient ocean on Mars confirmed? - EarthSky", "description": null, "url": "https://earthsky.org/space/ancient-ocean-on-mars-shoreline-nasa/", "urlToImage": "https://earthsky.org/upl/2022/11/Mars-ocean-3.5-billion-years-ago-artist-concept-ESO.jpg", "publishedAt": "2022-11-08T11:01:30Z", "content": "View larger. | Artist’s concept of an ancient ocean on Mars, about 3.5 billion years ago. A new study has found evidence for the shoreline that the researchers say once existed in the northern hemisp… [+5608 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Enzyme in Human Cells Likely Evolved From an Ancient Single-Celled Organism - Technology Networks", "description": "A team of researchers from the Department of Chemistry at Umeå University has discovered clear traces of an archaea in an enzyme found in the nucleus of human cells.", "url": "https://www.technologynetworks.com/cell-science/news/traces-of-ancient-organisms-in-human-cells-367395", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367395/traces-of-ancient-organisms-in-human-cells-367395-640x360.jpg?cb=20221108", "publishedAt": "2022-11-08T09:53:10Z", "content": "A team of researchers at Umeå University has discovered that an enzyme in human cells has probably evolved from an ancient single-celled organism. The enzyme's unique properties mean that it could be… [+2520 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Rare Pink Aurora Spotted In Earth's Night Skies After A Solar Storm - Indiatimes.com", "description": "Extremely rare pink aurorae swarmed the skies above Norway after a solar storm caused a temporary crack in Earth's magnetic field on November 3. When the crack was opened, highly energetic solar particles penetrated deeper into the atmosphere than normal, cau…", "url": "https://www.indiatimes.com/technology/science-and-future/rare-pink-aurora-solar-storm-584190.html", "urlToImage": "https://im.indiatimes.in/content/2022/Nov/Social-image-20_636a11265a2d8.jpg", "publishedAt": "2022-11-08T08:16:26Z", "content": "Extremely rare pink aurorae swarmed the skies above Norway after a solar storm caused a temporary crack in Earth's magnetic field on November 3.When the crack was opened, highly energetic solar parti… [+2174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "5 biggest 'planet killer' asteroids that pose a threat to our planet - The Indian Express", "description": "Here are five collosal \"planet killer\" asteroids that pose a potential threat to our planet.", "url": "https://indianexpress.com/article/technology/science/5-biggest-planet-killer-near-earth-potentially-hazardous-asteroids-8256036/", "urlToImage": "https://images.indianexpress.com/2022/11/Planet-killler-asteroids-20221101.jpg", "publishedAt": "2022-11-08T07:23:01Z", "content": "An NEA is an asteroid whose orbit brings it within 195 million kilometres of the Sun, meaning that it can pass within 50 million kilometres of Earths orbit. Just like planets, these asteroids typical… [+4746 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Hubble Spot Galaxy Pair Connected By Stellar Bridge - IFLScience", "description": "These cosmic islands have begun their merging dance", "url": "https://www.iflscience.com/hubble-spots-galaxy-pair-connected-by-luminous-stellar-bridge-66108", "urlToImage": "https://assets.iflscience.com/assets/articleNo/66108/aImg/63247/detail-of-the-new-arp-248-image-from-hubble-meta.jpg", "publishedAt": "2022-11-08T06:04:00Z", "content": "The Hubble Space Telescope has taken an incredible picture of the galactic system Arp 248, also known as Wilds Triplet. These three interacting galaxies are renowned for having a luminous bridge of s… [+2281 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Rare 'fossil' clam discovered alive - Science Daily", "description": "Discovering a new species is always exciting, but so is finding one alive that everyone assumed had been lost to the passage of time. A small clam, previously known only from fossils, has recently been found living at Naples Point, near Santa Barbara.", "url": "https://www.sciencedaily.com/releases/2022/11/221107153443.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-08T00:10:20Z", "content": "Discovering a new species is always exciting, but so is finding one alive that everyone assumed had been lost to the passage of time. A small clam, previously known only from fossils, has recently be… [+5346 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Black hole discovered 1600 light-years from Earth, astronomers find | USA TODAY - USA TODAY", "description": "The dormant black hole, dubbed Gaia BH1, sits 1,600 light-years away, three times closer than the last black hole to hold the record.RELATED: NASA studying U...", "url": "https://www.youtube.com/watch?v=yKFXdQSymsQ", "urlToImage": "https://i.ytimg.com/vi/yKFXdQSymsQ/hqdefault.jpg", "publishedAt": "2022-11-07T23:45:38Z", "content": null}, {"source": {"id": null, "name": "Umich.edu"}, "author": null, "title": "Gravity's impact on bone cells—experiments heading to the International Space Station - University of Michigan News", "description": "Early this morning, a pair of experiments exploring bone density, designed by engineers at the University of Michigan, left the Wallops Island, Virginia launchpad aboard a Northrop Grumman Corp. Antares rocket for the International Space Station (ISS).", "url": "https://news.umich.edu/gravitys-impact-on-bone-cellsexperiments-heading-to-the-international-space-station/", "urlToImage": "https://news.umich.edu/wp-content/uploads/mc-image-cache/2022/11/gravitys-impact-on-bone-cellsexperiments-heading-to-the-international-space-station-cropped.jpg", "publishedAt": "2022-11-07T20:42:10Z", "content": "Mechanical engineers at the University of Michigan are tackling mysteries of bone density loss in space and on Earth\r\nNadab Wubshet, a doctoral student in mechanical engineering, stands near the laun… [+5811 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA rocket launch spotted on the Grand Strand; Raw video of rocket launch - WPDE ABC15", "description": "Did you see a strange light streaking across the early morning sky? You're not alone.It was a NASA rocket launch from Wallops Island in Virginia.The Northrop...", "url": "https://www.youtube.com/watch?v=5Hk-IBcnNfo", "urlToImage": "https://i.ytimg.com/vi/5Hk-IBcnNfo/maxresdefault.jpg", "publishedAt": "2022-11-07T20:30:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul M. Sutter", "title": "When black holes collide they also produce neutrinos - Phys.org", "description": "Ever since astronomers first detected ultra high energy neutrinos coming from random directions in space, they have not been able to figure out what generates them. But a new hypothesis suggests an unlikely source: the mergers of black holes.", "url": "https://phys.org/news/2022-11-black-holes-collide-neutrinos.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/when-black-holes-colli.jpg", "publishedAt": "2022-11-07T18:37:09Z", "content": "Ever since astronomers first detected ultra high energy neutrinos coming from random directions in space, they have not been able to figure out what generates them. But a new hypothesis suggests an u… [+3404 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Incredible Discovery Has Finally Revealed The First Animals to Grow a Skeleton - ScienceAlert", "description": "Before life on Earth exploded in diversity some 540 million years ago, the first primitive animal skeletons were already starting to form.", "url": "https://www.sciencealert.com/incredible-discovery-has-finally-revealed-the-first-animals-to-grow-a-skeleton", "urlToImage": "https://www.sciencealert.com/images/2022/11/EarlySkeletonLife.jpg", "publishedAt": "2022-11-07T17:00:16Z", "content": "Before life on Earth exploded in diversity some 540 million years ago, the first primitive animal skeletons were already starting to form.\r\nSquishy-looking marine sponges from this time have been fou… [+4587 chars]"}]}