{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Green comet is on its way out of our lives for good. It will not return for another 50,000 years - India Today", "description": "The comet had been in the skies for nearly a month since mid-January as it traveled outwards away from Earth in its orbit.", "url": "https://www.indiatoday.in/science/story/green-comet-solar-system-orbit-asteroid-c2022-e3-ztf-2334546-2023-02-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202302/green_comet_0-sixteen_nine.jpg?VersionId=Snl0cZQKWxlIYQgA1TK1xle1icNZyMHR", "publishedAt": "2023-02-14T07:42:52Z", "content": "By India Today Web Desk: After dazzling humans with its greenish tinged presence in the night sky, Comet C/2022 E3 (ZTF) is on its way out of the inner solar system and our lives for good. The rare c… [+2625 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA warns of 5 asteroids set to approach Earth on Valentine's Day-February 14 - HT Tech", "description": "On Valentine's Day, which is today, NASA has issued alerts about 5 asteroids that are dashing towards Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-warns-of-5-asteroids-set-to-approach-earth-on-valentine-s-day-february-14-71676357825012.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/14/1600x900/cosmos-7559098_640_1670214967547_1676359102505_1676359102505.jpg", "publishedAt": "2023-02-14T07:19:33Z", "content": "It is Valentine's Day and although it's a day of celebration of love, 5 celestial objects heading towards Earth are adding to the excitement. NASA is one of the space agencies which keeps a constant … [+2139 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Archana Shandilya", "title": "Optical Illusion Visual Test: Can you spot the Hidden Pyramids in Picture shared by NASA in 11 secs? - Jagran Josh", "description": "Optical Illusion Visual Test: People with an eagle-eye view can spot the hidden Pyramids in the picture shared by NASA. Did you spot the Pyramids in 11 seconds?", "url": "https://www.jagranjosh.com/general-knowledge/optical-illusion-test-can-you-spot-hidden-pyramids-in-picture-shared-by-nasa-1676275295-1", "urlToImage": "https://img.jagranjosh.com/images/2023/February/1322023/OpticalIllusionTestSpotPyramidsinNASAPicture.jpg", "publishedAt": "2023-02-14T05:49:00Z", "content": "Optical Illusion Visual Test: There are many types of optical illusions like physical, physiological, and cognitive illusions. An optical illusion is a mind-bending, deeply fascinating, shape-shiftin… [+3208 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Falling asteroid lights up English Channel. It was detected hours before it hit Earth - India Today", "description": "The meteoroid, which was barely a meter in size, entered Earth's atmosphere over northern France.", "url": "https://www.indiatoday.in/science/story/asteroid-english-channel-video-meteoroid-european-space-agency-2334477-2023-02-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202302/asteroid_ec-sixteen_nine.jpg?VersionId=kZzaFxcRD5pULNVhV2aF59UqHRVsOXQi", "publishedAt": "2023-02-14T05:44:47Z", "content": "By India Today Web Desk: People in several parts of Europe, including around the English Channel, were treated to a dazzling display as an asteroid burned and exploded overhead. The asteroid entered … [+2604 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "A new technology to assemble matter in 3D - Tech Explorist", "description": "Creating 3D objects with sound.", "url": "https://www.techexplorist.com/new-technology-assemble-matter-3d/56915/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/use-of-sound-waves.jpg", "publishedAt": "2023-02-14T05:15:05Z", "content": "Acoustic waves exert forces when they interact with matter. Shaping ultrasound fields precisely in 3D thus allows control over the force landscape and should permit particulates to fall into place to… [+2784 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Valentine’s day solar storm ALERT! Sun blasts CME clouds towards the Earth - HT Tech", "description": "A solar storm can strike the Earth on Valentine’s day, after a huge coronal mass ejection (CME) cloud was spotted being hurled by the Sun. Know the damage it can cause.", "url": "https://tech.hindustantimes.com/tech/news/valentines-day-solar-storm-alert-sun-blasts-cme-clouds-towards-the-earth-71676349827181.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/14/1600x900/clement-714404_1674110601961_1676349851526_1676349851526.jpg", "publishedAt": "2023-02-14T04:46:21Z", "content": "Ever since the X-class solar flare eruption on the Sun on February 11, solar activities have been in the pause mode. But that does not mean any good news for the Earth. The same flare eruption had al… [+2503 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's James Webb Telescope Spots A Distant Galaxy That Mirrors Our Own - NDTV", "description": "The findings have been published in the Monthly Notices of the Royal Astronomical Society.", "url": "https://www.ndtv.com/science/nasas-james-webb-telescope-spots-a-distant-galaxy-that-mirrors-our-own-3780181", "urlToImage": "https://c.ndtvimg.com/2023-02/igvruomg_the-new-galaxy-is-just-3-per-cent-the-mass-of-the-milky-way_625x300_14_February_23.jpg", "publishedAt": "2023-02-14T02:59:41Z", "content": "The new galaxy is just 3 per cent the mass of the Milky Way\r\nIn the universe, every star is a hope for a new life and shelter. Now, James Webb Space Telescope has found a galaxy just like the Milky W… [+1970 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Atom-thin walls could smash size, memory barriers in next-gen devices: Nanomaterial feature could help electronic circuits adopt benefits of human memory - Science Daily", "description": "For all of the still-indistinguishable-from-magic wizardry packed into the three pounds of the adult human brain, it obeys the same rule as the other living tissue it controls: Oxygen is a must. So it was with a touch of irony that a scientists offered his ex…", "url": "https://www.sciencedaily.com/releases/2023/02/230213201035.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-02-14T01:48:46Z", "content": "For all of the unparalleled, parallel-processing, still-indistinguishable-from-magic wizardry packed into the three pounds of the adult human brain, it obeys the same rule as the other living tissue … [+6739 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Chiral phonons create spin current without needing magnetic materials - Science Daily", "description": "Researchers chiral phonons to convert wasted heat into spin information -- without needing magnetic materials. The finding could lead to new classes of less expensive, energy-efficient spintronic devices for use in applications ranging from computational memo…", "url": "https://www.sciencedaily.com/releases/2023/02/230213134700.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-02-14T01:36:12Z", "content": "Researchers from North Carolina State University and the University of North Carolina at Chapel Hill used chiral phonons to convert wasted heat into spin information -- without needing magnetic mater… [+3302 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Discovery could lead to new fungicides to protect rice crops - EurekAlert", "description": "In some years, rice blast disease destroys more than one quarter of the harvest worldwide. But it's hard to fight with current methods. A UC Berkeley lab and their UK colleagues have discovered how the fungus breeches the tough skin of the rice leaf and deter…", "url": "https://www.eurekalert.org/news-releases/979140", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/2a67f6f5-2563-4e1a-be40-59ad58dddfd0/Rendition/thumbnail/Content/Public", "publishedAt": "2023-02-14T01:15:46Z", "content": "image: Blast disease destroys between 10% and 35% of the worlds rice harvest each year. A new discovery could lead to fungicides that block the pathogen, Magnaporthe oryzae, from entering the leaves.… [+8514 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Rare fossil of freshwater aquatic reptile Hyphalosaurus discovered in NE China’s Liaoning - Global Times", "description": "Scientists from China and abroad announced on Tuesday the discovery of a very rare fossil of a freshwater aquatic reptile. The fossil was found in the stratum of the Early Cretaceous period in Northeast China’s Liaoning Province.", "url": "https://www.globaltimes.cn/page/202302/1285408.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2023/2023-02-14/d6af37fb-863d-418d-8597-530f02c71a65_s.jpeg", "publishedAt": "2023-02-14T01:01:00Z", "content": "A restoration map of Hyphalosaurus lingyuanensis Photo: Courtesy of Xing Lida\r\nScientists from China and abroad announced on Tuesday the discovery of a very rare fossil of a freshwater aquatic reptil… [+3716 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Spots Mysterious Spokes Moving Along Saturn's Rings - CNET", "description": "NASA and ESA's Hubble Space Telescope is investigating a \"fascinating magic trick of nature.\"", "url": "https://www.cnet.com/science/space/nasa-spots-mysterious-spokes-moving-along-saturns-rings/", "urlToImage": "https://www.cnet.com/a/img/resize/30d1740b47740b427b7724c6b5be872e6a9f2723/hub/2023/02/09/210d49be-bc66-4383-b182-5da96f005e66/saturnspokesopo2305a.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2023-02-13T22:37:00Z", "content": "There's something unusual happening in a new Hubble Space Telescope image of scenic ringed planet Saturn. The view is spectacular on its own, but zoom in on the left side of its rings and look for a … [+2212 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New model of quark-gluon plasma solves a long-standing discrepancy between theory and data - Phys.org", "description": "Research in fundamental science has revealed the existence of quark-gluon plasma (QGP)—a newly identified state of matter—as the constituent of the early universe. Known to have existed a microsecond after the Big Bang, the QGP, essentially a soup of quarks a…", "url": "https://phys.org/news/2023-02-quark-gluon-plasma-long-standing-discrepancy-theory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/new-model-of-quark-glu.jpg", "publishedAt": "2023-02-13T22:26:03Z", "content": "Research in fundamental science has revealed the existence of quark-gluon plasma (QGP)a newly identified state of matteras the constituent of the early universe. Known to have existed a microsecond a… [+5338 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Models Help Unveil the Mystery of Life's Origins on Earth - SciTechDaily", "description": "New research reveals clues about the physical and chemical characteristics of Earth when life is thought to have emerged. About four billion years ago, the first signs of life emerged on Earth in the form of microbes. Although scientists are still determining…", "url": "https://scitechdaily.com/new-models-help-unveil-the-mystery-of-lifes-origins-on-earth/", "urlToImage": "https://scitechdaily.com/images/Origin-Emergence-of-Life-Concept-Art.jpg", "publishedAt": "2023-02-13T21:56:28Z", "content": "Scientists published a paper in the journal Science that answers questions about what Earth was like billions of years ago and what traits helped life form. This research provides important informati… [+5768 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Ants show the way to beating traffic jams - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "Sydney, Feb 13: Being stuck in traffic is stressful, wastes time and resources and ends up costing the world’s economies trillions of dollars a year. Jams happen daily and authorities have spent decades trying to fix the problem with little success. Yet a sol…", "url": "https://www.dailyexcelsior.com/ants-show-the-way-to-beating-traffic-jams/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2023/02/download-11-12.jpg", "publishedAt": "2023-02-13T19:17:35Z", "content": "Sydney, Feb 13: Being stuck in traffic is stressful, wastes time and resources and ends up costing the world’s economies trillions of dollars a year. Jams happen daily and authorities have spent deca… [+3644 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Do forest trees really \"talk\" through underground fungi? - Devdiscourse", "description": "The idea that forest trees can \"talk\" to each other, share resources with their seedlings -- and even protect them -- through a connective underground web of delicate fungal filaments tickles the imagination.", "url": "https://www.devdiscourse.com/article/science-environment/2353709-do-forest-trees-really-talk-through-underground-fungi", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_02_2023_17_32_43_2587716.jpg?width=920&format=jpeg", "publishedAt": "2023-02-13T17:32:46Z", "content": "The thought that forest trees may \"speak\" to one other, exchange resources with their seedlings, and even defend them via a connected underground web of fine fungal filaments piques the interest of s… [+2908 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Sophia Chen, Wired.com", "title": "The secret lives of neutron stars - Ars Technica", "description": "Astrophysicists use gravitational waves and light to trace genealogies of dead stars.", "url": "https://arstechnica.com/science/2023/02/the-secret-lives-of-neutron-stars/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2014/02/X-ray_binary-640x215.jpg", "publishedAt": "2023-02-13T17:32:22Z", "content": "Composite X-ray, visible-light, and radio image of the X-ray binary Circinus X-1. This object is a neutron star in mutual orbit with an ordinary star. Such systems could have been responsible for the… [+3998 chars]"}, {"source": {"id": null, "name": "Expatguideturkey.com"}, "author": "Ece Nagihan", "title": "Where Is The Elon Musk's Tesla Roadster Launch into Space 5 Years Ago Now? - Expat Guide Turkey", "description": "Elon Musk, together with the space technologies company SpaceX, of which he is the CEO, launched the Roadster vehicle of Tesla, the automobile company of which he is also the CEO, into space five year", "url": "https://expatguideturkey.com/where-is-the-elon-musks-tesla-roadster-launch-into-space-5-years-ago-now/", "urlToImage": "https://expatguideturkey.com/wp-content/uploads/2023/02/where-is-the-elon-musks-tesla-roadster-launch-into-space-5-years-ago-now.webp", "publishedAt": "2023-02-13T17:26:15Z", "content": "Elon Musk, together with the space technologies company SpaceX, of which he is the CEO, launched the Roadster vehicle of Tesla, the automobile company of which he is also the CEO, into space five yea… [+1586 chars]"}, {"source": {"id": null, "name": "Expatguideturkey.com"}, "author": "Gül Demirci", "title": "When and Where Will The Next Earthquake Be? » - Expat Guide Turkey", "description": "When and Where Will The Next Earthquake Be? After the 7.7 and 7.6 earthquakes in Kahramanmaraş, in which more than 30 thousand people lost their lives in Turkey and Syria, US scientists developed a ne", "url": "https://expatguideturkey.com/when-and-where-will-the-next-earthquake-be/", "urlToImage": "https://expatguideturkey.com/wp-content/uploads/2023/02/Next-Earthquake-.webp", "publishedAt": "2023-02-13T16:01:08Z", "content": "When and Where Will The Next Earthquake Be?\r\nAfter the 7.7 and 7.6 earthquakes in Kahramanmara, in which more than 30 thousand people lost their lives in Turkey and Syria, US scientists developed a n… [+3179 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of St Andrews astronomers measure the mass of a single isolated star other than the Sun for the first time - India Education Diary", "description": "An international team, involving an astronomer from the University of St Andrews, has measured the mass of a white dwarf star using the fact that massive bodies curve space-time around them according to Einstein’s Theory of General Relativity.The tea", "url": "https://indiaeducationdiary.in/university-of-st-andrews-astronomers-measure-the-mass-of-a-single-isolated-star-other-than-the-sun-for-the-first-time/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/01/Cover-University-of-St-Andrews.jpg?fit=1024%2C576&ssl=1", "publishedAt": "2023-02-13T15:39:26Z", "content": "An international team, involving an astronomer from the University of St Andrews, has measured the mass of a white dwarf star using the fact that massive bodies curve space-time around them according… [+5066 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Using rocks found in Minnesota to help explain how Mars could have developed an atmosphere - Phys.org", "description": "A pair of Earth scientists, one with the University of Calgary, in Canada, the other from the University of Cambridge in the U.K., has found that studying rocks found in Duluth, Minnesota, might help us understand how Mars may have developed its ancient atmos…", "url": "https://phys.org/news/2023-02-minnesota-mars-atmosphere.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/using-rocks-found-in-m.jpg", "publishedAt": "2023-02-13T15:30:50Z", "content": "A pair of Earth scientists, one with the University of Calgary, in Canada, the other from the University of Cambridge in the U.K., has found that studying rocks found in Duluth, Minnesota, might help… [+2577 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA announces launch date of its JUICE mission to explore Jupiter's oceanic Moons - Republic World", "description": "ESA's JUICE mission aims to explore Jupiter's ocean-bearing Moons– Europa, Ganymede and Callisto– by peering beneath their icy surfaces.", "url": "https://www.republicworld.com/science/space/esa-announces-launch-date-of-its-juice-mission-to-explore-jupiters-oceanic-moons-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/kpbakndrq035q9m7_1676300044.jpeg", "publishedAt": "2023-02-13T15:29:00Z", "content": "The European Space Agency (ESA) announced Monday that its JUICE mission is targeted for launch on April 13. JUICE, which stands for Jupiter Icy Moons Explorer, aims to explore the ocean-bearing Moons… [+2147 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Earth's Core Has Changed Direction | Here's Why | Dawn News English - DawnNews English", "description": "Earth rotates at about a thousand miles per hour but new research published in nature geoscience says that the Earth's inner core may have actually stopped t...", "url": "https://www.youtube.com/watch?v=JGZXczzQ1uY", "urlToImage": "https://i.ytimg.com/vi/JGZXczzQ1uY/maxresdefault.jpg", "publishedAt": "2023-02-13T15:12:38Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "LOFAR super-telescope reveals the far reaches of the universe - euronews", "description": "The largest pan-European radio-frequency telescope offers a unique eye for exploring the far reaches of the universe.READ MORE : https://www.euronews.com/202...", "url": "https://www.youtube.com/watch?v=FCsaDIjzqpc", "urlToImage": "https://i.ytimg.com/vi/FCsaDIjzqpc/hqdefault.jpg", "publishedAt": "2023-02-13T15:10:08Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Unexpected molten rock layer discovered under Earth's crust - Earth.com", "description": "Unexpected molten rock layer discovered under Earth’s crust • Earth.com", "url": "https://www.earth.com/news/unexpected-molten-rock-layer-discovered-under-earths-crust/", "urlToImage": "https://cff2.earth.com/uploads/2023/02/13072610/Earth-layer-scaled.jpg", "publishedAt": "2023-02-13T14:37:07Z", "content": "The asthenosphere is a layer in the upper mantle of the Earths structure. It lies just beneath the crust and brittle outermost layer of the mantle, and is viscous rather than solid. The large plates … [+3453 chars]"}, {"source": {"id": null, "name": "Smithsonian.com"}, "author": "Will Sullivan", "title": "Launching Dust From the Moon Could Help Cool Earth, Scientists Say - Smithsonian Magazine", "description": "Proposals to fight climate change by blocking sunlight aren’t new, but some experts argue the answer lies closer to home", "url": "https://www.smithsonianmag.com/smart-news/scientists-theorize-that-launching-moon-dust-to-space-could-cool-earth-180981618/", "urlToImage": "https://th-thumbnailer.cdn-si-edu.com/fYDNyalA4wDe2cz8QuDBsjZnD7M=/fit-in/1600x0/filters:focal(2000x1333:2001x1334)/https%3A%2F%2Ftf-cmsv2-smithsonianmag-media.s3.amazonaws.com%2Ffiler_public%2Fb0%2F26%2Fb026a81e-f6eb-4cbc-9dc6-55aa77270a19%2Fgettyimages-1246853081.jpg", "publishedAt": "2023-02-13T14:03:13Z", "content": "The moon contains lots of dust, which scientists say could help block some sunlight from reaching Earth, cooling the planet.\r\n BAY ISMOYO / AFP via Getty Images\r\nTo prevent further damage to the plan… [+4090 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Harrison Gray", "title": "What Electrons Can Tell Us About the Speed of Sand - Eos", "description": "A new sediment tracer uses the interactions between radiation, charge, and the Sun to uncover the hidden transport histories of sand grains.", "url": "http://eos.org/editor-highlights/what-electrons-can-tell-us-about-the-speed-of-sand", "urlToImage": "https://i0.wp.com/eos.org/wp-content/uploads/2023/02/Figure-4a.png?fit=1200%2C675&ssl=1", "publishedAt": "2023-02-13T14:00:00Z", "content": "Source: Journal of Geophysical Research: Earth Surface\r\nThe Earths surface is continually reshaped by the processes that create and move sediment. For surface dwellers, cohabitating with this spright… [+2361 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Ramin Skibba", "title": "Citizen Scientists Show Light Pollution Erases Stars From the Sky - WIRED", "description": "More than a decade of eyewitness data shows that fainter stars disappear as artificial light brightens the night sky.", "url": "https://www.wired.com/story/citizen-scientists-show-light-pollution-erases-stars-from-the-sky/", "urlToImage": "https://media.wired.com/photos/63e52545cde6e0e4f71292c9/191:100/w_1280,c_limit/Sci-lightpollution-922717242.jpg", "publishedAt": "2023-02-13T14:00:00Z", "content": "Years ago, Christopher Kyba was skeptical about astronomy data collected by citizen scientistsafter all, it relies on people making naked-eye assessments of the night sky. But when a student wrote to… [+7086 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers develop AI-based technique to predict RNA modifications - ETHealthWorld", "description": "Within the RNA, different types of chemical molecules added to the RNA determine how the RNA molecule functions. However, these RNA changes are often invisible to standard approaches used by scientists to read RNA. Presently, more than 160 RNA modifications h…", "url": "https://health.economictimes.indiatimes.com/news/health-it/researchers-develop-ai-based-technique-to-predict-rna-modifications/97875936", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97875936,imgsize-14284,width-1200,height-628,overlay-ethealthworld/researchers-develop-ai-based-technique-to-predict-rna-modifications.jpg", "publishedAt": "2023-02-13T13:45:00Z", "content": "Washington [US]: A team of researchers from the Agency for Science, Technology, and Research and the National University of Singapore created software that accurately predicts chemical alterations of… [+3484 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Pluto's Moon Charon May be Hiding Ocean beneath Its Surface: Researchers — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: Researchers have predicted that Charon, a moon at the far end of the Solar System, might have an ocean beneath its surface. This could be a game-changing discovery. Pluto was abandoned as a planet more than ten years ago, and Charon is one of i…", "url": "https://www.transcontinentaltimes.com/pluto-moon-charon-hiding-interesting/", "urlToImage": "https://media.transcontinentaltimes.com/2023/02/Pluto-300x169.jpeg", "publishedAt": "2023-02-13T13:37:59Z", "content": "UNITED STATES: Researchers have predicted that Charon, a moon at the far end of the Solar System, might have an ocean beneath its surface. This could be a game-changing discovery. Pluto was abandoned… [+2860 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Comprehensive Picture of Greenland Ice Sheet Revealed - AZoCleantech", "description": "Scientists discovered that glacier movement in Greenland is more complicated than it sounds, with deformation in warmer ice comprising small amounts of water accounting for motion earlier thought to be caused by sliding where the ice meets the bedrock beneath.", "url": "https://www.azocleantech.com/news.aspx?newsID=32940", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/SocialSharingImage_32940_16762940329323888.jpg", "publishedAt": "2023-02-13T13:16:00Z", "content": "Scientists discovered that glacier movement in Greenland is more complicated than it sounds, with deformation in warmer ice comprising small amounts of water accounting for motion earlier thought to … [+4980 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA Rover Challenge 2023 | Students Representing India Speaks To CNN News18 | NASA News Today - CNN-News18", "description": "NASA Rover Challenge 2023 | Students Representing India Speaks To CNN News18 | NASA News TodayNASA Rover Challenge 2023: \"If people from abroad can do this, ...", "url": "https://www.youtube.com/watch?v=AAu__4YMNEo", "urlToImage": "https://i.ytimg.com/vi/AAu__4YMNEo/maxresdefault.jpg", "publishedAt": "2023-02-13T12:36:52Z", "content": null}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Fish recognizes itself in photographs: Research - TheNewsMill", "description": "Osaka [Japan], February 13 (ANI) A research team led by specially appointed Professor Masanori Kohda of the Graduate School of Science at Osaka Metropolitan University has proved that fish assume \"it's me\" when they see themselves in a photograph. The researc…", "url": "https://thenewsmill.com/2023/02/fish-recognizes-itself-in-photographs-research/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=71619&object_id=71619&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F02%252Ffish-recognizes-itself-in-photographs-research.jpg", "publishedAt": "2023-02-13T12:32:26Z", "content": "Osaka [Japan], February 13 (ANI) A research team led by specially appointed Professor Masanori Kohda of the Graduate School of Science at Osaka Metropolitan University has proved that fish assume “it… [+1815 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Paul Sutter", "title": "A guide to (not) understanding quantum mechanics - Ars Technica", "description": "How can we come to grips with a theory that doesn’t explain how anything works?", "url": "https://arstechnica.com/science/2023/02/a-guide-to-not-understanding-quantum-mechanics/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/quantum-goldfish-760x380.jpg", "publishedAt": "2023-02-13T12:30:28Z", "content": "Enlarge/ According to Werner Heisenberg and Niels Bohr, when it comes to the subatomic world, were just goldfish.\r\n146 with \r\nQuantum mechanics is simultaneously beautiful and frustrating.\r\nIts expla… [+2871 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "Amateur astronomer discovers faint galaxy that computers missed - NewsBytes", "description": "Giuseppe Donatiello, an amateur astronomer, spotted a faint galaxy that a computer algorithm failed to distinguish", "url": "https://www.newsbytesapp.com/news/science/hubble-space-telescope-confirms-discovery-of-faint-galaxy/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l23820230213163744.jpeg", "publishedAt": "2023-02-13T11:49:25Z", "content": "Amateur astronomer discovers faint galaxy that computers missed\r\nGiuseppe Donatiello, an amateur astronomer, spotted a faint galaxy that a computer algorithm failed to distinguish. This discovery was… [+1989 chars]"}, {"source": {"id": null, "name": "BOOM"}, "author": "The Conversation", "title": "What Are Primordial Black Holes And How Are They Detected? | BOOM - BOOM", "description": "Primordial black holes can possess any mass, and may range in size from a subatomic particle to several hundred kilometers.", "url": "https://www.boomlive.in/explainers/primordial-black-holes-atom-sized-universe-scientists-21041", "urlToImage": "https://www.boomlive.in/h-upload/2023/02/13/998753-universe-and-wormhole-01.jpg", "publishedAt": "2023-02-13T11:46:41Z", "content": "One of the most intriguing predictions of Einsteins general theory of relativity is the existence of black holes: astronomical objects with gravitational fields so strong that not even light can esca… [+5809 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Scientists Invent, Launch Plasma Thrusters Into Orbit - India Education Diary", "description": "An invention by Southampton researchers that will enable satellites to deorbit safely has launched into space for the first time.The invention, designed by Dr Minkwan Kim Associate Professor in Astronautics at the University of Southampton, is a plas", "url": "https://indiaeducationdiary.in/scientists-invent-launch-plasma-thrusters-into-orbit/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/12/University-of-Southampton1.jpg?fit=568%2C378&ssl=1", "publishedAt": "2023-02-13T11:35:08Z", "content": "An invention by Southampton researchers that will enable satellites to deorbit safely has launched into space for the first time.\r\nThe invention, designed by Dr Minkwan Kim Associate Professor in Ast… [+2822 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "New type of fractal emerges in spin ices – Physics World - physicsworld.com", "description": "Finding could have applications in magnetocaloric materials, spintronics, information storage and even quantum computing", "url": "https://physicsworld.com/a/new-type-of-fractal-emerges-in-spin-ices/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2023/02/Fractal-on-ice-web.png", "publishedAt": "2023-02-13T10:48:46Z", "content": "Fractal on ice: Example of the fractal structures in spin ice together with a famous example of a fractal (the Mandelbrot set), on top of a photograph of water ice. (Courtesy: Jonathan N Hallén, Cave… [+5182 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Size of proton measured for first time using neutrino beams - News9 LIVE", "description": "Scientists have successfully conducted the first statistically significant study to measure the size of protons using neutrinos.", "url": "https://www.news9live.com/science/size-of-proton-measured-for-first-time-using-neutrino-beams-au941-2050934", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/02/Fermilab-15-0021-07.jpg", "publishedAt": "2023-02-13T10:18:33Z", "content": "Scientists have successfully conducted the first statistically significant study to measure the size of protons using neutrinos.\r\n<ul><li>The MINERvA detector has gathered data on interactions contin… [+1976 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Fossilised Fish Unveils Backboned Animals’ Brain Evolution - India Education Diary", "description": "A 319-million-year-old fossilised fish, pulled from a coal mine in England more than a century ago, has revealed the oldest example of a well-preserved vertebrate brain.CT-scanning, where X-rays are used to reveal internal features, shows the skull o", "url": "https://indiaeducationdiary.in/fossilised-fish-unveils-backboned-animals-brain-evolution/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/02/nature-2022-06-08790b-cover-proposal-2.x7451b754.jpg?fit=1024%2C820&ssl=1", "publishedAt": "2023-02-13T10:13:27Z", "content": "A 319-million-year-old fossilised fish, pulled from a coal mine in England more than a century ago, has revealed the oldest example of a well-preserved vertebrate brain.\r\nCT-scanning, where X-rays ar… [+4865 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How NASA's breakthrough 'class of '78' changed the face of space travel - Nature.com", "description": "The inclusion of women and people of colour in NASA’s astronaut cadet programme was unprecedented — and met sometimes fierce resistance.", "url": "https://www.nature.com/articles/d41586-023-00401-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00401-w/d41586-023-00401-w_23988044.jpg", "publishedAt": "2023-02-13T10:11:18Z", "content": "Ronald McNair, part of the class of 1978, died in the space shuttle Challenger in 1986.Credit: NASA\r\nThe New Guys: The Historic Class of Astronauts That Broke Barriers and Changed the Face of Space T… [+6308 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": "Puja Molpariya", "title": "Fusion Of Mechanics And Electromagnetics Leads To A Game-Changing Reconfigurable Antenna For Future Technology - Revyuh", "description": "Engineering breakthrough: “It could be the branching off point for an entirely new field of designs with exciting applications we haven’t dreamed of yet.”", "url": "https://www.revyuh.com/news/science-and-research/scientific-research/fusion-of-mechanics-and-electromagnetics-leads-to-a-game-changing-reconfigurable-antenna-for-future-technology/", "urlToImage": "https://www.revyuh.com/wp-content/uploads/2023/02/Fusion-Of-Mechanics-And-Electromagnetics-Leads-To-A-Game-Changing-Reconfigurable-Antenna-For-Future-Technology.jpg", "publishedAt": "2023-02-13T10:00:04Z", "content": "Engineering breakthrough: It could be the branching off point for an entirely new field of designs with exciting applications we havent dreamed of yet.\r\nFuture communication network technologies, suc… [+3900 chars]"}, {"source": {"id": null, "name": "Mercomindia.com"}, "author": "Gautamee Hazarika", "title": "Researchers Split Untreated Seawater to Produce Green Hydrogen - Mercom India", "description": "An international team of researchers led by the University of Adelaide, Australia said they have successfully split seawater through ...", "url": "https://mercomindia.com/researchers-split-untreated-seawater-into-green-hydrogen/", "urlToImage": "https://mercomindia.s3.ap-south-1.amazonaws.com/wp-content/uploads/2023/02/Untitled-design-61.jpg", "publishedAt": "2023-02-13T09:50:00Z", "content": "An international team of researchers led by the University of Adelaide, Australia said they have successfully split seawater through direct electrolysis without pre-treatment and produced green hydro… [+2362 chars]"}, {"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "Galactic chemical evolution plays a crucial role in planet formation - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/galactic-chemical-evolution-plays-crucial-role-planet-formation", "urlToImage": null, "publishedAt": "2023-02-13T09:30:06Z", "content": "Most stars hosting giant planets are younger compared to stars hosting smaller planets, shows a study that traced the abundance of various elements in stars. This result answers long-standing questio… [+4035 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble captures a spectacular trio of merging galaxies | See pic - Devdiscourse", "description": "Read more about Hubble captures a spectacular trio of merging galaxies | See pic on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2353091-hubble-captures-a-spectacular-trio-of-merging-galaxies-see-pic", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_02_2023_14_46_52_4771508.jpg?width=920&format=jpeg", "publishedAt": "2023-02-13T09:18:08Z", "content": "This spectacular picture from NASA/ESA Hubble Space Telescope shows a trio of galaxies on the verge of collision. Located in the constellation Boötes, the three galaxies will eventually merge into a … [+1460 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Astronomers identify new ring system in solar system - India Education Diary", "description": "The ring system orbits much further out than is typical for other ring systems, calling into question current theories of how ring systems are formed. The ring system is around a dwarf planet, named Quaoar, which is approximately half the size of Plu", "url": "https://indiaeducationdiary.in/astronomers-identify-new-ring-system-in-solar-system/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/02/circumbinary-planet-1920.xc6cbd10d.jpg?fit=1024%2C600&ssl=1", "publishedAt": "2023-02-13T08:42:48Z", "content": "The ring system orbits much further out than is typical for other ring systems, calling into question current theories of how ring systems are formed. The ring system is around a dwarf planet, named … [+3619 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Researchers Decode Human Spinal Cord Injury Treatment In Cat Locomotion - India Education Diary", "description": "Cats always land on their feet, but what makes them so agile? Their unique sense of balance has more in common with humans than it may appear. Researchers at the Georgia Institute of Technology are studying cat locomotion to better understand how the", "url": "https://indiaeducationdiary.in/researchers-decode-human-spinal-cord-injury-treatment-in-cat-locomotion/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/visit-tech.png?fit=1024%2C444&ssl=1", "publishedAt": "2023-02-13T08:03:07Z", "content": "Cats always land on their feet, but what makes them so agile? Their unique sense of balance has more in common with humans than it may appear. Researchers at the Georgia Institute of Technology are s… [+4776 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN,China Global Television Network", "title": "Unprecedented massive 'polar vortex' spotted on the sun - CGTN", "description": "NASA's Solar Dynamics Observatory captured an unprecedented solar phenomenon on February 2 when a massive bright filament of plasma broke off the sun's surface, forming a whirlpool swirling around the sun's northern pole.", "url": "https://news.cgtn.com/news/2023-02-13/Unprecedented-massive-polar-vortex-spotted-on-the-sun-1ho4Qm1wSk0/index.html", "urlToImage": "https://news.cgtn.com/news/2023-02-13/Unprecedented-massive-polar-vortex-spotted-on-the-sun-1ho4Qm1wSk0/img/6e16b5fd4b8c4aeeb830a1607b6093d2/6e16b5fd4b8c4aeeb830a1607b6093d2-250.jpeg", "publishedAt": "2023-02-13T07:45:26Z", "content": "NASA's Solar Dynamics Observatory captured an unprecedented solar phenomenon on February 2 when a massive bright filament of plasma broke off the sun's surface, forming a whirlpool swirling around th… [+1366 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists discovered fossils of the largest penguin that ever lived - Tech Explorist", "description": "It weighs more than 150 kilograms.", "url": "https://www.techexplorist.com/fossils-largest-penguin-ever-lived/56892/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/Kumimanu-fordycei-1.jpg", "publishedAt": "2023-02-13T07:22:21Z", "content": "Fossils give us information about the evolution of life, and occasionally that information is quite startling. Recent fossil discoveries from New Zealand have revealed a remarkably diverse assemblage… [+3839 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Scientists Find Meteorites Get Pinch Of Salt From Earth’s Atmosphere - India Education Diary", "description": "New analysis of the Winchcombe meteorite has revealed just how quickly space rocks which fall to Earth can be contaminated by our atmosphere.The meteorite, which landed in Gloucestershire in February last year, was the first to be recovered on UK soi", "url": "https://indiaeducationdiary.in/scientists-find-meteorites-get-pinch-of-salt-from-earths-atmosphere/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/download-8-1.jpg?fit=305%2C165&ssl=1", "publishedAt": "2023-02-13T07:01:10Z", "content": "New analysis of the Winchcombe meteorite has revealed just how quickly space rocks which fall to Earth can be contaminated by our atmosphere.\r\nThe meteorite, which landed in Gloucestershire in Februa… [+5492 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Rameesha Sajwar", "title": "This Thumb-Sized Microscope Can Capture ‘Neural Landscapes’ From Deep Inside Animal Brains - Wonderful Engineering", "description": "Advertisement Researchers have come up with a way to reduce the two-photon fluorescence microscope to a thumb size device that enables them to see ins", "url": "https://wonderfulengineering.com/this-thumb-sized-microscope-can-capture-neural-landscapes-from-deep-inside-animal-brains/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/10/imgonline-com-ua-resize-5uXDkbBqKahuNo.jpg", "publishedAt": "2023-02-13T06:50:11Z", "content": "Researchers have come up with a way to reduce the two-photon fluorescence microscope to a thumb size device that enables them to see inside the brain of live and active animals. The device is named M… [+2663 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Amazing Prototype Reveals The Moon Like We've Never Seen It Before - ScienceAlert", "description": "Everyone loves taking pictures of the Moon.", "url": "https://www.sciencealert.com/amazing-prototype-reveals-the-moon-like-weve-never-seen-it-before", "urlToImage": "https://www.sciencealert.com/images/2023/02/MoonDetailFromEarthRadarTelescope.jpg", "publishedAt": "2023-02-13T01:41:15Z", "content": "Everyone loves taking pictures of the Moon. Whether it's with their phones or through the wonders of astrophotography, photographing the Moon reminds us about the wonders and awesomeness of the Unive… [+5636 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The sun just did something weird, and more space news - Yahoo News", "description": "An oddball new exoplanet, small but significant steps toward the future of spaceflight, and a mystery in the Kuiper Belt. Space is very big and quite often, ...", "url": "https://www.youtube.com/watch?v=FjChvj48YmQ", "urlToImage": "https://i.ytimg.com/vi/FjChvj48YmQ/maxresdefault.jpg", "publishedAt": "2023-02-13T00:17:55Z", "content": null}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Astronomers discovered a rare star system ready to explode in a massive 'kilonova' - BGR", "description": "Astronomers have discovered an exceptionally rare system set to end in a kilonova explosion so rare we've never found one before.", "url": "https://bgr.com/science/astronomers-discovered-a-rare-star-system-ready-to-explode-in-a-massive-kilonova/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/10/bgrpic-copy-2.jpg?quality=82&strip=all", "publishedAt": "2023-02-12T23:12:00Z", "content": "Astronomers have discovered humanity’s first known example of a rare binary system doomed to end in a massive kilonova explosion. This type of cosmic phenomenon is so rare that scientists estimate th… [+2354 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Discover 12 New Moons Orbiting Jupiter - VOA Learning English", "description": "Jupiter is the largest planet in our solar system. Now, astronomers say it again has the biggest number of moons.", "url": "https://learningenglish.voanews.com/a/scientists-discover-12-new-moons-orbiting-jupiter/6956298.html", "urlToImage": "https://gdb.voanews.com/9236a533-44e0-49b6-9b7b-6ac43fd0c53b_w1200_r1.jpg", "publishedAt": "2023-02-12T22:01:50Z", "content": "Astronomers have discovered 12 additional moons orbiting Jupiter. That means Jupiter now has a total of 92 moons, more than any other planet in our solar system.\r\nThe new moons were recently added to… [+4510 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Interplanetary space station “Luna-25” is ready for launch - The Times Hub", "description": "Spread the love Roskosmos is ready to launch it “at least tomorrow”, but ballistic conditions do not allow It seems that the story of delays and postponement of the launch […]", "url": "https://thetimeshub.in/interplanetary-space-station-luna-25-is-ready-for-launch/", "urlToImage": null, "publishedAt": "2023-02-12T19:10:15Z", "content": "Roskosmos is ready to launch it at least tomorrow, but ballistic conditions do not allow\r\nIt seems that the story of delays and postponement of the launch of the Luna-25 space station completed: head… [+900 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "A failed Webb telescope calibration leads to the discovery of this tiny asteroid - Digital Trends", "description": "Data from a failed calibration of Webb's MIRI instrument has been used to spot a tiny asteroid that measures just a few hundred feet across.", "url": "https://www.digitaltrends.com/space/webb-tiny-asteroid/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/02/STScI-01GQQNSVTFFJDXSTWG5XAFV07Y1.jpg?resize=1200%2C630&p=1", "publishedAt": "2023-02-12T18:00:20Z", "content": "With any new technology, there are bound to be failures — and that’s true of cutting-edge astronomy instruments like the James Webb Space Telescope as well. But failures can have a silver lining, as … [+2694 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "“Can you imagine how many nuts, bolts and pieces of satellites are flying in orbit?”: RSC Energia named a possible reason for the depressurization of Progress MS-21 - The Times Hub", "description": "Spread the love Back to news In particular, a possible reason for the depressurization of the cooling system is named. Kommersant writes about this. As the Advisor to the General […]", "url": "https://thetimeshub.in/can-you-imagine-how-many-nuts-bolts-and-pieces-of-satellites-are-flying-in-orbit-rsc-energia-named-a-possible-reason-for-the-depressurization-of-progress-ms-21/", "urlToImage": null, "publishedAt": "2023-02-12T17:50:59Z", "content": "Back to news In particular, a possible reason for the depressurization of the cooling system is named. Kommersant writes about this.\r\nAs the Advisor to the General Director of RSC Energia stated; Ale… [+2280 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Do Older Fathers Pass on More Genetic Mutations to Their Offspring? - SciTechDaily", "description": "The male reproductive system is a hotspot for the emergence of new genes, which may explain why more new mutations are passed down from fathers rather than mothers. However, the reason why older fathers tend to pass on more mutations than younger ones has rem…", "url": "https://scitechdaily.com/why-do-older-fathers-pass-on-more-genetic-mutations-to-their-offspring/", "urlToImage": "https://scitechdaily.com/images/Genetics-Cancer-DNA-Mutation-Illustration.jpg", "publishedAt": "2023-02-12T16:24:12Z", "content": "ByThe Rockefeller UniversityFebruary 12, 2023\r\nGenetic mutations are changes or variations in an organisms DNA sequence, which can have a range of effects on its traits and characteristics. Some muta… [+3908 chars]"}, {"source": {"id": null, "name": "Theglobestalk.com"}, "author": "https://m.facebook.com/theglobestalk/?ref=bookmarks", "title": "7 Interesting Space Shuttle Missions - The Globe's Talk", "description": "The launch of the James Webb Space Telescope by NASA and the first-ever alteration of a spacecraft's course by a collision with an asteroid by the American space agency, DART, were only two of the major space shuttle missions that took place in 2022.", "url": "https://theglobestalk.com/7-interesting-space-shuttle-missions/", "urlToImage": "https://theglobestalk.com/wp-content/uploads/2023/02/images-10_2_1.jpeg", "publishedAt": "2023-02-12T16:04:05Z", "content": "The launch of the James Webb Space Telescope by NASA and the first-ever alteration of a spacecraft’s course by a collision with an asteroid by the American space agency,DART, were only two of the maj… [+5892 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New Earth-sized exoplanet detected in the solar neighborhood - Phys.org", "description": "Using NASA's Kepler spacecraft and Transiting Exoplanet Survey Satellite (TESS), astronomers have discovered a new Earth-sized exoplanet located about 70 light years away from the sun. The newfound exoworld, designated K2-415b, is at least three times more ma…", "url": "https://phys.org/news/2023-02-earth-sized-exoplanet-solar-neighborhood.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-earth-sized-exopla.jpg", "publishedAt": "2023-02-12T15:20:01Z", "content": "Using NASA's Kepler spacecraft and Transiting Exoplanet Survey Satellite (TESS), astronomers have discovered a new Earth-sized exoplanet located about 70 light years away from the sun. The newfound e… [+3194 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "New Image Of Martian Surface Reveals The Red Planet's Ancient Secrets - Indiatimes.com", "description": "A new Mars photo is revealing secrets from the Red Planet's ancient past. The European Space Agency's Mars Express spacecraft recently captured a stunning view of Mars' surface.The new image, taken using the spacecraft's High Resolution Stereo Camera (HRSC) f…", "url": "https://www.indiatimes.com/technology/science-and-future/new-image-of-mars-surface-592552.html", "urlToImage": "https://im.indiatimes.in/content/2023/Feb/FBImage-49_63e3912642499.jpg", "publishedAt": "2023-02-12T09:26:50Z", "content": "A new Mars photo is revealing secrets from the Red Planet's ancient past. The European Space Agency's Mars Express spacecraft recently captured a stunning view of Mars' surface.\r\nThe new image, taken… [+2455 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 12 February 2023: Awesome Mammatus clouds - HT Tech", "description": "NASA Astronomy Picture of the Day is an unusual image of clouds hovering over Nebraska, US. What’s the mystery behind these unusual clouds? Read on.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-12-february-2023-awesome-mammatus-clouds-71676191584811.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/12/1600x900/mammatus_olson_960_1676191629062_1676191641407_1676191641407.jpg", "publishedAt": "2023-02-12T08:48:12Z", "content": "Nature is the ultimate beauty! Whether it is about volcanoes, beaches, mountains, valleys, rivers, seas, forests and even clouds, nature never leaves a chance to surprise us. Well, how do you usually… [+1898 chars]"}]}