{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Swinburne University of Technology: Star’s fatal encounter with black hole creates rare luminous flash - India Education Diary", "description": "Astronomers at Swinburne University of Technology have played an important role in the discovery of a rare luminous jet of matter travelling close to the speed of light, created by a supermassive black hole violently tearing apart a star.Published in", "url": "https://indiaeducationdiary.in/swinburne-university-of-technology-stars-fatal-encounter-with-black-hole-creates-rare-luminous-flash/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/04/Swinburne-University-of-Technology.png?fit=386%2C198&ssl=1", "publishedAt": "2022-12-01T08:02:22Z", "content": "Astronomers at Swinburne University of Technology have played an important role in the discovery of a rare luminous jet of matter travelling close to the speed of light, created by a supermassive bla… [+3091 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "SpaceX Again Delays Japan's Plan To Launch World's 1st Private Moon Lander - NDTV", "description": "SpaceX on Wednesday postponed the launch of the world's first private lander to the Moon, a mission undertaken by Japanese firm ispace.", "url": "https://www.ndtv.com/world-news/spacex-again-delays-japans-plan-to-launch-worlds-1st-private-moon-lander-3568612", "urlToImage": "https://c.ndtvimg.com/2022-12/8493t3fo_spacex-moon-lander-spacex-twitter_625x300_01_December_22.jpg", "publishedAt": "2022-12-01T07:53:06Z", "content": "The mission by ispace is the first of a program called Hakuto-R.\r\nWashington: SpaceX on Wednesday postponed the launch of the world's first private lander to the Moon, a mission undertaken by Japanes… [+2213 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chelyabinsk disaster shows how dangerous an asteroid really is; Know this HORROR story - HT Tech", "description": "Astrophysicist Neil deGrasse Tyson spoke about the asteroid horror story, dubbed the Chelyabinsk disaster, in Russia. Know just how dangerous an asteroid can be.", "url": "https://tech.hindustantimes.com/tech/news/chelyabinsk-disaster-shows-how-dangerous-an-asteroid-really-is-know-this-horror-story-71669880112466.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/01/1600x900/Screenshot_2022-12-01_134102_1669882321204_1669882335083_1669882335083.png", "publishedAt": "2022-12-01T07:38:34Z", "content": "On February 15, 2013, an asteroid exploded over the city of Chelyabinsk, Russia. The explosion resulted in the asteroid breaking down into small pebbles which rained onto Earth in the form of debris.… [+2000 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Study sheds light on the nature of atomic nuclei - Tech Explorist", "description": "Nuclear popcorn: Heavy nucleus changes shapes at different energies.", "url": "https://www.techexplorist.com/study-sheds-light-nature-atomic-nuclei/55153/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/12/atomic-nuclei.jpg", "publishedAt": "2022-12-01T07:18:50Z", "content": "Four fundamental forces- the electromagnetic force, gravity, and the weak and strong nuclear forces- that govern the universe simultaneously describe particle interaction and how this interaction mak… [+3630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Curious Kids: how many galaxies are there in the universe? - The Indian Express", "description": "Working out how many galaxies there are in the universe is actually pretty difficult. Many galaxies are too faint or small for us to observe easily, even with the most powerful telescopes. Despite this, astronomers came up with a clever way of working this out", "url": "https://indianexpress.com/article/parenting/curious-kids-how-many-galaxies-are-there-in-the-universe-milky-way-universe-earth-sun-8275647/", "urlToImage": "https://images.indianexpress.com/2022/12/galaxy.jpg", "publishedAt": "2022-12-01T05:04:57Z", "content": "How many galaxies are there beyond the Milky Way? Rosella, aged 15, Hong Kong A galaxy is a massive collection of gas, dust and billions of stars all bound together by the force of gravity. Galaxies … [+3040 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Colossal 110-foot asteroid hurtling towards Earth TODAY, NASA reveals - HT Tech", "description": "An alert has been issued against a speeding asteroid by NASA which is set for close approach with Earth today. Know its speed, distance and more.", "url": "https://tech.hindustantimes.com/tech/news/colossal-110-foot-asteroid-hurtling-towards-earth-today-nasa-reveals-71669869176999.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/01/1600x900/orbit-viewer-snaps_1669869283096_1669869301840_1669869301840.jpg", "publishedAt": "2022-12-01T04:35:45Z", "content": "Did you know that no less than 4 asteroids made close approaches to Earth yesterday! Now NASA has warned that another one is on its way, and it is a big one. This asteroid has huge destructive potent… [+1638 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Prehistoric Superpredator: Weird Whatcheeria Was the “T. rex of Its Time” - SciTechDaily", "description": "Ancient Iowan superpredator got big by front-loading its growth in its youth. Fossils found only at the Field Museum reveal the growth history of Whatcheeria. Although the Field Museum in Chicago is famous for SUE the T. rex, it is also home to the best, most…", "url": "https://scitechdaily.com/prehistoric-superpredator-weird-whatcheeria-was-the-t-rex-of-its-time/", "urlToImage": "https://scitechdaily.com/images/Whatcheeria-Illustration-scaled.jpg", "publishedAt": "2022-12-01T03:33:39Z", "content": "ByField MuseumNovember 30, 2022\r\nWhatcheeria was a prehistoric superpredator. It was a six-foot-long lake-dwelling creature with a salamander-like body and a long, narrow head. Credit: Adrienne Strou… [+8673 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Indian telescope observes cosmic violence as dying star comes close to a black hole - India Today", "description": "Located at an elevation of 4,500 meters above sea level on Mount Saraswati, the GROWTH-India telescope has looked into deep space to understand what happens when a dying star encounters a supermassive black hole.", "url": "https://www.indiatoday.in/science/story/indian-telescope-observes-cosmic-violence-as-dying-star-comes-close-to-a-black-hole-2303857-2022-12-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/cosmic_violence-sixteen_nine.png?VersionId=1T9Dr2fPqiDrap31E0bDYgb9QEqINy.b", "publishedAt": "2022-12-01T03:26:20Z", "content": "By India Today Web Desk: \r\nGlobal Relay of Observatories Watching Transients Happen (GROWTH) is India's first fully robotic optical research telescope developed jointly by the Indian Institute of Ast… [+3141 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "The junction is the key - EurekAlert", "description": "What laws govern how chemicals pass through filters? How do droplets of oil move through layers of stone? How do blood cells travel through a living organism? A team of researchers led by the Technical University of Munich (TUM) and the Max Planck Institute f…", "url": "https://www.eurekalert.org/news-releases/972850", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-12-01T02:01:36Z", "content": "What laws govern how chemicals pass through filters? How do droplets of oil move through layers of stone? How do blood cells travel through a living organism? A team of researchers led by the Technic… [+4442 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Fertilizing the ocean to store carbon dioxide - Chemie.de", "description": "The urgent need to remove excess carbon dioxide from Earth’s environment could include enlisting some of our planet’s smallest inhabitants, according to an international research team led by Micha ...", "url": "https://www.chemeurope.com/en/news/1178714/fertilizing-the-ocean-to-store-carbon-dioxide.html", "urlToImage": "https://img.chemie.de/Portal/News/638720e16aca8_Qs3Ayeu8z.png?tr=w-700,h-525,cm-extract,x-0,y-0:n-xzoom", "publishedAt": "2022-12-01T01:54:27Z", "content": "The urgent need to remove excess carbon dioxide from Earths environment could include enlisting some of our planets smallest inhabitants, according to an international research team led by Michael Ho… [+2820 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Nanodiamonds can be activated as photocatalysts with sunlight - Science Daily", "description": "Nanodiamond materials have potential as low-cost photocatalysts. But until now, such carbon nanoparticles required high-energy UV light to become active. The DIACAT consortium has therefore produced and analysed variations of nanodiamond materials. The work s…", "url": "https://www.sciencedaily.com/releases/2022/11/221130114604.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-01T01:10:23Z", "content": "Nanodiamond materials have great potential as catalysts. Inexpensive nanoparticles made of carbon provide very large surfaces compared to their volume. However, to catalytically accelerate chemical r… [+2820 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Cyborgs v ‘holdout humans’ - Bangalore Mirror", "description": "A typical mammalian species can be expected to exist for a million years. Modern humans, Homo sapiens, have been around for roughly 300,000 years. So what will happen if we make it to a million years", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/cyborgs-v-holdout-humans/articleshow/95892993.cms", "urlToImage": "https://bangaloremirror.indiatimes.com/photo/52761249.cms", "publishedAt": "2022-12-01T00:30:00Z", "content": "What the world might be like if our species survives for a million yearsMost species are transitory. They go extinct, branch into new species or change over time due to random mutations and environme… [+6239 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "AJ Bouchie", "title": "Finding genes to help fruit adapt to droughts - Phys.org", "description": "As climate change is expected to lead to more frequent periods of drought, researchers are increasingly working to make discoveries that can help plants adapt to prolonged water stress.", "url": "https://phys.org/news/2022-11-genes-fruit-droughts.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/finding-genes-to-help.jpg", "publishedAt": "2022-11-30T22:25:04Z", "content": "As climate change is expected to lead to more frequent periods of drought, researchers are increasingly working to make discoveries that can help plants adapt to prolonged water stress.\r\nResearchers … [+3817 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Nancy Atkinson", "title": "Tiny Cubesat Will Shine an Infrared 'Flashlight' Into the Moon's Shadowed Craters, Searching for Water Ice - Universe Today", "description": "A tiny spacecraft is ready to head out for a big job: shining a light on water ice at the Moon’s south pole. Lunar Flashlight is a cubesat about the size of a briefcase, set to launch on December 1 on a SpaceX Falcon 9 rocket, sharing a ride with the Hakuto-R…", "url": "https://www.universetoday.com/158746/tiny-cubesat-will-shine-an-infrared-flashlight-into-the-moons-shadowed-craters-searching-for-water-ice/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/11/lunar-flashlight-artist-PIA23131.jpg", "publishedAt": "2022-11-30T22:17:39Z", "content": "A tiny spacecraft is ready to head out for a big job: shining a light on water ice at the Moons south pole.\r\nLunar Flashlight is a cubesat about the size of a briefcase, set to launch on December 1 o… [+6118 chars]"}, {"source": {"id": null, "name": "Caltech.edu"}, "author": null, "title": "New theory explains magnetic trends in high-temperature superconductors - Caltech", "description": "Garnet Chan explores high-temperature superconductors from quantum first principles.", "url": "https://www.caltech.edu/about/news/new-theory-explains-magnetic-trends-in-high-temperature-superconductors", "urlToImage": "https://caltech-prod.s3.amazonaws.com/main/images/Magnet_4.width-600.jpg", "publishedAt": "2022-11-30T20:14:19Z", "content": "In just about any situation in which electricity is being used, whether it is lighting a bedroom at night, keeping frozen food cold, or powering a car that is taking a commuter to work, some of that … [+2713 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New monochromator optics for tender X-rays - Phys.org", "description": "A climate-neutral energy supply requires a wide variety of materials for energy conversion processes, for example catalytically active materials and new electrodes for batteries. Many of these materials have nanostructures that increase their functionality. W…", "url": "https://phys.org/news/2022-11-monochromator-optics-tender-x-rays.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-monochromator-opti.jpg", "publishedAt": "2022-11-30T19:38:35Z", "content": "A climate-neutral energy supply requires a wide variety of materials for energy conversion processes, for example catalytically active materials and new electrodes for batteries. Many of these materi… [+2761 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New Geology articles published online ahead o - EurekAlert", "description": "Article topics and locations include insights into Earth’s oldest stromatolites and prospects for the search for life on Mars; rare earth elements; and the missing link in carbonatitic magma evolution. These Geology articles are online at https://geology.geos…", "url": "https://www.eurekalert.org/news-releases/972932", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-30T19:34:40Z", "content": "Boulder, Colo., USA: Article topics and locations include insights into Earth’s oldest stromatolites and prospects for the search for life on Mars; rare earth elements; and the missing link in carbon… [+19786 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Quantum teleportation opens a 'wormhole in spacetime' – Physics World - physicsworld.com", "description": "String theory and quantum gravity could be put to the test by quantum processor", "url": "https://physicsworld.com/a/quantum-teleportation-opens-a-wormhole-in-spacetime/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/11/Quantum-wormhole.jpg", "publishedAt": "2022-11-30T19:24:42Z", "content": "Teleporting qubits: artists impression a wormhole created in a quantum processor. (Courtesy: A Mueller/Caltech)\r\nThe equivalent to a wormhole in spacetime has been created on a quantum processor. Res… [+5664 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Webb Telescope Unveils Soul-Haunting New 'Pillars of Creation' View - CNET", "description": "Combining the work of two different infrared instruments delivers a wild new look at the iconic fingers of gas and dust.", "url": "https://www.cnet.com/science/space/nasa-webb-telescope-unveils-soul-haunting-new-pillars-of-creation-view/", "urlToImage": "https://www.cnet.com/a/img/resize/2a03363c84c00c12571facc96c26c85e5b23e183/hub/2022/11/30/e012375d-5a54-48e7-9c67-774326265d63/webbpillarscompositestsci-01gk2kpefxg7m98jc28rxs66cz.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-11-30T18:33:45Z", "content": "Few things encapsulate the wonders of space like the epic Pillars of Creation, a set of gorgeous finger-like tendrils of gas and dust where stars are formed. On Wednesday, NASA and the European Space… [+1882 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "DNA sequence helps in understanding origins of jaws: Study - ThePrint", "description": "Washington [US], November 30 (ANI): Researchers at Uppsala University have discovered and characterised a DNA sequence found in jawed vertebrates, such as sharks and humans, but absent in jawless vertebrates, such as lampreys. This DNA is important for the sh…", "url": "https://theprint.in/science/dna-sequence-helps-in-understanding-origins-of-jaws-study/1243347/", "urlToImage": null, "publishedAt": "2022-11-30T18:16:12Z", "content": "Washington [US], November 30 (ANI): Researchers at Uppsala University have discovered and characterised a DNA sequence found in jawed vertebrates, such as sharks and humans, but absent in jawless ver… [+2627 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of New South Wales: Astronomers observe intra-group light – the elusive glow between distant galaxies - India Education Diary", "description": "An international team of astronomers have turned a new technique onto the faint light between galaxies – known as ‘intra-group light’ – to characterise the stars that dwell there.Lead author of the study published in MNRAS, Dr Cristina Martínez-Lombi", "url": "https://indiaeducationdiary.in/university-of-new-south-wales-astronomers-observe-intra-group-light-the-elusive-glow-between-distant-galaxies/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/04/University-Of-New-South-Wales.png?fit=600%2C254&ssl=1", "publishedAt": "2022-11-30T16:50:40Z", "content": "An international team of astronomers have turned a new technique onto the faint light between galaxies known as intra-group light to characterise the stars that dwell there.\r\nLead author of the study… [+4123 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The pupal moulting fluid has evolved social functions in ants - Nature.com", "description": "Ant pupae secrete a fluid, derived from the moulting fluid, that elicits parental care behaviour, provides nutrients for larvae and must be removed for pupal survival.", "url": "https://www.nature.com/articles/s41586-022-05480-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-05480-9/MediaObjects/41586_2022_5480_Fig1_HTML.png", "publishedAt": "2022-11-30T16:19:13Z", "content": "Rearing O. biroi pupae in social isolation and collecting pupal fluid\r\nIn O. biroi colonies, larvae and pupae develop in discrete and synchronized cohorts26. Ten days after the first larvae had enter… [+17913 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "VP Harris, French President Get First Look at Galactic Get Together - NASA", "description": "A merging galaxy pair cavort in this image captured by the James Webb Space Telescope. This new image of a pair of galaxies, known to astronomers as II ZW 96, was first previewed for Vice President Kamala Harris and French Presid", "url": "https://www.nasa.gov/image-feature/vp-harris-french-president-get-first-look-at-galactic-get-together/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/potm2211a-h1dd3n.jpg", "publishedAt": "2022-11-30T16:08:51Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Scientists hunt for the 2nd-closest supermassive black hole near Earth - HT Tech", "description": "Two astrophysicists at the Center for Astrophysics Harvard & Smithsonian have suggested a way to observe what could be the second-closest supermassive black hole to Earth.", "url": "https://tech.hindustantimes.com/tech/news/scientists-hunt-for-the-2nd-closest-supermassive-black-hole-71669807046283.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/30/1600x900/_2fc83c14-94fa-11e5-b13b-1ee01ddf34ff_1669817459319_1669817459319.jpg", "publishedAt": "2022-11-30T15:50:50Z", "content": "Two astrophysicists at the Center for Astrophysics Harvard &amp; Smithsonian have suggested a way to observe what could be the second-closest supermassive black hole to Earth: a behemoth 3 million ti… [+3039 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Paw Mozter", "title": "Ocean Ecosystems Have Not Changed Much Over Millions of Years, Giving Insight to Future Climate Change - Nature World News", "description": "A recent study casts doubt on the notion that ocean ecosystems have undergone little change over millions of years, leading scientists to rethink conservation strategies and public policy.", "url": "https://www.natureworldnews.com/articles/54377/20221130/ocean-ecosystems-changed-much-over-millions-years-led-scientists-rethink.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/62879/us-environment-animals-oceans-death.jpg", "publishedAt": "2022-11-30T15:46:54Z", "content": "Have we damaged marine life too much for it to recover?\r\nA recent study casts doubt on the notion that ocean ecosystems have undergone little change over millions of years, leading scientists to reth… [+3841 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Where Did Earth's Oxygen Come From? Scientists Hint At An Unexpected Source - NDTV", "description": "The amount of oxygen in the Earth's atmosphere makes it a habitable planet. 21% of the atmosphere consists of this life-giving element. But in the deep past - as far back as the Neoarchean era 2.8-2.5 billion years ago - this oxygen was almost absent", "url": "https://www.ndtv.com/science/where-did-earths-oxygen-come-from-scientists-hint-at-an-unexpected-source-3567088", "urlToImage": "https://c.ndtvimg.com/2022-10/naoo5i6_earth-generic_625x300_08_October_22.jpg", "publishedAt": "2022-11-30T15:33:49Z", "content": "The amount of oxygen in the Earths atmosphere makes it a habitable planet. (Representational)\r\nMichigan: The amount of oxygen in the Earth's atmosphere makes it a habitable planet.\r\nTwenty-one per ce… [+7356 chars]"}, {"source": {"id": null, "name": "Cool Hunting"}, "author": "Kelly Pau", "title": "New Research Supports the Idea that There Was Once Life on Mars - Cool Hunting", "description": "A recent study from the journal “Earth and Planetary Science Letters” presents new findings about the early evolution of Mars. By creating a newly developed model of Martian atmosphere …", "url": "http://coolhunting.com/culture/new-research-supports-the-idea-that-there-was-once-life-on-mars/", "urlToImage": "https://i0.wp.com/coolhunting.com/wp-content/uploads/2022/11/mars-life.jpg?fit=800%2C800&ssl=1", "publishedAt": "2022-11-30T15:25:49Z", "content": "A recent study from the journal “Earth and Planetary Science Letters” presents new findings about the early evolution of Mars. By creating a newly developed model of Martian atmosphere through time, … [+862 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brian Huchel", "title": "Insects offer new ideas on materials use, structure strength via 4D time-lapse imaging - Phys.org", "description": "Purdue University engineers and entomologists are making some sweet discoveries about how honeybees build and structure their honeycombs, which could lead to new fabrication techniques taken from the buzzing builders.", "url": "https://phys.org/news/2022-11-insects-ideas-materials-strength-4d.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/insects-offer-new-idea-1.jpg", "publishedAt": "2022-11-30T14:21:03Z", "content": "Purdue University engineers and entomologists are making some sweet discoveries about how honeybees build and structure their honeycombs, which could lead to new fabrication techniques taken from the… [+4493 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA Goddard's Recipe for Fresh Baked Spacecraft - NASA Goddard", "description": "You’ve heard of baked potatoes, baked cakes, and baked ziti, but how about baked spacecraft? As we prepare the Plankton, Aerosol, and cloud Ecosystem satelli...", "url": "https://www.youtube.com/watch?v=kjqd73nRJiU", "urlToImage": "https://i.ytimg.com/vi/kjqd73nRJiU/maxresdefault.jpg", "publishedAt": "2022-11-30T14:13:48Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers reveal 'Yin and Yang' mechanisms of stress granules by Caprin-1 - Phys.org", "description": "In a study published in PNAS, a research team led by Prof. Gong Weiming from the University of Science and Technology (USTC) of the Chinese Academy of Sciences and his collaborators revealed the \"Yin and Yang\" regulation of stress granules (SGs) by Caprin-1.", "url": "https://phys.org/news/2022-11-reveal-yin-yang-mechanisms-stress.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-reveal-yin.jpg", "publishedAt": "2022-11-30T13:51:28Z", "content": "In a study published in PNAS, a research team led by Prof. Gong Weiming from the University of Science and Technology (USTC) of the Chinese Academy of Sciences and his collaborators revealed the \"Yin… [+2420 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Mike Williams-Rice", "title": "Method predicts asymmetrical edges of 2D crystals - Futurity: Research News", "description": "Researchers have developed a new method that can predict the shapes of asymmetrical crystals. It's an algebraic sleight-of-hand.", "url": "https://www.futurity.org/asymmetrical-crystals-2837282/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/11/asymmetry_crystals_1600.jpg", "publishedAt": "2022-11-30T13:41:01Z", "content": "A new method can predict the shapes of asymmetrical crystals.\r\nA crystal’s shape is determined by its inherent chemistry, a characteristic that ultimately determines its final form from the most basi… [+4594 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "India's SARAS Telescope Finds Clues to Earliest Galaxies of the Universe! | Weather.com - The Weather Channel", "description": "A group of researchers from around the world have worked out the properties of radio luminous galaxies that formed just 200 million years after the Big Bang!", "url": "https://weather.com/en-IN/india/space/news/2022-11-30-india-saras-telescope-finds-clues-to-the-first-galaxies-of-universe", "urlToImage": "https://s.w-x.co/in-galaxy_6.jpg", "publishedAt": "2022-11-30T13:24:54Z", "content": "Humanitys fascination with the secrets of the universe is never ending, and rightly so! After all, who wouldn't want to know how our existence came to be? The world has been collectively striving to … [+3552 chars]"}, {"source": {"id": null, "name": "Sme.org"}, "author": "Jesse Basarab", "title": "RS-25 Engines Return to Space Aboard Artemis I - SME", "description": "The upcoming debut of NASA’s Space Launch System (SLS) rocket on the Artemis I mission will mark a return to flight for four main engines that already have a remarkable history of their own.", "url": "https://www.sme.org/technologies/articles/2022/november/rs-25-engines-return-to-space-aboard-artemis-i/", "urlToImage": "https://www.sme.org/globalassets/sme.org/technologies/articles/authors/basarab-jesse_768x432.jpg", "publishedAt": "2022-11-30T13:08:32Z", "content": "In addition to opening a historic new chapter in space exploration, the upcoming debut of NASA’s Space Launch System (SLS) rocket on the Artemis I mission will mark a return to flight for four main e… [+3709 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Is our universe a hologram? Physicists debate famous idea on its 25th anniversary - Deccan Herald", "description": "Twenty-five years ago this month, a conjecture shook the world of theoretical physics. It had the aura of revelation. “At first, we had a magical statement …almost out of nowhere,” says Mark Van Raamsdonk, a theoretical physicist at the University of British …", "url": "https://www.deccanherald.com/science-and-environment/is-our-universe-a-hologram-physicists-debate-famous-idea-on-its-25th-anniversary-1167151.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/30/istock-1085287936-1-999427-1624168708-1167151-1669813516.jpg", "publishedAt": "2022-11-30T13:04:50Z", "content": "Twenty-five years ago this month, a conjecture shook the world of theoretical physics. It had the aura of revelation. At first, we had a magical statement almost out of nowhere, says Mark Van Raamsdo… [+15977 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Hubble Captures a Swarm of Stars - NASA", "description": "Looking like a glittering swarm of buzzing bees, the stars of globular cluster NGC 6440 shine brightly in this NASA Hubble Space Telescope image. Located some 28,000 light-years away in the constellation Sagittarius, the archer.", "url": "https://www.nasa.gov/image-feature/goddard/2022/hubble-captures-a-swarm-of-stars/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/hubble_ngc6440.jpg", "publishedAt": "2022-11-30T12:18:48Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Fossilized brain of 525 million-year-old deep sea worm likely the oldest ever discovered - Livescience.com", "description": "An ancient worm unearthed in China has one of the oldest fossilized brains ever found. The brain's shape could also help solve a centuries-old debate about the evolution of arthropods.", "url": "https://www.livescience.com/oldest-fossilized-brain-worm", "urlToImage": "https://cdn.mos.cms.futurecdn.net/k9txTFmBPxT4U46eu8SCuV-1200-80.jpg", "publishedAt": "2022-11-30T11:44:11Z", "content": "An abstract artist's impression of what the fossilized worm, Cardiodictyon catenulum, may have looked like.  (Image credit: Nicholas Strausfeld/The University of Arizona)\r\n(opens in new tab)A 525 mil… [+4306 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Search for possible sign of life in Venus' clouds comes up empty - Space.com", "description": "The airplane-mounted SOFIA telescope didn't see signs of the possible biomarker.", "url": "https://www.space.com/sofia-flying-telescope-fails-find-phosphine-venus", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Uq3duqeiWqg9QEVAVsj5Xh-1200-80.jpg", "publishedAt": "2022-11-30T11:00:24Z", "content": "An aircraft-borne telescope could not find signs of a compound possibly linked to biological activity during observations of Venus' atmosphere.\r\nThe discovery of a potential signal indicating the pre… [+2052 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Europa’s plate tectonic activity is unlike Earth’s - Tech Explorist", "description": "The Europa has likely experienced intermittent, regional plate tectonic activity in the past.", "url": "https://www.techexplorist.com/europas-plate-tectonic-activity-unlike-earth/55121/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/Europas-surface.jpg", "publishedAt": "2022-11-30T09:06:57Z", "content": "The theory of plate tectonics describes how the Earth’s surface is divided into moving plates, explaining the distribution of earthquakes, volcanoes, mountains, and ocean basins on our planet. The ic… [+2303 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Andromeda galaxy's 'cannibalistic' nature points to new galactic growth theory - The Indian Express", "description": "New research has found that the neighbouring Andromeda galaxy \"cannibalises\" smaller galaxies to grow bigger. This is at odds with a calmer picture of how galaxies grow.", "url": "https://indianexpress.com/article/technology/science/andromeda-galaxy-cannibal-galaxy-growth-8297997/", "urlToImage": "https://images.indianexpress.com/2022/11/Andromeda-galaxy-20221130.jpg", "publishedAt": "2022-11-30T08:30:58Z", "content": "The Andromeda galaxy, which will collide with our Milky Way galaxy, in about 4 billion years from now, might be a cosmic cannibal that gets bigger by devouring smaller galaxies.The research, which is… [+2204 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Somalia Meteorite, Scientists Discover 2 Minerals Never-Before-Seen On Earth - NDTV", "description": "The El Ali meteorite was unearthed in Somalia in 2020 and has stunned the researchers with the presence of two unknown minerals.", "url": "https://www.ndtv.com/world-news/in-somalia-meteorite-scientists-discover-2-minerals-never-before-seen-on-earth-3565417", "urlToImage": "https://c.ndtvimg.com/2021-10/n10ildug_meteorite-generic_625x300_12_October_21.jpg", "publishedAt": "2022-11-30T07:50:44Z", "content": "The iron-based meteorite was found in Somalia in 2020. (Representational Photo)\r\nResearchers in Canada have discovered two new minerals in a meteorite that landed in east Africa, according to a repor… [+1722 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dangerous solar storm smashes into Earth with solar winds clocked at terrifying 700km a sec - HT Tech", "description": "Earth was struck by a powerful solar storm event yesterday with solar winds travelling as fast as 700 km per second and even worse is expected.", "url": "https://tech.hindustantimes.com/tech/news/dangerous-solar-storm-smashes-into-earth-with-solar-winds-clocked-at-terrifying-700km-a-sec-71669789764715.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/30/1600x900/northern-lights-984120_1920_1632829433522_1669789822424_1669789822424.jpg", "publishedAt": "2022-11-30T06:33:12Z", "content": "The previous week Earth was blasted by multiple solar storm strikes and it appears that the ongoing week is not going to be any different. The Sun has spit out a wave of terrifyingly fast moving sola… [+2038 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Groups of stars in certain envoirnment can regulate themselves - Tech Explorist", "description": "Astronomers see stellar self-control in action.", "url": "https://www.techexplorist.com/groups-stars-certain-envoirnment-regulate-themselves/55112/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/RCW-36.jpg", "publishedAt": "2022-11-30T06:11:40Z", "content": "The interstellar medium (ISM) is a complex mixture of multiple phases, where stars form in the densest regions, primarily organized in dense filaments. However, a new study reported that groups of st… [+3674 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Gallic acid-loaded graphene oxide against MRSA strains | IJN - Dove Medical Press", "description": "Stability, toxicity and anti-bacterial potential of gallic acid loaded graphene oxide (GAGO) against methicillin resistant Staphylococcus aureus (MRSA) strains", "url": "https://www.dovepress.com/stability-toxicity-and-antibacterial-potential-of-gallic-acid-loaded-g-peer-reviewed-fulltext-article-IJN", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-11-30T05:32:31Z", "content": "Introduction\r\nStaphylococcus aureus (S. aureus) is commonly found on the skin as a normal human microbiota. It does not become pathological until it enters the human body, which causes potent infecti… [+81681 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Dormant microbes can 'switch on' to cope with climate change - Science Daily", "description": "Dormant strains of bacteria that have previously adapted to cope with certain temperatures are switched back on during climatic change, according to a new report.", "url": "https://www.sciencedaily.com/releases/2022/11/221129112755.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-30T02:33:56Z", "content": "Dormant strains of bacteria that have previously adapted to cope with certain temperatures are switched back on during climatic change, according to a report published today in eLife.The results have… [+3015 chars]"}, {"source": {"id": null, "name": "Natureasia.com"}, "author": null, "title": "Evolution: Jurassic lizard skulls provide insights into reptile evolution | Nature Communications - Nature Middle East", "description": "The partially preserved skulls of two new lizard species from the Late Jurassic period (around 145 million years ago) of North America are described in a paper in Nature Communications. Both fossils r", "url": "https://www.natureasia.com/en/research/highlight/14298", "urlToImage": "http://www.natureasia.com/static/common/img/logos/journals/ncomms-logo-sq.png", "publishedAt": "2022-11-30T01:35:16Z", "content": "The partially preserved skulls of two new lizard species from the Late Jurassic period (around 145 million years ago) of North America are described in a paper in Nature Communications. Both fossils … [+1742 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "International Team Observes Innermost Structure Of Quasar Jet - Eurasia Review", "description": "An international team of scientists has observed the narrowing of a quasar jet for the first time by using a network of radio telescopes across the world. The results suggest that the narrowing of …", "url": "https://www.eurasiareview.com/30112022-international-team-observes-innermost-structure-of-quasar-jet/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2022/11/a-303.png?fit=800%2C450&ssl=1", "publishedAt": "2022-11-29T23:19:19Z", "content": "An international team of scientists has observed the narrowing of a quasar jet for the first time by using a network of radio telescopes across the world. The results suggest that the narrowing of th… [+1529 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "Astronomers detect “mystery molecule” in exoplanet’s atmosphere - Freethink", "description": "Thanks to the James Webb Space Telescope, we now know more about the atmosphere of WASP-39b, a distant gas giant, than any other exoplanet.", "url": "https://www.freethink.com/space/gas-giant-wasp-39b", "urlToImage": "https://www.freethink.com/wp-content/uploads/2022/11/gas-giant-Wasp-39b-1.jpeg?resize=1200,630", "publishedAt": "2022-11-29T23:00:00Z", "content": null}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "These bizarre fungi don't belong to any current classification of life - BGR", "description": "Scientists have made a connection between a new branch of fungi and a common ancestor from over 300 million years ago.", "url": "https://bgr.com/science/these-bizarre-fungi-dont-belong-to-any-current-classification-of-life/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/01/bgrpic-copy-2.jpg?quality=82&strip=all", "publishedAt": "2022-11-29T20:48:00Z", "content": "Genome studies have helped uncover an entirely new branch of fungi that includes 600 seemingly unconnected fungi. However, when digging into the genome sequencing of each fungus, researchers discover… [+1933 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Physics - Intelligent Materials: Science Fiction to Science Fact - Physics", "description": "Materials that learn to change their shape in response to an external stimulus are a step closer to reality, thanks to a prototype system produced by engineers at UCLA.", "url": "https://physics.aps.org/articles/v15/184", "urlToImage": "https://physics.aps.org/assets/a5e08a34-d608-4991-8ccc-bb3ebdc6ba96/e184_1_thumb.png", "publishedAt": "2022-11-29T19:14:58Z", "content": "A photograph of the mechanical neural network developed by researchers at UCLA.\r\nLiving entities constantly learn, adapting their behaviors to the environment so that they can thrive regardless of th… [+4548 chars]"}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "No Phosphine on Venus-According to SOFIA Observations - IT News Online", "description": "No Phosphine on Venus-According to SOFIA Observations", "url": "http://www.itnewsonline.com/PRNewswire/No-Phosphine-on-Venus-According-to-SOFIA-Observations/887944", "urlToImage": null, "publishedAt": "2022-11-29T18:29:55Z", "content": "<table><tr><td>No Phosphine on Venus-According to SOFIA ObservationsCopyright 2022 PR Newswire. All Rights Reserved2022-11-29</td></tr></table>\r\nWASHINGTON, Nov. 29, 2022 /PRNewswire/ --Â After the 2… [+5662 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Developing more sustainable and recyclable polyurethane foams - Phys.org", "description": "A team of researchers from the Center for Education and Research on Macromolecules (CERM) at the University of Liège (Belgium) has developed an innovative process that rethinks the manufacturing of polyurethane (PU) foams without the use of isocyanates—highly…", "url": "https://phys.org/news/2022-11-sustainable-recyclable-polyurethane-foams.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/more-sustainable-and-r.jpg", "publishedAt": "2022-11-29T17:37:48Z", "content": "A team of researchers from the Center for Education and Research on Macromolecules (CERM) at the University of Liège (Belgium) has developed an innovative process that rethinks the manufacturing of p… [+3550 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Renee Hansen", "title": "Mars Used To Be An Ocean World? - Giant Freakin Robot", "description": "The red planet was once a very different-looking place, as scientists believe Mars once had enough water to make an ocean.", "url": "https://www.giantfreakinrobot.com/sci/mars-once-an-ocean-world.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2021/04/mars.jpg", "publishedAt": "2022-11-29T17:07:21Z", "content": "Water on Mars may have been so plentiful, it could have been considered an ocean capable of sustaining life, scientists now theorize.\r\nBy Renee Hansen\r\n| Published 2 days ago\r\nThe surface of Mars\r\nKn… [+3000 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Assesses Launch Pad for Damage After Launch of the World’s Most Powerful Rocket - SciTechDaily", "description": "Following the successful Artemis I liftoff of the world’s most powerful rocket from NASA’s Kennedy Space Center in Florida, teams carefully assessed the mobile launcher and infrastructure at Launch Pad 39B. Engineers have determined that the overall mobile la…", "url": "https://scitechdaily.com/nasa-assesses-launch-pad-for-damage-after-launch-of-the-worlds-most-powerful-rocket/", "urlToImage": "https://scitechdaily.com/images/NASA-Artemis-I-Flight-Test-Liftoff.jpg", "publishedAt": "2022-11-29T16:12:55Z", "content": "ByNASANovember 29, 2022\r\nNASAs Space Launch System rocket carrying the Orion spacecraft launches on the Artemis I flight test, Wednesday, November 16, 2022, from Launch Complex 39B at NASAs Kennedy S… [+5264 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Scientists revive 50,000-year-old 'zombie' virus from Siberian permafrost, is it bad news for earth? - msnNOW", "description": "Scientists have characterized 13 \"zombie viruses\" which pose a potential threat to lives on planet earth.", "url": "https://zeenews.india.com/world/scientists-revive-50000-year-old-zombie-virus-from-siberian-permafrost-is-it-bad-news-for-earth-2541740.html", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14H3iS.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-29T16:00:58Z", "content": "© Provided by Zee NewsNew Delhi: Climate change caused by various factors including global warming is leading to many disastrous consequences and one of which is the melting of the ice caps of the pl… [+1318 chars]"}, {"source": {"id": null, "name": "Peoplesdispatch.org"}, "author": "Sandipan Talukdar", "title": "James Webb telescope may have spotted some of the most distant galaxies ever seen - Peoples Dispatch", "description": "Researchers are still in the process of confirming the distances of these galaxies", "url": "https://peoplesdispatch.org/2022/11/29/james-webb-telescope-may-have-spotted-some-of-the-most-distant-galaxies-ever-seen/", "urlToImage": "https://peoplesdispatch.org/wp-content/uploads/2022/03/otis_to_iis-1.jpg", "publishedAt": "2022-11-29T13:28:49Z", "content": "The James Webb Space Telescope (JWST), which is in space with its aim of finding out more about the origins of the universe, has recently to spotted two objects that may be the most distant galaxies … [+3024 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "ESA’s ExoMars plans depend on NASA contributions - SpaceNews", "description": "While ESA has secured funding to continue the ExoMars mission for a 2028 launch, that plan requires cooperation with NASA that has yet to be finalized.", "url": "https://spacenews.com/esas-exomars-plans-depend-on-nasa-contributions/", "urlToImage": "https://spacenews.com/wp-content/uploads/2020/01/2.-ExoMars2018_Rover_20140321_9k.jpg", "publishedAt": "2022-11-29T13:05:06Z", "content": "WASHINGTON While the European Space Agency has secured funding to continue the ExoMars mission for a 2028 launch, that plan requires cooperation with NASA that has yet to be finalized.\r\nAt a Nov. 23 … [+3129 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Soniya Y", "title": "How to Burn Belly Fat in Just 3 Weeks by Running? - Sportskeeda", "description": "If you're trying to lose weight, you might wonder whether running is the solution for you. Many people start running to help them slim down.", "url": "https://www.sportskeeda.com/health-and-fitness/how-burn-belly-fat-just-3-weeks-running", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/0fe5b-16697101461416-1920.jpg", "publishedAt": "2022-11-29T12:30:00Z", "content": "If you're trying to lose weight, you might wonder whether running is the solution for you. Many people start running to help them slim down. You can expect to burn calories and excess body fat with a… [+3748 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Scientists Found Clues About The Psychology Of Earliest Animal Ancestors - The Hans India", "description": "This discovery sheds light on how our earliest animal ancestors operated.The 575 million-year-old...", "url": "https://www.thehansindia.com/offbeat/scientists-found-clues-about-the-psychology-of-earliest-animal-ancestors-771186", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/11/29/1322634-animal-ancestors.jpg", "publishedAt": "2022-11-29T12:30:00Z", "content": "According to Australian National University(ANU), researchers have found fossils of some of the earliest known animals, dating back 575 million years. This discovery sheds light on how our earliest a… [+2267 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Structural materials being developed inspired by pangolins and peacocks - News9 LIVE", "description": "The researchers investigated the challenges and promises of bioinspired nanocomposites", "url": "https://www.news9live.com/science/structural-materials-being-developed-inspired-by-pangolins-and-peacocks-210826", "urlToImage": "https://media.news9live.com/h-upload/2022/11/29/586647-vyshnav-sidhu-n3p9ubt2p9s-unsplash.jpg", "publishedAt": "2022-11-29T12:08:07Z", "content": "An international team of researchers have published a review paper investigating next generation materials that are bioinspired from the natural world. These bioinspired nanocomposites have a mixture… [+2289 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "New device can control light at unprecedented speeds - Tech Explorist", "description": "Scientists have developed a programmable optical device for high-speed beam steering.", "url": "https://www.techexplorist.com/new-device-control-light-unprecedented-speeds/55105/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/a-programmable-wireless-spatial-light-modulator.jpg", "publishedAt": "2022-11-29T11:37:35Z", "content": "An international group of researchers, led by a team at MIT, has developed a programmable, wireless device that can control light, such as by focusing a beam in a specific direction or manipulating t… [+4790 chars]"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Could mirrors be the key to controlling solar energy during photosynthesis? - Innovation News Network", "description": "Using light through mirrors could be the key to controlling solar energy conversion during photosynthesis, or other light reactions.", "url": "https://www.innovationnewsnetwork.com/could-mirrors-be-key-to-controlling-solar-energy-during-photosynthesis/27773/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2022/11/iStockprimeimages-1032006128.jpg", "publishedAt": "2022-11-29T10:18:32Z", "content": "Harnessing solar energy to capture greenhouse gases is extremely popular in scientific research. This is because the sunlight that hits Earth for one hour is almost equivalent to the total energy con… [+2134 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "ANIKET DIXIT", "title": "SpaceX Dragon arrives at the ISS and drops off science supplies and Thanksgiving food - News Track English", "description": "USA: On November 27 at 7:39 am ET, SpaceX's Dragon spacecraft successfully docked at the International Space Station (ISS) with around 3,500 kg of cargo (6:09 am IST).\r\n\r\nAt 2:20 PM EST on 26 November, the mission took off (12:50 AM IST, 27 November). Supplie…", "url": "https://english.newstracklive.com/news/spacex-dragon-arrives-at-the-iss-and-drops-off-science-supplies-and-thanksgiving-food-sc71-nu355-ta355-1259149-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Nov/29/big_thumb/Screenshot-2022-11-29-141319_6385c637bf430.png", "publishedAt": "2022-11-29T09:27:28Z", "content": "USA: On November 27 at 7:39 am ET, SpaceX's Dragon spacecraft successfully docked at the International Space Station (ISS) with around 3,500 kg of cargo (6:09 am IST).\r\nAt 2:20 PM EST on 26 November,… [+1848 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Jagran Josh", "title": "Why didn't the Egg dropped from space crack?: Find out the Reasons for the experiment gone viral! - Jagran Josh", "description": "In your early years, you must have dropped a dozen eggs and they all surely cracked but a NASA engineer took this endeavor to new heights and decided to drop an egg from space. The egg did not crack. But how?", "url": "https://www.jagranjosh.com/general-knowledge/why-didnt-the-egg-dropped-from-space-crack-1669710570-1", "urlToImage": "https://img.jagranjosh.com/images/2022/November/29112022/egg-dropped-from-space.jpg", "publishedAt": "2022-11-29T08:27:00Z", "content": "In your early years, you must have dropped a dozen eggs and they all surely cracked but a NASA engineer took this endeavor to new heights and decided to drop an egg from space. The egg did not crack.… [+3617 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Study of ‘polluted’ white dwarfs finds that stars and planets grow together - India Education Diary", "description": "A team of astronomers have found that planet formation in our young Solar System started much earlier than previously thought, with the building blocks of planets growing at the same time as their parent star.Some white dwarfs are amazing laboratorie", "url": "https://indiaeducationdiary.in/university-of-cambridge-study-of-polluted-white-dwarfs-finds-that-stars-and-planets-grow-together/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg?fit=400%2C400&ssl=1", "publishedAt": "2022-11-29T08:20:48Z", "content": "A team of astronomers have found that planet formation in our young Solar System started much earlier than previously thought, with the building blocks of planets growing at the same time as their pa… [+4518 chars]"}]}