{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Brian Koberlein, Universe Today", "title": "We May Have Caught a Supermassive Black Hole Flipping Its Entire Magnetic Field - ScienceAlert", "description": "Black holes are powerful cosmic engines. They provide the energy behind quasars and other active galactic nuclei (AGNs). This is due to the interaction of matter with its powerful gravitational and magnetic fields.", "url": "https://www.sciencealert.com/a-supermassive-black-hole-just-flipped-its-entire-magnetic-field", "urlToImage": "https://www.sciencealert.com/images/2022-05/processed/AbstractImageOfABlackHoleWithLightGoingOutside_1024.jpg", "publishedAt": "2022-05-09T02:02:43Z", "content": "Black holes are powerful cosmic engines. They provide the energy behind quasars and other active galactic nuclei (AGNs). This is due to the interaction of matter with its powerful gravitational and m… [+3330 chars]"}, {"source": {"id": null, "name": "Cosmos"}, "author": "Matilda Handsley-Davis", "title": "Earthly comparison hints at shallow liquid water on Jupiter's moon - Echonetdaily", "description": "Jupiter’s moon Europa is described by NASA as one of the most promising locations in our solar system for present-day extraterrestrial life.", "url": "https://cosmosmagazine.com/space/astronomy/shallow-liquid-water-europa/", "urlToImage": "https://cosmosmagazine.com/wp-content/uploads/2022/04/europa-shallow-water-header-1200.jpg", "publishedAt": "2022-05-09T00:41:41Z", "content": null}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Chris Skeldon", "title": "Watch SpaceX Crew-3 astronauts \"waltz\" through space in a fun space dress video - brytfmonline.com", "description": "Here’s a SpaceX dance you won’t see every day. Fun (and acrobatic) video of astronauts...", "url": "https://www.brytfmonline.com/watch-spacex-crew-3-astronauts-waltz-through-space-in-a-fun-space-dress-video/", "urlToImage": null, "publishedAt": "2022-05-09T00:10:20Z", "content": "Here’s a SpaceX dance you won’t see every day. \r\nFun (and acrobatic) video of astronauts in . format International Space Station Reveals the lighter side of space travel during the formation of the f… [+2305 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Research: Quantum Mechanics Might Explain Why DNA Mutates Spontaneously - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. Even though DNA replicates with astounding precision, it's not immune to mistakes and can lead to mutations. Using sophisticated computer modelling, a team of physicists and chemists at the University of…", "url": "https://www.latestly.com/agency-news/science-news-research-quantum-mechanics-might-explain-why-dna-mutates-spontaneously-3684413.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/05/dna-g0d3bbcf2a_192020220128133834202201281427372022022713284520220508182217-588x441.jpg", "publishedAt": "2022-05-09T00:04:23Z", "content": "Washington [US], May 9 (ANI): Even though DNA replicates with astounding precision, it's not immune to mistakes and can lead to mutations. Using sophisticated computer modelling, a team of physicists… [+3872 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Laurence Malcom", "title": "They find sugar in the sea - Persia Digest", "description": "The concept of “salt water” in the oceans could change thanks to the discovery of large reserves of sugar that have not yet been noticed, and were revealed in Nature’s environment and evolution. Scientists and specialists reported that weeds such as weeds rel…", "url": "https://persiadigest.com/they-find-sugar-in-the-sea/", "urlToImage": null, "publishedAt": "2022-05-08T22:51:38Z", "content": "The concept of “salt water” in the oceans could change thanks to the discovery of large reserves of sugar that have not yet been noticed, and were revealed in Nature’s environment and evolution.\r\nSci… [+1166 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA Develops 'Lunar Backpack' to Support Future Moon Exploration - VOA Learning English", "description": "NASA has developed a wearable device to guide future explorers on the moon. The system is designed to map a wide range of terrain and guide astronauts through untouched territory and dark areas of the moon.", "url": "https://learningenglish.voanews.com/a/nasa-develops-lunar-backpack-to-support-future-moon-exploration/6558362.html", "urlToImage": "https://gdb.voanews.com/03190000-0aff-0242-e4d8-08da2eae83e2_cx3_cy3_cw88_w1200_r1.jpg", "publishedAt": "2022-05-08T22:01:07Z", "content": "The American space agency NASA has developed a wearable device to guide future explorers on the moon.\r\nThe system is designed to map terrain and guide astronauts through unknown territory and dark ar… [+4094 chars]"}, {"source": {"id": null, "name": "Azpm.org"}, "author": "Christopher Conover", "title": "NASA calls University of Arizona a \"crown jewel\" - Arizona Public Media", "description": "University students and researchers work with NASA on a number of high-profile projects.", "url": "https://www.azpm.org/p/headlines/2022/5/8/209970-nasa-calls-university-of-arizona-a-crown-jewel/", "urlToImage": "https://media.azpm.org/master/image/2020/10/22/hero/tagimpact.jpg", "publishedAt": "2022-05-08T20:54:13Z", "content": "NASA Deputy Administrator and former astronaut Pam Melroy called the University of Arizona a \"crown jewel\" among U.S. universities doing space science research.\r\nThe comments came after Melroy spent … [+959 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Galactic Ballet Captured by State-of-the-Art Dark Energy Camera - SciTechDaily", "description": "DOE-funded Dark Energy Camera at NSF’s NOIRLab in Chile captures a pair of galaxies performing a gravitational duet. The interacting galaxy pair NGC 1512 and NGC 1510 take center stage in this image from the US Department of Energy-fabricated Dark Energy Came…", "url": "https://scitechdaily.com/galactic-ballet-captured-by-state-of-the-art-dark-energy-camera/", "urlToImage": "https://scitechdaily.com/images/Galaxy-NGC-1512-Crop-scaled.jpg", "publishedAt": "2022-05-08T19:51:09Z", "content": "ByAssociation of Universities for Research in Astronomy (AURA)May 8, 2022\r\nThe interacting galaxy pair NGC 1512 and NGC 1510 take center stage in this image from the Dark Energy Camera, a state-of-th… [+5261 chars]"}, {"source": {"id": null, "name": "Big Island Video News"}, "author": null, "title": "Scientists Conduct Microgravity Survey On Kīlauea Volcano - Big Island Video News", "description": "HAWAIʻI VOLCANOES NATIONAL PARK - The USGS Hawaiian Volcano Observatory is using gravimeters to detect subtle changes in gravity caused by magma movements.", "url": "https://www.bigislandvideonews.com/2022/05/08/scientists-conduct-microgravity-survey-on-kilauea-volcano/", "urlToImage": "https://www.bigislandvideonews.com/wp-content/uploads/2022/05/2022-05-09-volcano-FEATURE.jpg", "publishedAt": "2022-05-08T19:32:20Z", "content": "USGS: “During a gravity survey, HVO scientists measure the relative strength of gravity (using a gravimeter, one of the small light-colored boxes in the center of the photo) between benchmarks. At ea… [+2502 chars]"}, {"source": {"id": null, "name": "CW39 Houston"}, "author": "Riley Rogers, Nexstar Media Wire", "title": "Jupiter’s moon Europa could be suitable for life, research says - CW39 Houston", "description": "A recent study of Jupiter’s moon, Europa, showed that radiolytic oxidants made at the surface of its ice can travel to the ocean beneath its ice shell, according to a team of researchers led by the University of Texas at Austin. This means that the icy moon c…", "url": "https://cw39.com/news/space-exploration/jupiters-moon-europa-could-be-suitable-for-life-research-says/", "urlToImage": "https://cw39.com/wp-content/uploads/sites/10/2022/05/EuropaClipper_Poster_08_2020_002_2_.jpg?w=1280", "publishedAt": "2022-05-08T18:36:44Z", "content": "AUSTIN, Texas (KXAN) The outer layer of one of Jupiter’s moons, Europa, is solid ice and strong evidence supports an ocean flowing below. New research led by the University of Texas at Austin is show… [+9080 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "Watch Rocket Lab Catch A Falling Rocket With A Helicopter – Then Drop It Moments Later - Wonderful Engineering", "description": "Advertisement A California-based company, “Rocket Lab,” under its mission “There and Back Again,” has finally embarked on a rocket to put 34 satellites into orbit. This space mission was elicited by one of the sustainable development goals of Rocket Lab: to l…", "url": "https://wonderfulengineering.com/watch-rocket-lab-catch-a-falling-rocket-with-a-helicopter-then-drop-it-moments-later/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/05/rocket-lab-catch.jpg", "publishedAt": "2022-05-08T18:10:32Z", "content": "A California-based company, Rocket Lab, under its mission There and Back Again, has finally embarked on a rocket to put 34 satellites into orbit. This space mission was elicited by one of the sustain… [+2182 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "New Way to Glimpse Distant Worlds Could Give Us Our First Real Look at Exoplanets - ScienceAlert", "description": "Planets outside of our Solar System are rather dull things. So dull, we can only see them directly by sifting out a scattering of reflected rays amid the glare of their parent star. Even then, the best we can manage is a pinprick to identify its posi", "url": "https://www.sciencealert.com/new-technique-for-using-space-as-a-lens-could-reveal-first-glimpses-of-distant-worlds", "urlToImage": "https://www.sciencealert.com/images/2022-05/processed/IllustrationOfExoplanetCorot9bAcrossItsSun_1024.jpg", "publishedAt": "2022-05-08T18:02:27Z", "content": "Planets outside of our Solar System are rather dull things. So dull, we can only see them directly by sifting out a scattering of reflected rays amid the glare of their parent star. Even then, the be… [+4350 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Andrew Wight", "title": "Exploring The Time The Universe Lit Up... With A Space Telescope! - Forbes", "description": "Colombian astronomer Sofía Rojas Ruiz will be using the James Webb Space Telescope (JWST) to study the first-born bright galaxies and quasars that contributed to the process of illuminating the universe from complete darkness about 13 billion years ago.", "url": "https://www.forbes.com/sites/andrewwight/2022/05/08/exploring-the-time-the-universe-lit-up-with-a-space-telescope/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62732b70656b8d826933ac09/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-05-08T18:00:00Z", "content": "Sofía Rojas in front of the UT 1, one of the 8-meter VLT telescopes in Paranal, Chile. January, ... [+] 2020.\r\nSofía Rojas\r\nColombian astronomer Sofía Rojas Ruiz will be using the James Webb Space Te… [+4647 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/nancy.atkinson4", "title": "This Crater on Mars is Just a Couple of Years Old - Universe Today", "description": "Changes are always taking place on Mars, from factors like seasonal variations and wind. But there’s one other aspect that changes the surface of Mar quite often: impacts. Here’s a new impact crater that was seen by the Mars Reconnaissance Orbiter. Exactly wh…", "url": "https://www.universetoday.com/155816/this-crater-on-mars-is-just-a-couple-of-years-old/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/05/ESP_065745_0980-1024x768.jpg", "publishedAt": "2022-05-08T17:29:37Z", "content": "Changes are always taking place on Mars, from factors like seasonal variations and wind. But theres one other aspect that changes the surface of Mar quite often: impacts.\r\nHeres a new impact crater t… [+1919 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "IANS", "title": "Global warming causing world's oceans to lose 'memory' - OTV News", "description": "Along with ocean memory decline, the thinning mixed layer is also found to increase the random fluctuations of the sea surface temperature.", "url": "https://odishatv.in/news/science/global-warming-causing-world-s-oceans-to-lose-memory--176452", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1652028521.webp", "publishedAt": "2022-05-08T16:49:25Z", "content": "Most of the world's oceans are steadily losing their year-to-year 'memory' under global warming, researchers have warned.\r\nOcean memory decline is found as a collective response across the climate mo… [+2086 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Dennis Overbye | NYT", "title": "Sonification of ripples: The sounds of a black hole singing - Business Standard", "description": "The Chandra astronomers recently 'sonified' these ripples by speeding up the signals to 57 or 58 octaves above their original pitch, boosting their frequency quadrillions of times to make them audible", "url": "https://www.business-standard.com/article/current-affairs/sonification-of-ripples-the-sounds-of-a-black-hole-singing-122050800901_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-12/23/full/1640231952-3705.jpg", "publishedAt": "2022-05-08T16:42:00Z", "content": "In space you can’t hear a black hole scream, but apparently you can hear it sing.\r\nIn 2003 astrophysicists wor­king with NASA’s orbiting Cha­n­­dra X-ray Observatory detected a pattern of ripples in … [+2691 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "See the fiery Blood Moon rise in a total lunar eclipse in May's must-see skywatching event - Space.com", "description": "If the weather is clear, skywatchers across most of the Americas, Europe and Africa will have a view of one of nature's most beautiful spectacles: a total eclipse of the moon.", "url": "https://www.space.com/total-lunar-eclipse-may-2022-must-see-event", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Gp68nVBzgHM8BXDcnBshSX-1200-80.jpg", "publishedAt": "2022-05-08T16:31:29Z", "content": "On the night of May 15-16, the attention of millions of people will be drawn skyward, where a mottled, coppery globe — the moon — will be completely immersed in the long, tapering cone of shadow cast… [+7400 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "See the ‘grand design’ of spiral galaxy M99 in this Hubble image - Digital Trends", "description": "The swirling spiral of the elegant galaxy M99 is on display in this week's image from the Hubble Space Telescope.", "url": "https://www.digitaltrends.com/news/hubble-grand-design-spiral-m99/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/hubble-sees-double-in-m99.jpg", "publishedAt": "2022-05-08T16:05:41Z", "content": "The swirling spiral of the elegant galaxy M99 is on display in this week’s image from the Hubble Space Telescope. As a prototypical spiral galaxy, like our Milky Way, M99 has the classical rotating d… [+2278 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "What is CAPSTONE? All about NASA's mission that would decide lunar space station's fate - Republic World", "description": "NASA says that through the CAPSTONE mission, it is showing how future missions could pinpoint their place in space as they reach for more distant destinations.", "url": "https://www.republicworld.com/science/space/what-is-capstone-all-about-nasas-mission-that-would-decide-lunar-space-stations-fate-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ux7dyoyxs8jnx51i_1652024296.jpeg", "publishedAt": "2022-05-08T15:56:00Z", "content": "The US space agency NASA has an ambitious plan of building a space station called 'Gateway' that will be installed in the moons orbit. The space station will be built under the Artemis program which … [+1958 chars]"}, {"source": {"id": null, "name": "Foxweather.com"}, "author": "Andrew Wulfeck", "title": "Meet the manikins that will hitch a ride on NASA’s moon rocket - FOX 10 News Phoenix", "description": "The manikins aboard Artemis I mission will have thousands of sensors to help experts determine the forces on the human body", "url": "https://www.foxweather.com/earth-space/manikin-nasa-artemis-moon", "urlToImage": "https://images.foxweather.com/static.foxweather.com/www.foxweather.com/content/uploads/2022/05/1024/512/man.png?ve=1&tl=1", "publishedAt": "2022-05-08T15:25:33Z", "content": "KENNEDY SPACE CENTER, Fla. – When NASA launches its Artemis I moon rocket with the Orion spacecraft, humans will not be aboard, but scientists will be focused on three manikins who will be collecting… [+3667 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA shares pictures of SpaceX Dragon capsule before and after brutal atmospheric re-entry - Republic World", "description": "ESA astronaut Matthias Maurer along with three NASA astronauts recently arrived on Earth after spending six months aboard the International Space Station.", "url": "https://www.republicworld.com/science/space/esa-shares-pictures-of-spacex-dragon-capsule-before-and-after-brutal-atmospheric-re-entry-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/nofh5nrez0zyu3j5_1652020116.jpeg", "publishedAt": "2022-05-08T15:13:00Z", "content": "SpaceX's Dragon capsule splashed down in the Atlantic ocean with four astronauts on May 6, and like every other spacecraft, it went through the unforgiving atmospheric re-entry. It is the phase, whic… [+2272 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Time spent in space changes the structure of astronauts’ brains - Digital Trends", "description": "Researchers have found changes to the brains of astronauts who visited the ISS, with parts of the brain called perivascular spaces expanding.", "url": "https://www.digitaltrends.com/news/astronaut-brains-perivascular-space/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/iss-105mm-forward-mosaic-created-with-imagery-from-expedition-66.jpg", "publishedAt": "2022-05-08T15:00:34Z", "content": "Researchers have found changes in the brains of astronauts who visited the International Space Station, with parts of the brain called perivascular spaces expanding in volume.\r\nThis new study looks a… [+2437 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Some lunar water may have come from Earth's atmosphere - Interesting Engineering", "description": "New research conducted by University of Alaska Fairbanks Geophysical Institute scientists reveals that not all of the moon's water comes from its own surface; some of it is siloed from the Earth's atmosphere.", "url": "https://interestingengineering.com/lunar-water-earth-atmosphere", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/EBwmJQe2O0/sizes/moon-water_md.jpg", "publishedAt": "2022-05-08T14:25:42Z", "content": "Not all of the moon's water comes from its own surface; some of it is siloed from the Earth's atmosphere, according to new research by University of Alaska Fairbanks Geophysical Institute scientists … [+3006 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Dust threatens the future of Mars helicopter Ingenuity - Digital Trends", "description": "The helicopter has re-established a link with the rover after communications were lost this week. But for how long can the plucky helicopter keep going?", "url": "https://www.digitaltrends.com/news/mars-ingeniuty-dust-issue/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/zl0_0114_0677061225_832eby_n0041062zcam08094_0630lmj01_12001.jpg", "publishedAt": "2022-05-08T14:18:48Z", "content": "The Mars helicopter Ingenuity faced a challenge this week when it lost communications with its rover partner Perseverance, marking the first time in its more than one year of operations that it had m… [+4219 chars]"}, {"source": {"id": null, "name": "Ijpr.org"}, "author": "", "title": "Researchers spot a rare type of dragonfish at 1000 feet deep in California - Jefferson Public Radio", "description": "Scientists in Monterey Bay, Calif., found a seldom-seen species of dragonfish swimming nearly 1,000 feet below the ocean's surface.", "url": "https://www.ijpr.org/science-technology/npr-news/2022-05-07/researchers-spot-a-rare-type-of-dragonfish-at-1-000-feet-deep", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/824f366/2147483647/strip/true/crop/944x496+0+106/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2022%2F05%2F07%2Fdragonfish-screenshot-ef81ef468dc7f7dea64a7411ca86ed970b5eeb56.png", "publishedAt": "2022-05-08T14:13:00Z", "content": "Researchers in California recently came across an incredibly elusive type of deep-sea dragonfish nearly 1,000 feet below the ocean surface.\r\nThe highfin dragonfish, bathophilus flemingi, was recently… [+1537 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "See What Happens on the Space Station During an “Orbital Reboost” Maneuver - SciTechDaily", "description": "Get in line with ESA astronaut Matthias Maurer and his Expedition 66 crewmates to experience an orbital reboost of the International Space Station (ISS) from the inside. This video is sped up 8 times faster than real-time. The International Space Station flie…", "url": "https://scitechdaily.com/see-what-happens-on-the-space-station-during-an-orbital-reboost-maneuver/", "urlToImage": "https://scitechdaily.com/images/Matthias-Maurer-ISS-Reboost.gif", "publishedAt": "2022-05-08T13:57:24Z", "content": "Video clip of ESA astronaut Matthias Maurer and his Expedition 66 crewmates experiencing a reboost of the International Space Station. While the video at the bottom of this article is sped up by 8 ti… [+1154 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "James Webb Space Telescope still has 2 months before awakening; NASA scientist reveals why - Republic World", "description": "James Webb Space Telescope's instruments are currently undergoing the thermal stability test, meaning testing at extreme temperatures in outer space.", "url": "https://www.republicworld.com/science/space/james-webb-space-telescope-still-has-2-months-before-awakening-nasa-scientist-reveals-why-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/bkxoaf3vqcvauvs6_1652012442.jpeg", "publishedAt": "2022-05-08T13:05:00Z", "content": "The James Webb Space Telescope, which recently got all its instruments aligned with its primary mirrors, has yet to pass a crucial test that would take another couple of months. Webb's instruments ar… [+2095 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "Canada will now prosecute those who commit crimes on the moon - TweakTown", "description": "Canada has passed an amendment to its Criminal Code, expanding its jurisdiction to allow it to prosecute crimes to the moon.", "url": "https://www.tweaktown.com/news/86052/canada-will-now-prosecute-those-who-commit-crimes-on-the-moon/index.html", "urlToImage": "https://static.tweaktown.com/news/8/6/86052_01_space-criminals-canada-will-start-to-prosecute-crimes-on-the-moon_full.jpg", "publishedAt": "2022-05-08T11:43:06Z", "content": "Canada passed laws on April 28th, 2022, allowing crimes committed on the moon to be prosecuted.\r\nAn amendment to Canada's Criminal Code to allow the change passed with members of parliament voting 18… [+1482 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Corals convert sunscreen chemical into a toxin that kills them - Ars Technica", "description": "The chemical in the sunblock is fine until the coral alters it.", "url": "https://arstechnica.com/science/2022/05/corals-convert-sunscreen-chemical-into-a-toxin-that-kills-them/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/05/GettyImages-110959868-760x380.jpg", "publishedAt": "2022-05-08T11:00:37Z", "content": "13 with 12 posters participating\r\nMedical authorities have spent years convincing people to use sunscreen to limit their exposure to UV light. But that effort has had a bit of a setback, as several l… [+4537 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA astronaut Samantha Christoforetti becomes first TikToker from space; watch video - Republic World", "description": "ESA's Christoforetti arrived at the International Space Station on April 28 with three NASA astronauts-- Robert Hines, Jessica Watkins and Kjell Lindgren.", "url": "https://www.republicworld.com/science/space/esa-astronaut-samantha-christoforetti-becomes-first-tiktoker-from-space-watch-video-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/zl5yomme7urzko34_1652004909.jpeg", "publishedAt": "2022-05-08T10:45:00Z", "content": "European Space Agencys (ESA) decorated astronaut Samantha Christoforetti has added another feather to her cap, shooting the first TikTok video in space. Currently, on her second space mission, Christ… [+2113 chars]"}, {"source": {"id": null, "name": "Buzz.ie"}, "author": "Eithne Dodd", "title": "A blood moon total eclipse will be visible in Ireland this May - Buzz.ie", "description": "The blood moon will also be a super moon", "url": "https://www.buzz.ie/news/irish-news/blood-super-moon-lunar-eclipse-26904814", "urlToImage": "https://i2-prod.buzz.ie/incoming/article26904741.ece/ALTERNATES/s1200/0_GettyImages-913838496.jpg", "publishedAt": "2022-05-08T10:35:45Z", "content": "People in Ireland should be able to see a 'blood moon total lunar eclipse' just before the sun rises on Monday, 16 May. \r\nIn a nutshell \r\nAstronomy Ireland has told Irish stargazers to be on the look… [+1498 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "NASA Likely to Launch Artemis 1 Moon Rocket in August - India.com", "description": "Artemis 1, was earlier scheduled to launch in late May 2022.", "url": "https://www.india.com/science/nasa-likely-to-launch-artemis-1-moon-rocket-in-august-5380516/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/05/4df5585edbeee5b1cbb757019f7dd4ba.jpg", "publishedAt": "2022-05-08T08:56:21Z", "content": "Washington: NASA has yet again delayed its Artemis 1 moon rocket launch and now the US space agency is planning it for August, the media reported. Artemis 1, was earlier scheduled to launch in late M… [+2337 chars]"}, {"source": {"id": null, "name": "Insta Chronicles"}, "author": null, "title": "The Ultimate Guide to Mercenary Enrollment Chapter 84 and All Things Mercenary Here Is the Link for More Information About It - Insta Chronicles", "description": "Mercenary Enrollment Chapter 84 Mercenary Enrollment, popularly seen as Teenage Mercenary, is one of the most famous weekly military-themed anime series whose writer is YC and directed by Rak Hyun. The making and printing of this super hit comic were started …", "url": "https://instachronicles.com/2022/05/08/the-ultimate-guide-to-mercenary-enrollment-chapter-84-and-all-things-mercenary-here-is-the-link-for-more-information-about-it/", "urlToImage": "https://instachronicles.com/wp-content/uploads/2022/05/mercenary-enrollment-chapter-84-release-date-and-time-countdown-when-is-it-coming-out-62664787eaa20-1650870151.jpg", "publishedAt": "2022-05-08T08:21:51Z", "content": "Mercenary Enrollment Chapter 84\r\nMercenary Enrollment, popularly seen as Teenage Mercenary, is one of the most famous weekly military-themed anime series whose writer is YC and directed by Rak Hyun.\r… [+2843 chars]"}, {"source": {"id": null, "name": "mymcmurray.com"}, "author": null, "title": "Blue marshlands store as much carbon as green forests, says study - mymcmurray.com", "description": "VANCOUVER — Estuaries edged by tall grasses and wildflowers that are home to birds, crabs, tiny fish and other wildlife are more effective than young coastal forests at capturing and storing carbon dioxide, says a study.  The Cowichan Estuary on Vancouver Isl…", "url": "https://www.mymcmurray.com/2022/05/08/blue-marshlands-store-as-much-carbon-as-green-forests-says-study/", "urlToImage": "https://www.mymcmurray.com/wp-content/blogs.dir/sites/11/2022/05/20220506190532-6275b05a478c4d45b834d49fjpeg.jpg", "publishedAt": "2022-05-08T08:00:00Z", "content": "VANCOUVER Estuaries edged by tall grasses and wildflowers that are home to birds, crabs, tiny fish and other wildlife are more effective than young coastal forests at capturing and storing carbon dio… [+3860 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Here's a Glimpse at a Future Hothouse Earth if Greenhouse Gasses Aren't Curbed - ScienceAlert", "description": "Throughout our planet's history, Earth has fluctuated between a hothouse and an icehouse.", "url": "https://www.sciencealert.com/here-s-a-glimpse-at-a-future-hothouse-earth-if-greenhouse-gasses-aren-t-curbed", "urlToImage": "https://www.sciencealert.com/images/2022-05/processed/HothouseEarthPastClimate_1024.jpg", "publishedAt": "2022-05-08T06:02:39Z", "content": "Throughout our planet's history, Earth has fluctuated between a hothouse and an icehouse.\r\nToday, our home is supposed to be in a period of global cooling, but human emissions of greenhouse gasses ar… [+3115 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Outgunning NASA’s Hubble, China Claims Its Xuntian Telescope With 350-Fold Bigger View Can Unravel ‘Cosmic Mysteries’ - EurAsian Times", "description": "China is ramping up its efforts to explore the universe as it is set to launch its space telescope ‘Xuntian’ next year. Known as China’s own ‘Hubble,’ authorities in Beijing claim it outmatches the NASA and European Space Agency (ESA) telescope’s capabilities…", "url": "https://eurasiantimes.com/china-claims-its-xuntian-telescope-with-350-fold-bigger/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/05/China-Telescope-e1651981266451.jpg", "publishedAt": "2022-05-08T03:45:39Z", "content": "China is ramping up its efforts to explore the universe as it is set to launch its space telescope Xuntian next year. Known as Chinas own Hubble, authorities in Beijing claim it outmatches the NASA a… [+7503 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA’s Psyche spacecraft is almost ready to launch to a strange metallic asteroid - BollyInside", "description": "There are a variety of weird objects in our solar system, and one of the most intriguing is Psyche, a bizarre metal asteroid. It’s one of the largest", "url": "https://www.bollyinside.com/news/technology/nasas-psyche-spacecraft-is-almost-ready-to-launch-to-a-strange-metallic-asteroid", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/NASAs-Psyche-spacecraft-is-almost-ready-to-launch-to-a.jpeg", "publishedAt": "2022-05-07T22:58:24Z", "content": "There are a variety of weird objects in our solar system, and one of the most intriguing is Psyche, a bizarre metal asteroid. Its one of the largest asteroids in the asteroid belt between Mars and Ju… [+1935 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Reveals Surviving Companion Star in Aftermath of Titanic Supernova Explosion - SciTechDaily", "description": "The discovery helps explain the puzzle of hydrogen loss pre-supernova, and supports the theory that most massive stars are paired. It's not unheard of to find a surviving star at the scene of a massive supernova explosion, which would be expected to obliterat…", "url": "https://scitechdaily.com/hubble-reveals-surviving-companion-star-in-aftermath-of-titanic-supernova-explosion/", "urlToImage": "https://scitechdaily.com/images/Supernova-and-Remnant-Star-Illustration-scaled.jpg", "publishedAt": "2022-05-07T21:09:49Z", "content": "BySpace Telescope Science InstituteMay 7, 2022\r\nThis artists illustration shows supernova 2013ge, with its companion star at the lower right. The companion star is impacted by the blast wave from the… [+13030 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Fiona Connor", "title": "Nasa to SMASH giant asteroid with aircraft at 23,000kph in £240m mission to defend the earth... - The US Sun", "description": "", "url": "https://www.the-sun.com/tech/5289047/nasa-smash-giant-asteroid-aircraft/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/05/hugemeteorslammingintoourplanetsatmosphere-JS728695950-1.jpg?strip=all&quality=100&w=1700&h=1080&crop=1", "publishedAt": "2022-05-07T20:35:00Z", "content": "NASA is set to smash a giant asteroid with an aircraft at 23,000kph in a bid to defend the earth.\r\nThe £240m mission, dubbed DART after Double Asteroid Redirection Test, is expected to take place in … [+2415 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Eta Aquarid meteor shower of 2022 thrills stargazers in these stunning photos - Space.com", "description": "The Eta Aquarids are made up of leftover dust from Halley's Comet.", "url": "https://www.space.com/eta-aquarid-meteor-shower-2022-thrills-stargazers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/d4SjbJ8cSarJKxNLFL3ZtN-1200-80.jpg", "publishedAt": "2022-05-07T19:33:04Z", "content": "Meteor streaks delighted skywatchers this weekend as the Earth passed through the dust trail of Halley's Comet in an annual meteor shower display.\r\nThe Eta Aquarid meteor shower, which is visible in … [+3402 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "ISRO plans mission to Venus, eyes Dec 2024 launch window - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "NEW DELHI, May 5:  After sending missions to the Moon and Mars, ISRO is now readying a spacecraft to orbit Venus to study what lies below the surface of the hottest planet in the solar system and also unravel the mysteries under the sulfuric acid clouds envel…", "url": "https://www.dailyexcelsior.com/isro-plans-mission-to-venus-eyes-dec-2024-launch-window-3/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/02/ISRO.jpg", "publishedAt": "2022-05-07T19:20:49Z", "content": "NEW DELHI, May 5:  After sending missions to the Moon and Mars, ISRO is now readying a spacecraft to orbit Venus to study what lies below the surface of the hottest planet in the solar system and als… [+2273 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Long-range quantum entanglement needs three-way interaction — ScienceDaily - Verve Times", "description": "A theoretical study shows that long-range entanglement can indeed survive at temperatures above absolute zero, if the correct conditions are met.Quantum computing has been earmarked as the next revolutionary step in computing. However current systems", "url": "https://vervetimes.com/long-range-quantum-entanglement-needs-three-way-interaction-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-07T18:58:50Z", "content": "A theoretical study shows that long-range entanglement can indeed survive at temperatures above absolute zero, if the correct conditions are met.Quantum computing has been earmarked as the next revol… [+3670 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Space Telescope: Not Yet Imagined [Video] - SciTechDaily", "description": "Hubble's launch and deployment in April 1990 marked the most significant advance in astronomy since Galileo's telescope. Thanks to five servicing missions and more than 30 years of operation, our view of the universe and our place within it has never been the…", "url": "https://scitechdaily.com/hubble-space-telescope-not-yet-imagined-video/", "urlToImage": "https://scitechdaily.com/images/Hubble-Space-Telescope-Not-Yet-Imagined.jpg", "publishedAt": "2022-05-07T17:28:51Z", "content": "ByNASA's Goddard Space Flight CenterMay 7, 2022\r\nThe Hubble Space Telescope was launched by the space shuttle Discovery on April 24, 1990. Avoiding distortions of the atmosphere, Hubble has an unobst… [+2822 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Research suggests minerals might be key to healing damaged tissue - The Siasat Daily", "description": "Washington: A collaboration between researchers in the Department of Biomedical Engineering and the College of Medicine at Texas A&M University identifies the crucial role of minerals in regulating gene expression, thus controlling the number of proteins that…", "url": "https://www.siasat.com/research-suggests-minerals-might-be-key-to-healing-damaged-tissue-2322543/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/05/tissue_may7.jpg", "publishedAt": "2022-05-07T17:19:00Z", "content": "Washington: A collaboration between researchers in the Department of Biomedical Engineering and the College of Medicine at Texas A&amp;M University identifies the crucial role of minerals in regulati… [+4767 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Is that a space jellyfish? SpaceX rocket launch illuminates sky, gives visual treat to viewers - WION", "description": "The residents of Florida were in for a visual treat when SpaceX launched 53 internet satellites, known as Starlinks satellite, into space.", "url": "https://www.wionews.com/world/is-that-a-space-jellyfish-spacex-rocket-launch-illuminates-sky-gives-visual-treat-to-viewers-477189", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/07/260543-space.jpg", "publishedAt": "2022-05-07T15:49:15Z", "content": "The residents of Florida were in for a visual treat when SpaceX launched 53 internet satellites, known as Starlinks satellite, into space.\r\nThe Falcon 9 rocket's launch didnt create any excitement pe… [+1898 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/nancy.atkinson4", "title": "This is a Dust Avalanche on Mars - Universe Today", "description": "For decades, scientists have observed dark landslides called slope streaks on Mars. First seen by the Viking orbiters in the 1970s, every orbiter mission since has observed them, but the mechanism behind the slope streaks has been hotly debated: could they be…", "url": "https://www.universetoday.com/155796/this-is-a-dust-avalanche-on-mars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/05/E1-PIA25235-HiRISE_Spots_Splitting_Slope_Stre.width-1320.jpg", "publishedAt": "2022-05-07T15:09:40Z", "content": "For decades, scientists have observed dark landslides called slope streaks on Mars. First seen by the Viking orbiters in the 1970s, every orbiter mission since has observed them, but the mechanism be… [+4941 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Steve Carr", "title": "New research provides possible insights into the formation of Earth - Phys.org", "description": "A new study, conducted by scientists at The University of New Mexico, found ancient, primordial helium-3 leaking from the Earth's core, suggesting the planet formed inside a solar nebula, stirring further debate among scientists.", "url": "https://phys.org/news/2022-05-insights-formation-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/earth.jpg", "publishedAt": "2022-05-07T14:10:01Z", "content": "A new study, conducted by scientists at The University of New Mexico, found ancient, primordial helium-3 leaking from the Earth's core, suggesting the planet formed inside a solar nebula, stirring fu… [+8977 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Scientists are preparing a message to be broadcast in space but say humanity will not hear it - The bharat express news", "description": "Scientists prepare to send a message into space to contact the aliens, but doubt humanity's ability to survive long enough to receive an answer. A team of", "url": "https://www.thebharatexpressnews.com/scientists-are-preparing-a-message-to-be-broadcast-in-space-but-say-humanity-will-not-hear-it/", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article26899954.ece/ALTERNATES/s615b/2_500M-Aperture-Spherical-Telescope-Soon-To-Put-Into-Use.jpg", "publishedAt": "2022-05-07T12:24:03Z", "content": "Scientists prepare to send a message into space to contact the aliens, but doubt humanity’s ability to survive long enough to receive an answer.\r\nA team of boffins working on the Beacon in the Galaxy… [+2905 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Moon's soil can produce oxygen and fuel, say Chinese study - DNA India", "description": "Chinese scientists have told in their study that there are active substances in the lunar soil that can convert carbon dioxide into oxygen and fuel.", "url": "https://www.dnaindia.com/science/report-moon-soil-can-produce-oxygen-and-fuel-say-chinese-study-nanjing-university-scientists-2951255", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/05/07/1757798-change-5-lunar-samples-reuters.jpg", "publishedAt": "2022-05-07T11:59:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: May 07, 2022, 05:31 PM ISTIntensive research is going on to create habitable conditions for humans on the Moon. This includes bas… [+3110 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA: Asteroid, larger than the Eiffel Tower, set to get dangerously close to Earth - HT Tech", "description": "A large 1,600-feet wide asteroid is speeding towards the Earth, says NASA. Know the chances of it striking our planet.", "url": "https://tech.hindustantimes.com/tech/news/nasa-asteroid-larger-than-the-eiffel-tower-set-to-get-dangerously-close-to-earth-71651922975728.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/07/1600x900/asteroid-g5603adab3_1920_1647078503425_1651923013457.jpg", "publishedAt": "2022-05-07T11:31:37Z", "content": "A gigantic asteroid is rushing towards the Earth, according to the American space agency NASA. The asteroid is 1,600-feet wide and will make its closest approach to the Earth on Monday, May 9th. Unli… [+2188 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Salty groundwater system found under ice sheet in Antarctica, implicating sea level rise - Moneycontrol", "description": "Our findings suggest that this salty groundwater is the largest reservoir of liquid water below the ice stream we studied and likely others, and it may be affecting how the ice flows in Antarctica, scientists said.", "url": "https://www.moneycontrol.com/news/environment/salty-groundwater-system-found-under-ice-sheet-in-antarctica-implicating-sea-level-rise-8469721.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/Glacier-770x433.jpg", "publishedAt": "2022-05-07T10:42:38Z", "content": "A new discovery deep beneath one of Antarctica's rivers of ice could change scientists' understanding of how the ice flows, with important implications for estimating future sea-level rise.\r\nGlacier … [+5222 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Before there were birds or bees, this is how trilobites made babies - Deccan Herald", "description": "The sturdy, calcite-infused exoskeletons of trilobites and their segmented shells are nearly ubiquitous in fossil deposits from the Cambrian Period to the Permian. But this trove of trilobite fossils has revealed frustratingly little when it comes to how the …", "url": "https://www.deccanherald.com/science-and-environment/before-there-were-birds-or-bees-this-is-how-trilobites-made-babies-1107248.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/07/istock-478272718-1-1107248-1651918787.jpg", "publishedAt": "2022-05-07T10:19:47Z", "content": "The sturdy, calcite-infused exoskeletons of trilobites and their segmented shells are nearly ubiquitous in fossil deposits from the Cambrian Period to the Permian. But this trove of trilobite fossils… [+4434 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Mysterious 'Black Widow' Binary With Shortest Orbit Yet Discovered. Here's What We Know So Far - ABP Live", "description": "The stellar oddity is a new 'black widow binary', which is a rapidly spinning neutron star, or pulsar, that is circling and slowly consuming a smaller companion star.", "url": "https://news.abplive.com/science/mysterious-black-widow-binary-with-shortest-orbit-yet-discovered-here-is-what-we-know-so-far-1530331", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/05/07/68755e7ea080deedee1ecf0fa28c5982_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-05-07T10:19:15Z", "content": "New Delhi: Astronomers at the Massachusetts Institute of Technology (MIT) in the United States have discovered a new and mysterious system 3,000 light-years from Earth, thanks to the flashing of a ne… [+5719 chars]"}, {"source": {"id": null, "name": "Inferse.com"}, "author": "https://www.facebook.com/profile.php?id=100006133201346", "title": "Space agency wants YOU to study comet images and reveal solar system secrets – can you spot the d… – The US Sun - Inferse", "description": "THE European Space Agency has asked the public to assess photos of a comet in a 'cosmic game of spot the difference'.On Thursday, the ESA revealed Rosetta Zoo, a citizen science project launched with Zooniverse (a web portal owned and operated by the Citizen …", "url": "https://www.inferse.com/76708/space-agency-wants-you-to-study-comet-images-and-reveal-solar-system-secrets-can-you-spot-the-d-the-us-sun/", "urlToImage": "https://www.inferse.com/wp-content/uploads/2022/05/wp-header-logo-3998-1000x600.png", "publishedAt": "2022-05-07T08:48:45Z", "content": "THE European Space Agency has asked the public to assess photos of a comet in a 'cosmic game of spot the difference'.On Thursday, the ESA revealed Rosetta Zoo, a citizen science project launched with… [+3075 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Scary solar storm today! May cause blackouts in various regions on Earth- check its effects - HT Tech", "description": "According to NOAA, a solar storm will strike Earth today. The solar storm today can cause radio blackouts in various regions on the planet. Check out its full effects and what we can expect.", "url": "https://tech.hindustantimes.com/tech/news/scary-solar-storm-today-may-cause-blackouts-in-various-regions-on-earth-check-its-effects-71651911995159.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/07/1600x900/Solar_Flare_1630605449921_1651912048495.jpg", "publishedAt": "2022-05-07T08:29:38Z", "content": "Another scary solar storm is going to strike the Earth today, according to the National Oceanic and Atmospheric Administration (NOAA). Lately, the Sun has been shooting solar flares incessantly. And … [+2257 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Scientists Are Worried That a Space Rock Harvested by NASA Could Bring Back Killer Germs to Earth - Galaxy Reporters", "description": "NASA is currently holding public meetings this week and asking for feedback about its sample retrieval plans. The space agency plans to land a spacecraft with Martian samples at a U.S. Air Force base in the early 2030s. That’s still a long way off, but some s…", "url": "https://galaxyreporters.com/scientists-are-worried-that-a-space-rock-harvested-by-nasa-could-bring-back-killer-germs-to-earth/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/Scientists-worried-Mars-rocks-retrieved-by-NASA-may-host-alien-germs.webp", "publishedAt": "2022-05-07T07:45:57Z", "content": "NASA is currently holding public meetings this week and asking for feedback about its sample retrieval plans. The space agency plans to land a spacecraft with Martian samples at a U.S. Air Force base… [+1318 chars]"}, {"source": {"id": null, "name": "Gizbot"}, "author": "Sharmishte Datti", "title": "NASA To Study Lunar Samples After 50 Years; Could Aid In Upcoming Artemis Mission - Gizbot", "description": "NASA has several ambitious missions lined up. The astronauts back then collected various rocks and dust from the Moon but NASA didn’t have the technology to examine them. Now, 50 years later, NASA is studying the lunar samples.", "url": "https://www.gizbot.com/news/nasa-to-study-lunar-samples-after-50-years-could-aid-in-upcoming-artemis-mission-080517.html", "urlToImage": "https://www.gizbot.com/img/2022/05/nasa-to-study-lunar-samples-after-50-years1-1651906147.jpg", "publishedAt": "2022-05-07T06:51:34Z", "content": "NASA has several ambitious missions lined up. But if we look back 50 years, the NASA Apollo 1 mission was one of the most dangerous and ambitious ones. The astronauts back then collected various rock… [+2414 chars]"}, {"source": {"id": null, "name": "Parisbeacon.com"}, "author": "Paris Beacon", "title": "They confirm that the international project to measure gravitational waves in space is feasible and is ente... - Paris Beacon News", "description": "The joint project of the European Space Agency (ESA) and NASA to build an orbital observatory with the aim of detecting and measuring gravitational waves has successfully passed phase A, the examination of its feasibility by an international panel of experts.…", "url": "https://www.parisbeacon.com/96164/", "urlToImage": "https://www.parisbeacon.com/wp-content/uploads/2022/05/They-confirm-that-the-international-project-to-measure-gravitational-waves.jpg", "publishedAt": "2022-05-07T06:48:29Z", "content": "The joint project of the European Space Agency (ESA) and NASA to build an orbital observatory with the aim of detecting and measuring gravitational waves has successfully passed phase A, the examinat… [+1757 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Lonnie Lee Hood", "title": "Elon Musk's #2 Says Humanity Will Be on Mars Within the Decade - Futurism", "description": "One of SpaceX's top employees said in a conference this week that SpaceX will likely make it to Mars before the NASA Artemis mission does.", "url": "https://futurism.com/the-byte/elon-musk-team-humanity-mars-decade-space", "urlToImage": "https://wp-assets.futurism.com/2022/05/elon-musk-team-humanity-mars-decade-space.png", "publishedAt": "2022-05-07T05:35:39Z", "content": "\"People on the Moon sooner.\"\r\nBetter, Faster\r\nOne of SpaceXs top employees said in a conference this week that SpaceX will likely make it to Mars before the NASA Artemis mission does.\r\nSpaceX\r\n Presi… [+1585 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Citizen science initiative spots 1,701 asteroids in archival Hubble data - News9 LIVE", "description": "Over 20 years of observations was used in the hunt for asteroids", "url": "https://www.news9live.com/science/citizen-science-initiative-spots-1701-asteroids-in-archival-hubble-data-168821", "urlToImage": "https://media.news9live.com/h-upload/2022/05/07/338870-heic2207acropped.jpg", "publishedAt": "2022-05-07T05:30:45Z", "content": "On the International Asteroid Day in 2019, which falls on June 30, an international group of astronomers initiated the Hubble Asteroid Hunter citizen science project to identify asteroid streaks in a… [+4517 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Shailaja Tripathi", "title": "International Astronomy Day 2022: Meteor Showers, eclipses- Check 5 major astronomical events of 2022 - Jagran Josh", "description": "Astronomy Day: On the International Astronomy Day 2022, learn more about the essence of the day and some of the major astronomical events of 2022.", "url": "https://www.jagranjosh.com/current-affairs/international-astronomy-day-2022-meteor-showers-eclipses-check-5-major-astronomical-events-of-2022-1651901539-1", "urlToImage": "https://img.jagranjosh.com/images/2022/May/752022/Astronomy_day.jpg", "publishedAt": "2022-05-07T05:28:00Z", "content": "Astronomy Day 2022: International Astronomy Day is observed on May 7 to make people aware of one of the greatest natural sciences that exist in the world- Astronomy. The International Astronomy Day 2… [+3623 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Warning! On May 7, solar storm will pass through Earth, says NOAA. Find out its effects - WION", "description": "On Saturday (May 7), the world may witness minor radio blackouts. Well, if you do, it may be due to a weak solar storm, which will pass through Earth, the National Oceanic and Atmospheric Administration (NOAA) said.", "url": "https://www.wionews.com/science/warning-on-may-7-weak-solar-storm-will-pass-through-earth-says-noaa-find-out-its-effects-476915", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/06/260283-solar-flare.jpg", "publishedAt": "2022-05-06T15:35:12Z", "content": "On Saturday (May 7), the world may witness minor radio blackouts. Well, if you do, it may be due to a weak solar storm, which will pass through Earth, the National Oceanic and Atmospheric Administrat… [+1136 chars]"}, {"source": {"id": null, "name": "FOX 7 Austin"}, "author": "FOX TV Digital Team", "title": "1st solar eclipse of 2022 appears in southern skies - FOX 10 News Phoenix", "description": "The first solar eclipse of 2022 appeared in southern skies Saturday. Here’s when another partial one is expected later this year — and when the big total eclipse is coming to America that everyone’s been waiting for.", "url": "https://www.fox7austin.com/news/1st-solar-eclipse-of-2022-appears-in-southern-skies", "urlToImage": "https://images.foxtv.com/static.fox10phoenix.com/www.fox10phoenix.com/content/uploads/2022/05/1280/720/2220_Eclipse_Panel-1280x900.jpg?ve=1&tl=1", "publishedAt": "2022-05-01T17:14:33Z", "content": "The first solar eclipse of 2022 graced southern skies this weekend.\r\nOn Saturday, April 30, people in parts of southern South America, Antarctica and the Pacific and Southern Oceans witnessed a parti… [+1820 chars]"}]}