{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Wisconsin-Madison: New study allows researchers to more efficiently form human heart cells from stem cells - India Education Diary", "description": "Lab-grown human heart cells provide a powerful tool to understand and potentially treat heart disease. However, the methods to produce human heart cells from pluripotent stem cells are not optimal. Fortunately, a new study out of the University of Wi", "url": "https://indiaeducationdiary.in/university-of-wisconsin-madison-new-study-allows-researchers-to-more-efficiently-form-human-heart-cells-from-stem-cells/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/uw-logo-color-flush-300x180-2.png", "publishedAt": "2022-07-02T07:52:22Z", "content": "Lab-grown human heart cells provide a powerful tool to understand and potentially treat heart disease. However, the methods to produce human heart cells from pluripotent stem cells are not optimal. F… [+4225 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UC San Diego: “Soft” CRISPR May Offer a New Fix for Genetic Defects - India Education Diary", "description": "Curing debilitating genetic diseases is one of the great challenges of modern medicine. During the past decade, development of CRISPR technologies and advancements in genetics research brought new hope for patients and their families, although the sa", "url": "https://indiaeducationdiary.in/uc-san-diego-soft-crispr-may-offer-a-new-fix-for-genetic-defects/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/1200px-University_of_California_San_Diego_seal.svg_-1024x1024.png", "publishedAt": "2022-07-02T07:43:06Z", "content": "Curing debilitating genetic diseases is one of the great challenges of modern medicine. During the past decade, development of CRISPR technologies and advancements in genetics research brought new ho… [+3748 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Utrecht University: Deep Atlantic Ocean used to be 20 °C in past ‘greenhouse climate’ - India Education Diary", "description": "A new study of the temperature of ancient oceans shows that the deep Atlantic Ocean was once a balmy 20 °C - , similar to the surface of the modern Mediterranean. Scientists say the new data, which covers the last 60 million years, shows the huge imp", "url": "https://indiaeducationdiary.in/utrecht-university-deep-atlantic-ocean-used-to-be-20-c-in-past-greenhouse-climate/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/1200px-Utrecht_University_logo.svg_-1024x1024.png", "publishedAt": "2022-07-02T07:14:26Z", "content": "A new study of the temperature of ancient oceans shows that the deep Atlantic Ocean was once a balmy 20 °C – , similar to the surface of the modern Mediterranean. Scientists say the new data, which c… [+2488 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Giant comet twice the size of Mt. Everest to pass through Earth in July - WION", "description": "Comet C2017 K2 was first spotted by the Hubble Space Telescope on the outer reaches of the solar system in 2017", "url": "https://www.wionews.com/science/giant-comet-twice-the-size-of-mt-everest-to-pass-through-earth-in-july-493757", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/07/02/275881-comet.jpg", "publishedAt": "2022-07-02T05:55:10Z", "content": "An enormous comet that is twice the size of Mount Everest has entered the inner part of our solar system and is about to pass through Earth in July.\r\nComet C/2017 K2 (PANSTARRS), called K2 for short,… [+1912 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Tonga volcano eruption was among the most powerful ever observed - Tech Explorist", "description": "The eruption triggered atmospheric gravity waves reaching the edge of space.", "url": "https://www.techexplorist.com/tonga-volcano-eruption-among-most-powerful-ever-observed/52252/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/07/Hunga-Tonga-Hunga-Haapai.jpg", "publishedAt": "2022-07-02T05:50:55Z", "content": "Hunga TongaHunga Ha’apai is a submarine volcano in the South Pacific ocean. On 20 December 2021, an eruption began on Hunga TongaHunga Ha’apai. About four weeks later, on 15 January 2022, the eruptio… [+2751 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This “riskiest asteroid known to humankind” was set to strike Earth but then THIS happened - HT Tech", "description": "The European Space Agency labeled a 50-meter wide asteroid as the “riskiest asteroid known to humankind in the last year” because of its high probability to hit the Earth. But something has changed.", "url": "https://tech.hindustantimes.com/tech/news/this-riskiest-asteroid-known-to-humankind-was-set-to-strike-earth-but-then-this-happened-71656740601565.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/02/1600x900/ygy_1637905928669_1656740634529.jpg", "publishedAt": "2022-07-02T05:47:07Z", "content": "On June 30, 2022, the world observed the International Asteroid Day. But days building up to it were extremely dramatic for the space agencies across the globe because of an asteroid named 2021 QM1. … [+2600 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New York University: Scientists Engineer Synthetic DNA to Study “Architect” Genes - India Education Diary", "description": "Researchers at New York University have created artificial Hox genes—which plan and direct where cells go to develop tissues or organs—using new synthetic DNA technology and genomic engineering in stem cells.Their findings, published in Science, conf", "url": "https://indiaeducationdiary.in/new-york-university-scientists-engineer-synthetic-dna-to-study-architect-genes/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/New_York_University-Logo.wine_-2-1024x683.png", "publishedAt": "2022-07-02T05:40:35Z", "content": "Researchers at New York University have created artificial Hox geneswhich plan and direct where cells go to develop tissues or organsusing new synthetic DNA technology and genomic engineering in stem… [+4282 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Sakshi Tiwari", "title": "1st Country To “Master Mars” – China Releases Stunning Images Of Red Planet As It Aims To Beat US In Space Race - EurAsian Times", "description": "China’s first interplanetary exploration mission, the Tianwen-1 Mars probe, was successfully launched on July 23, 2020. It had achieved an extraordinary feat by orbiting, landing, and traveling across the Red Planet. Two years later, the Tianwen-1 probe has c…", "url": "https://eurasiantimes.com/1st-country-to-master-mars-china-releases-stunning-images-of-red-planet/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/07/Tianwen-1-1.jpg", "publishedAt": "2022-07-02T04:47:56Z", "content": "China’s first interplanetary exploration mission, the Tianwen-1 Mars probe, was successfully launched on July 23, 2020. It had achieved an extraordinary feat by orbiting, landing, and traveling acros… [+6568 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Higgs boson ten years after its discovery why this particle could unlock new physics beyond the standard model - The Week", "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI", "url": "https://www.theweek.in/wire-updates/international/2022/07/02/fgn3-higgs-boson.html", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2022-07-02T03:46:29Z", "content": "By Martin Bauer and Stephen Jones, Durham UniversityDurham (UK), Jul 2 (The Conversation) Ten years ago, scientists announced the discovery of the Higgs boson, which helps explain why elementary part… [+6582 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Happy Birthday Mylswamy Annadurai: All you need to know about the Moon Man of India - CNBCTV18", "description": "Mylswamy Annadurai, the ‘Moon Man of India’, turns 64 on July 2. Annadurai served as the director for India’s lunar probes, Chandrayaan-1 and Chandrayaan-2, earning him the title of the ‘Moon Man of India’.", "url": "https://www.cnbctv18.com/india/mylswamy-annadurai-moon-man-of-india-birthday-all-you-need-to-know-14007712.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/07/Mylswamy_Annadurai-1019x573.jpg", "publishedAt": "2022-07-02T03:44:00Z", "content": "MiniMylswamy Annadurai, the Moon Man of India, turns 64 on July 2. Annadurai served as the director for Indias lunar probes, Chandrayaan-1 and Chandrayaan-2, earning him the title of the Moon Man of … [+5 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unusual Fossil Galaxy Discovered on Outskirts of Andromeda – Could Reveal History of the Universe - SciTechDaily", "description": "Gemini North telescope reveals a relict of the earliest galaxies. A unique ultra-faint dwarf galaxy has been discovered on the outer fringes of the Andromeda Galaxy thanks to the discerning eyes of an amateur astronomer examining archival data processed by NS…", "url": "https://scitechdaily.com/unusual-fossil-galaxy-discovered-on-outskirts-of-andromeda-could-reveal-history-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Ultra-Faint-Dwarf-Galaxy-Pegasus-V-Circled.jpg", "publishedAt": "2022-07-02T01:21:48Z", "content": "ByAssociation of Universities for Research in Astronomy (AURA)July 1, 2022\r\nAn amateur astronomers keen eyes led to the discovery of an unusual ultra-faint dwarf galaxy on the outskirts of the Androm… [+9011 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Summer Nights Call for Stargazing! Look out for Some of July's Celestial Events, ... - Latest Tweet by - LatestLY", "description": "The latest Tweet by NASA states, 'Summer nights call for stargazing! Look out for some of July’s celestial events, including the planets of dawn, the “Dog Days of Summer” and an astronomical teapot pointing to the center of the Milky Way. All this and more in…", "url": "https://www.latestly.com/socially/technology/science/summer-nights-call-for-stargazinglook-out-for-some-of-julys-celestial-events-latest-tweet-by-nasa-3898108.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/04/nasa-784x441.jpg", "publishedAt": "2022-07-01T20:27:54Z", "content": "Summer nights call for stargazing!\r\nLook out for some of Julys celestial events, including the planets of dawn, the Dog Days of Summer and an astronomical teapot pointing to the center of the Milky W… [+634 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "There's a Change Happening to Earth's Outer Core, as Revealed by Seismic Wave Data - ScienceAlert", "description": "Most of our knowledge about what sits at the center of our planet comes from the study of seismic waves rolling out from earthquakes. Careful analysis of these waves can reveal the composition of rocks and metal below Earth's surface.", "url": "https://www.sciencealert.com/two-groups-of-seismic-waves-show-how-earth-s-outer-core-is-changing", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/EarthCore_1024.jpg", "publishedAt": "2022-07-01T20:19:24Z", "content": "Most of our knowledge about what sits at the center of our planet comes from the study of seismic waves rolling out from earthquakes. Careful analysis of these waves can reveal the composition of roc… [+3553 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Spoorthy Raman", "title": "A rocky world beyond ours - Deccan Herald", "description": "A rocky world beyond ours", "url": "https://www.deccanherald.com/science-and-environment/a-rocky-world-beyond-ours-1123039.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/07/02/file7lo8bqvvz50r3b4y4bu-1123039-1656702901.jpg", "publishedAt": "2022-07-01T18:44:32Z", "content": "The universe is an interesting medley of diverse objects. There are giant, heavy black holes and galaxy superclusters, and then there are infinitesimally tiny, invisible quarks and electrons that mak… [+2140 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Dinosaurs took over amid ice, not warmth, says a new study of ancient mass extinction - Phys.org", "description": "Many of us know the conventional theory of how the dinosaurs died 66 million years ago: in Earth's fiery collision with a meteorite, and a following global winter as dust and debris choked the atmosphere. But there was a previous extinction, far more mysterio…", "url": "https://phys.org/news/2022-07-dinosaurs-ice-warmth-ancient-mass.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/dinosaurs-took-over-am.jpg", "publishedAt": "2022-07-01T18:00:04Z", "content": "Many of us know the conventional theory of how the dinosaurs died 66 million years ago: in Earth's fiery collision with a meteorite, and a following global winter as dust and debris choked the atmosp… [+9088 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "Lost in space: Astronauts struggle to regain bone density - HT Tech", "description": "Previous research has shown astronauts lose between one to two percent of bone density for every month spent in space, as the lack of gravity takes the pressure off their legs when it comes to standing and walking.", "url": "https://tech.hindustantimes.com/tech/news/lost-in-space-astronauts-struggle-to-regain-bone-density-71656664363990.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/01/1600x900/SPACE-EXPLORATION-SPACEWALK-2_1638462509111_1656669735454.JPG", "publishedAt": "2022-07-01T17:16:20Z", "content": "Astronauts lose decades' worth of bone mass in space that many do not recover even after a year back on Earth, researchers said Thursday, warning that it could be a \"big concern\" for future missions … [+3364 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Jessica Hall", "title": "Northrop Grumman's Cygnus Spacecraft Successfully Boosts The International Space Station - ExtremeTech", "description": "The Cygnus module boosted the ISS' orbit before heading back to Earth earlier this week, instead of relying on Russian rockets.", "url": "https://www.extremetech.com/extreme/337621-northrop-grummans-cygnus-spacecraft-successfully-boosts-the-international-space-station", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2022/06/NASA-Cygnus-Feature-640x353.jpg", "publishedAt": "2022-07-01T17:02:00Z", "content": "After a successful attempt to boost the International Space Station into a higher orbit earlier this week, Northrop Grumman’s Cygnus NG-17 spacecraft has burned up in a controlled destructive descent… [+2988 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Video: A satellite has clicked `selfie` from space - WION", "description": "The satellite even used a selfie stick to click the photo. The satellite is owned by a company and is revolving around the Earth in an orbit 550 kilometres from the surface", "url": "https://www.wionews.com/science/video-a-satellite-has-clicked-selfie-from-space-493663", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/07/01/275798-selfie.jpg", "publishedAt": "2022-07-01T16:46:14Z", "content": "The word 'Selfie' was the 'word of the year' of Oxford Dictionaries in 2013. The concept was new in the preceding years. But since then the word (and photos) have become almost a second nature to us.… [+1336 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "The case is building that colliding neutron stars create magnetars - Phys.org", "description": "Magnetars are some of the most fascinating astronomical objects. One teaspoon of the stuff they are made out of would weigh almost one billion tons, and they have magnetic fields that are hundreds of millions of times more powerful than any magnetic field tha…", "url": "https://phys.org/news/2022-07-case-colliding-neutron-stars-magnetars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/the-case-is-building-t.jpg", "publishedAt": "2022-07-01T16:20:40Z", "content": "Magnetars are some of the most fascinating astronomical objects. One teaspoon of the stuff they are made out of would weigh almost one billion tons, and they have magnetic fields that are hundreds of… [+4013 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Space Station Science Highlights: Week of June 27, 2022 - NASA", "description": "Crew members aboard the International Space Station conducted scientific investigations during the week of June 27 that included collecting standard health and performance measures, testing new techniques for growing plants, and demonstrating wireless data tr…", "url": "https://www.nasa.gov/mission_pages/station/research/news/space-station-science-highlights-27jun22/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/02_iss067e119939_large_cristoforetti_in_cupola.jpg", "publishedAt": "2022-07-01T15:47:58Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Donavyn Coffey", "title": "Octopuses may be so terrifyingly smart because they share humans' genes for intelligence - Livescience.com", "description": "Genetic sequences called transposons help regulate learning.", "url": "https://www.livescience.com/jumping-genes-octopus-intelligence", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vKqpjY9KYKPmxBLbVxwTpf-1200-80.jpg", "publishedAt": "2022-07-01T15:30:18Z", "content": "Octopuses are brainy creatures with sophisticated smarts, and now scientists have uncovered a clue that may partly explain the cephalopods' remarkable intelligence: Its genes have a genetic quirk tha… [+3327 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Laurence Malcom", "title": "Researchers discover giant bacteria in mangrove ecosystems - Persia Digest", "description": "Researchers at Lawrence Berkeley National Laboratory, or Berkeley Laboratory, have discovered giant bacteria in Guadeloupe’s marine systems, which are remarkably unusual because they can be seen with the naked eye. According to a Berkeley Lab press release, t…", "url": "https://persiadigest.com/researchers-discover-giant-bacteria-in-mangrove-ecosystems/", "urlToImage": null, "publishedAt": "2022-07-01T15:27:52Z", "content": "Researchers at Lawrence Berkeley National Laboratory, or Berkeley Laboratory, have discovered giant bacteria in Guadeloupe’s marine systems, which are remarkably unusual because they can be seen with… [+2663 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA captures breathtaking image of an eclipse from space - WION", "description": "The amazing photo of the solar eclipse from space has been clicked by NASAs Solar Dynamics Observatory (SDO) which is in orbit around the Earth", "url": "https://www.wionews.com/science/nasa-captures-breathtaking-image-of-an-eclipse-from-space-493644", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/07/01/275771-nasa-solar-eclipse.jpg", "publishedAt": "2022-07-01T15:27:16Z", "content": "Solar eclipse is a wonder to behold when viewed from Earth in first. Not everyone of us has been lucky enough to experience this wonder of nature. If the celestial event is so impressive from our pla… [+1445 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Tricky Mars rocks making things difficult for NASA's Perseverance rover - Space.com", "description": "Collecting samples on another planet isn't as easy as it looks.", "url": "https://www.space.com/nasa-perseverance-mars-rover-rock-problems", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5APV8qmTBufbcFy2HZ2RDS-1200-80.jpg", "publishedAt": "2022-07-01T15:00:04Z", "content": "NASA's Perseverance rover is on the hunt for the \"goldilocks\" of rocks to sample on Mars. \r\nOne of the key goals of Perseverance's mission\r\n is to collect rock samples that will be returned to Earth … [+3339 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Wandering Star could bring comet shower on Earth in about a million years’ time, all details here - Economic Times", "description": "Earth could be in trouble as a wandering star enters our solar system in a million years from now which can end up in a lethal comet shower.", "url": "https://economictimes.indiatimes.com/news/international/us/wandering-star-could-bring-comet-shower-on-earth-in-about-a-million-years-time-all-details-here/articleshow/92602364.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92602334,width-1070,height-580,imgsize-449162,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-01T14:13:00Z", "content": "One of the most popular doomsday movie themes is a huge asteroid aiming for Earth accidentally discovered by a scientist. Comets with prominent long streaming tails are pretty huge objects made of ic… [+2396 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Tech Desk", "title": "NASA to send a telescope on a football sized balloon to observe the Milky Way Galaxy - Times Now", "description": "NASA plans on using a balloon larger than a football field to send a telescope about 40,000 meters above Antarctica, where it will study a phenomenon that chokes off star formation in some galaxies, effectively killing them.", "url": "https://www.timesnownews.com/technology-science/nasa-to-send-a-telescope-on-a-football-sized-balloon-to-observe-the-milky-way-galaxy-article-92601144", "urlToImage": "https://static.tnn.in/thumb/msid-92601144,imgsize-100,width-1280,height-720,resizemode-75/92601144.jpg", "publishedAt": "2022-07-01T13:10:40Z", "content": "Alia Bhatt, Ranbir Kapoor expecting first child! Actress announces pregnancy with adorable pic from hospital - SEE INSIDE"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Astronomers simulate evolution of jets associated with collapsing star - News9 LIVE", "description": "This is the first complete, three dimensional simulation of its kind", "url": "https://www.news9live.com/science/astronomers-simulate-evolution-of-jets-associated-with-collapsing-star-180012", "urlToImage": "https://media.news9live.com/h-upload/2022/07/01/447646-jet-star.jpg", "publishedAt": "2022-07-01T12:47:26Z", "content": "For the first time, researchers have simulated the jets formed by a collapsar, or a collapsing star. These jets generate gamma ray bursts (GRBs), which are among the most luminous and energetic event… [+4150 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "James Webb Space Telescope ready to detect exoplanets as 2nd instrument ready for science - Republic World", "description": "The James Webb Space Telescope (JWST) is halfway to uncovering secrets of the universe after the readiness of its second instrument, NASA announced.", "url": "https://www.republicworld.com/science/space/james-webb-space-telescope-ready-to-detect-exoplanets-as-2nd-instrument-ready-for-science-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/zccpuaxgilct5l3h_1656678236.jpeg", "publishedAt": "2022-07-01T12:29:00Z", "content": "NASA recently announced that the James Webb Space Telescope (JWST) is halfway to uncovering secrets of the universe, as two of its four instruments are completely ready for science. The latest instru… [+2343 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "Amit Malewar", "title": "Using microbes to make highly energy-dense rocket fuels - Inceptive Mind", "description": "A new class of energy-dense biofuels based on one of nature's most unique molecules.", "url": "https://www.inceptivemind.com/using-microbes-make-highly-energy-dense-rocket-fuels/25283/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2022/07/ocketfuel-from-bacteria.jpg", "publishedAt": "2022-07-01T11:11:15Z", "content": "Freeing the global economy from its dependence on petroleum is key to slowing down the pace of climate change. Energy-demanding applications like rocketry, aviation, and shipping are fueled with petr… [+3463 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Astronomers detect the most distant galaxy rotation ever observed - Tech Explorist", "description": "Capturing the onset of galaxy rotation in the early universe.", "url": "https://www.techexplorist.com/astronomers-detect-distant-galaxy-rotation-ever-observed/52244/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/07/MACS1149-JD1.jpg", "publishedAt": "2022-07-01T11:01:13Z", "content": "With powerful telescopes, astronomers could detect more and more distant galaxies. Interestingly, they can estimate how fast a galaxy is moving and, in turn, when it was formed based on how “redshift… [+2731 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bern: Bernese researchers simulate defense of the earth - India Education Diary", "description": "NASA’s Double Asteroid Redirection Test (DART) mission is the world’s first full-scale planetary defense test against potential asteroid impacts on Earth. Researchers of the University of Bern and the National Centre of Competence in Research (NCCR)", "url": "https://indiaeducationdiary.in/university-of-bern-bernese-researchers-simulate-defense-of-the-earth/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/06/University-of-Bern.jpg", "publishedAt": "2022-07-01T10:18:45Z", "content": "NASAs Double Asteroid Redirection Test (DART) mission is the worlds first full-scale planetary defense test against potential asteroid impacts on Earth. Researchers of the University of Bern and the … [+4113 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Perseverance rover at Enchanted Lake on Mars; NASA says 'best place to find signs of life' - Republic World", "description": "NASA's Perseverance rover landed in the Jezero crater on Mars in February 2021 and has been exploring Mars to find signs of ancient microbial life.", "url": "https://www.republicworld.com/science/space/perseverance-rover-at-enchanted-lake-on-mars-nasa-says-best-place-to-find-signs-of-life-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/urma11teumbdczv1_1656669242.jpeg", "publishedAt": "2022-07-01T10:03:00Z", "content": "NASA's Perseverance rover has come across a location that is being considered one of the best locations to find signs of ancient life on Mars. Called the 'Enchanted Lake', the location is an outcrop … [+1811 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "Where will NASA put Artemis Base Camp on the moon? - Space.com", "description": "Scientists and mission planners are searching for the best site.", "url": "https://www.space.com/nasa-artemis-moon-base-camp-location", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Hny7Jk8DaFwHC4WxFSAQVU-1200-80.jpg", "publishedAt": "2022-07-01T10:00:26Z", "content": "NASA aims to set up a crewed outpost near the moon's south pole, calling it \"our first foothold on the lunar frontier.\" \r\nThe ingredients for that encampment, known as Artemis Base Camp\r\n, are an unp… [+11630 chars]"}, {"source": {"id": null, "name": "Thalesgroup.com"}, "author": null, "title": "Euclid scientific satellite to study dark energy and dark matter to better understand the origin of the accelerated expansion of the Universe marks an important milestone - Thales", "description": "Turin, 1 July 2022 - Thales Alenia Space, a joint venture between Thales (67%) and Leonardo (33%), announced that all the integration activities for the Euclid satellite have been completed at the Turin plant and Euclid will soon be heading to the Thales Alen…", "url": "https://www.thalesgroup.com/en/worldwide/space/press_release/euclid-scientific-satellite-study-dark-energy-and-dark-matter-better", "urlToImage": "https://www.thalesgroup.com/sites/default/files/database/assets/images/2019-06/ESA_Euclid_EDFF_Candels_v1_zoom%201600_433.png", "publishedAt": "2022-07-01T09:27:24Z", "content": "Integration activities completed for a soon shipment from Turin to Cannes facilities at Thales Alenia Space\r\nTurin, 1 July 2022 - Thales Alenia Space, a joint venture between Thales (67%) and Leonard… [+6518 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "When did pandas start eating bamboo? Scientists have answer - WION", "description": "After the analysis of a new fossil, scientists found that the bears ancestors also had a thumb-like sixth digit to grip their favourite food", "url": "https://www.wionews.com/science/when-did-pandas-start-eating-bamboo-scientists-have-answer-493490", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/07/01/275620-untitled-design-13.png", "publishedAt": "2022-07-01T08:43:32Z", "content": "A new study, which has been conducted by the Natural History Museum in Los Angeles, has found that pandas have been munching bamboo for six million years.\r\nAfter the analysis of a new fossil, scienti… [+1297 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Converting methane into methanol under ambient conditions using light - Tech Explorist", "description": "The ‘holy grail of catalysis’.", "url": "https://www.techexplorist.com/converting-methane-methanol-ambient-conditions-using-light/52241/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/07/holy-grail-of-catalysis.jpg", "publishedAt": "2022-07-01T08:15:33Z", "content": "Natural gas, consisting mainly of methane, has a relatively low energy density under ambient conditions. Partial oxidation of methane to methanol lifts the energy density and drives the production of… [+4770 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "Venus orbiter, lunar constellation and exoplanets telescopes among candidates as China selects new space science missions - SpaceNews", "description": "The Chinese Academy Sciences is preparing to select a new batch of space missions from proposals to study Earth, the Sun and solar system, and the deeper universe as part of a \"New Horizons Program.\"", "url": "https://spacenews.com/?p=129203&#038;preview=true&#038;preview_id=129203", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/05/mars-northern-hemisphere-medium-res-Tianwen1-26march2021-cnsa-pec-scaled.jpg", "publishedAt": "2022-07-01T08:03:09Z", "content": "HELSINKI The Chinese Academy Sciences is preparing to select a new batch of space missions from proposals to study Earth, the Sun and solar system, and the deeper universe as part of a “New Horizons … [+5539 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Isopropyl alcohol detected in stellar nursery Sagittarius B2 towards centre of Milky Way - News9 LIVE", "description": "Also known as iso-propanol, the chemical is a common ingredient in hand sanitiser", "url": "https://www.news9live.com/science/isopropyl-alcohol-detected-in-stellar-nursery-sagittarius-b2-towards-centre-of-milky-way-179918", "urlToImage": "https://media.news9live.com/h-upload/2022/07/01/447335-alcoholinspacecropped1.jpg", "publishedAt": "2022-07-01T07:45:41Z", "content": "Researchers have identified isopropyl alcohol, also known as iso-propanol in space. This is the first time that the compound has been found beyond Earth. Isopropyl alcohol is a common ingredient in a… [+2633 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Earthshine Moon 2022: Know when and how to watch this spectacular event - HT Tech", "description": "Earthshine Moon 2022: Do not miss out on this beautiful event when the Moon glows due to the shine of the Earth. Find out when and how to watch it.", "url": "https://tech.hindustantimes.com/tech/news/earthshine-moon-2022-know-when-and-how-to-watch-this-spectacular-event-71656659906847.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/01/1600x900/ISS028-E-20073_front_1656660089144_1656660103625.jpg", "publishedAt": "2022-07-01T07:23:45Z", "content": "Earthshine Moon 2022: We have already seen quite a few stunning cosmic events this year. From the solar eclipse, blood Moon, the Tau Herculids meteor shower to the five-planet alignment, this year ha… [+1803 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "NASA Invites the Public to Identify Clouds on Mars, Puts up Tutorial - News18", "description": "Nasa, through the project 'Cloudspotting on Mars', wants to study the atmosphere on the Red Planet.", "url": "https://www.news18.com/news/buzz/nasa-invites-the-public-to-identify-clouds-on-mars-puts-up-tutorial-5473333.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/untitled-design-2022-07-01t122808.426-165665877616x9.png", "publishedAt": "2022-07-01T07:01:46Z", "content": "NASA has invited the public to help it identify clouds on Mars. Through their project, Cloudspotting on Mars, the space agency is asking for everyones help in understanding the atmosphere of the Red … [+1942 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Dogs trace ancestry to two separate wolf populations: Study - Times of India", "description": "A new study by an international group of geneticists and archaeologists of the Francis Crick Institute, has discovered that the ancestry of dogs can be traced to at least two populations of ancient wolves. The study revealed the answer to the most asked quest…", "url": "https://timesofindia.indiatimes.com/videos/news/dogs-trace-ancestry-to-two-separate-wolf-populations-study/videoshow/92589719.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-92589719,imgsize-35222.cms", "publishedAt": "2022-07-01T05:42:00Z", "content": "Jul 01, 2022, 11:12AM ISTSource: ANIA new study by an international group of geneticists and archaeologists of the Francis Crick Institute, has discovered that the ancestry of dogs can be traced to a… [+637 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "ALERT! Mysterious solar storm hits Earth; scientists baffled - HT Tech", "description": "A Solar Storm hit Earth last weekend, leaving scientists confused over the reason for the impact. Here’s more about it.", "url": "https://tech.hindustantimes.com/tech/news/alert-mysterious-solar-storm-hits-earth-scientists-baffled-71656650703988.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/01/1600x900/faintyoung_1652920721271_1656650750158.jpg", "publishedAt": "2022-07-01T04:46:33Z", "content": "Amid rising risk of solar flare eruption on the Sun, a mysterious solar storm has hit Earth around the midnight of June 25, continuing throughout the next day.\r\nSolar storms have been a common phenom… [+1849 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Oxford: Braking mid-air to prioritise safety over energy or speed - India Education Diary", "description": "Researchers at the University of Oxford have found that hawks control their flight to ensure the safest landing conditions when perching, even if it takes longer and more energy to do so. Understanding how birds optimise their landing manoeuvres thro", "url": "https://indiaeducationdiary.in/university-of-oxford-braking-mid-air-to-prioritise-safety-over-energy-or-speed/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/05/Oxford-University.jpg", "publishedAt": "2022-07-01T04:30:59Z", "content": "Researchers at the University of Oxford have found that hawks control their flight to ensure the safest landing conditions when perching, even if it takes longer and more energy to do so. Understandi… [+3228 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Chandra Observatory shows black hole spins slower than its peers - India Education Diary", "description": "Astronomers have made a record-breaking measurement of a black hole’s spin, one of two fundamental properties of black holes. NASA’s Chandra X-ray Observatory shows this black hole is spinning slower than most of its smaller cousins. This is the most", "url": "https://indiaeducationdiary.in/university-of-cambridge-chandra-observatory-shows-black-hole-spins-slower-than-its-peers/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg", "publishedAt": "2022-07-01T04:21:55Z", "content": "Astronomers have made a record-breaking measurement of a black holes spin, one of two fundamental properties of black holes. NASAs Chandra X-ray Observatory shows this black hole is spinning slower t… [+4095 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Fluffy' New Crab Species Covered In Hair Discovered By Scientists - NDTV", "description": "The photos of the fuzzy new species have been circulating on the internet, with many users posting hilarious comments on its appearance.", "url": "https://www.ndtv.com/offbeat/fluffy-new-crab-species-covered-in-hair-discovered-by-scientists-3117161", "urlToImage": "https://c.ndtvimg.com/2022-07/j10t75so_new-crab-species-650_625x300_01_July_22.jpg", "publishedAt": "2022-07-01T03:43:14Z", "content": "The new crab species has been named 'Lamarckdromia beagle'.\r\nScientists have discovered a creepy new type of crab that disguises itself by hair scraped from other sea creatures. The crab uses the hai… [+1390 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "There is no perfect system to manage space traffic - BollyInside", "description": "The topic of space traffic management (STM) has been discussed throughout the past few years, and notably over the past few months, everywhere from the", "url": "https://www.bollyinside.com/news/there-is-no-perfect-system-to-manage-space-traffic", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/There-is-no-perfect-system-to-manage-space-traffic.jpeg", "publishedAt": "2022-07-01T01:20:45Z", "content": "The topic of space traffic management (STM) has been discussed throughout the past few years, and notably over the past few months, everywhere from the U.S. Senate floor to press conferences at the W… [+3959 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "LightSail 2 celebrates its third anniversary as the end of the mission nears - BollyInside", "description": "Currently celebrating its third year in orbit, a solar-sailing mission is not likely to reach its fourth. The LightSail 2 solar sail from The Planetary", "url": "https://www.bollyinside.com/news/lightsail-2-celebrates-its-third-anniversary-as-the-end-of-the-mission-nears", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/LightSail-2-celebrates-its-third-anniversary-as-the-end-of.jpeg", "publishedAt": "2022-06-30T23:56:36Z", "content": "Currently celebrating its third year in orbit, a solar-sailing mission is not likely to reach its fourth.\r\nThe LightSail 2 solar sail from The Planetary Society was funded by the public and launched … [+2291 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "Europa’s experienced Mars orbiter gets an instrument upgrade - BollyInside", "description": "The venerable Mars Express spacecraft is getting new software from the European Space Agency (ESA), allowing it to look beneath Mars and its moon Phobos", "url": "https://www.bollyinside.com/news/europas-experienced-mars-orbiter-gets-an-instrument-upgrade", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Europas-experienced-Mars-orbiter-gets-an-instrument-upgrade.jpeg", "publishedAt": "2022-06-30T23:20:15Z", "content": "The venerable Mars Express spacecraft is getting new software from the European Space Agency (ESA), allowing it to look beneath Mars and its moon Phobos in greater detail than ever.\r\nSince December 2… [+2141 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Mystery Rocket That Collided With Moon Created Two Craters On Lunar Surface NASA - ABP Live", "description": "Experts have predicted that the discarded rocket stage struck the lunar surface at Hertzsprung crater on the Moon's far side, on March 4 at 7:25 am EST (4:55 pm IST).", "url": "https://news.abplive.com/science/mystery-rocket-that-collided-with-moon-created-two-craters-on-lunar-surface-nasa-1540142", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/06/30/b60a6926c6e615ece8c4c6553483cac9_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-06-30T22:31:00Z", "content": "A rocket body collided with the Moon in March this year. The object was observed to be heading toward a lunar collision rate last year. \r\nNASA's Lunar Reconnaissance Orbiter has spotted a crater — wh… [+5819 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "A star died, and in its death throes, killed off its planets, NASA Hubble Space Telescope shows - HT Tech", "description": "A dying star, also known as a white dwarf, killed the planets it was surrounded by! For perspective, think of our Sun and its planets!", "url": "https://tech.hindustantimes.com/tech/news/a-star-died-and-in-its-death-throes-killed-off-its-planets-nasa-hubble-space-telescope-shows-71656620918106.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/30/1600x900/ap10-22-2015-000010b_7593e088-797d-11e5-9d61-41ab8e878edd_1656620980752.jpg", "publishedAt": "2022-06-30T20:30:49Z", "content": "A dying star has ripped apart an entire planetary system, reveal scientists. Dubbed as G238-44, this white dwarf is disrupting an entire planetary system by consuming the rock-metallic and icy materi… [+1548 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Earth’s history REVEALED! What is Ice age? How many have there been? Everything explained - HT Tech", "description": "Do you know our planet had at least 5 major Ice ages. Know what caused it.", "url": "https://tech.hindustantimes.com/tech/news/earths-history-revealed-what-is-ice-age-how-many-have-there-been-everything-explained-71656620528140.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/30/1600x900/Polar-Bears-0_1656620631156_1656620663867.jpg", "publishedAt": "2022-06-30T20:26:16Z", "content": "Ice age sounds terrifying and is actually one of the most brutal periods for all forms of life that ever was on the planet. However, it has periods during which things get a lot better. And in fact, … [+2057 chars]"}, {"source": {"id": null, "name": "Business Wire"}, "author": null, "title": "Rocket Lab Completes Fifth Orbit Raise For NASA's CAPSTONE Mission to The Moon - Business Wire", "description": "Rocket Lab's Photon Lunar spacecraft has ignited its HyperCurie engine for a fifth time, further carrying NASA’s CAPSTONE satellite toward the Moon.", "url": "https://www.businesswire.com/news/home/20220630005834/en/Rocket-Lab-Completes-Fifth-Orbit-Raise-For-NASA%E2%80%99s-CAPSTONE-Mission-to-The-Moon", "urlToImage": "https://mms.businesswire.com/media/20220630005834/en/1417605/23/Rocket_Lab_Logo.jpg", "publishedAt": "2022-06-30T18:47:00Z", "content": "LONG BEACH, Calif.--(BUSINESS WIRE)--Rocket Lab USA, Inc. (Nasdaq: RKLB) (Rocket Lab or the Company), a leading launch and space systems company, today confirmed its Photon Lunar spacecraft successfu… [+3113 chars]"}, {"source": {"id": null, "name": "UH System Current News"}, "author": "UH News", "title": "UH-developed tool can detect ancient life on Earth and beyond | University of Hawaiʻi System News - University of Hawaii", "description": "It can detect bio-residue in fish fossils from the 34–56 million-year-old Green River rock formation located in Colorado, Wyoming and Utah.", "url": "https://www.hawaii.edu/news/2022/06/30/biofinder-tool-ancient-life/", "urlToImage": "https://www.hawaii.edu/news/wp-content/uploads/2022/06/manoa-higp-compact-biofinder.jpg", "publishedAt": "2022-06-30T18:09:04Z", "content": "White light (a) and Biofinder (b) images of Green River formation fish fossil. (Photo credit: Misra, et al.)\r\nAn innovative scientific instrument developed by University of Hawaiʻi at Mānoa researche… [+3225 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "NASA’s Terra satellite tracks a ‘strange’ cloud from the Caspian Sea - BollyInside", "description": "On May 28, NASA discovered a “unusual” cloud over the Caspian Sea. The cloud is an intriguing case study of how satellites detect such occurrences in the", "url": "https://www.bollyinside.com/news/nasas-terra-satellite-tracks-a-strange-cloud-from-the-caspian-sea", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/NASAs-Terra-satellite-tracks-a-strange-cloud-from-the-Caspian.jpeg", "publishedAt": "2022-06-30T16:56:49Z", "content": "On May 28, NASA discovered a unusual cloud over the Caspian Sea. The cloud is an intriguing case study of how satellites detect such occurrences in the Earths atmosphere.\r\nScientists used NASAs Terra… [+2696 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Never-before-seen microbes locked in glacier ice could spark a wave of new pandemics if released - Livescience.com", "description": "Climate change just got even more terrifying.", "url": "https://www.livescience.com/hundreds-of-new-microbes-found-in-melting-glaciers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kLqu6GALezSWy9dPDiYssQ-1200-80.jpg", "publishedAt": "2022-06-30T16:34:43Z", "content": "A new study found hundreds of newfound microbes in melting glaciers, some of which could potentially be pathogenic. (Image credit: Shutterstock)\r\n(opens in new tab)Stunned scientists have uncovered m… [+5239 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "This cluster of galaxies is so massive that it warps space-time - BollyInside", "description": "Hubble, NASA’s space telescope, has obtained some magnificent photographs. One of its most recent photos is noteworthy for reasons other than its", "url": "https://www.bollyinside.com/news/this-cluster-of-galaxies-is-so-massive-that-it-warps-space-time", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/This-cluster-of-galaxies-is-so-massive-that-it-warps.jpeg", "publishedAt": "2022-06-30T16:08:28Z", "content": "Hubble, NASAs space telescope, has obtained some magnificent photographs. One of its most recent photos is noteworthy for reasons other than its appearance. Thats because this image of Abell 1351 dep… [+2560 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Novel Functional 2D Hybrid Material - AZoNano", "description": "More potent, portable gadgets have been developed because of the ongoing miniaturization of electrical technologies.", "url": "https://www.azonano.com/news.aspx?newsID=39345", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39345_16565845370675680.png", "publishedAt": "2022-06-30T14:34:00Z", "content": "More potent, portable gadgets have been developed as a result of the ongoing miniaturization of electrical technologies. These technological innovations, like artificial intelligence, social networks… [+5115 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Steph Lee", "title": "NASA rovers may need to dig deeper to find ancient Martian life - Inverse", "description": "In this edition of Inverse Daily, read about the search for life on Mars, devastating floods, and more.", "url": "https://www.inverse.com/science/inverse-daily-29-06-22", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2022/6/29/9b6f2579-83f5-485d-b82e-abe3be93f310-shutterstock-418578940.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-06-30T14:00:25Z", "content": "On Mars \r\n Scientists search for amino acids like pirates hunt for gold. Finding these chemical molecules would be considered a potential sign of alien life. But a new study suggests that there likel… [+5149 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Mysterious US X-37B space plane eyes orbital record - WION", "description": "X-37B robotic space plane tests new systems in space as the US seeks to maintain space superiority. It also conducts experiments for America’s future space exploration.", "url": "https://www.wionews.com/science/mysterious-us-x-37b-space-plane-eyes-orbital-record-493282", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/30/275432-shinde1.JPG", "publishedAt": "2022-06-30T13:01:55Z", "content": "US military's X-37B robotic space plane is set to create a new record of staying aloft for 780 days. The reusable spaceplane has currently completed 773 days. According to the US Air Force, it is a p… [+1468 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Lunar rover to study subsurface ice and water near south pole of Moon in 2023 - News9 LIVE", "description": "The rover is expected to find resources to support future manned missions", "url": "https://www.news9live.com/science/lunar-rover-to-study-subsurface-ice-and-water-near-south-pole-of-moon-in-2023-179714", "urlToImage": "https://media.news9live.com/h-upload/2022/06/30/446205-nasamoonrovercropped.jpg", "publishedAt": "2022-06-30T11:03:44Z", "content": "NASA is launching a rover next year to investigate subsurface deposits of ice and water near the south pole of the Moon. The exploration is expected to support future manned missions to the Moon, whi… [+2488 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Reuters", "title": "Meet zombie star that survived supernova blast - Geo News", "description": "Star at issue is white dwarf, which is an incredibly dense object with about mass of sun crammed into size of Earth", "url": "https://www.geo.tv/latest/425327-meet-zombie-star-that-survived-supernova-blast", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2022-06-30/425327_123628_updates.jpg", "publishedAt": "2022-06-30T10:59:00Z", "content": "<ul><li>This star is known as white dwarf.</li><li>White dwarf is remaining core of star that blew off its material at end of life cycle.</li><li>Scientists have detected about 50 supernova but until… [+3523 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "NASA wants to use swarms of underwater robots to hunt for life on ice moons - News9 LIVE", "description": "NASA is developing a novel concept to explore subsurface oceans of ice moons in the Solar System", "url": "https://www.news9live.com/science/nasa-wants-to-use-swarms-of-underwater-robots-to-hunt-for-life-on-ice-moons-179703", "urlToImage": "https://media.news9live.com/h-upload/2022/06/30/446218-jpegpia25314width-1024cropped1.jpg", "publishedAt": "2022-06-30T10:40:52Z", "content": "NASA has awarded funding to further advance a concept known as Sensing With Independent Micro-Swimmers (SWIM) for exploring subsurface oceans on ice worlds in the Solar System. Moons such as Europa, … [+3826 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Special Report: Deflecting asteroids - Devdiscourse", "description": "If they are within one-third the distance from Earth to the Sun, they are classified as near-Earth objects NEOs, and are of special interest because of their potential to destroy our planet. In 1994, US Congress asked space agency NASA to identify 90 percent …", "url": "https://www.devdiscourse.com/article/science-environment/2092679-special-report-deflecting-asteroids", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/11_11_2021_16_30_17_8641485.jpg?width=920&format=jpeg", "publishedAt": "2022-06-30T10:31:25Z", "content": "Our solar system is full of rogue rocks. Millions of them orbit around the Sun or around other objects, the shattered remains of planets, moons, or comets. If they are within one-third the distance f… [+3013 chars]"}, {"source": {"id": null, "name": "Science News for Students"}, "author": null, "title": "Some Greenland polar bears are surviving with very little sea ice - Science News for Students", "description": "The ‘glacial mélange’ on which they’ve come to rely — a mix of ice, snow and slush — could be a temporary refuge for some polar bears.", "url": "https://www.sciencenewsforstudents.org/article/polar-bear-greeland-sea-ice-glacial-melange-climate-change", "urlToImage": "https://www.sciencenewsforstudents.org/wp-content/uploads/2022/06/061422_no_polarbear_feat.jpg", "publishedAt": "2022-06-30T10:30:00Z", "content": "Arctic: A region that falls within the Arctic Circle. The edge of that circle is defined as the northernmost point at which the sun is visible on the northern winter solstice and the southernmost poi… [+6801 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Scientists grow food in the dark with 'artificial photosynthesis' - The Indian Express", "description": "This process could be used to grow food in the dark in controlled environments, which could prove to be useful in many applications, including in space.", "url": "https://indianexpress.com/article/technology/science/scientists-grow-food-in-the-dark-with-artificial-photosynthesis-7998708/", "urlToImage": "https://images.indianexpress.com/2022/06/Growing-plants-dark-featured.jpg", "publishedAt": "2022-06-30T10:09:56Z", "content": "Scientists at UC Riverside and the University of Delaware have devised a way to grow plants in complete darkness and create food plants in the dark using artificial photosynthesis. The researchers gr… [+2442 chars]"}, {"source": {"id": null, "name": "Gizbot"}, "author": "Sharmishte Datti", "title": "NASA Perseverance Rover Experiences Dust Devils On Mars; New Insights Into Martian Weather - Gizbot", "description": "NASA’s Mars mission is a very ambitious one, and several projects are already working toward making it a success. This includes the Mars Perseverance rover, which has been collecting rock samples since its landing in 2021. However, there seems to be harsh wea…", "url": "https://www.gizbot.com/news/nasa-perseverance-rover-experiences-dust-devils-on-mars-new-insights-into-martian-weather-081470.html", "urlToImage": "https://www.gizbot.com/img/2022/06/nasa-perseverance-rover-experiences-dust-devils-1656580076.jpg", "publishedAt": "2022-06-30T09:11:06Z", "content": "NASA's Mars mission is a very ambitious one, and several projects are already working toward making it a success. This includes the Mars Perseverance rover, which has been collecting rock samples sin… [+2546 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Gloria Holmes", "title": "BepiColombo: ESA's Mercury probe has passed again - Persia Digest", "description": "The European-Japanese space probe BepiColombo has passed Mercury for the second time, taking pictures of the innermost planet in the solar system. The first image, which shows part of the probe and Mercury’s crater-ridden surface, was taken from a distance of…", "url": "https://persiadigest.com/bepicolombo-esas-mercury-probe-has-passed-again/", "urlToImage": null, "publishedAt": "2022-06-23T17:41:37Z", "content": "The European-Japanese space probe BepiColombo has passed Mercury for the second time, taking pictures of the innermost planet in the solar system. The first image, which shows part of the probe and M… [+1802 chars]"}]}