{"status": "ok", "totalResults": 53, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "AFP", "title": "NASA gets serious about UFOs, and officially joins the hunt | Mint - Mint", "description": "NASA has announced a new study that will recruit leading scientists to examine unidentified aerial phenomena", "url": "https://www.livemint.com/science/news/nasa-gets-serious-about-ufos-and-officially-joins-the-hunt-11654868216453.html", "urlToImage": "https://images.livemint.com/img/2022/06/10/600x338/NASA-UFOs-0_1654819515339_1654868407371_1654868417159.jpg", "publishedAt": "2022-06-10T13:45:17Z", "content": "NASA is officially joining the hunt for UFOs. The space agency on Thursday announced a new study that will recruit leading scientists to examine unidentified aerial phenomena -- a subject that has lo… [+2559 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "Japan’s Hayabusa2 probe finds amino acids in asteroid samples - The Siasat Daily", "description": "Tokyo: Japan's Hayabusa2 space mission, which brought to Earth samples from an asteroid in late 2020, has found more than 20 types of amino acids in it, according to Japanese space agency JAXA officials. In 2018, Hayabusa2 landed atop a moving asteroid named …", "url": "https://www.siasat.com/japans-hayabusa2-probe-finds-amino-acids-in-asteroid-samples-2346333/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/Asteroid.jpg", "publishedAt": "2022-06-10T13:39:00Z", "content": "Tokyo: Japan’s Hayabusa2 space mission, which brought to Earth samples from an asteroid in late 2020, has found more than 20 types of amino acids in it, according to Japanese space agency JAXA offici… [+2131 chars]"}, {"source": {"id": null, "name": "Astronomy Magazine"}, "author": "Alison Klesman", "title": "The Sky This Week from June 10 to 17 - Astronomy Magazine", "description": "Enjoy a morning lineup of planets and watch the Moon blot out a star in Scorpius from June 10 to 17.", "url": "https://astronomy.com/observing/sky-this-week/2022/06/the-sky-this-week-from-june-10-to-17", "urlToImage": "http://astronomy.com/~/media/CFD72A793C78458FAF82A933AA0C243B.jpg", "publishedAt": "2022-06-10T13:33:40Z", "content": "Sunday, June 12The Moon occults, or passes in front of, 2nd-magnitude Dschubba (Delta [δ] Scorpii) tonight, visible to observers in eastern Canada and the northeastern U.S. Our satellite rises before… [+3215 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "IANS", "title": "Webb telescope endures impact from larger than expected micrometeoroid - Gadgets Now", "description": "The next-generation and powerful James Webb telescope was hit by space debris called micrometeoroid, leading to a \"marginally detectable effect in the data\" but has suffered no damage, according to Nasa.Since its launch on December 25 last year, the Webb tele…", "url": "https://www.gadgetsnow.com/tech-news/webb-telescope-endures-impact-from-larger-than-expected-micrometeoroid/articleshow/92131766.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-92131766,imgsize-113896,width-800/92131766.jpg", "publishedAt": "2022-06-10T13:24:00Z", "content": "The next-generation and powerful James Webb telescope was hit by space debris called micrometeoroid, leading to a \"marginally detectable effect in the data\" but has suffered no damage, according to N… [+2836 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Birmingham: New insights into how cyanobacteria regulate zinc uptake in the open ocean - India Education Diary", "description": "Marine cyanobacteria (blue-green algae) are major contributors to the global carbon cycle and are the basis of the food web in many of the world’s oceans. They only require sunlight, carbon dioxide, plus a panel of essential elements, including metal", "url": "https://indiaeducationdiary.in/university-of-birmingham-new-insights-into-how-cyanobacteria-regulate-zinc-uptake-in-the-open-ocean/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/University-of-Birmingham.jpg", "publishedAt": "2022-06-10T10:54:44Z", "content": "Marine cyanobacteria (blue-green algae) are major contributors to the global carbon cycle and are the basis of the food web in many of the worlds oceans. They only require sunlight, carbon dioxide, p… [+3291 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Remnants of the comet that exploded 15 years ago will now reach Earth - DNA India", "description": "3 years ago, Hubble saw a comet named 17P/Holmes for the first time. But in 2007, there was a huge explosion in it.", "url": "https://www.dnaindia.com/science/report-remnants-of-the-comet-17p-holmes-that-exploded-15-years-ago-will-now-reach-earth-hubble-2959452", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/06/10/2229730-comet-17p-holmes-nasa.jpg", "publishedAt": "2022-06-10T10:42:40Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Jun 10, 2022, 04:12 PM ISTAsteroids and meteors are the most prominent among the bodies passing very nearby to the Earth. Asteroi… [+3292 chars]"}, {"source": {"id": null, "name": "Science News for Students"}, "author": null, "title": "Watch how a western banded gecko takes down a scorpion - Science News for Students", "description": "New high-speed video reveals how normally mild-mannered geckos can violently shake venomous prey into submission.", "url": "https://www.sciencenewsforstudents.org/article/gecko-western-banded-scorpion-eat-shake-video", "urlToImage": "https://www.sciencenewsforstudents.org/wp-content/uploads/2022/04/040522_ht_gecko-scorpion_feat.jpg", "publishedAt": "2022-06-10T10:30:00Z", "content": "behavior: The way something, often a person or other organism, acts towards others, or conducts itself.\r\nbiologist: A scientist involved in the study of living things.\r\ncarnivore: An animal that eith… [+2328 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "When and where to look to see rare planetary moment | Newshub - Newshub", "description": "In a rare display, Mercury, Venus, Mars, Jupiter and Saturn will align, along with the Moon, in sequential order from the Sun.Ian Griffin, Astronomer and Dir...", "url": "https://www.youtube.com/watch?v=KmIk1EjqGfM", "urlToImage": "https://i.ytimg.com/vi/KmIk1EjqGfM/hqdefault.jpg", "publishedAt": "2022-06-10T10:11:45Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Europe will launch a 'lurking' probe in 2029 to watch for an interstellar comet - Space.com", "description": "The probe will wait in space for a yet unknown, but very exciting, object to arrive.", "url": "https://www.space.com/esa-comet-interceptor-mission-2029-launch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/97gdzfKy2WMsDHmze8FMoD-1200-80.jpeg", "publishedAt": "2022-06-10T10:00:07Z", "content": "The European Space Agency (ESA) plans to launch a unique comet-chasing mission in 2029. \r\nThe mission, called Comet Interceptor, was approved on Wednesday (June 8) at ESA's Science Programme Committe… [+3744 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Discovery of the Elements Predicted by Mendeleev's Table – Scandium, Gallium, and Germanium - Royal Society Of Chemistry", "description": "Mary Virginia Orna gives a talk on the discovery of elements predicted by Mendeleev’s periodic table, presented on 19 April 2022. This is part of a series of...", "url": "https://www.youtube.com/watch?v=pREG_oXeyj0", "urlToImage": "https://i.ytimg.com/vi/pREG_oXeyj0/maxresdefault.jpg", "publishedAt": "2022-06-10T09:42:55Z", "content": null}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "NASA Launch Main Body of Europa Clipper Spacecraft - Taking a Step Closer Toward Exploring Jupiter's Icy Moon - Galaxy Reporters", "description": "NASA’s mission to explore the Jupiter glacier is taking a big step forward as engineers launch a large part of the spacecraft. Europe, the crescent moon of Jupiter, is probably home to a vast ocean floor under its icy shell. Scientists believe that this ocean…", "url": "https://galaxyreporters.com/nasa-launch-main-body-of-europa-clipper-spacecraft-taking-a-step-closer-toward-exploring-jupiters-icy-moon/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/NASA-Completes-Main-Body-of-Europa-Clipper-spacecraft.webp", "publishedAt": "2022-06-10T09:28:40Z", "content": "NASA’s mission to explore the Jupiter glacier is taking a big step forward as engineers launch a large part of the spacecraft.\r\nEurope, the crescent moon of Jupiter, is probably home to a vast ocean … [+979 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Physicists Are Now Able to Detect New Particles Around Black Holes Using Gravitational Waves - Galaxy Reporters", "description": "Clouds of ultralight particles can form around dark circular holes. A team of physicists from the University of Amsterdam and Harvard University now suggests that these clouds will leave a mark on the gravitational waves emitted by double black holes. Black h…", "url": "https://galaxyreporters.com/physicists-are-now-able-to-detect-new-particles-around-black-holes-using-gravitational-waves/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/X-ray-echoes-of-a-black-hole.jpg", "publishedAt": "2022-06-10T09:22:30Z", "content": "Clouds of ultralight particles can form around dark circular holes. A team of physicists from the University of Amsterdam and Harvard University now suggests that these clouds will leave a mark on th… [+2013 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "New Research Shows the Deep Connection Between Universe's Most Colossal Collisions and Our Own Solar System's - Galaxy Reporters", "description": "New research shows the deep connection between the universe’s most significant, most influential events and the smallest, most powerful ones powered by our Sun. The results are from the long observations of NASA’s Chandra X-ray Observatory of Abell 2146; coll…", "url": "https://galaxyreporters.com/new-research-shows-the-deep-connection-between-universes-most-colossal-collisions-and-our-own-solar-systems/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_1029243295-scaled.jpg", "publishedAt": "2022-06-10T09:18:23Z", "content": "New research shows the deep connection between the universe’s most significant, most influential events and the smallest, most powerful ones powered by our Sun.\r\nThe results are from the long observa… [+1704 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Superworm Makes a Meal Out of Waste Polystyrene - Technology Networks", "description": "A species of worm with an appetite for polystyrene could be the key to plastic recycling on a mass scale.", "url": "https://www.technologynetworks.com/applied-sciences/news/superworm-makes-a-meal-out-of-waste-polystyrene-362478", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/362478/superworm-makes-a-meal-out-of-waste-polystyrene-362478-640x360.jpg?cb=20220610", "publishedAt": "2022-06-10T08:17:27Z", "content": "A species of worm with an appetite for polystyrene could be the key to plastic recycling on a mass scale. \r\nResearchers at the University of Queensland have discovered the common Zophobas morio super… [+2087 chars]"}, {"source": {"id": null, "name": "Thalesgroup.com"}, "author": null, "title": "Thales Alenia Space at the 2022 Congress of the International Society for Photogrammetry and Remote Sensing - Thales", "description": "The 24th Congress of the International Society for Photogrammetry and Remote Sensing, also encompassing space information sciences, took place this week in Nice. Thales Alenia Space was one of the event sponsors, and our teams showcased the company’s wide ran…", "url": "https://www.thalesgroup.com/en/worldwide/space/news/thales-alenia-space-2022-congress-international-society-photogrammetry-and", "urlToImage": "https://www.thalesgroup.com/sites/default/files/database/assets/images/2022-06/ISPRS_1600.jpg", "publishedAt": "2022-06-10T07:50:21Z", "content": "The 24th Congress of the International Society for Photogrammetry and Remote Sensing, also encompassing space information sciences, took place this week in Nice. Thales Alenia Space was one of the ev… [+6170 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Antarctic Glaciers Are Losing Ice At Fastest Rate In The Last 5,500 Years - Indiatimes.com", "description": "Glaciers in Antarctica are now losing ice at the fastest rate in 5,500 years, a study has found. Antarctica has two huge ice masses: the East and West Antarctic Ice Sheets that feed many glaciers, and WAIS is thinning at a scary rate, Phys.org reported.Scient…", "url": "https://www.indiatimes.com/technology/science-and-future/antarctic-glaciers-are-losing-ice-at-fastest-rate-in-the-last-5500-years-571852.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/matt-palmer-M7EnqaUt6Yg-unsplash_62a2f5a0b6dd9.jpg", "publishedAt": "2022-06-10T07:19:26Z", "content": "Glaciers in Antarctica are now losing ice at the fastest rate in 5,500 years, a study has found.Antarctica has two huge ice masses: the East and West Antarctic Ice Sheets that feed many glaciers, and… [+2431 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Caltech: Native Americans Name Asteroid 'Ayló'chaxnim or 'Venus Girl' - India Education Diary", "description": "On June 7, at Caltech's Palomar Observatory in the forested mountain outside San Diego, members of the Pauma band of indigenous peoples gathered to celebrate the naming of the first known asteroid to circle entirely within the orbit of Venus. The ast", "url": "https://indiaeducationdiary.in/caltech-native-americans-name-asteroid-aylochaxnim-or-venus-girl/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/caltech-campus-entrance-sign.jpg", "publishedAt": "2022-06-10T07:17:46Z", "content": "On June 7, at Caltech’s Palomar Observatory in the forested mountain outside San Diego, members of the Pauma band of indigenous peoples gathered to celebrate the naming of the first known asteroid to… [+4777 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Caltech: Decoding a Key Part of the Cell, Atom by Atom - India Education Diary", "description": "Whatever you are doing, whether it is driving a car, going for a jog, or even at your laziest, eating chips and watching TV on the couch, there is an entire suite of molecular machinery inside each of your cells hard at work. That machinery, far too", "url": "https://indiaeducationdiary.in/caltech-decoding-a-key-part-of-the-cell-atom-by-atom/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/caltech-campus-entrance-sign.jpg", "publishedAt": "2022-06-10T07:14:24Z", "content": "Whatever you are doing, whether it is driving a car, going for a jog, or even at your laziest, eating chips and watching TV on the couch, there is an entire suite of molecular machinery inside each o… [+10495 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Caltech: NuSTAR Celebrates 10 Years in Space - India Education Diary", "description": "Launched from a rocket strapped to the belly of an aircraft on June 13, 2012, NASA's NuSTAR mission is celebrating 10 years in space. The mission, which detects high-energy X-rays, has made numerous discoveries over the years about extreme cosmic obj", "url": "https://indiaeducationdiary.in/caltech-nustar-celebrates-10-years-in-space/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/caltech-campus-entrance-sign.jpg", "publishedAt": "2022-06-10T07:14:24Z", "content": "Launched from a rocket strapped to the belly of an aircraft on June 13, 2012, NASA’s NuSTAR mission is celebrating 10 years in space. The mission, which detects high-energy X-rays, has made numerous … [+442 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Lucy's solar panel remains stuck as probe sets course toward eight ancient asteroids - India Today", "description": "Lucy, the spacecraft headed to study 8 ancient asteroids, is still making attempts to get its stuck solar panel out as it begins its journey deep into the solar system.", "url": "https://www.indiatoday.in/science/story/lucy-s-solar-panel-remains-stuck-as-probe-sets-course-toward-eight-ancient-asteroids-1960733-2022-06-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Lucy-647x363.jpeg?lUeDVxkKCqRi1halt10fH2pvfM3dqTZw", "publishedAt": "2022-06-10T06:26:04Z", "content": "The first spacecraft to fly to eight ancient asteroids to study the evolution of the Solar System is still trying to get its stuck solar panel unlatched. The spacecraft encountered a major fault hour… [+2492 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA James Webb Space Telescope is the “perfect time machine”, will reveal secrets of black holes - HT Tech", "description": "The James Webb Space Telescope is the “perfect time machine” to dig out the secrets of the black hole seeds and the baby universe, says NASA.", "url": "https://tech.hindustantimes.com/tech/news/nasa-james-webb-space-telescope-is-the-perfect-time-machine-will-reveal-secrets-of-black-holes-71654840993293.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/10/1600x900/stsci-j-p2223a_1654841042845_1654841063487.jpg", "publishedAt": "2022-06-10T06:07:12Z", "content": "The NASA James Webb Space Telescope (JWST) is about to start its spectacular journey of space exploration. As the world awaits the first images captured by the most powerful space telescope to ever e… [+3019 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "To cut boredom, NASA's Perseverance rover finds a friend on Mars. Find out who is it - WION", "description": "Perseverance rover and the rock seem to share a special bond now as they have been together for the last four months. The rock seems to have become a witness to the exploration activities of Perseverance. It has travelled more than 5.3 miles (8.5 kilometers) …", "url": "https://www.wionews.com/science/to-cut-boredom-nasas-perseverance-rover-finds-a-friend-on-mars-find-out-who-is-it-486770", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/10/269568-perseverance-rover.jpg", "publishedAt": "2022-06-10T04:09:33Z", "content": "NASAs rover, Perseverance, seems to have found a friend on Mars. No, it's not an alien but a small pet rock. The two have been together for around four months now and they seem to have become insepar… [+1277 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Hubble spots largest near-infrared image to find universe's rarest galaxies - Ahmedabad Mirror", "description": "An international team of scientists has released the largest near-infrared image ever taken by the Hubble Space Telescope, enabling astronomers to map the star-forming regions of the universe and learn how the earliest, most distant galaxies originated.\n\nTo i…", "url": "https://ahmedabadmirror.com/hubble-spots-largest-near-infrared-image-to-find-universes-rarest-galaxies/81834688.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1654595611568.jpg-org", "publishedAt": "2022-06-10T03:50:51Z", "content": "An international team of scientists has released the largest near-infrared image ever taken by the Hubble Space Telescope, enabling astronomers to map the star-forming regions of the universe and lea… [+1880 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA and SpaceX have canceled the launch of the Falcon 9 rocket due to propellant problems - BollyInside", "description": "NASA and SpaceX announced Monday that they will cancel this week’s Falcon 9 launch of a cargo mission to the International Space Station due to a thruster", "url": "https://www.bollyinside.com/news/nasa-and-spacex-have-canceled-the-launch-of-the-falcon-9-rocket-due-to-propellant-problems", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/NASA-and-SpaceX-have-canceled-the-launch-of-the-Falcon.jpeg", "publishedAt": "2022-06-10T00:20:14Z", "content": "NASA and SpaceX announced Monday that they will cancel this weeks Falcon 9 launch of a cargo mission to the International Space Station due to a thruster malfunction.\r\nMMH vapour readings were found … [+912 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Goddard Glossary: Hyperspectral - NASA Goddard", "description": "This #WorldOceansWeek, we thought we’d take a look at how we see the ocean. For Goddard Glossary, we’re defining “hyperspectral,” the type of analysis our up...", "url": "https://www.youtube.com/watch?v=wbYgJqcWxxg", "urlToImage": "https://i.ytimg.com/vi/wbYgJqcWxxg/hqdefault.jpg", "publishedAt": "2022-06-09T20:45:22Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "A Venus-bound mission from NASA will carry a tiny sensor built by students to the planet's hellish surface - Space.com", "description": "NASA's DAVINCI mission, which is slated to launch to Venus in 2029, will carry a dime-sized, student-built sensor to study the ​​planet's atmosphere and mountainous terrain for the first time.", "url": "https://www.space.com/venus-davinci-lander-student-built-sensor", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sUB6qpe6N8ehrtYXVS9emf-1200-80.jpg", "publishedAt": "2022-06-09T20:42:32Z", "content": "NASA's DAVINCI mission to Venus will carry a dime-sized, student-built sensor to study the ​​planet's near-surface environment.\r\nThe DAVINCI\r\n (Deep Atmosphere Venus Investigation of Noble gasses, Ch… [+3512 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sofie Bates", "title": "NASA to launch six small satellites to monitor and study tropical cyclones - Phys.org", "description": "NASA is launching the first two of six small satellites no earlier than June 12, to study the formation and development of tropical cyclones almost every hour—about four to six times more often than is possible with current satellites. This is the first of th…", "url": "https://phys.org/news/2022-06-nasa-small-satellites-tropical-cyclones.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasa-to-launch-6-small.jpg", "publishedAt": "2022-06-09T20:33:14Z", "content": "NASA is launching the first two of six small satellites no earlier than June 12, to study the formation and development of tropical cyclones almost every hourabout four to six times more often than i… [+5316 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Asteroid Apophis is used by space rock hunters for target practice - BollyInside", "description": "Scientists at the University of Arizona are participating in sky scans to look for asteroids that could one day endanger the Earth. They’re among those", "url": "https://www.bollyinside.com/news/asteroid-apophis-is-used-by-space-rock-hunters-for-target-practice", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/As-scientists-test-asteroid-protection-technologies-famed-asteroid-Apophis-is.jpeg", "publishedAt": "2022-06-09T20:33:03Z", "content": "Scientists at the University of Arizona are participating in sky scans to look for asteroids that could one day endanger the Earth.\r\nTheyre among those keeping an eye on the asteroid Apophis, which w… [+997 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "Press Trust of India", "title": "China releases world’s ‘most detailed’ map of Moon - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/world/china-releases-worlds-most-detailed-map-of-moon", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2Fimport%2F2018%2F07%2F2018_7largeimg128_jul_2018_163503290gallery.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-09T19:30:00Z", "content": "Beijing: China has released a new comprehensive geologic map of the moon, the \"most detailed\" to date, which is expected to make a vital contribution to scientific research, exploration and landing s… [+379 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "SpaceX Slated to Be NASA's Orbital Taxi for at Least Another 8 Years - Gizmodo", "description": "The space agency had little choice, given the sorry state of the much-delayed Boeing Starliner program.", "url": "https://gizmodo.com/spacex-slated-to-be-nasas-orbital-taxi-for-at-least-ano-1849040405", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/edd7b0b45c33156d7dc6880c32bd97e3.jpg", "publishedAt": "2022-06-09T18:06:00Z", "content": "The partnership between NASA and SpaceX is poised to get even stronger, as the space agency recently announced its intention to purchase five additional Crew Dragon flights to the International Space… [+5426 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "SpaceX launches Egyptian communications satellite into orbit - National Herald", "description": "Elon Musk's SpaceX has successfully launched a satellite into orbit that will be operated by the Egyptian company Nilesat, in its 23rd rocket launch and landing of 2022", "url": "https://www.nationalheraldindia.com/international/spacex-launches-egyptian-communications-satellite-into-orbit", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2022-06%2F4444ffd6-de01-4ec3-afbb-fb5f4fdc1e63%2F_SpaceX_launches_Egyptian_communications_satellite_into_orbit.jpeg?rect=0%2C46%2C400%2C210&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-09T17:30:00Z", "content": "It also helped launch two Starlink missions, the company added.\r\nNilesat 301 will operate from geostationary orbit, which lies about 35,800 kilometres above Earth.\r\nSpaceX has up to five more launche… [+312 chars]"}, {"source": {"id": null, "name": "Americanbazaaronline.com"}, "author": "ABcontributor", "title": "Earth's magnetic poles not to flip, assures new... - The American Bazaar", "description": "Based on similarities with the recreated anomalies, it suggests that Earth is not heading towards a polarity reversal", "url": "https://www.americanbazaaronline.com/2022/06/09/earths-magnetic-poles-not-to-flip-assures-new-study-449881/", "urlToImage": "https://www.americanbazaaronline.com/wp-content/uploads/2022/06/Earths-magnetic-poles-e1654791113486.jpg", "publishedAt": "2022-06-09T16:21:40Z", "content": "Based on similarities with the recreated anomalies, it suggests that Earth is not heading towards a polarity reversal\r\nBy Kiran N. Kumar\r\nWhat happens when the so-called “Polar drift” happens? It’s a… [+3491 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "American Astronomical Society honors seven MIT affiliates with 2022 awards, prizes - India Education Diary", "description": "Seven MIT community members have been honored with 2022 American Astronomical Society (AAS) prizes and awards.Those awarded include two assistant professors of physics, Erin Kara and Kiyoshi Masui, as well as alumni Camille Carlisle SM ’10, Charles K", "url": "https://indiaeducationdiary.in/american-astronomical-society-honors-seven-mit-affiliates-with-2022-awards-prizes/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2022-06-09T16:06:26Z", "content": "Seven MIT community members have been honored with 2022 American Astronomical Society (AAS) prizes and awards.\r\nThose awarded include two assistant professors of physics, Erin Kara and Kiyoshi Masui,… [+6416 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Themeinwp.", "title": "NASA awarded contracts to develop new space suits - The Times Hub", "description": "News » Science & Technology Axiom Space and Collins Aerospace have been awarded contracts worth up to $3.5 billion to develop and supply next-generation spacesuits to further NASA's presence not only in orbit, but and to send astronauts to the moon for the fi…", "url": "https://thetimeshub.in/nasa-awarded-contracts-to-develop-new-space-suits/13260/", "urlToImage": null, "publishedAt": "2022-06-09T15:29:29Z", "content": "News » Science &amp; Technology\r\nAxiom Space and Collins Aerospace have been awarded contracts worth up to $3.5 billion to develop and supply next-generation spacesuits to further NASA's presence not… [+727 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "ASTRONAUT DISCUSSES LIFE ABOARD SPACE STATION DURING INVESTING IN SPACE CONFERENCE - NASA Video", "description": "Aboard the International Space Station, Expedition 67 Flight Engineer Samantha Cristoforetti of ESA (European Space Agency) discussed living and working in s...", "url": "https://www.youtube.com/watch?v=ej9_XCq009s", "urlToImage": "https://i.ytimg.com/vi/ej9_XCq009s/hqdefault.jpg", "publishedAt": "2022-06-09T15:25:11Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Peter Rüegg", "title": "Expert takes stock of three years of marsquake measurements - Phys.org", "description": "NASA's InSight lander successfully touched down on Mars on 26 November 2018. Seventy Martian days later, the seismometer—called SEIS—deployed on the surface of Mars began recording the Red Planet's tremors. It has registered more than 1,300 quakes so far. The…", "url": "https://phys.org/news/2022-06-expert-stock-years-marsquake.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/expert-takes-stock-of.jpg", "publishedAt": "2022-06-09T15:17:36Z", "content": "NASA's InSight lander successfully touched down on Mars on 26 November 2018. Seventy Martian days later, the seismometercalled SEISdeployed on the surface of Mars began recording the Red Planet's tre… [+7726 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Texas A&M: Designing Self-Healing Chips To Withstand Space Radiation - India Education Diary", "description": "With an increase in commercial space flight and further exploration of our solar system on the horizon, there is a growing need for more robust integrated circuits, or chips, capable of weathering the harsh and damaging effects of radiation to which", "url": "https://indiaeducationdiary.in/texas-am-designing-self-healing-chips-to-withstand-space-radiation/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/tam-box-stack-1.png", "publishedAt": "2022-06-09T13:07:30Z", "content": "With an increase in commercial space flight and further exploration of our solar system on the horizon, there is a growing need for more robust integrated circuits, or chips, capable of weathering th… [+3432 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "First-Ever Appearance of Previously Undetectable Quantum Excitation Captured - AZoQuantum", "description": "A Quantum Science Center-supported team has captured the first-ever appearance of a previously undetectable quantum excitation known as the axial Higgs mode.", "url": "https://www.azoquantum.com/News.aspx?newsID=9049", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ThumbForNews_9049_1654774474242870.jpg", "publishedAt": "2022-06-09T11:53:00Z", "content": "A Quantum Science Center-supported team has captured the first-ever appearance of a previously undetectable quantum excitation known as the axial Higgs mode.\r\nThis mode manifests as a low-energy exci… [+5482 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "NASAs Curiosity rover captures strange rock pillars at Gale Crater on Mars - News9 LIVE", "description": "The structures are likely to be cemented fillings of ancient fractures in sedimentary rock", "url": "https://www.news9live.com/science/nasas-curiosity-rover-captures-strange-rock-pillars-at-gale-crater-on-mars-175340", "urlToImage": "https://www.news9live.com/images/logo.png", "publishedAt": "2022-06-09T11:20:16Z", "content": "NASA's Curiosity Rover has captured images of strange rock pillars on Mars. The size of the pillars is not apparent from the images. Over tens of thousands of years, material sinking to the bottom of… [+1739 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Adam Hunt", "title": "One-of-a-kind 'liquid telescope' is now operational in the Himalayas - TweakTown", "description": "The International Liquid-Mirror Telescope is now operational, and is the first such telescope designed exclusively for astronomy.", "url": "https://www.tweaktown.com/news/86739/one-of-kind-liquid-telescope-is-now-operational-in-the-himalayas/index.html", "urlToImage": "https://static.tweaktown.com/news/8/6/86739_01_the-worlds-first-liquid-telescope-for-astronomy-is-now-in-india_full.jpg", "publishedAt": "2022-06-09T09:38:52Z", "content": "A brand new telescope in the Indian Himalayas has been commissioned at the Devasthal Observatory campus of Aryabhatta Research Institute of Observational Sciences (ARIES).\r\nThe telescope is known as … [+1533 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Europe's GAIA Mission Will Leads to Most Complete Map of Milky Way Ever Created When Complete - Galaxy Reporters", "description": "Gaia has been glancing at our stellar neighborhood since 2014, and each of its data discharges has steered us towards taking giant leaps in our perception of the Milky Way. Astronomers have understood the precise positions of the huge numbers of stars, their …", "url": "https://galaxyreporters.com/europes-gaia-mission-will-leads-to-most-complete-map-of-milky-way-ever-created-when-complete/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/New-trove-of-data-from-Europes-Gaia-mission-will-lead-to-best-Milky-Way-map-ever.webp", "publishedAt": "2022-06-09T06:50:05Z", "content": "Gaia has been glancing at our stellar neighborhood since 2014, and each of its data discharges has steered us towards taking giant leaps in our perception of the Milky Way.\r\nAstronomers have understo… [+1125 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Neutral electron flow detected in Graphene could shape future quantum computation - India Education Diary", "description": "Physicists studying have detected counter propagating channels in two layered graphene along which certain neutral quasiparticles move in opposite directions breaking conventional norms. The detection has potential to shape the future quantum computa", "url": "https://indiaeducationdiary.in/neutral-electron-flow-detected-in-graphene-could-shape-future-quantum-computation/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2022-06-09T04:59:33Z", "content": "Physicists studying have detected counter propagating channels in two layered graphene along which certain neutral quasiparticles move in opposite directions breaking conventional norms. The detectio… [+2842 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "South Korea gives up its 1st mission dedicated to studying an asteroid - The Goa Spotlight", "description": "South Korea has decided to cancel the development of its first mission dedicated to exploring an ast", "url": "https://thegoaspotlight.com/2022/06/08/south-korea-gives-up-its-1st-mission-dedicated-to-studying-an-asteroid/", "urlToImage": "https://t.ctcdn.com.br/MHiyT40tMJCu__NWTyhjqh-rlZ8=/1086x611/smart/i559866.png", "publishedAt": "2022-06-09T00:45:00Z", "content": "South Korea has decided to cancel the development of its first mission dedicated to exploring an asteroid, citing a lack of technical capability as the reason. According to the project, a probe would… [+2228 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Pulitzer Prize awarded for reporting on the James Webb Space Telescope - BollyInside", "description": "Natalie Wolchover, a science writer at Quanta Magazine, won a Pulitzer Prize in 2022 for her work explaining the complicated story of NASA’s James Webb", "url": "https://www.bollyinside.com/news/pulitzer-prize-awarded-for-reporting-on-the-james-webb-space-telescope", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Pulitzer-Prize-awarded-for-reporting-on-the-James-Webb-Space.jpeg", "publishedAt": "2022-06-08T22:20:13Z", "content": "Natalie Wolchover, a science writer at Quanta Magazine, won a Pulitzer Prize in 2022 for her work explaining the complicated story of NASAs James Webb Space Telescope, which debuted in December.\r\nWol… [+3988 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists observe effects of heat in materials with atomic resolution: Research will benefit design of future electronic and thermoelectric technologies - Science Daily", "description": "Using cutting-edge electron microscopes and novel techniques, a team of researchers has found a way to map phonons -- vibrations in crystal lattices -- in atomic resolution, enabling deeper understanding of the way heat travels through quantum dots, engineere…", "url": "https://www.sciencedaily.com/releases/2022/06/220608161359.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-06-08T21:09:16Z", "content": "As electronic, thermoelectric and computer technologies have been miniaturized to nanometer scale, engineers have faced a challenge studying fundamental properties of the materials involved; in many … [+4891 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "On Friday, these research experiments will be sent into space. - BollyInside", "description": "On Friday, SpaceX’s Falcon-9 rocket will deliver a new supply of cargo, food, and science experiments to the International Space Station (ISS). On June", "url": "https://www.bollyinside.com/news/on-friday-these-research-experiments-will-be-sent-into-space", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/On-Friday-these-research-experiments-will-be-sent-into-space.jpeg", "publishedAt": "2022-06-08T19:44:29Z", "content": "On Friday, SpaceXs Falcon-9 rocket will deliver a new supply of cargo, food, and science experiments to the International Space Station (ISS). On June 10, the 25th cargo resupply mission will launch … [+3629 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Astronomers are puzzled by a mysterious radio signal picked up from space - BollyInside", "description": "Astronomers have discovered a neutron star unlike any other previously discovered after following a mystery radio signal from space. Manisha Caleb, a", "url": "https://www.bollyinside.com/news/astronomers-are-puzzled-by-a-mysterious-radio-signal-picked-up-from-space", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Astronomers-are-puzzled-by-a-mysterious-radio-signal-picked-up.jpeg", "publishedAt": "2022-06-08T19:32:13Z", "content": "Astronomers have discovered a neutron star unlike any other previously discovered after following a mystery radio signal from space.\r\nManisha Caleb, a lecturer at the University of Sydney, is the pro… [+3065 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Mars helicopter Ingenuity has a dead sensor but its team aims to keep flying - Space.com", "description": "The little chopper's handlers had prepared for this scenario.", "url": "https://www.space.com/ingenuity-mars-helicopter-troubleshooting-dead-navigation-sensor", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jaUPgvktJkvbg9sg8xy6iD-1200-80.jpg", "publishedAt": "2022-06-08T18:36:47Z", "content": "Ingenuity, the small helicopter that accompanied NASA's Perseverance rover to Mars, was designed to make just a handful of flight tests after the duo landed in the Red Planet's Jezero Crater in Febru… [+3455 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Synonymous mutations in representative yeast genes are mostly strongly non-neutral - Nature.com", "description": "A survey of 8,341 mutations in 21 yeast genes shows that synonymous mutations are nearly as harmful as nonsynonymous mutations, in part because they both affect the mRNA level of the gene mutated.", "url": "https://www.nature.com/articles/s41586-022-04823-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-04823-w/MediaObjects/41586_2022_4823_Fig1_HTML.png", "publishedAt": "2022-06-08T15:16:59Z", "content": "<li>Kimura, M. Genetic variability maintained in a finite population due to mutational production of neutral and nearly neutral isoalleles. Genet Res11, 247269 (1968).\r\nCAS \r\n PubMed \r\n Article \r\nGoo… [+12483 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "Researchers Develop Compact Nano-Sensor That Identifies Pesticides on Fruit - AZoSensors", "description": "In just a few minutes, scientists at Sweden’s Karolinska Institutet have developed a small sensor for identifying pesticides on fruit. The approach, which was described as real evidence in the journal Advanced Science, uses flame-sprayed silver nanoparticles …", "url": "https://www.azosensors.com/news.aspx?newsID=15074", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/news/ImageForNews_15074_16546886281945847.jpg", "publishedAt": "2022-06-08T15:01:00Z", "content": "In just a few minutes, scientists at Sweden’s Karolinska Institute have developed a small sensor for identifying pesticides on fruit. The approach, which was described as real evidence in the journal… [+4107 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Russia wants to restart Germany's black-hole searching space telescope - Space.com", "description": "German mission personnel ordered the telescope, which is mounted to a Russian spacecraft, into safe mode in response to Russia's invasion of Ukraine.", "url": "https://www.space.com/russia-wants-to-restart-german-erosita-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/N386oQgDEzUGfTb34tXB7Z-1200-80.png", "publishedAt": "2022-06-08T15:00:26Z", "content": "Russia wants to restart a German black-hole searching telescope that went to space aboard a Russian satellite in 2019. Germany ordered the telescope mothballed in early March in response to Russia's … [+4358 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Yoyo stars' found responsible for off-center cosmic bubbles - Phys.org", "description": "Astronomers have developed a new model to simulate the formation of a cluster of baby stars. Comparison with the well-known real case of the Orion Nebula shows that its off-center bubble of ionized gas was caused by a massive star that was pushed out of the n…", "url": "https://phys.org/news/2022-06-yoyo-stars-responsible-off-center-cosmic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/yoyo-stars-responsible.jpg", "publishedAt": "2022-06-08T14:50:14Z", "content": "Astronomers have developed a new model to simulate the formation of a cluster of baby stars. Comparison with the well-known real case of the Orion Nebula shows that its off-center bubble of ionized g… [+3410 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Hope for tropical sponge survival as oceans become more acidic - Phys.org", "description": "New research from Te Herenga Waka—Victoria University of Wellington shows that tropical ocean-dwelling sponges may have a good chance of survival even as Earth's oceans are impacted by climate change.", "url": "https://phys.org/news/2022-06-tropical-sponge-survival-oceans-acidic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/sea-sponge.jpg", "publishedAt": "2022-06-08T13:32:13Z", "content": "New research from Te Herenga WakaVictoria University of Wellington shows that tropical ocean-dwelling sponges may have a good chance of survival even as Earth's oceans are impacted by climate change.… [+3250 chars]"}]}