{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Capturing and tracking migratory songbirds - CBC Vancouver", "description": "A group of volunteers has been spending a lot of time at Iona Regional Park in Richmond these days. They're there to capture migratory songbirds and track th...", "url": "https://www.youtube.com/watch?v=DvuGTOVTChU", "urlToImage": "https://i.ytimg.com/vi/DvuGTOVTChU/maxresdefault.jpg", "publishedAt": "2023-05-09T01:38:49Z", "content": null}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Metaherbarium and Microreserves Could Prevent Plant Extinction: Study - LatestLY", "description": "Get latest articles and stories on Science at LatestLY.  Like animals, many plant species are struggling to adapt to a human-dominated planet. However, plants are often overlooked in conservation efforts, even though they are cheaper and easier to protect tha…", "url": "https://www.latestly.com/agency-news/science-news-metaherbarium-and-microreserves-could-prevent-plant-extinction-study-5112811.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/05/ANI-20230509002418-588x441.jpg", "publishedAt": "2023-05-09T01:18:26Z", "content": "Washington [US], May 9 (ANI): In a review published in the journal Trends in Plant Science on May 2, a plant ecologist suggested an approach for preventing all future land plant extinctions across th… [+3518 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "Webb telescope spots three debris belts around luminous star Fomalhaut | Mint - Mint", "description": "Scientists unveil observations by the James Webb Space Telescope showing three concentric dusty rings of debris around a luminous star called Fomalhaut in our own neighborhood of the Milky Way galaxy", "url": "https://www.livemint.com/science/news/webb-telescope-spots-three-debris-belts-around-luminous-star-fomalhaut-11683580158379.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/05/08/600x338/SPACE-EXPLORATION-FOMALHAUT-0_1683580585764_1683580609081.JPG", "publishedAt": "2023-05-08T21:22:29Z", "content": "WASHINGTON : There has been plenty of excitement in recent decades about planets detected orbiting various stars beyond our solar system. But planets provide an incomplete picture of the complex fram… [+3906 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "4 of Uranus' biggest moons have secret, underground oceans, new study suggests - Livescience.com", "description": "A reanalysis of Voyager data suggests that four of Uranus moons may have oceans tucked between their cores and icy crusts.", "url": "https://www.livescience.com/space/uranus/4-of-uranus-biggest-moons-have-secret-underground-oceans-new-study-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BzVwYeP7DQDWvVtJtkndN3-1200-80.png", "publishedAt": "2023-05-08T21:08:40Z", "content": "Hidden oceans may lurk under the icy crusts of four of Uranus' moons. \r\nScientists recently reanalyzed data from the Voyager spacecraft that flew by Uranus in the 1980s and found that four of Uranus'… [+3034 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "Smart Surgical Implant Coatings Warn Of Early Device Failure and Prevent Infections - HospiMedica", "description": "Orthopedic implant infections and device failure pose significant challenges. Newly-developed 'smart' coatings for orthopedic implants can now provide early warnings of device failure while eliminating infection-causing bacteria.", "url": "https://www.hospimedica.com/surgical-techniques/articles/294797092/smart-surgical-implant-coatings-warn-of-early-device-failure-and-prevent-infections.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2023-05-08/214841_hm.jpg", "publishedAt": "2023-05-08T21:07:51Z", "content": "Orthopedic implant infections and device failure pose significant challenges, affecting up to 10% of patients. Existing approaches to combat infections have significant drawbacks, as biofilms can for… [+2421 chars]"}, {"source": {"id": null, "name": "Finnoexpert.com"}, "author": null, "title": "Stanley Deser, Whose Ideas on Gravity Help Explain the Universe, Dies at 92 - Finnoexpert", "description": "Stanley Deser, a theoretical physicist who helped illuminate the details of gravity and how it shapes the space-time fabric of the universe, died on April 21", "url": "https://finnoexpert.com/2023/05/09/stanley-deser-whose-ideas-on-gravity-help-explain-the-universe-dies-at-92/", "urlToImage": "https://static01.nyt.com/images/2023/05/05/multimedia/Deser-jcml/Deser-jcml-facebookJumbo.jpg", "publishedAt": "2023-05-08T21:02:45Z", "content": "The problem we face is how to unify these two into a seamless theory of everything, said Michael Duff, an emeritus professor of physics at Imperial College London in England. Stanley was amongst the … [+1149 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Rocket Lab launches 2 small NASA satellites to monitor tropical storms - CBS Philadelphia", "description": "The satellites are designed to provide hourly updates of typhoon and hurricane development in a bid to improve forecasting and provide new insights into how ...", "url": "https://www.youtube.com/watch?v=16MsDsCmTGI", "urlToImage": "https://i.ytimg.com/vi/16MsDsCmTGI/maxresdefault.jpg", "publishedAt": "2023-05-08T20:55:01Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Russian cosmonauts conduct spacewalk on ISS - AP Archive", "description": "(3 May 2023) RESTRICTION SUMMARY: MUST CREDIT NASA++ON-SCREEN GRAPHICS AND COMMENTARY AT SOURCE++NASA - MUST CREDIT NASAInternational Space Station - 3 May 2...", "url": "https://www.youtube.com/watch?v=OvfWqlxzB7A", "urlToImage": "https://i.ytimg.com/vi/OvfWqlxzB7A/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AH-BIAC6AKKAgwIABABGGUgZShCMA8=&rs=AOn4CLB4cB9oVzLM8IDHV-W_JVcXoWm_lQ", "publishedAt": "2023-05-08T20:42:49Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Isn't Giving Up on Troubled Water-Hunting Moon Cubesat - Gizmodo", "description": "A new tactic to fire up the lunar satellite's engines has resulted in \"limited success.\"", "url": "https://gizmodo.com/nasa-troubled-water-hunting-lunar-flashlight-1850415667", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/0e60683e5ef33337012a4914bd20c190.jpg", "publishedAt": "2023-05-08T20:40:00Z", "content": "For nearly five months, teams behind NASAs Lunar Flashlight mission have been trying to get the briefcase-sized satellite to fire up its thrusters and get on the right orbital track around the Moon. … [+2994 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Chinese startup aims to debut new reusable rocket next year - Space.com", "description": "Galactic Energy hopes to make its mark with the Pallas 1.", "url": "https://www.space.com/china-galactic-energy-pallas-1-reusable-rocket", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gJNAfxLycdcziVEyDRPrGe-1200-80.jpg", "publishedAt": "2023-05-08T20:30:20Z", "content": "A Chinese launch startup is making moves toward launching its small Falcon 9-like rocket.\r\nGalactic Energy was established in 2018 and is already working toward a test launch of its Pallas 1 rocket\r\n… [+2269 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Research into bacteria may lead to new ways of treating infections, improving human health - Phys.org", "description": "New research from Nova Southeastern University (NSU) is working towards understanding human infections and unlocking how bacteria \"work together\" to make these infections much more difficult to treat. Understanding this symbiotic relationship can lead to bett…", "url": "https://phys.org/news/2023-05-bacteria-ways-infections-human-health.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/nsu-research-into-bact.jpg", "publishedAt": "2023-05-08T20:11:59Z", "content": "New research from Nova Southeastern University (NSU) is working towards understanding human infections and unlocking how bacteria \"work together\" to make these infections much more difficult to treat… [+2770 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Viruses could reshuffle the carbon cycle in a warming world - Phys.org", "description": "Microbes play important roles in ecosystems, and these roles are changing with global warming. Scientists also now know that most types of microbes are infected by viruses, but they know relatively little about how these viral infections could change how micr…", "url": "https://phys.org/news/2023-05-viruses-reshuffle-carbon-world.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/viruses-could-reshuffl.jpg", "publishedAt": "2023-05-08T19:52:02Z", "content": "Microbes play important roles in ecosystems, and these roles are changing with global warming. Scientists also now know that most types of microbes are infected by viruses, but they know relatively l… [+3284 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Research team explores the mechanism of tropical expansion under changing climate - Phys.org", "description": "Scientific evidence shows that the tropical belt around the middle of the globe is expanding. For years scientists have proposed different mechanisms that might explain this expansion. A team of researchers has now determined that the poleward advancing mid-l…", "url": "https://phys.org/news/2023-05-team-explores-mechanism-tropical-expansion.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/research-team-explores.jpg", "publishedAt": "2023-05-08T19:29:03Z", "content": "Scientific evidence shows that the tropical belt around the middle of the globe is expanding. For years scientists have proposed different mechanisms that might explain this expansion. A team of rese… [+4017 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Europe's new weather satellite delivers stunning Earth views - Learn about it! - VideoFromSpace", "description": "The Meteosat third generation imager has delivered its first imagery of Europe and Africa from 36,000 kilometers away (22,369 mi.). See the images and learn ...", "url": "https://www.youtube.com/watch?v=i1F7MIivvDo", "urlToImage": "https://i.ytimg.com/vi/i1F7MIivvDo/maxresdefault.jpg", "publishedAt": "2023-05-08T18:56:53Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "Look for 'Earthgrazers' as the Eta Aquarid meteor shower overlaps the new moon on May 19 - Space.com", "description": "With a new moon occurring on May 19, skywatchers might still be able to see a few stragglers toward the end of this annual meteor shower.", "url": "https://www.space.com/eta-aquarid-meteor-shower-poor-year-may-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5vsy9dSjAVRZepwHHEvDDB-1200-80.jpg", "publishedAt": "2023-05-08T18:30:54Z", "content": "The peak of the Eta Aquarid meteor shower is a few days behind us, having occurred just before daybreak on Saturday morning (May 6).\r\nThis meteor display is active in the first week of May but will c… [+4850 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Astronomers Watch a Star Gulp Down One of its Planets - Universe Today", "description": "Astronomers know that red giants eat planets that get too close. But they've never caught one in the act, until now.", "url": "https://www.universetoday.com/161225/astronomers-watch-a-star-gulp-down-one-of-its-planets/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/Red-Giant-Dooms-Earth.jpg", "publishedAt": "2023-05-08T17:54:39Z", "content": "A star like our Sun only shines the way it does because of its intrinsic balance. Stars are massive, and the inward gravitational pressure from all that mass acts to contain the outward thermal press… [+10322 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Secret Uncovered: Nature Study Reveals That Moon Has Solid Core Similar to Earth's - Transcontinental Times", "description": "UNITED STATES: A recent study published in the journal Nature has revealed a long-guarded secret about the moon’s internal structure. Scientists have discovered that the moon has a solid core similar to Earth’s, which was previously undetected due to its smal…", "url": "https://www.transcontinentaltimes.com/moon-has-solid-core-similar-to-earth/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/05/Earth-Moon.jpg", "publishedAt": "2023-05-08T17:53:38Z", "content": "UNITED STATES: A recent study published in the journal Nature has revealed a long-guarded secret about the moon’s internal structure. Scientists have discovered that the moon has a solid core similar… [+2365 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "Astronomers find remnants of the oldest stars in the universe - Livescience.com", "description": "A gas cloud 13 billion light-years away may be the resting place of some of the earliest stars in the universe.", "url": "https://www.livescience.com/space/cosmology/astronomers-find-remnants-of-the-oldest-stars-in-the-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8LLioqqmuJZkZdoPEYGouf-1200-80.jpg", "publishedAt": "2023-05-08T17:50:53Z", "content": "Astronomers may have just found the remnants of some of the universe's very first stars. The chemical signatures of these faraway, 13-plus-billion-year-old objects are remarkably different from those… [+2269 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jaden Hill", "title": "Patagonian ice field sediment cores reveal glacial waxing and waning over thousands of years - Phys.org", "description": "A team of researchers began their journey around frigid Patagonia, moving through water channels to reach the fjords, surrounded by ice and snow. They withstood freezing temperatures throughout their journey, all in the hope of extracting the perfect sediment…", "url": "https://phys.org/news/2023-05-patagonian-ice-field-sediment-cores.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/patagonian-ice-field-s.jpg", "publishedAt": "2023-05-08T17:37:07Z", "content": "A team of researchers began their journey around frigid Patagonia, moving through water channels to reach the fjords, surrounded by ice and snow. They withstood freezing temperatures throughout their… [+6878 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Study offers explanation for why there are so few insects in the ocean - Phys.org", "description": "Scientists from Tokyo Metropolitan University have proposed a hypothesis for why insects are so rare in marine environments. They previously showed that insects evolved a unique chemical mechanism to harden their shells that uses molecular oxygen and an enzym…", "url": "https://phys.org/news/2023-05-explanation-insects-ocean.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/why-are-there-so-few-i.jpg", "publishedAt": "2023-05-08T17:11:38Z", "content": "Scientists from Tokyo Metropolitan University have proposed a hypothesis for why insects are so rare in marine environments. They previously showed that insects evolved a unique chemical mechanism to… [+3749 chars]"}, {"source": {"id": null, "name": "EcoWatch"}, "author": "Cristen Hemingway Jaynes", "title": "Dust Nourishes Phytoplankton, Boosting Ocean's Ability to Store Carbon, Study Finds - EcoWatch", "description": "New research explores dust’s part in helping to sustain marine life while also regulating carbon dioxide levels in the atmosphere.", "url": "https://www.ecowatch.com/dust-phytoplankton-oceans.html", "urlToImage": "https://www.ecowatch.com/wp-content/uploads/2023/05/nasa-dust-storm.jpg", "publishedAt": "2023-05-08T16:38:02Z", "content": "Dust, tiny particles of everything from skin tissue to microplastics, lifted by the wind to settle on a table, the fur of an Arctic fox or the surface of the ocean. Dust is something seen by humans a… [+4615 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Tiny microbes could brew big benefits for green biomanufacturing - Nanowerk", "description": "Scientists find new route in bacteria to decarbonize industry. The discovery could reduce greenhouse gas emissions from the manufacturing of fuels, drugs, and chemicals.", "url": "https://www.nanowerk.com/news2/green/newsid=62956.php", "urlToImage": "https://www.nanowerk.com/news2/green/id62956.jpg", "publishedAt": "2023-05-08T16:03:36Z", "content": "Nanowerk Newsletter\r\nGet our Cleantech News updates to your inbox!"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Nose shape affected by genetic material inherited from Neanderthals - News-Medical.Net", "description": "Humans inherited genetic material from Neanderthals that affects the shape of our noses, finds a new study led by UCL researchers.", "url": "https://www.news-medical.net/news/20230508/Nose-shape-affected-by-genetic-material-inherited-from-Neanderthals.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Gene-620x480.jpg", "publishedAt": "2023-05-08T15:59:00Z", "content": "Humans inherited genetic material from Neanderthals that affects the shape of our noses, finds a new study led by UCL researchers.\r\nThe new Communications Biology study finds that a particular gene, … [+3406 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Seeing the 3D genome like never before - Massachusetts Institute of Technology (MIT)", "description": "Using a new technique, MIT engineers are able to analyze the 3D organization of the genome at a resolution 100 times higher than before making their images t...", "url": "https://www.youtube.com/watch?v=oybAJIeVT-s", "urlToImage": "https://i.ytimg.com/vi/oybAJIeVT-s/maxresdefault.jpg", "publishedAt": "2023-05-08T15:02:56Z", "content": null}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Quantum Fluids of Light Come into Sharper View - Physics", "description": "Experiments probing quasiparticles in semiconductor microcavities offer unprecedented insights into the dynamics of quantum fluids of light.", "url": "https://physics.aps.org/articles/v16/74", "urlToImage": "https://physics.aps.org/assets/87ddc2bf-c7ba-432a-81cb-ccdb0458b589/e74_3_thumb.png", "publishedAt": "2023-05-08T15:01:23Z", "content": "Figure 1:Sketch of the “pump-probe” setup used by Claude and co-workers to characterize the fluid of polaritons in a semiconductor cavity. A “pump” laser pulse (red) generated polaritons via photoexc… [+9342 chars]"}, {"source": {"id": null, "name": "Pandaily.com"}, "author": "Pandaily", "title": "Chinese Scientists Discover Lunar Glass Materials from Lunar Soil - Pandaily", "description": "On May 8, according to a report from the Institute of Physics, Chinese Academy of Sciences, a team led by academician Wang Weihua recently conducted systematic material science research on lunar soil samples collected by Chang'E-5 mission from a unique perspe…", "url": "https://pandaily.com/chinese-scientists-discover-lunar-glass-materials-from-lunar-soil/", "urlToImage": "https://assets.pandaily.com/uploads/2023/05/1-2.jpg", "publishedAt": "2023-05-08T14:32:46Z", "content": "On May 8, according to a report from the Institute of Physics, Chinese Academy of Sciences, a team led by academician Wang Weihua recently conducted systematic material science research on lunar soil… [+2399 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "#CosmicMystery: Win a trip to Euclid mission control - European Space Agency", "description": "Help us visualise how much of the Universe we know and don’t know and win a trip to mission control as ESA’s Euclid mission launches into space no earlier than July to unlock the mysteries of the Dark Universe.", "url": "https://www.esa.int/Science_Exploration/Space_Science/Euclid/CosmicMystery_Win_a_trip_to_Euclid_mission_control", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/05/cosmicmystery_contest_visual/24871722-1-eng-GB/CosmicMystery_contest_visual_pillars.png", "publishedAt": "2023-05-08T13:52:21Z", "content": "Science &amp; Exploration08/05/2023580 views10 likes\r\nHelp us visualise how much of the Universe we know and dont know and win a trip to mission control as ESAs Euclid mission launches into space no … [+7848 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "DH Web Desk", "title": "NASA's snake-like robot on a mission to discover life on Saturn's moon - Deccan Herald", "description": "The National Aeronautics and Space Administration (NASA) is onto something out of the world, quite literally. It is currently undertaking the task of developing a snake-like robot which is said to explore internal and enclosed dynamic terrain structures, asse…", "url": "https://www.deccanherald.com/science-and-environment/nasas-snake-like-robot-on-a-mission-to-discover-life-on-saturns-moon-1216836.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/05/08/befunky-collage-1216836-1683552273.png", "publishedAt": "2023-05-08T13:24:33Z", "content": "The National Aeronautics and Space Administration (NASA) is onto something out of the world, quite literally. It is currently undertaking the task of developing a snake-like robot which is said to ex… [+1855 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Polar bear fur inspires solar-thermal textiles – Physics World - physicsworld.com", "description": "New fabric is 30% lighter in weight than cotton and keeps wearers warmer at colder temperatures", "url": "https://physicsworld.com/a/polar-bear-fur-inspires-solar-thermal-textiles/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2023/05/polar-bear-145969469-Shutterstock_Fotokon.jpg", "publishedAt": "2023-05-08T13:04:27Z", "content": "Inspired by polar bears: this new textile creates an on-body greenhouse effect to keep you warm. (Courtesy: W Viola et al. ACS Appl. Mater. Interfaces 10.1021/acsami.2c23075)\r\nA new double-layered fa… [+4211 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Tatyana Woodall", "title": "To Live on Mars, Human Architecture Has to Combine Science and Sci-Fi - Inverse", "description": "As NASA’s desire for planned crewed missions to Mars becomes reality, establishing safe human settlements for life off-Earth is one of the agency’s most urgent tasks.", "url": "https://www.inverse.com/science/future-of-design-mars-architecture", "urlToImage": "https://imgix.bustle.com/uploads/getty/2023/5/5/56c25f38-8bd3-4ccf-9e30-25915ac76780-getty-122374517.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-05-08T13:00:25Z", "content": "Our homes are the places that define us; those warm private spaces that we depend on for work, respite, and haven from the harsh realities of the wider world. On Earth, the buildings and dwellings hu… [+11123 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Electron re-collision tracked in real time - Phys.org", "description": "The motion of an electron in a strong infrared laser field is tracked in real time by means of a novel method developed by MPIK physicists and applied to confirm quantum-dynamics theory by cooperating researchers at MPI-PKS. The experimental approach links th…", "url": "https://phys.org/news/2023-05-electron-re-collision-tracked-real.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/electron-recollision-t.jpg", "publishedAt": "2023-05-08T13:00:03Z", "content": "The motion of an electron in a strong infrared laser field is tracked in real time by means of a novel method developed by MPIK physicists and applied to confirm quantum-dynamics theory by cooperatin… [+4685 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "The reason behind not detecting aliens yet revealed - Times of India", "description": "Trending News: Interesting theory on why we haven't been able to detect aliens yet. The scientists say it could be", "url": "https://timesofindia.indiatimes.com/etimes/trending/the-reason-behind-not-detecting-aliens-yet-revealed/articleshow/100075622.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100075610,width-1070,height-580,imgsize-333816,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-05-08T12:05:00Z", "content": null}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Nanopore Single-Molecule Sensing for Glycan Detection - AZoNano", "description": "Recently, a collaborative research team from the Dalian Institute of Chemical Physics (DICP) of the Chinese Academy of Sciences (CAS), under the direction of Prof. Guangyan Qing and Prof. Xinmiao Liang, developed a glycan identification method based on nanopo…", "url": "https://www.azonano.com/news.aspx?newsID=40227", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_40227_16835474121144869.jpg", "publishedAt": "2023-05-08T12:04:00Z", "content": "Numerous cellular processes depend on glycans for a variety of crucial functions. Glycans play a wide variety of functions, and their intricate structures, which are the result of variations in compo… [+2548 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Kabir Firaque", "title": "‘Not a victim’: Rosalind Franklin’s role in solving the mystery of DNA structure - Hindustan Times", "description": "Popular narrative sees her as a scientist whose data was stolen. But she must be remembered as an equal contributor, write researchers revisiting her story", "url": "https://www.hindustantimes.com/science/not-a-victim-rosalind-franklin-s-role-in-solving-the-mystery-of-dna-structure-101683539995747.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/08/1600x900/Rosalind-franklin-in-paris_1683543296788_1683543309750.jpg", "publishedAt": "2023-05-08T11:12:01Z", "content": "New Delhi: It is a story often told and retold in scientific lore, a story of denial, yet also of inspiration, the story of Rosalind Franklin. The iconic British scientists work, some of it shared wi… [+8562 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Korean probe Danuri sends stunning images of craters on the Moon - India Today", "description": "The images were beamed back by the probe in April and show four craters on Moon - Tsiolkovsky crater, Schrödinger Valley, Wichmann Crater, and the Szilard M Crater.", "url": "https://www.indiatoday.in/science/story/korean-probe-danuri-sends-stunning-images-of-craters-on-the-moon-2376399-2023-05-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202305/tsiolkovsky-sixteen_nine.jpg?VersionId=rSF_mKrSI_YJO2F.W9Tsl3zpzZlMJ7yc", "publishedAt": "2023-05-08T10:54:01Z", "content": "By India Today Science Desk: Months after it entered into lunar orbit, South Korea's Danuri spacecraft has beamed back incredibly detailed images of the craters on the Moon.\r\nThe Korea Pathfinder Lun… [+2140 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Nanotechnology and Ceramics: Innovations in Nanolithography - AZoNano", "description": "In this article, AZoNano discusses the different nanolithography techniques that can be utilized for fabricating ceramic micro- and nanostructures.", "url": "https://www.azonano.com/article.aspx?ArticleID=6451", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6451_16835417544489523.jpg", "publishedAt": "2023-05-08T10:36:00Z", "content": "In this article, AZoNano discusses the different nanolithography techniques that can be utilized for fabricating ceramic micro- and nanostructures. It also discusses the use of nanomaterials in these… [+10024 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Reconstruct Skull Of \"Tadpole\"-Like Ancient Predator - NDTV", "description": "Researchers from University College London say that their latest research shows the animal had huge teeth and powerful jaws.", "url": "https://www.ndtv.com/science/scientists-reconstruct-skull-of-tadpole-like-ancient-predator-4015279", "urlToImage": "https://c.ndtvimg.com/2023-05/2vdi543o_ancient-predator-skull-1200_625x300_08_May_23.jpg", "publishedAt": "2023-05-08T10:17:14Z", "content": "Crassigyrinus scoticus was a crocodile-like creature that roamed the Earth 330 million years ago.\r\nScientists have digitally reconstructed the face of a 330 million-year-old crocodile-like predator t… [+1844 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Fermin Koop", "title": "Researchers create centipede robots that can save people from earthquake rubble - ZME Science", "description": "The more legs a robot has, the better. At least sometimes.", "url": "https://www.zmescience.com/research/inventions/researchers-create-centipede-robots-that-can-save-people-from-earthquake-rubble/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/05/0A6A7294-1-1-scaled.jpg", "publishedAt": "2023-05-08T09:46:43Z", "content": "A team of researchers from the Georgia Institute of Technology in the US created a number of robots inspired by the centipede. Each robot has a different number of legs to see which worked best on di… [+3494 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Oregon research shows stem cells harness the power of wrinkles when divided in two - India Education Diary", "description": "What seems like a straightforward task for a cell — dividing in two — is actually an intricate series of engineering puzzles. A dividing cell needs to maneuver its insides so that the right components will end up in each cell, to produce two function", "url": "https://indiaeducationdiary.in/university-of-oregon-stem-cells-harness-the-power-of-wrinkles-when-divided-in-two/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2023-05-08T09:33:59Z", "content": "What seems like a straightforward task for a cell dividing in two is actually an intricate series of engineering puzzles. A dividing cell needs to maneuver its insides so that the right components wi… [+2937 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Comparative plastome genomics, taxonomic delimitation and evolutionary divergences of Tetraena hamiensis var. qatarensis and Tetraena simplex (Zygophyllaceae) | Scientific Reports - Nature.com", "description": "Scientific Reports - Comparative plastome genomics, taxonomic delimitation and evolutionary divergences of Tetraena hamiensis var. qatarensis and Tetraena simplex (Zygophyllaceae)", "url": "https://www.nature.com/articles/s41598-023-34477-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-34477-1/MediaObjects/41598_2023_34477_Fig1_HTML.png", "publishedAt": "2023-05-08T09:32:59Z", "content": "<li>Liu, J. et al. Integrating a comprehensive DNA barcode reference library with a global map of yews (Taxus L.) for forensic identification. Mol. Ecol. Resour.18, 11151131 (2018).\r\nArticle \r\n CAS \r… [+28912 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Tech Desk", "title": "Asteroid Incoming! South Bombay House-Sized Space Rock Speeds Towards Earth on May 9th - Times Now", "description": "The Apollo-group asteroid 2023 HG1 is set to make a close approach to Earth, traveling at a speed of 7200kmph.", "url": "https://www.timesnownews.com/technology-science/asteroid-incoming-south-bombay-house-sized-space-rock-speeds-towards-earth-on-may-9th-article-100070409", "urlToImage": "https://static.tnn.in/thumb/msid-100070409,updatedat-1683536795111,width-1280,height-720,resizemode-75/100070409.jpg", "publishedAt": "2023-05-08T09:06:35Z", "content": "AP SSC Result Today LIVE (OUT): AP 10th Results DECLARED on bse.ap.gov.in, Details on Marks Memo, Pass Percentage and More"}, {"source": {"id": null, "name": "Mmnews.tv"}, "author": "MM News Staff", "title": "Astronomers detect Black Hole devouring a Star - MM News", "description": "Astronomers have discovered a new tidal tidal disruption event (TDE) in the NGC 7392 galaxy, 137 m...", "url": "https://mmnews.tv/astronomers-detect-black-hole-devouring-a-star/", "urlToImage": "https://mmnews.tv/wp-content/uploads/2023/05/Untitled-1-copy-42.jpg", "publishedAt": "2023-05-08T09:04:07Z", "content": "Astronomers have discovered a new tidal tidal disruption event (TDE) in the NGC 7392 galaxy, 137 million light-years from Earth, providing insight into how supermassive black holes rip apart passing … [+1431 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Kate Plummer", "title": "Scientists discover that the origins of human life began in the Sun - indy100", "description": "People have been struggling with the question of how human life started for years and years.It is the ultimate existential question and previously scientists have considered the role of lightning, while religious people obviously have other ideas.And now scie…", "url": "https://www.indy100.com/science-tech/origins-human-life-sun-science", "urlToImage": "https://www.indy100.com/media-library/what-if-earth-orbited-the-sun-at-the-speed-of-light.jpg?id=32020148&width=1200&height=600&coordinates=0%2C1040%2C0%2C1041", "publishedAt": "2023-05-08T09:02:00Z", "content": "People have been struggling with the question of how human life started for years and years.\r\nIt is the ultimate existential question and previously scientists have considered the role of lightning, … [+1668 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Black hole image! 'H' is for Hot and Huge in Chandra X-ray Observatory image, NASA reveals - HT Tech", "description": "Black hole image H is for Hot and Huge in Chandra Xray Observatory image NASA reveals A giant black hole at the center of a massive elliptical galaxy is making a mark on its surroundings reveals NASA. It has an Hshaped structure and is found in a detailed new…", "url": "https://tech.hindustantimes.com/web-stories/black-hole-image-h-is-for-hot-and-huge-in-chandra-x-ray-observatory-image-nasa-reveals-71683457466350.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/08/1600x900/image_1683457951862_1683536054036.png/", "publishedAt": "2023-05-08T08:56:10Z", "content": "Photo Credit: NASA\r\n  A giant black hole at the center of a massive elliptical galaxy is making a mark on its surroundings, reveals NASA.\r\nPhoto Credit: NASA\r\n  It has an \"H\"-shaped structure and is … [+2090 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "How Can We Detect Chemical Manufacturing Contamination? - AZoSensors", "description": "AZoSensors explores how biosensors can be used to detect chemical manufacturing contamination.", "url": "https://www.azosensors.com/article.aspx?ArticleID=2810", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/Article_Images/SocialSharingImage_2810_16832822506251613.jpg", "publishedAt": "2023-05-08T08:05:02Z", "content": "Cancer, animal mortality, and environmental damage are just some of the harmful effects of chemical contamination. Here, we look at the role that biosensors play in the rapid detection of these conta… [+7084 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble snaps a cosmic leviathan almost nine billion light-years away from Earth - Devdiscourse", "description": "Read more about Hubble snaps a cosmic leviathan almost nine billion light-years away from Earth on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2443731-hubble-snaps-a-cosmic-leviathan-almost-nine-billion-light-years-away-from-earth", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_05_2023_13_23_41_1270808.jpg?width=920&format=jpeg", "publishedAt": "2023-05-08T07:54:24Z", "content": "In the center of this image captured by the Hubble Space Telescope lies a vast galaxy cluster. Just as a submerged sea monster causes waves and disturbances on the surface, the gravitational influenc… [+1825 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Sun ejected 14 solar flare and 31 coronal mass ejections last week - Devdiscourse", "description": "Read more about Sun ejected 14 solar flare and 31 coronal mass ejections last week on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2443665-sun-ejected-14-solar-flare-and-31-coronal-mass-ejections-last-week", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/08_05_2023_12_09_19_6729569.jpg?width=920&format=jpeg", "publishedAt": "2023-05-08T06:49:05Z", "content": "Gif Credit: Twitter (@NASASun)\r\nOver the past week, our celestial neighbour and life-giving star, the Sun, unleashed a flurry of solar activity. According to NASA, 14 notable solar flares and 31 coro… [+1992 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Adithyan P", "title": "What Will the Artemis Moon Base Look Like? - News18", "description": "The US space agency plans to maintain a human presence, for the very first time, on a celestial body other than Earth.", "url": "https://www.news18.com/buzz/what-will-the-artemis-moon-base-look-like-7749463.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/nasa-2-168352380016x9.png", "publishedAt": "2023-05-08T05:30:52Z", "content": "The next time NASA goes to the Moon, it intends to stay. Under the Artemis program, the US space agency plans to maintain a human presence, for the very first time, on a celestial body other than Ear… [+4810 chars]"}, {"source": {"id": null, "name": "Novuslight.com"}, "author": null, "title": "Robots Conduct Autonomous Scientific Experiments - Novus Light Technologies Today", "description": "The artificial intelligence platform, dubbed BacterAI, mapped the metabolism of two microbes associated with oral health.", "url": "https://www.novuslight.com/robots-conduct-autonomous-scientific-experiments_N12822.html", "urlToImage": "https://www.novuslight.com/uploads/n/Jensen.jpg", "publishedAt": "2023-05-08T05:30:00Z", "content": "Researchers from the University of Michigan developed an artificial intelligence system that enables robots to conduct autonomous scientific experiments that can escalate the pace of discovery in are… [+3160 chars]"}, {"source": {"id": null, "name": "Stardate.org"}, "author": null, "title": "Noisy Mergers - Stardate.org", "description": "A hypermassive neutron star defies gravity. Instead of instantly collapsing to form a black hole, it keeps itself puffed up. But only for a while. In the end, gravity always wins.A neutron star is the ultra-dense corpse of a once mighty star. It’s more massiv…", "url": "https://stardate.org/radio/program/2023-05-08", "urlToImage": null, "publishedAt": "2023-05-08T05:13:11Z", "content": "A hypermassive neutron star defies gravity. Instead of instantly collapsing to form a black hole, it keeps itself puffed up. But only for a while. In the end, gravity always wins.\r\nA neutron star is … [+1260 chars]"}, {"source": {"id": null, "name": "Dunya News"}, "author": null, "title": "Dragon crew ship docks to new port - Dunya News", "description": "This was the 27th spacecraft relocation in space station history", "url": "https://dunyanews.tv/en/Technology/721922-Dragon-Crew-Ship-Docks-to-New-Port", "urlToImage": "https://img.dunyanews.tv/news/2023/May/05-08-23/news_big_images/721922_13708583.jpg", "publishedAt": "2023-05-08T04:16:44Z", "content": "Technology\r\nThis was the 27th spacecraft relocation in space station history\r\n(Web Desk) - The SpaceX Dragon, with Expedition 69 crew members Steve Bowen and Woody Hoburg of NASA, UAE (United Arab Em… [+536 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Algorithm can eavesdrop on satellite constellations to provide global positioning data - News9 LIVE", "description": "The algorithm exploits signals broadcast by constellations of satellites in low Earth orbit such as Starlink or OneWeb,", "url": "https://www.news9live.com/science/algorithm-can-eavesdrop-on-satellite-constellations-to-provide-global-positioning-data-2130036", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/05/Mega-constellation_coverage_pillars-Cropped.jpg", "publishedAt": "2023-05-08T04:15:42Z", "content": "The algorithm exploits signals broadcast by constellations of satellites in low Earth orbit such as Starlink or OneWeb,\r\nResearchers have developed an algorithm that snoops on signals broadcasted by … [+2063 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Advanced X-ray technique unveils fast solid-gas chemical reaction pathways - Chemie.de", "description": "For the rational design of new material compounds, it is important to understand the mechanisms underlying their synthesis. Analytical techniques such as nuclear magnetic resonance and spectroscop ...", "url": "https://www.chemeurope.com/en/news/1180394/advanced-x-ray-technique-unveils-fast-solid-gas-chemical-reaction-pathways.html", "urlToImage": "https://img.chemie.de/Portal/News/6454bdb1d4902_d--YBQGYy.png?tr=n-xzoom", "publishedAt": "2023-05-08T04:07:58Z", "content": "For the rational design of new material compounds, it is important to understand the mechanisms underlying their synthesis. Analytical techniques such as nuclear magnetic resonance and spectroscopy a… [+3273 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Forget Asteroids, this cosmic item may pose an even greater threat to worlds out there - HT Tech", "description": "Forget Asteroids this cosmic item may pose an even greater threat to worlds out there Asteroids generate fear about their immense destructive power. After all an asteroid has been blamed for the extinction of dinosaurs. And they can very well have terrifying …", "url": "https://tech.hindustantimes.com/web-stories/forget-asteroids-this-cosmic-item-may-pose-an-even-greater-threat-to-worlds-out-there-71683517275463.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/08/1600x900/super_nova_1683517963812_1683518448298.jpg/", "publishedAt": "2023-05-08T04:02:28Z", "content": "Photo Credit: NASA\r\n Asteroids generate fear about their immense destructive power. After all, an asteroid has been blamed for the extinction of dinosaurs. And they can very well have terrifying cons… [+1920 chars]"}, {"source": {"id": null, "name": "Ens-newswire.com"}, "author": null, "title": "Amazon's 'Dark Earth' Secret Promises Global Forest Renewal - Environment News Service", "description": "%environment_news_service%", "url": "https://ens-newswire.com/amazons-dark-earth-secret-promises-global-forest-renewal/", "urlToImage": null, "publishedAt": "2023-05-08T01:54:45Z", "content": "SAO PAULO, Brazil, May 7, 2023 (ENS) – Millions of Amerindian people living centuries ago in todays Amazonia transformed the originally poor soil. The result is Amazonian dark earth, ADE, or terra pr… [+5810 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Iron-depleted, oxidized chemistry of Earth's continental crust not from crystallization of mineral garnet: Study - Devdiscourse", "description": "The iron-poor composition of continental crust is a major reason why vast portions of the Earth's surface stand above sea level as dry land, making terrestrial life possible today.", "url": "https://www.devdiscourse.com/article/science-environment/2443506-iron-depleted-oxidized-chemistry-of-earths-continental-crust-not-from-crystallization-of-mineral-garnet-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_05_2023_01_50_13_5242831.jpg?width=920&format=jpeg", "publishedAt": "2023-05-08T01:50:15Z", "content": "A new research attempted to determine the understanding of Earth's crust by testing and ultimately eliminating one popular hypothesis about why continental crust is lower in iron and more oxidized co… [+6747 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "AI is helping astronomers make new discoveries and learn about the universe faster than ever before - EastMojo", "description": "AI has spread into every field of astronomy. As the technology has become more powerful, AI algorithms have begun helping astronomers tame massive data sets and discover new knowledge about the universe.", "url": "http://www.eastmojo.com/space/2023/05/08/ai-is-helping-astronomers-make-new-discoveries-and-learn-about-the-universe-faster-than-ever-before/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/01/universe_2250310_1920.jpg?fit=1920%2C1280&ssl=1", "publishedAt": "2023-05-08T01:30:00Z", "content": "The famous first image of a black hole just got two times sharper. A research team used artificial intelligence to dramatically improve upon its first image from 2019, which now shows the black hole … [+8329 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "Reconstructing ancient bacterial genomes can revive previously unknown molecules – offering a potential source for new antibiotics - Daily Excelsior", "description": "Washington, May 7:Microorganisms – in particular bacteria – are skillful chemists that can produce an impressive diversity of chemical compounds known as natural products. These metabolites provide the microbes major evolutionary advantages, such as allowing …", "url": "https://www.dailyexcelsior.com/reconstructing-ancient-bacterial-genomes-can-revive-previously-unknown-molecules-offering-a-potential-source-for-new-antibiotics/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2023/05/download-13-6.jpg", "publishedAt": "2023-05-08T00:31:04Z", "content": "Washington, May 7:Microorganisms in particular bacteria are skillful chemists that can produce an impressive diversity of chemical compounds known as natural products.These metabolites provide the mi… [+6380 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Abhinav Yadav", "title": "Why care about space — Part 2. More Subtle Reasons | by Abhinav Yadav | May, 2023 - Medium", "description": "Continuing from Why care about space series — these are subtle reasons that not everyone stops to think about. Did you know that Einstein’s theory of relativity has a practical application in our…", "url": "https://travellingthroughspace.medium.com/why-care-about-space-part-2-e7dcca62b29a", "urlToImage": "https://miro.medium.com/v2/da:true/resize:fit:768/1*AohVPQQRwKx4fa1DhOO42g.gif", "publishedAt": "2023-05-07T21:58:15Z", "content": "Continuing from Why care about spaceseries these are subtle reasons that not everyone stops to think about.\r\nNavigating our daily lives \r\nDid you know that Einsteins theory of relativity has a practi… [+3434 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Worlds Largest “Raptor” Dinosaurs Lived 10 Million Years Earlier Than Thought - SciTechDaily", "description": "The Utahraptor, the world's largest \"raptor\" dinosaur, is now estimated to be 135 million years old, 10 million years older than previously thought. The discovery has important implications for dinosaur evolutionary history and narrows the gap in the rock rec…", "url": "https://scitechdaily.com/worlds-largest-raptor-dinosaurs-lived-10-million-years-earlier-than-thought/", "urlToImage": "https://scitechdaily.com/images/Utahraptors-Prey-Trapped-Quicksand-Deposit.jpg", "publishedAt": "2023-05-07T19:14:41Z", "content": "ByUniversity of KansasMay 7, 2023\r\nCsotonyi illustration: Portrayal of Utahraptors and prey trapped in quicksand deposit of the Stikes Quarry bone bed at Utahraptor Ridge. A recent geological study h… [+5631 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: New Space Exploration Partner, Mars Experience on Earth, Black Hole Week - SciTechDaily", "description": "Another partner for space exploration … A Mars experience right here on Earth … And a promising find outside our solar system … A few of the stories to tell you about – This Week at NASA! https://youtu.be/9CbCEsfZ7BE Another Nation Signs Up for Exploration Co…", "url": "https://scitechdaily.com/?p=275105", "urlToImage": "https://scitechdaily.com/images/GJ-486-b-Exoplanet-Star.jpg", "publishedAt": "2023-05-07T14:18:52Z", "content": "ByNASAMay 7, 2023\r\nGJ 486 b is about 30% larger than the Earth and three times as massive, which means it is a rocky world with stronger gravity than Earth. It orbits a red dwarf star in just under 1… [+3569 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "All about LIGO-India project, which has put country on elite astronomy map - The Federal", "description": "What is the LIGO-India project for which the Centre has approved Rs 2,600 crore? When will it start operating and why is it important? Here are your questions answered.", "url": "https://thefederal.com/explainers-2/all-about-ligo-india-project-which-has-put-country-on-elite-astronomy-map/", "urlToImage": "https://thefederal.com/file/2023/05/LIGO_India_site.jpg", "publishedAt": "2023-05-07T11:58:33Z", "content": "Last month, the Union Cabinet cleared Rs 2,600 crore for the Laser Interferometer Gravitational-Wave Observatory (LIGO) project that will come up in Hingoli, Maharashtra, some 590 km east of Mumbai. … [+5507 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Webb finds water vapor near star with exoplanet - EarthSky", "description": null, "url": "https://earthsky.org/space/water-vapor-gj-486-b-exoplanets-webb/", "urlToImage": "https://earthsky.org/upl/2023/05/GJ486b-exoplanet-artist-concept-May-1-2023.jpeg", "publishedAt": "2023-05-07T11:50:59Z", "content": "View larger. | Artist’s concept of GJ 486 b, a rocky exoplanet orbiting a red dwarf star 26 light-years from Earth. NASA’s Webb Space Telescope has found tentative evidence for water vapor on the pla… [+6499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Shares Old Pic Showing Saturn's Glorious Rings In Natural Colour - NDTV", "description": "NASA recently shared an old mesmerising picture of Saturn showing the gas giant's golden north hemisphere and its main rings in natural colour.", "url": "https://www.ndtv.com/science/nasa-shares-old-pic-showing-saturns-glorious-rings-in-natural-colour-4013163", "urlToImage": "https://c.ndtvimg.com/2023-05/tj7lcus8_saturn-pic_625x300_07_May_23.jpg", "publishedAt": "2023-05-07T10:46:29Z", "content": "In the picture, Saturn appears half-lit in gold, blue, and tan shades.\r\nNASA often shares space pictures and videos on its social media handle which usually leaves netizens mesmerised. The space agen… [+1795 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 7 May 2023: Helix Nebula! Will our Sun turn into THIS? - HT Tech", "description": "NASA Astronomy Picture of the Day today is that of a Helix Nebula, which is said to be formed by the death of a Sun-like star.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-7-may-2023-helix-nebula-will-our-sun-turn-into-this-71683455437252.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/07/1600x900/Helix2_CFHT_960_1683455489464_1683455495561.jpg", "publishedAt": "2023-05-07T10:32:17Z", "content": "Nebulae are colossal clouds of gas and dust in outer space that serve as the birthplace of stars, commonly referred to as \"stellar nurseries,\" and occasionally the site of their demise - and sometime… [+1736 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Scientists reveal how massive galaxies form in early universe - ThePrint", "description": "Beijing [China], May 7 (ANI/WAM): An international team of scientists has proved that gas recycling is the key factor in the formation of massive galaxies in the early universe and this discovery came after they observed a nebula located 11 billion light-year…", "url": "https://theprint.in/world/scientists-reveal-how-massive-galaxies-form-in-early-universe/1560884/", "urlToImage": null, "publishedAt": "2023-05-07T09:15:41Z", "content": "Beijing [China], May 7 (ANI/WAM): An international team of scientists has proved that gas recycling is the key factor in the formation of massive galaxies in the early universe and this discovery cam… [+1651 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "ISRO to Make History with Back-to-Back Moon and Sun Missions in July - Transcontinental Times", "description": "INDIA: The Indian Space Research Organisation (ISRO) is gearing up for two back-to-back missions in July 2023. The missions, Chandrayaan 3 and Aditya L1, are set to be historic feats in India’s space research sector. Chandrayaan 3 will be India’s third moon m…", "url": "https://www.transcontinentaltimes.com/isro-back-to-back-moon-sun-missions/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/05/ISRO-Aditya-L1.jpg", "publishedAt": "2023-05-07T08:52:32Z", "content": "INDIA: The Indian Space Research Organisation (ISRO) is gearing up for two back-to-back missions in July 2023. The missions, Chandrayaan 3 and Aditya L1, are set to be historic feats in India’s space… [+2377 chars]"}, {"source": {"id": null, "name": "Newsroomodisha.com"}, "author": "Newsroom Odisha Network", "title": "Cow urine can be a boon for humans: IVRI - Newsroom Odisha", "description": "Lucknow: In a research, the senior scientists of the Indian Veterinary Research Institute (IVRI) in Bareilly have found that cow urine extract is rich in antibacterial and antifungal properties and a boon for humans.The four-year-long study conducted", "url": "https://newsroomodisha.com/cow-urine-can-be-a-boon-for-humans-ivri/", "urlToImage": "https://newsroomodisha.com/wp-content/uploads/2023/05/17f1487a76612a1630ac08cff1ecc01a-Gxwd7u.jpeg", "publishedAt": "2023-05-07T08:43:22Z", "content": "Lucknow: In a research, the senior scientists of the Indian Veterinary Research Institute (IVRI) in Bareilly have found that cow urine extract is rich in antibacterial and antifungal properties and a… [+1198 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "MIT engineers “grow” atomically thin transistors on top of computer chips - India Education Diary", "description": "Emerging AI applications, like chatbots that generate natural human language, demand denser, more powerful computer chips. But semiconductor chips are traditionally made with bulk materials, which are boxy 3D structures, so stacking multiple layers o", "url": "https://indiaeducationdiary.in/mit-engineers-grow-atomically-thin-transistors-on-top-of-computer-chips/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2023-05-07T04:36:08Z", "content": "Emerging AI applications, like chatbots that generate natural human language, demand denser, more powerful computer chips. But semiconductor chips are traditionally made with bulk materials, which ar… [+8368 chars]"}]}