{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk's Starship Does A Splashdown In The Sea: What It Means - NDTV", "description": "Elon Musk's SpaceX has achieved a remarkable feat with the successful splashdown of its Starship rocket system. This was the vehicle's fourth test flight and its first controlled return and soft ocean landing.", "url": "https://www.ndtv.com/world-news/elon-musk-s-starship-does-a-splashdown-in-the-sea-what-it-means-5836726", "urlToImage": "https://c.ndtvimg.com/2024-06/3tf8prhg_starship-reuters_625x300_07_June_24.jpeg?ver-20240506.08", "publishedAt": "2024-06-07T06:21:47Z", "content": "Splashdowns were first used in the early days of space exploration.\r\nElon Musk's SpaceX has achieved a remarkable feat with the successful splashdown of its Starship rocket system. This was the vehic… [+2482 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Beth Ridgeway", "title": "NASA, Global Astronomers Await Rare Nova Explosion - NASA", "description": "Around the world, professional and amateur astronomers alike are closely watching T Coronae Borealis – the “Blaze Star,” a binary system some 3,000 light-years from Earth – waiting for an impending nova explosion event so bright it will be visible on Earth wi…", "url": "https://www.nasa.gov/centers-and-facilities/marshall/nasa-global-astronomers-await-rare-nova-explosion/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/06/novacyg093500952-print.jpg", "publishedAt": "2024-06-06T15:28:46Z", "content": "Around the world this summer, professional and amateur astronomers alike will be fixed on one small constellation deep in the night sky. But its not the seven stars of Corona Borealis, the Northern C… [+6407 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chinese Space Plane Releases Unidentified Object In Orbit: All About It - NDTV", "description": "China has kept the mission shrouded in secrecy, with the country's space authorities refraining from releasing any images or descriptions of the spacecraft.", "url": "https://www.ndtv.com/world-news/chinese-space-plane-releases-unidentified-object-in-orbit-all-about-it-5831775", "urlToImage": "https://c.ndtvimg.com/2024-06/gp5aith8_spaceplane_625x300_06_June_24.jpeg?ver-20240506.08", "publishedAt": "2024-06-06T11:54:26Z", "content": "The spaceplane has been in orbit for more than 165 days. (Representative Image)\r\nThe US Space Force has noticed that there is another object that was released by China's secret spaceplane and is now … [+1996 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Giant virus found on Greenland ice sheet, scientists have no clue how it works - India Today", "description": "Living alongside the algae on the ice scientists have discovered giant viruses lingering deep below", "url": "https://www.indiatoday.in/science/story/giant-virus-found-on-greenland-ice-sheet-scientists-have-no-clue-how-they-work-2549733-2024-06-06", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/greenland-ice-sheet-064704275-16x9_0.jpg?VersionId=CpgIGLVGVWhqcNye5vX3jP8n09Jbx7.n", "publishedAt": "2024-06-06T06:52:58Z", "content": "Every spring, as the Arctic emerges from months of darkness, a remarkable transformation takes place. Polar bears emerge from their dens, arctic terns return from their southern migration, and musk o… [+3046 chars]"}]}