{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "NASA Rover Spots Strange Rock On Mars - Forbes", "description": "In a photo taken by the rover Curiosity on its 3,709th day on Mars, a strange rock spotted in the upper right of the image has NASA experts puzzled.", "url": "https://www.forbes.com/sites/davidbressan/2023/01/16/nasa-rover-spots-strange-rock-on-mars/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63c5a5c43d1876be05e5b69a/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-01-16T20:27:34Z", "content": "A mysterious rock was spotted be the rover Curiosity on Mars.\r\nNASA/JPL-Caltech/MSSS\r\nIn a photo taken by the rover Curiosity on its 3,709th day on Mars, a strange rock spotted in the upper right of … [+1676 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Saumya Bohra", "title": "Perseverance Rover Shares Latest Images of Our Red Neighbouring Planet - The Tech Outlook", "description": "NASA’s Perseverance Rover has been exploring Mars since it successfully landed there on February 18. Since then, it has sent back some amazing pictures of our neighbouring planet. Among them is a collection of photographs that NASA unveiled last week", "url": "https://www.thetechoutlook.com/news/science/perseverance-rover-shares-latest-images-of-our-red-neighbouring-planet/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/01/4A69ADC7-D837-4E8E-A38F-9657A9CFD845.jpeg", "publishedAt": "2023-01-16T20:03:14Z", "content": "NASAs Perseverance Rover has been exploring Mars since it successfully landed there on February 18. Since then, it has sent back some amazing pictures of our neighbouring planet. Among them is a coll… [+1673 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "The green comet: Comet 2022 E3 ZTF - EarthSky", "description": null, "url": "https://earthsky.org/astronomy-essentials/the-green-comet-comet-2022-e3-ztf/", "urlToImage": "https://earthsky.org/upl/2023/01/comet-2022-E3-chart-1-guy-ottewell-800x570.webp", "publishedAt": "2023-01-16T19:58:57Z", "content": "This chart shows the orbital view of the green comet C/2022 E3 (ZTF). The grid lines on the ecliptic plane are 1 astronomical unit (AU) – the average distance between the sun and Earth or 93 million … [+5648 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "The \"Big Rip\": We Already Know How The Universe Will End In Thousands Of Years - Nation World News", "description": "principle of big Bang It is one of the most famous in science and is used to describe the early development of the universe, its beginnings, with some nuance.", "url": "https://nationworldnews.com/the-big-rip-we-already-know-how-the-universe-will-end-in-thousands-of-years/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/The-Big-Rip-We-Already-Know-How-the-Universe-Will.jpg", "publishedAt": "2023-01-16T19:43:57Z", "content": "principle of big Bang It is one of the most famous in science and is used to describe the early development of the universe, its beginnings, with some nuance. But everything that begins (we believe) … [+4011 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Hubble Spots Stealthy Asteroid Photobombing a Fuzzy Galaxy - CNET", "description": "NASA and ESA's space telescope snaps an interloper as it aims at a hazy galaxy.", "url": "https://www.cnet.com/science/space/hubble-spots-stealthy-asteroid-photobombing-a-fuzzy-galaxy/", "urlToImage": "https://www.cnet.com/a/img/resize/e69499983f9a99ce9620344c65269daee3c88253/hub/2023/01/16/296031c2-1e65-4068-b298-1052d091e95d/hubbelasteroidpotw2303a.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2023-01-16T19:35:43Z", "content": "A Hubble Space Telescope image released Monday has an obvious target in the middle: hazy galaxy UGC 7983. But as with many Hubble images, there's a lot more going on here than initially meets the eye… [+1423 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "One day, there could be a pipeline of oxygen flowing from the moon's south pole - Phys.org", "description": "The Artemis program intends to put humans on the moon for the first time since NASA's Apollo missions. But Artemis has a larger scope than just landing people there, setting up some science experiments, gathering moon rocks, playing a little golf, then leavin…", "url": "https://phys.org/news/2023-01-day-pipeline-oxygen-moon-south.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/one-day-there-could-be.jpg", "publishedAt": "2023-01-16T19:26:40Z", "content": "The Artemis program intends to put humans on the moon for the first time since NASA's Apollo missions. But Artemis has a larger scope than just landing people there, setting up some science experimen… [+5493 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Dheeraj Bengrut", "title": "Record-breaking detection of radio signal from atomic hydrogen in extremely distant galaxy using GMRT - Hindustan Times", "description": "Astronomers from McGill University, Canada and Indian Institute of Science (IISc), Bengaluru have detected a radio signal originating from atomic hydrogen in an extremely distant galaxy using data from the Giant Metre Wave Radio Telescope (GMRT) in Pune", "url": "https://www.hindustantimes.com/cities/pune-news/recordbreaking-detection-of-radio-signal-from-atomic-hydrogen-in-extremely-distant-galaxy-using-gmrt-101673892494688.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/16/1600x900/Illustration-showing-detection-of-the-lensed-21-cm_1673892489425.png", "publishedAt": "2023-01-16T18:08:14Z", "content": "Astronomers from McGill University, Canada and Indian Institute of Science (IISc), Bengaluru have detected a radio signal originating from atomic hydrogen in an extremely distant galaxy using data fr… [+3662 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Modern Agriculture Turned a Wild Plant Into a Problematic Weed - SciTechDaily", "description": "New research has discovered that agriculture is causing rapid evolutionary changes not only on farms but also in wild species in adjacent areas. An international team of researchers at the University of British Columbia has uncovered how the expansion of mode…", "url": "https://scitechdaily.com/?p=244446", "urlToImage": "https://scitechdaily.com/images/Waterhemp-in-Corn-Field-scaled.jpg", "publishedAt": "2023-01-16T17:43:10Z", "content": "Waterhemp can drastically reduce corn and soy yields, as seen on the right in a corn field in Essex County. Credit: Julia Kreiner, University of British Columbia\r\nNew research has discovered that agr… [+5170 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jason Parnell-Brookes, Gemma Lavender", "title": "How to view and photograph comets - Space.com", "description": "Learn how to observe and photograph comets as C/2022 E3 (ZTF) nears the sun. Get the best sights and images of this celestial encounter with our handy guide.", "url": "https://www.space.com/how-to-view-and-photograph-comets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2bcYhZkscEGx3Cwaw4BQWd-1200-80.jpg", "publishedAt": "2023-01-16T17:30:47Z", "content": "Comets are notoriously fickle things. Some are given high expectations of putting on a good show and fail to deliver. In contrast, others, originally thought to be unremarkable, may suddenly flare up… [+11197 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tobias Lortzing", "title": "1 billion years of abstinence: Chloroplasts can finally hope for sex - Phys.org", "description": "Scientists at the Max Planck Institute of Molecular Plant Physiology in Potsdam (Germany) analyzed the inheritance of chloroplasts under different environmental conditions in almost 4 million tobacco plants.", "url": "https://phys.org/news/2023-01-billion-years-abstinence-chloroplasts-sex.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/1-billion-years-of-abs.jpg", "publishedAt": "2023-01-16T17:29:04Z", "content": "Identification of abiotic factors controlling plastid inheritance. a, Genetic screen for paternal plastid transmission. (i) At the onset of flowering, transplastomic plants (WTptGFP) are exposed to a… [+9370 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Novel Neurofeedback Technique Enhances Awareness of Mind-Wandering - Neuroscience News", "description": "Researchers have developed a novel neurofeedback technique based on Pavlovian conditioning that detects when a person's mind is wandering.", "url": "https://neurosciencenews.com/mind-wandering-neurofeedback-22265/", "urlToImage": "https://neurosciencenews.com/files/2023/01/neurofeedback-mind-wandering-neurosinces-public.jpg", "publishedAt": "2023-01-16T17:11:54Z", "content": "Summary: Researchers have developed a novel neurofeedback technique based on Pavlovian conditioning that detects when a person’s mind is wandering.\r\nSource: ATR Brain Information Communication Resear… [+7147 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Challenging Our Understanding of the Universe: Astronomers Discover an Enigmatic Cosmic Explosion - SciTechDaily", "description": "Gamma-ray bursts are the most intense explosions in the universe and are typically caused by the collapse of stars or the collision of compact stellar remnants. However, a recent discovery has challenged this understanding, as it does not fit into either of t…", "url": "https://scitechdaily.com/?p=244464", "urlToImage": "https://scitechdaily.com/images/Artists-Conception-of-a-Gamma-Ray-Burst-scaled.jpg", "publishedAt": "2023-01-16T16:33:08Z", "content": "ByUniversity of Copenhagen - Faculty of ScienceJanuary 16, 2023\r\nArtists conception of a gamma-ray burst caused by the violent collision of two massive neutron stars, following their inspiraling dans… [+11597 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Laser desorption mass spectrometry with an Orbitrap analyser for in situ astrobiology - Nature.com", "description": "A miniaturized instrument comprising a pulsed UV laser system and an Orbitrap analyser enables the characterization of the organic content and chemical composition of planetary materials, supporting the science objectives of future planetary missions.", "url": "https://www.nature.com/articles/s41550-022-01866-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41550-022-01866-x/MediaObjects/41550_2022_1866_Fig1_HTML.png", "publishedAt": "2023-01-16T16:02:18Z", "content": "<li>Johnson, S. S., Anslyn, E. V., Graham, H. V., Mahaffy, P. R. &amp; Ellington, A. D. Fingerprinting non-terran biosignatures. Astrobiology18, 915922 (2018).\r\nArticle \r\n ADS \r\nGoogle Scholar \r\n</li… [+10267 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "'Impossible' neutron stars could explain strange flashes - Space.com", "description": "Neutron-star mergers could create hypermassive neutron stars that are the fastest spinning stars in the universe.", "url": "https://www.space.com/hypermassive-neutron-stars-oscillating-gamma-ray-bursts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gqsSvCBZAZLoVJs3gyqZCP-1200-80.jpg", "publishedAt": "2023-01-16T16:00:51Z", "content": "The oscillating frequencies of two short gamma-ray bursts are the best evidence yet for the formation of 'impossible' hypermassive neutron stars that can briefly defy gravity before collapsing to for… [+5713 chars]"}, {"source": {"id": null, "name": "Bangkok Post"}, "author": "AFP", "title": "Runaway W. Antarctic ice sheet collapse not 'inevitable': study - Bangkok Post", "description": "PARIS - The runaway collapse of the West Antarctic Ice Sheet -- which would trigger catastrophic sea level rise -- is not \"inevitable\", scientists said Monday following research that tracked the region's recent response to climate change.", "url": "https://www.bangkokpost.com/world/2483945/runaway-w-antarctic-ice-sheet-collapse-not-inevitable-study", "urlToImage": "https://static.bangkokpost.com/media/content/20230116/c1_4605845_700.jpg", "publishedAt": "2023-01-16T15:45:00Z", "content": "PARIS - The runaway collapse of the West Antarctic Ice Sheet -- which would trigger catastrophic sea level rise -- is not \"inevitable\", scientists said Monday following research that tracked the regi… [+3794 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers find a simple way to predict the properties of compounds of drugs with metals - News-Medical.Net", "description": "RUDN University chemists, biologists and physicians have found a simple way to predict the properties of compounds of drugs with metals.", "url": "https://www.news-medical.net/news/20230116/Researchers-find-a-simple-way-to-predict-the-properties-of-compounds-of-drugs-with-metals.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2020/3/shutterstock_1054148270_ebcc7adac18445889666f7e1f5dbad85-620x480.jpg", "publishedAt": "2023-01-16T15:09:00Z", "content": "RUDN University chemists, biologists and physicians have found a simple way to predict the properties of compounds of drugs with metals. This can be done using topological indices - numbers that desc… [+3326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "How Russia is planning a rescue mission to bring astronauts home - The Indian Express", "description": "The astronauts had been scheduled to return to Earth in March, but they will now remain in orbit for several more months.", "url": "https://indianexpress.com/article/explained/explained-sci-tech/russia-rescue-mission-astronauts-home-explained-8385603/", "urlToImage": "https://images.indianexpress.com/2023/01/russia-space-station.jpg", "publishedAt": "2023-01-16T15:07:04Z", "content": "This is the next Soyuz that was scheduled to fly in March, said Joel Montalbano, the space station program manager at NASA. Itll just fly a little earlier.\r\nThe need for a new Soyuz arose after the o… [+1833 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "An Analysis of an Active Galactic Nucleus - AZoQuantum", "description": "Active galactic nuclei are known to be the strongest compact steady sources of energy in the universe. This has been powered by supermassive black holes that tend to swallow matter in the galaxies’ center.", "url": "https://www.azoquantum.com/News.aspx?newsID=9379", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_9379_16738696003753545.png", "publishedAt": "2023-01-16T14:27:00Z", "content": "Active galactic nuclei are known to be the strongest compact steady sources of energy in the universe. \r\nAn artist’s impression of what the dust around an active galactic nucleus might look like seen… [+3835 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "SpaceX launches its Falcon Heavy rocket with a classified military payload for US Space Force - Firstpost", "description": "SpaceX launched two satellites for the US Space Force on their Falcon Heavy rocket. Later this week, they will also launch a Falcon 9 rocket, to launch 51 Starlink broadband satellites into low-Earth orbit.", "url": "https://www.firstpost.com/tech/news-analysis/spacex-launches-its-falcon-heavy-rocket-with-a-classified-military-payload-for-us-space-force-11996412.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/01/SpaceX-launches-its-Falcon-Heavy-rocket-with-a-classified-military-payload-for-US-Space-Force.jpg", "publishedAt": "2023-01-16T13:44:11Z", "content": "FP StaffJan 16, 2023 19:14:11 IST\r\nElon Musks SpaceX launched a triple-core Falcon Heavy rocket from the Kennedy Space Center to launch two classified satellites for the US Space Force. Reports sugge… [+2321 chars]"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Innovative nano-coating can help harvest energy in space - Innovation News Network", "description": "A research team has invented a nano-coating that can reduce the operating temperatures of space-qualified structures from 120°C to 60°C.", "url": "https://www.innovationnewsnetwork.com/innovative-nano-coating-can-help-harvest-energy-in-space/28890/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2023/01/shutterstockAlones_1916757824.jpg", "publishedAt": "2023-01-16T13:40:40Z", "content": "The nano-coating, named the Multifunctional Nanobarrier Structure (MFNS), can be used alongside a spacecraft’s sensors and advanced composite materials thanks to its custom-built, room temperature ap… [+2521 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop an artificial neuron closely mimicking the characteristics of a biological neuron - News-Medical.Net", "description": "Researchers reported a conductance-based organic electrochemical neuron that mimicked biological signaling in neurons, especially activation/inactivation of their sodium and potassium channels.", "url": "https://www.news-medical.net/news/20230116/Researchers-develop-an-artificial-neuron-closely-mimicking-the-characteristics-of-a-biological-neuron.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_735888_16738754953665231.jpg", "publishedAt": "2023-01-16T13:39:00Z", "content": "In a recent article published in Nature Materials, researchers reported a conductance-based organic electrochemical neuron (c-OECN) that mimicked biological signaling in neurons, especially activatio… [+4381 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of the Universe: Researchers Use High-Powered Lasers to Study Magnetic Reconnection - SciTechDaily", "description": "Scientists use powerful laser beams to create miniature solar flares in order to study the process of magnetic reconnection. Scientists employed twelve high-powered laser beams to simulate miniature solar flares in order to investigate the underlying mechanis…", "url": "https://scitechdaily.com/?p=244045", "urlToImage": "https://scitechdaily.com/images/Magnetic-Reconnection-in-a-Solar-Flare.jpg", "publishedAt": "2023-01-16T13:38:13Z", "content": "ByKyushu UniversityJanuary 16, 2023\r\nScreenshot from NASAs Conceptual Image Lab on Magnetic Reconnection Throughout the Solar System. Magnetic reconnection occurs when anti-parallel magnetic fieldsin… [+6002 chars]"}, {"source": {"id": null, "name": "Technewsspace.com"}, "author": null, "title": "South Koreans Warned Of Being Hit By Debris From An Old NASA Satellite - Tech News Space", "description": "South Koreans, who frequently receive mobile alerts about earthquakes and COVID outbreaks, have learned a more unusual but no less dire warning this time.", "url": "https://technewsspace.com/south-koreans-warned-of-being-hit-by-debris-from-an-old-nasa-satellite/", "urlToImage": "https://i0.wp.com/technewsspace.com/wp-content/uploads/2023/01/South-Koreans-warned-of-being-hit-by-debris-from-an.jpg", "publishedAt": "2023-01-16T13:02:45Z", "content": "South Koreans, who frequently receive mobile alerts about earthquakes and COVID outbreaks, have learned a more unusual but no less dire warning this time. They were told on Monday morning that this t… [+1372 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Early universe's galaxies surprisingly diverse, JWST finds - Space.com", "description": "Even early on, 'galaxies were already fairly evolved and had a wide range of structures.'", "url": "https://www.space.com/galaxies-early-universe-surprisingly-diverse-james-webb-space-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/a8vqR4pUukywRs5wiWpFTk-1200-80.png", "publishedAt": "2023-01-16T13:00:23Z", "content": "The James Webb Space Telescope is changing our understanding of the cosmos.\r\nGalaxies in the early days of the universe were much more varied and mature than previously thought, according to a new st… [+2065 chars]"}, {"source": {"id": null, "name": "Orissadiary.com"}, "author": "Odisha Diary bureau", "title": "First evidence of solitary waves near Mars may decode the mystery behind ion loss in the planet - Odisha Diary", "description": "Scientists have reported the first evidence of the presence of solitary waves or distinct electric field fluctuations in the Martian magnetosphere. The study of these waves is crucial as they directly control particle energization, plasma loss, trans", "url": "https://orissadiary.com/first-evidence-of-solitary-waves-near-mars-may-decode-the-mystery-behind-ion-loss-in-the-planet/", "urlToImage": "https://i0.wp.com/orissadiary.com/wp-content/uploads/2023/01/image001KI8A.jpg?fit=317%2C398&ssl=1", "publishedAt": "2023-01-16T12:53:23Z", "content": "Scientists have reported the first evidence of the presence of solitary waves or distinct electric field fluctuations in the Martian magnetosphere. The study of these waves is crucial as they directl… [+2634 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": "Puja Molpariya", "title": "This Stunning New Image Reveals Where All Milky Way’s Supernova Remnants Are - Revyuh", "description": "A new radio astronomy image depicting the locations of star births and deaths is the most comprehensive radio image of our galaxy to date, heralding an", "url": "https://www.revyuh.com/news/science-and-research/space/this-stunning-new-image-reveals-where-all-milky-ways-supernova-remnants-are/", "urlToImage": "https://www.revyuh.com/wp-content/uploads/2023/01/This-Stunning-New-Image-Reveals-Where-All-Milky-Ways-Supernova-Remnants-Are.jpg", "publishedAt": "2023-01-16T12:01:00Z", "content": "A new radio astronomy image depicting the locations of star births and deaths is the most comprehensive radio image of our galaxy to date, heralding an auspicious beginning to the new year.\r\nAs part … [+3690 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Ural Federal University Scientists Specify Rare Astronomical Phenomena Of January - India Education Diary", "description": "In January, all the brightest celestial bodies in the sky can be seen simultaneously by residents of the Urals and Perm. They can be observed even with the naked eye. Vladilen Sanakoev, Engineer at the UrFU Training Astronomical Observatory, told URA", "url": "https://indiaeducationdiary.in/ural-federal-university-scientists-specify-rare-astronomical-phenomena-of-january/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png?fit=534%2C462&ssl=1", "publishedAt": "2023-01-16T11:38:14Z", "content": "In January, all the brightest celestial bodies in the sky can be seen simultaneously by residents of the Urals and Perm. They can be observed even with the naked eye. Vladilen Sanakoev, Engineer at t… [+1196 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Moon Mission in Jeopardy? Issues With Lunar Flashlight's Spacecraft Propulsion System - SciTechDaily", "description": "The mission is characterizing its new “green” propulsion system and developing a modified plan for the briefcase-size satellite’s journey to the Moon. NASA’s Lunar Flashlight mission successfully launched on December 11, 2022, to begin its four-month journey …", "url": "https://scitechdaily.com/nasas-moon-mission-in-jeopardy-issues-with-lunar-flashlights-spacecraft-propulsion-system/", "urlToImage": "https://scitechdaily.com/images/Lunar-Flashlight-Spacecraft.jpg", "publishedAt": "2023-01-16T11:12:01Z", "content": "ByJet Propulsion LaboratoryJanuary 16, 2023\r\nThis artists concept shows the briefcase-sized Lunar Flashlight spacecraft using its near-infrared lasers to shine light into shaded polar regions on the … [+4762 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "JoAnna Wendel", "title": "Never-before-seen volcanic magma chamber discovered deep under Mediterranean, near Santorini - Livescience.com", "description": "Using a technique to study seismic waves, researchers revealed a previously unknown magma chamber underneath a the Kolumbo submarine volcano.", "url": "https://www.livescience.com/mediterranean-volcano-growing-magma-chamber", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gEanX47mZF6bsGpMwZ8LQX-1200-80.jpg", "publishedAt": "2023-01-16T11:00:00Z", "content": "A submarine volcano whose deadly eruption shattered the picturesque Greek island of Santorini nearly 400 years ago has a growing, never-before-seen magma chamber that could fuel another massive erupt… [+4084 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Time Lapse Images Of The Butterfly Nebula Offer New Insights On Its Origin - Indiatimes.com", "description": "Astronomers capture a breathtaking timelapse of a nebula in the shape of a butterfly as the star inches closer towards its death, reveals a LiveScience report.                        NASANGC6302, the ‘Butterfly Nebula’ is located around 4,000 light years away…", "url": "https://www.indiatimes.com/technology/science-and-future/time-lapse-images-of-the-butterfly-nebula-offer-new-insights-on-its-origin-590392.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jan/Facebook-Image-17_63c530982bed3.jpg", "publishedAt": "2023-01-16T10:42:47Z", "content": "Astronomers capture a breathtaking timelapse of a nebula in the shape of a butterfly as the star inches closer towards its death, reveals a LiveScience report.\r\nNASA\r\nNGC6302, the Butterfly Nebula is… [+2369 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA wants your help to discover and study alien planets - The Indian Express", "description": "NASA's Exoplanet Watch citizen science is now open to everyone and you can help scientists discover and study exoplanets even if you don't own a telescope.", "url": "https://indianexpress.com/article/technology/nasa-exoplanet-watch-8385124/", "urlToImage": "https://images.indianexpress.com/2023/01/NASA-exoplanet-watch-20230116.jpg", "publishedAt": "2023-01-16T10:40:59Z", "content": "Scientists have so far confirmed the existence of over 5,000 planets outside of our solar system. They display a wide variety of distinct characteristics, like clouds made of glass and twin suns. But… [+4475 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Investigation of grafting silane coupling agents on superhydrophobicity of carbonyl iron/SiO2 particles for efficient oil/water mixture and emulsion separation | Scientific Reports - Nature.com", "description": "Scientific Reports - Investigation of grafting silane coupling agents on superhydrophobicity of carbonyl iron/SiO2 particles for efficient oil/water mixture and emulsion separation", "url": "https://www.nature.com/articles/s41598-023-28131-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-28131-z/MediaObjects/41598_2023_28131_Fig1_HTML.png", "publishedAt": "2023-01-16T10:33:50Z", "content": "<li>Rabbani, Y., Shariaty-Niassar, M. &amp; Ebrahimi, S. A. S. The effect of superhydrophobicity of prickly shape carbonyl iron particles on the oil-water adsorption. Ceram. Int.47, 2840028410 (2021)… [+14645 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Giant Dinosaurs With Sickle-Like Claws Lived In Patagonia, First Record Of Theropods From Region Reveals - ABP Live", "description": "Researchers have focused on theropods as part of the study. The theropod fossils identified date from 66 to 75 million years ago. They found that non-avian theropod dinosaurs included top predators.", "url": "https://news.abplive.com/science/giant-dinosaurs-with-sickle-like-claws-lived-in-patagonia-first-record-of-theropods-from-region-reveals-1575974", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/16/3533a04b6f546372b440bd2d25385a5d1673857076435324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-01-16T10:29:21Z", "content": "A team of researchers led by The University of Texas at Austin have discovered fossils which represent the first record of theropods from the Chilean portion of prehistoric Patagonia. Theropods were … [+4547 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Researchers develop unified theory for formation of rocky planets - News9 LIVE", "description": "The new theory can explain several characteristics of rocky exoplanets", "url": "https://www.news9live.com/science/researchers-develop-unified-theory-for-formation-of-rocky-planets-au941-2026712", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/01/Batygin_Konstantin-Planet-Fa.2e16d0ba.jpg", "publishedAt": "2023-01-16T10:22:21Z", "content": "The new theory can explain several characteristics of rocky exoplanets\r\n<ul><li>The new theory can explain the formation of rocky super-Earths observed in other star systems. </li><li>The theory can … [+3064 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "刘明", "title": "Chinese, European Mars probes help examine atmosphere near sun - China Daily", "description": "In an \"almost-out-of-service\" period in 2021, China's Tianwen-1 orbiter, along with Mars Express of the European Space Agency, helped solar scientists know more about what happens near the sun.", "url": "https://www.chinadaily.com.cn/a/202301/16/WS63c51379a31057c47eba9e50.html", "urlToImage": "http://img2.chinadaily.com.cn/images/202301/16/63c51379a31057c4b4b362f6.png", "publishedAt": "2023-01-16T09:05:00Z", "content": "[Photo/Shanghai Astronomical Observatory of the Chinese Academy of Sciences] \r\nSHANGHAI -- In an \"almost-out-of-service\" period in 2021, China's Tianwen-1 orbiter, along with Mars Express of the Euro… [+1414 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Hubble Spots Black Hole Twisting A Star Into A Doughnut As It’s Slowly Devoured - Indiatimes.com", "description": "The Hubble Space Telescope has discovered a star being stretched like a doughnut as a black hole devours it, reveals a report by LiveScience.                         NASAThe black hole in question is located at the core of the galaxy ESO 583-G004, around 300 …", "url": "https://www.indiatimes.com/technology/science-and-future/hubble-spots-black-hole-twisting-a-star-into-a-doughnut-as-its-slowly-devoured-590371.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jan/Facebook-Image---2023-01-16T140157967_63c50e1c59848.jpg", "publishedAt": "2023-01-16T08:40:54Z", "content": "The Hubble Space Telescope has discovered a star being stretched like a doughnut as a black hole devours it, reveals a report by LiveScience. \r\nNASA\r\nThe black hole in question is located at the core… [+1496 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Surprise! NASA just found Opal gems on Mars - HT Tech", "description": "NASA's Curiosity Rover has found opal gems on Mars.", "url": "https://tech.hindustantimes.com/tech/news/surprise-nasa-just-found-opal-gems-on-mars-71673855989510.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/ghdj_1673856229236_1673856278078_1673856278078.jpg", "publishedAt": "2023-01-16T08:07:49Z", "content": "NASA rovers on Mars have been looking for clues to water or any other source of life. Now, in a big surprise, NASA's Curiosity Rover, which has been exploring the surface of Mars, has found water-ric… [+1826 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "James Webb Space Telescope snaps NGC 346 that is 'furiously forming stars' - HT Tech", "description": "The new findings from the James Webb Space Telescope is all about solving the mysteries of NGC346, one of the most dynamic star-forming regions in near our Milky Way Galaxy, says ESA.", "url": "https://tech.hindustantimes.com/tech/news/james-webb-space-telescope-snaps-ngc-346-that-is-furiously-forming-stars-71673853371624.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/Webb_inspects_NGC_346_pillars_1673853509990_1673853527581_1673853527581.jpg", "publishedAt": "2023-01-16T07:21:16Z", "content": "The universe is full of mysteries. Some are horrifying and some are awesome. To find out what is going on in outer space, NASA and ESA have deployed a number of telescopes and the newest one is the J… [+1958 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 16 January 2023: Moon-pockmarked by asteroid strikes - HT Tech", "description": "NASA’s Astronomy Picture of the Day is a stunning image of the Moon, showing all of its features in detail.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-16-january-2023-moon-pockmarked-by-asteroid-strikes-71673850905066.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/Untitled_desi_1673851041158_1673851053360_1673851053360.jpg", "publishedAt": "2023-01-16T06:38:43Z", "content": "The Moon has long been one of the central pieces of the studies related to Earth. Its presence influences various phenomena on the planet, such as tides. The Moon is believed to have formed about 4.5… [+1706 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Supermassive black hole found: 400 previously unknown black holes discovered by NASA's Chandra X-ray Observato - Times Now", "description": "Astronomers have made a groundbreaking discovery of more than 400 previously undiscovered black holes located in the centers of galaxies.", "url": "https://www.timesnownews.com/technology-science/supermassive-black-hole-found-400-previously-unknown-black-holes-discovered-by-nasas-chandra-x-ray-observatory-article-97021613", "urlToImage": "https://static.tnn.in/thumb/msid-97021613,imgsize-100,updatedat-1673850229977,width-1280,height-720,resizemode-75/97021613.jpg", "publishedAt": "2023-01-16T06:24:35Z", "content": "Budget 2023: Issue is not what a freebie is, it is whether you will be able to give that or not: FM Sitharaman"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Starwatch: Venus outshines Saturn in twilight conjunction - The Guardian", "description": "Planetary pairing will be visible to naked eye from across the globe", "url": "https://www.theguardian.com/science/2023/jan/16/starwatch-venus-outshines-saturn-in-twilight-conjunction", "urlToImage": "https://i.guim.co.uk/img/media/e0c9fd0dba9e6cfeea6a4664af6cca2cfe2f9b57/207_165_710_426/master/710.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e8910caba60db4cb9cee65eb4a0f57a5", "publishedAt": "2023-01-16T06:00:00Z", "content": "Starwatch chart looking west-south-west from London on Sunday 22 January 2023 towards the close conjunction of Saturn and Venus\r\nThe brilliantly bright planet Venus passes Saturn this week in a parti… [+1083 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Scott Alan Johnston", "title": "Cosmic Noon was Billions of Years ago, When Many Galaxies Were Filled With Star-Forming Nebulae Like This - Universe Today", "description": "You’re looking at NGC 346, a star cluster 210 light years away that is energetically pumping out brand new stars from a dense cloud of gas and dust. Between 10 and 11 billion years ago, nearly all galaxies in the Universe underwent an era of intense star form…", "url": "https://www.universetoday.com/159647/cosmic-noon-was-billions-of-years-ago-when-many-galaxies-were-filled-with-star-forming-nebulae-like-this/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/01/Webb_inspects_NGC_346-m-scaled.jpg", "publishedAt": "2023-01-16T04:23:24Z", "content": "Youre looking at NGC 346, a star cluster 210 light years away that is energetically pumping out brand new stars from a dense cloud of gas and dust. Between 10 and 11 billion years ago, nearly all gal… [+3656 chars]"}, {"source": {"id": null, "name": "IT-Online"}, "author": "Kathy Gibson", "title": "Artemis III will be first human mission to the lunar South Pole - IT-Online", "description": "Humans have always been drawn to explore, discover, and learn as much as we can about the world – and worlds – around us. This isn’t always easy, but it’s in our nature. NASA and its partners aim to land the first woman and first person of colour on the surfa…", "url": "https://it-online.co.za/2023/01/16/artemis-iii-will-be-first-human-mission-to-the-lunar-south-pole/", "urlToImage": "https://it-online.co.za/wp-content/uploads/2023/01/artemis-1.jpg", "publishedAt": "2023-01-16T03:22:30Z", "content": "Humans have always been drawn to explore, discover, and learn as much as we can about the world – and worlds – around us.\r\nThis isnt always easy, but its in our nature. NASA and its partners aim to l… [+8091 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Earth facing danger from a skyscraper-sized asteroid! Close approach today - HT Tech", "description": "A monstrous 420-foot asteroid could make a close approach to Earth as soon as today, NASA has revealed.", "url": "https://tech.hindustantimes.com/tech/news/earth-facing-danger-from-a-skyscraper-sized-asteroid-close-approach-today-71673832916391.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/asteroid-3113282_960_720_1672570457957_1673833027403_1673833027403.webp", "publishedAt": "2023-01-16T01:38:04Z", "content": "Astronomers have been keeping a close eye on asteroids that pass near Earth, as these space rocks have the potential to be dangerous to Earth. In recent years, there have been several close calls wit… [+1831 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "Ayyappan R", "title": "Are we safe from a sudden asteroid strike? No, says India's first meteor scientist - Onmanorama", "description": "For every potentially damaging asteroid spotted, there are millions falling towards the Earth unseen.", "url": "https://www.onmanorama.com/news/kerala/2023/01/16/is-earth-safe-asteroid-attack-indias-first-meteor-scientist-aswin-sekhar.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/kerala/top-news/images/2023/1/16/asteroid1.jpg", "publishedAt": "2023-01-16T00:56:01Z", "content": "The most devastating extinctions, when almost the entire life on earth was wiped out, had happened in prehistoric times. The most recent was 66 million years ago when dinosaurs were killed off.\r\nThou… [+6896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study Suggests Dark Matter May Be Made of Dark Photons - SciTechDaily", "description": "The hypothetical new particles could potentially account for the observations made by the Cosmic Origin Spectrograph on the Hubble Space Telescope. According to a new study published in Physical Review Letters, it is possible that dark matter is composed of u…", "url": "https://scitechdaily.com/?p=242819", "urlToImage": "https://scitechdaily.com/images/New-Hints-That-Dark-Matter-Could-Be-Made-Up-of-Dark-Photons-scaled.jpg", "publishedAt": "2023-01-16T00:18:22Z", "content": "ByInternational School for Advanced Studies (SISSA)January 15, 2023\r\n2D projection of the cosmic web as obtained from a supercomputer simulation. Credit: Dr. Ewald Puchwein and the Sherwood-Relics co… [+1956 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Can humanity's new giant leap into space succeed? - BBC", "description": "Humanity is set for its next big leap into space with nations and private companies racing to build outposts on other worlds", "url": "https://www.bbc.com/news/science-environment-64039146", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/100C/production/_128080140_mediumrocket.jpg", "publishedAt": "2023-01-16T00:05:13Z", "content": "There is a new order emerging in space - a race between America and China. But with the demands of space exploration, even these great superpowers won't be able to do it alone. \r\nHugely technically c… [+9152 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Space Exploration Collaboration, Webb Reveals Galaxies From Dawn of the Universe - SciTechDaily", "description": "Continuing a collaboration in space exploration … Space station research heads back to Earth … And highlighting new science from NASA missions … A few of the stories to tell you about – This Week at NASA! https://youtu.be/kvskiBVlRiE US, Japan Sign Space Agre…", "url": "https://scitechdaily.com/?p=244300", "urlToImage": "https://scitechdaily.com/images/Orion-Approaching-Full-Gateway-Configuration.jpg", "publishedAt": "2023-01-15T19:25:07Z", "content": "ByNASAJanuary 15, 2023\r\nA view of the full Gateway configuration with Orion approaching Gateway. Credit: NASA/Alberto Bertolin\r\nContinuing a collaboration in space exploration \r\nSpace station researc… [+3080 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul M. Sutter", "title": "How Crazy Magnetic Fields Drive the Sun Mad - Universe Today", "description": "Recently a team of astronomers have discovered that multiple intertwining magnetic fields that connect and reconnect can power these jets.", "url": "https://www.universetoday.com/159540/how-crazy-magnetic-fields-drive-the-sun-mad/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/11/solarflare-1.jpg", "publishedAt": "2023-01-15T19:02:11Z", "content": "Solar coronal jets are fast moving plumes of plasma that erupt suddenly from the polar regions of the Sun. Astronomers believe that these help heat up the solar corona, but the physics behind the for… [+2287 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Orbit of Doom: The Surprising Connection Between Earth's Orbital Patterns and an Ancient Warming Event - SciTechDaily", "description": "An international team of scientists has suggested that changes in Earth's orbit that resulted in hotter conditions may have played a role in triggering a rapid global warming event that occurred 56 million years ago. This event, known as the Paleocene-Eocene …", "url": "https://scitechdaily.com/orbit-of-doom-the-surprising-connection-between-earths-orbital-patterns-and-an-ancient-warming-event/", "urlToImage": "https://scitechdaily.com/images/Future-Earth-Global-Warming.jpg", "publishedAt": "2023-01-15T17:33:28Z", "content": "ByPenn StateJanuary 15, 2023\r\nAn international team of scientists has found that changes in Earths orbit that favored hotter conditions may have helped trigger a rapid global warming event 56 million… [+5845 chars]"}, {"source": {"id": null, "name": "SpacePolicyOnline.com"}, "author": null, "title": "U.S.-JAPAN SPACEWALK AT ISS (Mann/Wakata), Jan 20, 2023, Earth orbit, 8:15 am ET - SpacePolicyOnline.com", "description": "Posted: January 15, 2023 12:12 pm ET | Last Updated: January 15, 2023 12:12 pm ET | (NASA TV)", "url": "https://spacepolicyonline.com/events/u-s-japan-spacewalk-at-iss-mann-wakata-jan-20-2023-earth-orbit-815-am-et/", "urlToImage": null, "publishedAt": "2023-01-15T17:19:44Z", "content": "NASA astronaut Nicole Mann and JAXA astronaut Koichi Wakata will conduct a spacewalk on January 20, 2023 beginning at approximately 8:15 am ET.\r\nThey will complete installation of two mounting platfo… [+304 chars]"}, {"source": {"id": null, "name": "The Tico Times"}, "author": "AFP", "title": "Space junk, not meteorites, remains biggest threat to spacecraft : - The Tico Times", "description": "The latest news and information from Costa Rica including breaking news, weather, travel, events, sports and more.", "url": "https://ticotimes.net/2023/01/15/space-junk-not-meteorites-remains-biggest-threat-to-spacecraft", "urlToImage": "https://ticotimes.net/wp-content/uploads/2015/07/150705Dawn1.jpg", "publishedAt": "2023-01-15T17:00:00Z", "content": "Dodging the kind of meteorite strike that forced Russia to plan a space station rescue mission is nearly impossible, yet the greater threat to spacecraft is actually the man-made debris in orbit, exp… [+4378 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic, Space.com Staff", "title": "The greatest universe images of all time - msnNOW", "description": "Explore some of the best Hubble Space Telescope images here in our gallery.", "url": "https://www.space.com/best-hubble-space-telescope-images.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LJC5igojyPYjPZRUFitVoE-1200-80.jpg", "publishedAt": "2023-01-15T16:00:31Z", "content": "Hubble superbubble\r\nThe Hubble Space Telescope (opens in new tab) is a large astronomical observatory that launched on April 24, 1990, and has provided us with a wide array of awe-inspiring images ev… [+1318 chars]"}, {"source": {"id": null, "name": "Alittlebithuman.com"}, "author": "https://www.facebook.com/runarthors", "title": "Notable Astronomical Events in 2023 to Look Out For - A Little Bit Human", "description": "Keep your eye on the sky this year as there's some pretty cool stuff going on in 2023. Here's the most notable astronomical events in 2023 you need to see.", "url": "https://www.alittlebithuman.com/astronomical-events-in-2023/", "urlToImage": "https://i0.wp.com/www.alittlebithuman.com/wp-content/uploads/2023/01/NightSky.jpg", "publishedAt": "2023-01-15T15:00:00Z", "content": "Space has been the fascination of humans since the dawn of man. For thousands of years, weve looked up at the sky, asked questions, created mythoi, and yearned to explore beyond the boundaries of our… [+6869 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "5 most exciting Space Missions in 2023: OSIRIS-REx, SpaceX, Psyche asteroid mission, more - HT Tech", "description": "Looking forward to some of the most exciting space missions in 2023? We definitely are! From Moon, Jupiter, and well beyond that, check out the 5 most exciting Space Missions slated for this year.", "url": "https://tech.hindustantimes.com/web-stories/5-most-exciting-space-missions-in-2023-osiris-rex-spacex-psyche-asteroid-mission-more-71673785299458.html", "urlToImage": null, "publishedAt": "2023-01-15T14:01:04Z", "content": "The missions plan explains that after a 7 to 8-year cruise to Jupiter, utilizing Earth and Venus gravity assists, JUICE will go into orbit around Jupiter in 2031 to examine its moons Ganymede, Europa… [+48 chars]"}, {"source": {"id": null, "name": "Knownews.in"}, "author": null, "title": "Wild! Black holes destroy the same stars over and over captured by Newton Telescope - know news", "description": "The ESA XMM-Newton Space Telescope has given two different teams of astronomers an in-depth look at repeated bursts of light from inactive black holes", "url": "https://knownews.in/tech/wild-black-holes-destroy-the-same-stars-over-and-over-captured-by-newton-telescope/", "urlToImage": "https://knownews.in/wp-content/uploads/2023/01/galaxy_1673785664936_1673785707937_1673785707937.png", "publishedAt": "2023-01-15T12:47:41Z", "content": "Black holes are the greatest mysteries in space and yes, they are the most ferocious phenomena in space. Now they’ve been caught destroying the same stars over and over again.\r\n The ESA XMM-Newton Sp… [+2560 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Secret Code of the Universe: A Remarkable Way of Measuring the Fine Structure Constant - SciTechDaily", "description": "The fine structure constant is a fundamental constant of nature and its measurement is crucial in physics. Recently, researchers at TU Wien have discovered a unique way of measuring it. The value of one over 137, also known as the fine structure constant, is …", "url": "https://scitechdaily.com/the-secret-code-of-the-universe-a-remarkable-way-of-measuring-the-fine-structure-constant/", "urlToImage": "https://scitechdaily.com/images/Fine-Structure-Constant-Experiment.jpg", "publishedAt": "2023-01-15T09:49:30Z", "content": "A light source (left) sends a beam of light through a special material, which changes the direction of polarization by an angle that is given by the fine structure constant. Credit: Tatiana Lysenko /… [+3380 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Ethical ancient DNA research must involve descendant communities - ANI News", "description": "The analysis of ancient DNA allows scientists to trace human evolution and make important discoveries about modern populations. The data revealed by ancient DNA sampling can be valuable, but the human remains that carry this ancient DNA are often those of the…", "url": "https://www.aninews.in/news/science/ethical-ancient-dna-research-must-involve-descendant-communities20230115145744", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230115091326.jpg", "publishedAt": "2023-01-15T09:27:00Z", "content": "Washington [US], January 15 (ANI): The analysis of ancient DNA allows scientists to trace human evolution and make important discoveries about modern populations. The data revealed by ancient DNA sam… [+1807 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Reuters", "title": "Astronomers Discover Milky Way Galaxy's Most-Distant Stars - Voice of America - VOA News", "description": "Furthest of them is 1.08 million light years from Earth", "url": "https://www.voanews.com/a/astronomers-discover-milky-way-galaxy-s-most-distant-stars/6916997.html", "urlToImage": "https://gdb.voanews.com/022a0000-0aff-0242-3e2a-08daf5661dde_w1200_r1.jpg", "publishedAt": "2023-01-15T08:08:56Z", "content": "Astronomers have detected in the stellar halo that represents the Milky Way's outer limits a group of stars more distant from Earth than any known within our own galaxy - almost halfway to a neighbor… [+3241 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "NASA Satellite Shows How We Can Track Local CO2 Emissions From Space - ScienceAlert", "description": "In 2013, the National Oceanic and Atmospheric Administration (NOAA) reported that atmospheric concentrations of carbon dioxide (CO2) had reached 400 parts per million (ppm) for the first time since the Pliocene Era (ca.", "url": "https://www.sciencealert.com/nasa-satellite-shows-how-we-can-track-local-co2-emissions-from-space", "urlToImage": "https://www.sciencealert.com/images/2023/01/CarbonDioxideEmissionsMapASwirlOfRedsBluesYellows.jpg", "publishedAt": "2023-01-15T02:01:00Z", "content": "In 2013, the National Oceanic and Atmospheric Administration (NOAA) reported that atmospheric concentrations of carbon dioxide (CO2) had reached 400 parts per million (ppm) for the first time since t… [+5151 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Magnetic field disturbances can lead migratory birds astray - Earth.com", "description": "Magnetic field disturbances can lead migratory birds astray • Earth.com", "url": "https://www.earth.com/news/magnetic-field-disturbances-can-lead-migratory-birds-astray/", "urlToImage": "https://cff2.earth.com/uploads/2023/01/14153316/Magnetic-field-scaled.jpg", "publishedAt": "2023-01-14T23:11:00Z", "content": "Scientists have long known that bad weather can make migratory birds disoriented during their annual fall migrations, causing them to wind up in territories they are not accustomed to (a phenomenon c… [+2983 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New MIT Research Indicates That Automation Is Responsible for Income Inequality - SciTechDaily", "description": "Recent data suggests that the majority of the increase in the wage gap since 1980 can be attributed to automation replacing less-educated workers. When using self-checkout machines in supermarkets and drugstores, it is unlikely that you are bagging your purch…", "url": "https://scitechdaily.com/new-mit-research-indicates-that-automation-is-responsible-for-income-inequality/", "urlToImage": "https://scitechdaily.com/images/Income-Inequality-Concept.jpg", "publishedAt": "2023-01-14T23:07:34Z", "content": "ByPeter Dizikes, Massachusetts Institute of TechnologyJanuary 14, 2023\r\nA newly published paper quantifies the extent to which automation has contributed to income inequality in the U.S., simply by r… [+7345 chars]"}]}