{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Inouye Solar Telescope Captures New Images of Sun’s Surface - Sci.News", "description": "New images from the Visible-Broadband Imager (VBI) on NSF’s 4-m Inouye Solar Telescope show a variety of sunspots and quiet regions of the Sun.", "url": "https://www.sci.news/astronomy/inouye-solar-telescope-suns-surface-images-11936.html", "urlToImage": "https://cdn.sci.news/images/2023/05/image_11936-Sun.jpg", "publishedAt": "2023-05-22T21:54:54Z", "content": "New images from the Visible-Broadband Imager (VBI) on NSFs 4-m Inouye Solar Telescope show a variety of sunspots and quiet regions of the Sun.\r\nThese images of the Suns surface were captured by the I… [+2505 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Fluorine-based new drug synthesis at lightning speed - Science Daily", "description": "Researchers synthesize fluorine-based compound via rapid biphasic (gas and liquid) mixing.", "url": "https://www.sciencedaily.com/releases/2023/05/230522131403.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-22T21:35:04Z", "content": "How short is one second? The duration of a second can be defined as one 86,400th of a 24-hour day. A bullet train traveling at 300 km per hour can cover a distance of 83 meters in one second. On aver… [+3707 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Fine particulate matter catalyzes oxidative stress in the lungs - Science Daily", "description": "Study sheds new light on the adverse health effects of air pollution: hydrogen peroxide production of fine particles may not be as important as previously assumed. A new study reveals that the adverse health effects of fine particulate matter (PM2.5) are attr…", "url": "https://www.sciencedaily.com/releases/2023/05/230522131349.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-22T20:29:42Z", "content": "In the scientific literature, the total production of reactive oxygen species (ROS) such as H2O2 is commonly used as proxy for the toxicity of air pollutants and their ability to induce oxidative str… [+3574 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Record-breaking Tonga undersea volcano disrupted satellite signals in space - Space.com", "description": "The January 2022 Hunga Tonga-Hunga Ha'apai eruption continues to astound.", "url": "https://www.space.com/tonga-undersea-volcano-eruption-disrupted-satellite-signals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YkieGoJLvuLRhtJL4YdXJ7-1200-80.jpeg", "publishedAt": "2023-05-22T19:30:49Z", "content": "An underwater volcanic eruption last year was powerful enough to generate plasma bubbles that disrupted radio communications in outer space, a new study finds.\r\nThe new results could lead to ways to … [+3926 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers produce a multi-scale map of protein assemblies in the DNA damage response - News-Medical.Net", "description": "Writing in the May 22, 2023 issue of Cell Systems, a diverse team of scientists, led by researchers at University of California San Diego School of Medicine, have produced a novel map that depicts the human body's enormously complicated and highly evolved sys…", "url": "https://www.news-medical.net/news/20230522/Researchers-produce-a-multi-scale-map-of-protein-assemblies-in-the-DNA-damage-response.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/78486183-620x480.jpg", "publishedAt": "2023-05-22T19:23:00Z", "content": "Writing in the May 22, 2023 issue of Cell Systems, a diverse team of scientists, led by researchers at University of California San Diego School of Medicine, have produced a novel map that depicts th… [+5400 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study shows the potential of TAp63 as a new therapeutic target for rheumatoid arthritis - News-Medical.Net", "description": "Rheumatoid arthritis (RA) is an autoimmune disease characterized by joint deterioration. The clinical outcomes of patients with active RA can be improved using anti-rheumatic medications, such as methotrexate (MTX).", "url": "https://www.news-medical.net/news/20230522/Study-shows-the-potential-of-TAp63-as-a-new-therapeutic-target-for-rheumatoid-arthritis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/4/shutterstock_390538711_6b3c40fdd32742caa54307db3553cab1-620x480.jpg", "publishedAt": "2023-05-22T19:14:00Z", "content": "Rheumatoid arthritis (RA) is an autoimmune disease characterized by joint deterioration. The clinical outcomes of patients with active RA can be improved using anti-rheumatic medications, such as met… [+3287 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "See Jupiter's volcanic moon Io glow red-hot in incredible images from NASA's Juno probe - Space.com", "description": "The Juno mission was making its 51st flyby of the gas giant planet and its moons when it viewed the 'tortured moon' Io in stunning detail.", "url": "https://www.space.com/nasa-juno-jupiter-io-volcanic-moon-images", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rS54drK34MFvHEKcbVKVXh-1200-80.jpg", "publishedAt": "2023-05-22T19:00:19Z", "content": "NASA's Juno mission has made its 51st close flyby of Jupiter, catching stunning images of its moon Io, in the process. \r\nJuno flew past Io on Tuesday, May 16, on a flyby that brought it closer to the… [+4624 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Microorganisms' climate adaptation can slow down global warming - Science Daily", "description": "A new study shows that the ability of microorganisms to adapt to climate warming will slow down global warming by storing carbon in soil.", "url": "https://www.sciencedaily.com/releases/2023/05/230522131332.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-22T18:49:35Z", "content": "A new study from Lund University in Sweden shows that the ability of microorganisms to adapt to climate warming will slow down global warming by storing carbon in soil.In the study, researchers colle… [+2205 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How plants use sugar to produce roots: Heidelberg biologists identify the molecular mechanism that controls root branching - Science Daily", "description": "Along with sugar reallocation, a basic molecular mechanism within plants controls the formation of new lateral roots. Botanists have demonstrated that it is based on the activity of a certain factor, the target of rapamycin (TOR) protein. A better understandi…", "url": "https://www.sciencedaily.com/releases/2023/05/230522131318.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-22T18:36:06Z", "content": "Along with sugar reallocation, a basic molecular mechanism within plants controls the formation of new lateral roots. An international team of plant biologists has demonstrated that it is based on th… [+3650 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Water Vapor Detected in The Solar System's Asteroid Belt For First Time - ScienceAlert", "description": "There's a fair amount of water in the Solar System.", "url": "https://www.sciencealert.com/water-vapor-detected-in-the-solar-systems-asteroid-belt-for-first-time", "urlToImage": "https://www.sciencealert.com/images/2023/05/comet-read-art.jpg", "publishedAt": "2023-05-22T18:01:13Z", "content": "There's a fair amount of water in the Solar System. Several moons and planets are loaded with it, while comets from the far reaches are packed with the stuff. Where it warms in the heat of the Sun, i… [+4893 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Lost' immune cells partly to blame for reduced vaccine response in older people: Consequences of cells not being in the right place at the right time lead to immune system defects - Science Daily", "description": "Researchers have shown that within immune structures called the germinal centre, the mislocation of Tfh cells causes reduced capacity to respond well to vaccination with age. The research also identified that Tfh cells have a previously unappreciated role in …", "url": "https://www.sciencedaily.com/releases/2023/05/230522131258.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-22T17:43:49Z", "content": "Understanding the ways our immune response changes as we age holds the key to designing better vaccines and boosting protection for people most at risk. Research published by Dr Michelle Linterman an… [+3678 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Fireball-Like Meteor Lights Up Night Sky In Australia - NDTV", "description": "The incident took place at 9.22 pm in Australia and was observed across multiple suburbs.", "url": "https://www.ndtv.com/feature/watch-fireball-like-meteor-lights-up-night-sky-in-australia-4057473", "urlToImage": "https://c.ndtvimg.com/2023-05/r6bdhm88_meteor-in-australia_625x300_22_May_23.jpg", "publishedAt": "2023-05-22T17:31:36Z", "content": "The video was captured at Cairns Airport in Queensland\r\nOn Saturday, residents in northeast Australia witnessed a fireball-like object shooting across the sky. An incredible video was captured at Cai… [+1414 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Long-running mystery behind Jupiter's changing bands and stripes solved - Devdiscourse", "description": "Read more about Long-running mystery behind Jupiter's changing bands and stripes solved on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2461068-long-running-mystery-behind-jupiters-changing-bands-and-stripes-solved", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/11_02_2022_12_40_08_2375731.jpg?width=920&format=jpeg", "publishedAt": "2023-05-22T16:54:01Z", "content": "Jupiter's famous light and dark \"stripes\" have puzzled scientists for decades, leaving them eager to decode the mechanisms driving this mesmerizing phenomenon. Now, researchers at the University of L… [+2016 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Model Devised to Study Vortex Rings in Nuclear Fusion - AZoQuantum", "description": "Better comprehending the development of swirling, ring-shaped disturbances—called vortex rings—can aid nuclear fusion scientists compress fuel more resourcefully, thereby bringing it nearer to turning into a feasible energy source.", "url": "https://www.azoquantum.com/News.aspx?newsID=9583", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/SocialSharingImage_9583_16847711676011828.png", "publishedAt": "2023-05-22T16:08:00Z", "content": "Better comprehending the development of swirling, ring-shaped disturbances—called vortex rings—can aid nuclear fusion scientists compress fuel more resourcefully, increasing its feasibility as an ene… [+5664 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "New DNA evidence suggests multiple populations gave rise to modern humans - Tech Explorist", "description": "Homo sapiens originated from multiple closely related populations.", "url": "https://www.techexplorist.com/new-dna-evidence-suggests-multiple-populations-gave-rise-modern-humans/60485/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/photomontage.jpg", "publishedAt": "2023-05-22T16:06:31Z", "content": "A new study published in Nature challenges the traditional view of human evolution. Researchers from UC Davis used genetic data from current African populations and compared it to existing fossil evi… [+3504 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "More effort is needed to bring salt-tolerant crops to the farmers who need them, argue researchers - Phys.org", "description": "Despite years of effort and advances in understanding how salinity tolerance works in plants, very few salt-tolerant crops have been released for commercial use.", "url": "https://phys.org/news/2023-05-effort-salt-tolerant-crops-farmers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/now-is-the-time-to-del.jpg", "publishedAt": "2023-05-22T15:30:25Z", "content": "Despite years of effort and advances in understanding how salinity tolerance works in plants, very few salt-tolerant crops have been released for commercial use.\r\nIn a comprehensive review of breedin… [+5121 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Li Yuan", "title": "Scientists explore synergistic effect of weather systems on a flood event in central China - Phys.org", "description": "In July 2021, central China's Henan Province experienced an extraordinary event—a prolonged heavy rainfall period marked by record-breaking hourly rain rates and substantial precipitation accumulation.", "url": "https://phys.org/news/2023-05-scientists-explore-synergistic-effect-weather.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/scientists-explore-syn.jpg", "publishedAt": "2023-05-22T15:25:03Z", "content": "In July 2021, central China's Henan Province experienced an extraordinary eventa prolonged heavy rainfall period marked by record-breaking hourly rain rates and substantial precipitation accumulation… [+2722 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "Astronomers find Earth-sized planet covered in volcanoes - Freethink", "description": "An Earth-sized exoplanet 90 light years away may be covered in active volcanoes — and home to extraterrestrial life.", "url": "https://www.freethink.com/space/earth-sized-exoplanet", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/05/earth-sized-exoplanet-thumb.jpg?resize=1200,630", "publishedAt": "2023-05-22T15:00:00Z", "content": null}, {"source": {"id": null, "name": "Design Products & Applications"}, "author": "", "title": "Newton's motion laws meet their match with novel smart material - Design Products & Applications", "description": "An engineering team has unveiled a game-changing prototype ‘metamaterial’ that wields electrical signals to command both the direction and intensity of energy waves passing through a solid material, paving the way for transformative applications in military, …", "url": "https://www.dpaonthenet.net/article/198436/Newton-s-motion-laws-meet-their-match-with-novel-smart-material.aspx", "urlToImage": "http://www.dpaonthenet.net/global/showimage.ashx?Type=Article&ID=211812&Min=200", "publishedAt": "2023-05-22T14:58:26Z", "content": "22 May 2023\r\nAn engineering team has unveiled a game-changing prototype metamaterial that wields electrical signals to command both the direction and intensity of energy waves passing through a solid… [+2577 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telangana Today", "title": "NASA Invents A Snake Robot To Explore Space | EELS | NASA | Telangana Today - Telangana Today", "description": "This snake-looking machine is expected to explore oceans on Saturn’s moon and other inaccessible locations", "url": "https://telanganatoday.com/nasa-invents-a-snake-robot-to-explore-space-eels-nasa-telangana-today", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2023/05/NASA.jpg", "publishedAt": "2023-05-22T14:15:22Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Rarest of rare: 2 albino egg-laying mammals spotted in Australia - Livescience.com", "description": "Echidnas are shy creatures, and even individuals without albinism are rarely seen in the wild.", "url": "https://www.livescience.com/animals/land-mammals/rarest-of-rare-2-albino-egg-laying-mammals-spotted-in-australia", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hTMKQgaEZGiXjBDCgEWP2T-1200-80.jpg", "publishedAt": "2023-05-22T14:08:17Z", "content": "Echidnas are one of two known mammals in the world whose females lay eggs and also produce milk for their babies, which are called puggles. (Image credit: Bathurst Regional Council)\r\nResidents of New… [+3893 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Astronomers recreate super speedy rings surrounding black holes in lab - Interesting Engineering", "description": "The team used the Mega Ampere Generator for Plasma Implosion Experiments machine (MAGPIE) to simulate the disc spin of a black hole.", "url": "https://interestingengineering.com/science/super-speedy-rings-surrounding-black-holes", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/05/22/image/jpeg/NMQqubPzaJ8uLq6z07m8cr2zqvml66CSoagbtUU3.jpg", "publishedAt": "2023-05-22T13:52:00Z", "content": "The authors hope that this experiment will shed light on one of the most perplexing aspects of accretion disks: how does a black hole grow if material remains in a stable orbit around the event horiz… [+1532 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Toward the realization of chiral spin liquids and non-Abelian anyons in quantum simulators - Phys.org", "description": "Chiral spin liquids are one of the most fascinating phases of matter ever imagined by physicists. These exotic liquids exhibit quasi-particles known as non-Abelian anyons that are neither bosons nor fermions, and whose manipulation could allow for the realiza…", "url": "https://phys.org/news/2023-05-chiral-liquids-non-abelian-anyons-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/toward-the-realization.jpg", "publishedAt": "2023-05-22T13:46:10Z", "content": "Chiral spin liquids are one of the most fascinating phases of matter ever imagined by physicists. These exotic liquids exhibit quasi-particles known as non-Abelian anyons that are neither bosons nor … [+2327 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Nearby star explosion captivates astronomers; closest supernova seen in five years - Devdiscourse", "description": "Read more about Nearby star explosion captivates astronomers; closest supernova seen in five years on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2460613-nearby-star-explosion-captivates-astronomers-closest-supernova-seen-in-five-years", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_05_2023_17_58_49_1063407.jpg?width=920&format=jpeg", "publishedAt": "2023-05-22T12:30:06Z", "content": "NASA's Astronomy Picture Of the Day (APOD) features the Pinwheel Galaxy or M101, one of the most well-known and visually striking galaxies in the night sky. In a momentous astronomical event, esteeme… [+1910 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "Venus To Be Close To Moon; Special Arrangements For Sky Gazers In Bhubaneswar - odishabytes - OdishaBytes", "description": "Bhubaneswar: Sky gazers will be able to witness a rare celestial event on Tuesday as the Moon and Venus will share the same ascension. The moon will be passing 2° to the north of Venus on Tuesday. Pathani Samanta Planetarium in Bhubaneswar has made special ar…", "url": "https://odishabytes.com/venus-to-be-close-to-moon-special-arrangements-for-sky-gazers-in-bhubaneswar/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2023/05/Venus-e1684757489642.jpg", "publishedAt": "2023-05-22T12:28:12Z", "content": "Bhubaneswar: Sky gazers will be able to witness a rare celestial event on Tuesday as the Moon and Venus will share the same ascension. The moon will be passing 2° to the north of Venus on Tuesday.\r\nP… [+705 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Making Nanosheets in One Minute - AZoNano", "description": "A novel technology to make nanosheets, which are thin films of 2D materials a couple of nanometers thick, in approximately one minute was developed by a study team headed by Professor Minoru Osada (he, him) and postdoctoral researcher Yue Shi (she, her) at th…", "url": "https://www.azonano.com/news.aspx?newsID=40246", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_40246_16847574939066142.png", "publishedAt": "2023-05-22T12:13:00Z", "content": "A novel technology to make nanosheets, which are thin films of 2D materials a couple of nanometers thick, in approximately one minute was developed by a study team headed by Professor Minoru Osada (h… [+3441 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Severe Geomagnetic Storm To Hit Earth on May 23: Solar Radiation Storms Expected To Cause G1 Class Magnetic - LatestLY", "description": "The sun has been sending out solar plasma, and the result is strong geomagnetic storms in recent times. We must brace for another one, as a strong geomagnetic storm is heading towards the earth and may hit it on May 23.", "url": "https://www.latestly.com/technology/science/severe-geomagnetic-storm-to-hit-earth-on-may-23-solar-radiation-storms-expected-to-cause-g1-class-magnetic-storm-5145812.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/05/aurora-225449_1920-2-784x441.jpg", "publishedAt": "2023-05-22T11:50:29Z", "content": "The sun has been sending out solar plasma, and the result has been strong geomagnetic storms in recent times. We must brace for another one, as a strong geomagnetic storm is heading towards the earth… [+2047 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "The glacial cycle was driven primarily by astronomical forces in quite a different way than modern age - Tech Explorist", "description": "The glacial cycle was driven by astronomical forces in the past.", "url": "https://www.techexplorist.com/glacial-cycles-unpredictable-uncontrollable/60465/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/Artists-impression.jpg", "publishedAt": "2023-05-22T11:43:25Z", "content": "Analyses of deep-sea sediment cores and other paleoclimatic archives have established the glacial-interglacial climate cycles during the Pleistocene. These cycles are linked to the dynamics of the ic… [+3571 chars]"}, {"source": {"id": null, "name": "Beststocks.com"}, "author": "Elaine Mendonça", "title": "5th Anniversary of the First Successful Mission to Mars - Best Stocks", "description": "Today marks an important day in history as we celebrate the 5th anniversary of the first successful mission to Mars.", "url": "https://beststocks.com/5th-anniversary-of-the-first-successful-missi/", "urlToImage": "https://beststocks.com/wp-content/uploads/2023/03/Aerospace-3.jpg", "publishedAt": "2023-05-22T11:34:43Z", "content": "Today marks an important day in history as we celebrate the 5th anniversary of the first successful mission to Mars. On May 22, 2018, the Mars One spacecraft launched from Earth carrying a team of si… [+2907 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Adithyan P", "title": "Webb Telescope Spots Signs of Universe's Biggest Stars - News18", "description": "The team of European researchers behind the study previously theorised the existence of supermassive stars in 2018 in an attempt to explain one of the great mysteries of astronomy.", "url": "https://www.news18.com/viral/webb-telescope-spots-signs-of-universes-biggest-stars-7884847.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/stars-168475300216x9.png", "publishedAt": "2023-05-22T10:57:50Z", "content": "So far, the largest stars observed anywhere have a mass of around 300 times that of our Sun. But the supermassive star described in a new study has an estimated mass of 5,000 to 10,000 Suns. The team… [+3769 chars]"}, {"source": {"id": null, "name": "Thekashmirwalla.com"}, "author": "News Desk", "title": "Two big asteroids approaching Earth at 30,000 kmph: NASA - The Kashmir Walla", "description": "The National Aeronautics and Space Administration (NASA) telescopes have found two 120-feet asteroids coming closer to the Earth, HT Tech reported.", "url": "https://thekashmirwalla.com/two-big-asteroids-approaching-earth-at-30000-kmph-nasa/", "urlToImage": "https://thekashmirwalla.com/wp-content/uploads/2023/05/download-11.jpg", "publishedAt": "2023-05-22T10:47:25Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Economist", "title": "Artists hope to turn selfies into comets | Mint - Mint", "description": "A pair of space art projects hope to light up the sky", "url": "https://www.livemint.com/science/artists-hope-to-turn-selfies-into-comets-11684751813831.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/05/22/600x338/space_1675270316660_1684751928945.jpg", "publishedAt": "2023-05-22T10:42:09Z", "content": "For most of its history, spaceflight has been done with military, scientific or commercial motives in mind. But lighter-hearted uses are possible too. Wealthy space cadets can already buy trips into … [+4295 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "Researchers on the brink of unraveling the mystery: Did life evolve multiple times? - The Week", "description": "Latest news from India, World, Entertainment, Science, Health and Technology", "url": "https://www.theweek.in", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2023-05-22T09:31:30Z", "content": "India reports 1,839 new Covid cases. Active cases stand at 25,178"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble sees a cosmic jellyfish adrift in ferociously hostile environment - Devdiscourse", "description": "Read more about Hubble sees a cosmic jellyfish adrift in ferociously hostile environment on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2460305-hubble-sees-a-cosmic-jellyfish-adrift-in-ferociously-hostile-environment", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_05_2023_13_58_45_3850092.jpg?width=920&format=jpeg", "publishedAt": "2023-05-22T08:51:52Z", "content": "The NASA/ESA Hubble Space Telescope has captured this celestial beauty - a jellyfish galaxy JW39 that lies over 900 million light-years away in the constellation Coma Berenices. It is one of several … [+2098 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Humidity As Important as Scent for Attracting Pollinators to a Plant - Technology Networks", "description": "Humidity is as important as scent in attracting pollinators to a plant, new Cornell-led research finds, advancing basic biology and opening new avenues to support agriculture.", "url": "https://www.technologynetworks.com/applied-sciences/news/humidity-as-important-as-scent-for-attracting-pollinators-to-a-plant-373620", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/373620/humidity-as-important-as-scent-for-attracting-pollinators-to-a-plant-373620-640x360.jpg?cb=20230522", "publishedAt": "2023-05-22T08:42:41Z", "content": "Humidity is as important as scent in attracting pollinators to a plant, new Cornell-led research finds, advancing basic biology and opening new avenues to support agriculture.\r\nIn a study published  … [+3138 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Cell-Like Transport System Designed - Technology Networks", "description": "Scientists have designed a new cell-like transport system that represents an important milestone on the road to artificial cells.", "url": "https://www.technologynetworks.com/genomics/news/new-cell-like-transport-system-designed-373612", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/373612/new-cell-like-transport-system-designed-373612-640x360.jpg?cb=20230522", "publishedAt": "2023-05-22T08:12:09Z", "content": "Creating artificial cells with life-like characteristics out of a minimal set of components is a major goal of synthetic biology. Autonomous motion is a key capability here, and one that is difficult… [+2940 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Scientists invent Magic Sunlight Powder: The Fast and Cheap Solution to Clean Dirty Water! - Times Now", "description": "Sunlight Superpower: The Revolutionary Recyclable Powder that Purifies Contaminated Water in Seconds!", "url": "https://www.timesnownews.com/technology-science/scientists-invent-magic-sunlight-powder-the-fast-and-cheap-solution-to-clean-dirty-water-article-100414670", "urlToImage": "https://static.tnn.in/thumb/msid-100414670,updatedat-1684742764868,width-1280,height-720,resizemode-75/100414670.jpg", "publishedAt": "2023-05-22T08:06:04Z", "content": "Samsung introduces its 2023 Range of semi-automatic washing machines in India: Price, specifications, and more details"}, {"source": {"id": null, "name": "Qrius.com"}, "author": "Qrius", "title": "Curious about Saturn's rings? Now we may know how they were formed... - Qrius", "description": "Saturn: we may finally know when the magnificent rings were formed", "url": "https://qrius.com/curious-about-saturns-rings-now-we-may-know-how-they-were-formed/", "urlToImage": "https://images.theconversation.com/files/526275/original/file-20230515-27-k825du.jpeg?ixlib=rb-1.1.0&q=45&auto=format&w=754&fit=clip", "publishedAt": "2023-05-22T07:54:44Z", "content": "Gareth Dorrian, University of Birmingham\r\nSaturns rings are one of the jewels of the solar system, but it seems that their time is short and their existence fleeting.\r\nA new study suggests the rings … [+5908 chars]"}, {"source": {"id": null, "name": "Panasiabiz.com"}, "author": "Nitish shaw", "title": "Yellowstone Volcano's Last Super-eruption Not One Big Bang, But a Series of Explosions - PanAsiaBiz", "description": "New research suggests that the last super-eruption at Yellowstone volcano was not one huge explosion but a series of smaller eruptions or multiple vents", "url": "https://www.panasiabiz.com/62701/yellowstone-volcanos-last-supereruption-not-one-big-bang-but-a-series-of-explosions/", "urlToImage": "https://www.panasiabiz.com/wp-content/uploads/2023/05/WhatsApps-Sticker-Maker-Tool-Coming-Soon-To-iOS-Users.jpg", "publishedAt": "2023-05-22T07:21:11Z", "content": "New research suggests that the last super-eruption at Yellowstone volcano was not one huge explosion but a series of smaller eruptions or multiple vents spewing volcanic material in rapid succession.… [+3333 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "A young, fresh Martian impact crater captured by NASA's HiRISE camera - Devdiscourse", "description": "Read more about A young, fresh Martian impact crater captured by NASA's HiRISE camera  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2460166-a-young-fresh-martian-impact-crater-captured-by-nasas-hirise-camera", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_05_2023_11_53_48_6051529.jpg?width=920&format=jpeg", "publishedAt": "2023-05-22T06:24:18Z", "content": "This image captured by the HiRISE camera aboard NASA's Mars Reconnaissance Orbiter (MRO) showcases a textbook example of a young, fresh impact crater on the Red Planet. With a diameter of 1.3 kilomet… [+1961 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bobby John Varkey", "title": "Seaweed health benefits: The newest superfood packed to the gills with vitamins and minerals - Moneycontrol", "description": "Health benefits of seaweed: An emerging sustainable superfood, seaweed's impressive nutritional profile, ranging from iodine to protein and omega-3 fatty acids, makes it an excellent addition to a balanced diet.", "url": "https://www.moneycontrol.com/news/health-and-fitness/seaweed-health-benefits-the-newest-marine-superfood-packed-to-the-gills-with-vitamins-and-minerals-10635091.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/Benefits-of-seaweed-770x433.jpg", "publishedAt": "2023-05-22T05:54:15Z", "content": "In recent years, the world has witnessed a growing interest in sustainable food sources that can meet the nutritional needs of a growing global population while minimising environmental impact. Among… [+3365 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": "More from this author", "title": "Why Do Scorpions Glow In The Dark? - Science ABC", "description": "Scorpions have an outermost covering called the cuticle, that allows for emission and excitation of light particles, causing a short-lived fluorescence where the whole body of the animal glows under ultraviolet light.", "url": "https://www.scienceabc.com/nature/animals/why-do-scorpions-glow-in-the-dark.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2023/03/Bright-blue-scorpion-Centruroides-gracilis-glowing-under-UV-light.jpg", "publishedAt": "2023-05-22T05:31:20Z", "content": "Table of Contents (click to expand)\r\nThe greenish glow that scorpions emit at night happens because of photoluminescence occurring in their cuticle. Scientists hypothesize that the photoluminescent c… [+9878 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Adithyan P", "title": "US 'Space Symphony' Puts Stunning NASA Images to Music - News18", "description": "'The world premiere outside Washington last week of 'Cosmic Cycles' showcased vivid imagery compiled by the US space agency alongside the first-ever public performance of the music.", "url": "https://www.news18.com/viral/us-space-symphony-puts-stunning-nasa-images-to-music-7880719.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/nasa-1-168473297016x9.png", "publishedAt": "2023-05-22T05:23:56Z", "content": "It could be the ultimate blend of art and science a new seven-suite space symphony\" inspired and illustrated by NASAs latest mind-boggling images. The world premiere outside Washington last week of C… [+4311 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Adithyan P", "title": "Long-necked Dinosaur Fossil Found By Argentine Scientists is One of Biggest Ever - News18", "description": "The dinosaur's bones were so big they caused the van carrying them to a Buenos Aires laboratory to tip over, though no one was injured and the remains were left intact.", "url": "https://www.news18.com/viral/long-necked-dinosaur-fossil-found-by-argentine-scientists-is-one-of-biggest-ever-7879849.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/dinosaur-fossil-168472656316x9.png", "publishedAt": "2023-05-22T04:15:04Z", "content": "Argentine paleontologists have discovered the remains of a gigantic new species of long-necked herbivorous dinosaur in the countrys southern Patagonia region, saying the beast ranks as one of the lar… [+1918 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Surprise G2-class Geomagnetic storm sparks stunning red auroras even in Missouri - HT Tech", "description": "Stunning red auroras were captured across the US caused by a G2-class Geomagnetic storm that hit Earth.", "url": "https://tech.hindustantimes.com/tech/news/surprise-g2-class-geomagnetic-storm-sparks-stunning-red-auroras-even-in-missouri-71684728411516.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/22/1600x900/aurora_1684728603284_1684728614155.jpg", "publishedAt": "2023-05-22T04:11:11Z", "content": "2023 has been an eventful year for astronomers and skywatchers. Not only have we witnessed several big asteroids pass by Earth at close distances, but other sky phenomena such as auroras have mesmeri… [+2589 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Adam Barnhardt", "title": "Earth Likely Safe From Devastating Asteroid Impact for Next 1,000 Years - ComicBook.com", "description": "Armageddon isn't coming true anytime soon. According to one new study, scientists believe no catastrophic asteroids will hit Earth at any point within the next 1,000 years, saving the next handful of generations from another Ice Age. Davide Farnocchia, an ast…", "url": "https://comicbook.com/irl/news/earth-no-asteroids-hitting-planet-1000-years/", "urlToImage": "https://sportshub.cbsistatic.com/i/2022/10/11/1a736c5b-381e-4de0-a83c-e90f29d7b0fd/dart-asteroid-test.jpg?width=1200", "publishedAt": "2023-05-22T03:57:00Z", "content": "Armageddon isn't coming true anytime soon. According to one new study, scientists believe no catastrophic asteroids will hit Earth at any point within the next 1,000 years, saving the next handful of… [+2034 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Adithyan P", "title": "New Dinosaur Found in Spain Illuminates History of Meat-eating Group - News18", "description": "Living about 126 to 127 million years ago, the bipedal dinosaur, named Protathlitis cinctorrensis, was about 33 to 36 feet (10 to 11 meters) long and weighed about 2 tons.", "url": "https://www.news18.com/viral/new-dinosaur-found-in-spain-illuminates-history-of-meat-eating-group-7879927.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/dinosaur-168472720616x9.png", "publishedAt": "2023-05-22T03:49:08Z", "content": "During the Cretaceous Period in a lush coastal region in eastern Spain, an impressive dinosaur with an elongated and vaguely crocodile-like skull was on the prowl for a meal, its curved and serrated … [+3533 chars]"}, {"source": {"id": null, "name": "WRGB"}, "author": "Craig Adams", "title": "The Da Vinci Glow - The Moon Has A Certain Glow To It This Week - WRGB", "description": "The “Da Vinci Glow” can be seen on the moon the next few nights including tonight.What is it you ask?The artist and inventor Leonardo Da Vinci some 500 years ag", "url": "https://cbs6albany.com/weather/weather-extra/the-da-vinci-glow-the-moon-has-a-certain-glow-to-it-this-week-sights-in-the-evening-sky-518-moon-views-whats-that-glow", "urlToImage": "https://cbs6albany.com/resources/media/b4a5a837-3433-4bcf-a0f3-83989862d746-large16x9_DaVinciGlow.jpg?1684720684141", "publishedAt": "2023-05-22T02:08:00Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "(Updated) NASA's TROPICS mission launch delayed due to weather - Devdiscourse", "description": "Read more about (Updated) NASA's TROPICS mission launch delayed due to weather on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2459073-updated-nasas-tropics-mission-launch-delayed-due-to-weather", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_05_2023_06_37_40_2334793.jpg?width=920&format=jpeg", "publishedAt": "2023-05-22T01:52:56Z", "content": "Due to unfavourable weather conditions, NASA and Rocket Lab have deferred the May 22 launch of the second pair of TROPICS satellites to orbit. They are now targeting Tuesday, May 23, (5:00 p.m. NZST)… [+1654 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Synthetic delivery vector STxB induces mucosal immunity against viral antigens - News-Medical.Net", "description": "Research describes the development of a synthetic delivery vector called STxB for mucosal vaccination. It induces mucosal immunity, including resident memory CD8+ T cells and IgA antibodies, against antigens derived from mucosal viruses when administered intr…", "url": "https://www.news-medical.net/news/20230521/Synthetic-delivery-vector-STxB-induces-mucosal-immunity-against-viral-antigens.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_748779_16846872130078769.jpg", "publishedAt": "2023-05-22T00:44:00Z", "content": "In a recent study posted to the bioRxiv* preprint server, researchers describe a mucosal vector vaccine for targeting dendritic cells.\r\nStudy: A synthetic delivery vector for mucosal vaccination. Ima… [+5387 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Tweaking Just a Few Genes Transforms Scales Into Feathers - ScienceAlert", "description": "The feathers, fur, and scales that adorn different members of the animal kingdom may look quite different, but they're all made of the same basic stuff.", "url": "https://www.sciencealert.com/tweaking-just-a-few-genes-transforms-scales-into-feathers", "urlToImage": "https://www.sciencealert.com/images/2023/05/feather-chicken-foot.jpg", "publishedAt": "2023-05-21T18:01:11Z", "content": "The feathers, fur, and scales that adorn different members of the animal kingdom may look quite different, but they're all made of the same basic stuff. And, as it turns out, it only takes a relative… [+4198 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study illustrates how cells choose DNA repair methods - Devdiscourse", "description": "DNA is usually regarded as the blueprint for life and is essential for an organism to perform biological tasks. A range of factors, including radical metabolites, radiation, and other hazardous substances, can cause DNA damage. Because DNA is a two-stranded m…", "url": "https://www.devdiscourse.com/article/health/2459839-study-illustrates-how-cells-choose-dna-repair-methods", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_05_2023_17_45_26_0961829.jpg?width=920&format=jpeg", "publishedAt": "2023-05-21T17:45:29Z", "content": "DNA is usually regarded as the blueprint for life and is essential for an organism to perform biological tasks. A range of factors, including radical metabolites, radiation, and other hazardous subst… [+3435 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Heart Transplant, NASA Style: Roman Space Telescope Gets Its Core - SciTechDaily", "description": "NASA’s Focal Plane System, a key part of the Nancy Grace Roman Space Telescope, has arrived at Ball Aerospace for assembly into the Wide Field Instrument. This system, with 18 detectors and state-of-the-art electronics, will provide high-resolution images for…", "url": "https://scitechdaily.com/heart-transplant-nasa-style-roman-space-telescope-gets-its-core/", "urlToImage": "https://scitechdaily.com/images/NASA-Nancy-Grace-Roman-Space-Telescope-Detectors-scaled.jpg", "publishedAt": "2023-05-21T17:23:11Z", "content": "ByAshley Balzer, NASAs Goddard Space Flight CenterMay 21, 2023\r\nPrincipal technician Billy Keim installs a cover plate over the detectors for NASAs Nancy Grace Roman Space Telescope. Credit: NASA/Chr… [+4240 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Mysterious Flyby Anomaly Baffles Scientists as Spacecraft Defy Known Laws of Physics - Transcontinental Times", "description": "INDIA: In the vast expanse of space, scientists have been perplexed by an intriguing phenomenon known as the flyby anomaly, in which spacecraft travelling past Earth experience unexplained deviations in their trajectories. This mysterious anomaly has sparked …", "url": "https://www.transcontinentaltimes.com/flyby-anomaly-baffles-scientists/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/05/Flyby-Anomaly.jpg", "publishedAt": "2023-05-21T15:39:43Z", "content": "INDIA: In the vast expanse of space, scientists have been perplexed by an intriguing phenomenon known as the flyby anomaly, in which spacecraft travelling past Earth experience unexplained deviations… [+3424 chars]"}, {"source": {"id": null, "name": "Theglobestalk.com"}, "author": "https://m.facebook.com/theglobestalk/?ref=bookmarks", "title": "Pulsars Unveiled: Unlocking the Secrets of their Enigmatic Pulses - The Globe's Talk", "description": "Pulsars, celestial objects that emit regular pulses of electromagnetic radiation, have captivated scientists since their discovery in the 1960s. These rapidly", "url": "https://theglobestalk.com/pulsars-unveiled-unlocking-secrets-of-their-enigmatic-pulses/", "urlToImage": "https://theglobestalk.com/wp-content/uploads/2023/05/images-6.jpeg", "publishedAt": "2023-05-21T15:10:58Z", "content": "Pulsars, celestial objects that emit regular pulses of electromagnetic radiation, have captivated scientists since their discovery in the 1960s. These rapidly spinning remnants of massive stars hold … [+7076 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Holly Spanner", "title": "Earthshine tonight: How to see May's spectacular Moon event - BBC Science Focus Magazine", "description": "Lifting the veil on the Moon’s eery glow: here’s when and how to see lunar Earthlight this May.", "url": "https://www.sciencefocus.com/news/earthshine-may-2023/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2023/05/Everything-you-need-to-know-about-Earthshine-1ab2a50.jpg?resize=960,413", "publishedAt": "2023-05-21T15:05:03Z", "content": "You may have noticed the Moon exhibiting a ghostly glow lately, where a subtle light is illuminating the usually unlit portion of the lunar surface. This is a phenomenon called Earthshine, and it can… [+7721 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "4.6 billion-year-old meteorite discovered after it smashed through the roof of a house - BGR", "description": "A rock that smashed into a home in New Jersey this year has been confirmed as a rare meteorite believed to be roughly 4.6 billion years old.", "url": "https://bgr.com/science/4-6-billion-year-old-meteorite-discovered-after-it-smashed-through-the-roof-of-a-house/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/11/comet-earth.jpg?quality=82&strip=all", "publishedAt": "2023-05-21T13:04:00Z", "content": "A rock that smashed into a home in New Jersey this year has been confirmed as a rare meteorite believed to be roughly 4.6 billion years old. The confirmation comes after much testing and observation … [+1699 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "NASA’s last “Great Observatory” could be coming out of retirement - Freethink", "description": "A startup’s audacious plan to revive NASA’s retired Spitzer Space Telescope just secured a $250,000 Space Force contract.", "url": "https://www.freethink.com/space/spitzer-space-telescope", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/05/spitzer-space-telescope-thumb.jpg?resize=1200,630", "publishedAt": "2023-05-21T13:00:00Z", "content": null}, {"source": {"id": null, "name": "Natescrest.com"}, "author": "Izer", "title": "Unpublished discovery on Mars - AS.com - Nates's Crest", "description": "Red planet. From Earth, the cold, barren desert that stretches across acres and acres of the peaceful world appears as an orange star. Shines brighter", "url": "https://www.natescrest.com/unpublished-discovery-on-mars-as-com/", "urlToImage": "https://img.asmedia.epimg.net/resizer/xmj_HgUTim_dgUkltYXVe95MT3A=/1472x828/cloudfront-eu-central-1.images.arcpublishing.com/diarioas/SZQG7RM5C5DCDDYYSYXLDLXBTA.jpg", "publishedAt": "2023-05-21T06:22:10Z", "content": "Red planet. From Earth, the cold, barren desert that stretches across acres and acres of the peaceful world appears as an orange star. Shines brighter than the rest. When scientists mentioned astrono… [+2627 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "A radioactive source of heat inside Mars has been identified: it has become known what is the thickness of ... - The Times Hub", "description": "Spread the love According to scientists, Mars is indeed covered with “very thick armor.” According to a study published in Geophysical Research Letters, a Swiss team has finally been able to accurately determine the thickness of the Martian crust. Scientists …", "url": "https://thetimeshub.in/a-radioactive-source-of-heat-inside-mars-has-been-identified-it-has-become-known-what-is-the-thickness-of-the-planets-crust/", "urlToImage": null, "publishedAt": "2023-05-21T05:08:52Z", "content": "According to scientists, Mars is indeed covered with “very thick armor.” \r\nAccording to a study published in Geophysical Research Letters, a Swiss team has finally been able to accurately determine t… [+825 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "A monster from the depths of the ocean. Scientists discover fossils of ancient sea predator with 'screw... - The Times Hub", "description": "Spread the love Researchers are still puzzled, because they have not yet seen such strange teeth. An ancient ocean during the Late Cretaceous is hardly a safe place. Between 66 million and 100 million years ago, veritable sea monsters criss-crossed the ocean,…", "url": "https://thetimeshub.in/a-monster-from-the-depths-of-the-ocean-scientists-discover-fossils-of-ancient-sea-predator-with-screwdriver-teeth/", "urlToImage": null, "publishedAt": "2023-05-21T05:08:38Z", "content": "Researchers are still puzzled, because they have not yet seen such strange teeth. \r\nAn ancient ocean during the Late Cretaceous is hardly a safe place. Between 66 million and 100 million years ago, v… [+794 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid Alert app: a journey through the cosmos - HT Tech", "description": "Asteroid Alert app a journey through the cosmos Asteroid Alert app an innovative application developed by PhoneScience immerses users in the intricate world of space dynamics. Asteroid Alert app an innovative application developed by PhoneScience immerses use…", "url": "https://tech.hindustantimes.com/web-stories/asteroid-alert-app-a-journey-through-the-cosmos-71684638750898.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/21/1600x900/Asteroid_alert_app_1684639056784_1684639056979.jpg/", "publishedAt": "2023-05-21T03:40:10Z", "content": "Photo Credit: PhoneScience\r\n Asteroid Alert app, an innovative application developed by PhoneScience, immerses users in the intricate world of space dynamics. \r\nAsteroid Alert app, an innovative appl… [+1108 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": "Kevin Hurler", "title": "Put a Crown on It: Saturn Shatters Jupiter’s Record for Most Moons - Gizmodo Australia", "description": "In February, scientists declared that Jupiter had the most moons of any planet in our solar system, with 92 natural...", "url": "https://www.gizmodo.com.au/2023/05/put-a-crown-on-it-saturn-shatters-jupiters-record-for-most-moons/", "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2023/05/16/9e88d7093ac9194841d040f7d9356cd3.png?quality=80&resize=1280,720", "publishedAt": "2023-05-21T02:00:00Z", "content": "In February, scientists declared that Jupiter had the most moons of any planet in our solar system, with 92 natural satellites, ripping the crown from Saturns grasp. Now, Saturn has snatched it back,… [+2236 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA looks for hidden monster, but Hubble Space Telescope snaps THIS - HT Tech", "description": "NASA has deployed the Hubble Space Telescope to find a hidden monster.", "url": "https://tech.hindustantimes.com/tech/news/nasa-looks-for-hidden-monster-but-hubble-space-telescope-snaps-this-71684577243637.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/20/1600x900/hubble_ngc6325_potw2320a_0_1684577599696_1684577605805.jpg", "publishedAt": "2023-05-20T10:15:06Z", "content": "NASA has been scouring the boundaries of space through the iconic Hubble Space Telescope for decades now and its latest mission has been to search for hidden monsters out there. While doing so, the H… [+1293 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "Is the world ending this Sunday? Heres why May 21 is observed as End of World Day - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/science/is-the-world-ending-this-sunday-heres-why-may-21-is-observed-as-end-of-world-day", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-05/b04a3da6-592f-4615-8594-e1173a3c33f3/Swarna___2023_05_20T140613_049.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-05-20T10:08:00Z", "content": "May 21 is observed as the End of the World Day by people across the globe. There's an interesting tale stating its commemoration that will surely steal ears of time travellers, space enthusiasts, and… [+1216 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Understanding the Celestial Dance: The Enchanting 4:1 Resonance Unveiled between Jupiter and Saturn - Transcontinental Times", "description": "INDIA: Astronomers discovered an extraordinary celestial dance between the gas giants of our solar system, Jupiter and Saturn. Scientists unveiled the fascinating 4:1 resonance these awe-inspiring planets share, providing a mesmerising spectacle that captivat…", "url": "https://www.transcontinentaltimes.com/celestial-dance-jupiter-and-saturn/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/05/Satur.jpg", "publishedAt": "2023-05-20T06:15:00Z", "content": "INDIA: Astronomers discovered an extraordinary celestial dance between the gas giants of our solar system, Jupiter and Saturn. Scientists unveiled the fascinating 4:1 resonance these awe-inspiring pl… [+3036 chars]"}]}