{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "SpaceNews"}, "author": "Jason Rainbow", "title": "British startup powers up sensor for monitoring tiny orbital debris - SpaceNews", "description": "Odin Space is preparing to start detecting tiny but potentially dangerous pieces of orbital debris in the coming weeks from a sensor on a recently launched space tug, according to the British startup’s cofounder and CEO James New.", "url": "https://spacenews.com/british-startup-powers-up-sensor-for-monitoring-tiny-orbital-debris/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/06/ODIN-Render-2-scaled.jpg", "publishedAt": "2023-06-27T22:03:22Z", "content": "TAMPA, Fla. Odin Space is preparing to start detecting tiny but potentially dangerous pieces of orbital debris in the coming weeks from a sensor on a recently launched space tug, according to the Bri… [+1725 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Humans' ancestors survived the asteroid impact that killed the dinosaurs - Science Daily", "description": "A Cretaceous origin for placental mammals, the group that includes humans, dogs and bats, has been revealed by in-depth analysis of the fossil record, showing they co-existed with dinosaurs for a short time before the dinosaurs went extinct.", "url": "https://www.sciencedaily.com/releases/2023/06/230627123015.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-06-27T21:09:47Z", "content": "A Cretaceous origin for placental mammals, the group that includes humans, dogs and bats, has been revealed by in-depth analysis of the fossil record, showing they co-existed with dinosaurs for a sho… [+2608 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Perseverance rover spots donut-shaped rock on Mars (photo) - Space.com", "description": "It might be a large meteorite.", "url": "https://www.space.com/mars-rover-perseverance-donut-rock-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QgRBXsef3t95b35fXse23V-1200-80.jpg", "publishedAt": "2023-06-27T20:00:46Z", "content": "NASA's Mars rover Perserverance snapped this photo of a possible meteorite on the Red Planet on June 23, 2023. (Image credit: Future)\r\nNASA's Perseverance Mars rover has rolled up on a rocky donut th… [+2171 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "University of Washington", "title": "Researchers make a quantum computing leap with a magnetic twist - Newswise", "description": "A team led by scientists and engineers at the University of Washington has announced a significant advancement in quantum computing. They have detected signatur", "url": "https://www.newswise.com/articles/researchers-make-a-quantum-computing-leap-with-a-magnetic-twist", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2023/06/27/649b2ab1039fe_figurenewsletter.png&width=600&height=600", "publishedAt": "2023-06-27T18:05:00Z", "content": "Newswise — Quantum computing could revolutionize our world. For specific and crucial tasks, it promises to be exponentially faster than the zero-or-one binary technology that underlies today’s machin… [+7053 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "NASA's James Webb Space Telescope Detects Crucial Carbon Molecule In Distant Star System - Pragativadi", "description": "A team of international scientists has used NASA’s James Webb Space Telescope to detect a new carbon compound in space for the first time. Known as methyl cation (pronounced cat-eye-on) (CH3+), the molecule is important because it aids the formation", "url": "https://pragativadi.com/nasas-james-webb-space-telescope-detects-crucial-carbon-molecule-in-distant-star-system/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2023/06/STScI-01H2TW00Z40N44Z110J4N1H0YE.png", "publishedAt": "2023-06-27T17:43:45Z", "content": "A team of international scientists has used NASAs James Webb Space Telescope to detect a new carbon compound in space for the first time. Known as methyl cation (pronounced cat-eye-on) (CH3+), the mo… [+2918 chars]"}, {"source": {"id": null, "name": "Theglobestalk.com"}, "author": "https://m.facebook.com/theglobestalk/?ref=bookmarks", "title": "Unveiling a Stellar Rarity: A Rare Star Found in the Galaxy - The Globe's Talk", "description": "A newly discovered star just 773 light-years away belongs to one of the rarest categories in the Milky Way. J1912-4410 is a white dwarf pulsar, a type of star", "url": "https://theglobestalk.com/stellar-rarity-a-rare-star-found-in-the-galaxy/", "urlToImage": "https://theglobestalk.com/wp-content/uploads/2023/06/images-68.jpeg", "publishedAt": "2023-06-27T17:21:21Z", "content": "A newly discovered star just 773 light-years away belongs to one of the rarest categories in the Milky Way. J1912-4410 is a white dwarf pulsar, a type of star so rarely seen that only one other is kn… [+3801 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "ESA’s spacecraft to explore universe’s ‘dark mysteries’ launching this week - Gadgets Now", "description": "The European Space Agency (ESA) will launch the Euclid spacecraft to explore the dark mysteries of the universe on Saturday, US space agency NASA has said. Liftoff will be from Cape Canaveral Space Force Station in Florida, on a SpaceX Falcon 9 rocket.“The ES…", "url": "https://www.gadgetsnow.com/tech-news/esas-spacecraft-to-explore-universes-dark-mysteries-launching-this-week/articleshow/101317833.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-101317833,imgsize-179260,width-800/101317833.jpg", "publishedAt": "2023-06-27T17:15:00Z", "content": "The European Space Agency (ESA) will launch the Euclid spacecraft to explore the dark mysteries of the universe on Saturday, US space agency NASA has said. Liftoff will be from Cape Canaveral Space F… [+2136 chars]"}, {"source": {"id": null, "name": "Mongabay.com"}, "author": "Lizkimbrough", "title": "Microbes play leading role in soil carbon capture, study shows - Mongabay.com", "description": "More carbon is stored in the soil than in all plants, animals and the atmosphere combined, making it among the most critical conservation frontiers as we face the climate crisis. According to a recent study published in the journal Nature, microbes are the ke…", "url": "https://news.mongabay.com/2023/06/microbes-play-leading-role-in-soil-carbon-capture-study-shows/", "urlToImage": "https://imgs.mongabay.com/wp-content/uploads/sites/20/2021/08/10050907/soilcoverseedling-768x512.jpeg", "publishedAt": "2023-06-27T16:53:56Z", "content": "<ul><li>Soil is a significant carbon reservoir, storing more carbon than all plants, animals and the atmosphere combined, making it crucial for addressing the climate crisis.</li><li>Microbes, such a… [+6334 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Synthesis of peripherally annulated phenanthroporphyrins - Phys.org", "description": "Prof. Okujima, in collaboration with Prof. Kobayashi at Shinshu University, have reported the synthesis, molecular structure, optical properties and electronic structure of unusual phenanthrene-fused porphyrins in Organic Letters.", "url": "https://phys.org/news/2023-06-synthesis-peripherally-annulated-phenanthroporphyrins.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/synthesis-of-periphera.jpg", "publishedAt": "2023-06-27T16:47:05Z", "content": "Prof. Okujima, in collaboration with Prof. Kobayashi at Shinshu University, have reported the synthesis, molecular structure, optical properties and electronic structure of unusual phenanthrene-fused… [+1113 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Never-before-seen 'missing link' dinosaur walks, drinks and socializes in stunning new animation - Livescience.com", "description": "The newly discovered duck-billed dinosaur, Gonkoken nanoi, likely grew to around 13 feet long and weighed up to 1 ton, new analysis reveals.", "url": "https://www.livescience.com/animals/dinosaurs/never-before-seen-missing-link-dinosaur-walks-drinks-and-socializes-in-stunning-new-animation", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HV4uEUZZS5Lq2NiddBkn7S-1200-80.jpg", "publishedAt": "2023-06-27T15:52:49Z", "content": "A digital reconstruction of what the newly discovered species, Gonkoken nanoi, might have looked like. (Image credit: PaleoGDY/University of Chile)\r\nPaleontologists have unearthed a never-before-seen… [+4189 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "Shashank Tripati", "title": "IAU Names Minor Planet After First Indian Meteor Astronomer Aswin Sekhar - Deccan Chronicle", "description": "IAU Names Minor Planet After First Indian Meteor Astronomer Aswin Sekhar", "url": "https://www.deccanchronicle.com/science/science/270623/iau-names-minor-planet-after-first-indian-meteor-astronomer-aswin-sekh.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-63a0e63oolbnk10pr69mnr09f1-20230627212106.Medi.jpeg", "publishedAt": "2023-06-27T15:52:48Z", "content": null}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Devika Rao, Staff writer", "title": "Earth's axis has shifted thanks to human groundwater pumping - Yahoo Movies Canada", "description": "Earth's axis has shifted thanks to human groundwater pumping", "url": "https://news.yahoo.com/earths-axis-shifted-thanks-human-154844499.html", "urlToImage": "https://media.zenfs.com/en/the_week_574/a4460e42763c6737ffa5e4a95fddf6ad", "publishedAt": "2023-06-27T15:48:44Z", "content": "Globe spinning. Buena Vista Images / Getty Images \r\nHuman use of groundwater for drinking and agriculture has affected the tilt of the Earth, according to a new study published in the journal Geophys… [+1899 chars]"}, {"source": {"id": null, "name": "Caltech.edu"}, "author": null, "title": "New Bioinspired Robot Flies, Rolls, Walks, and More - Caltech", "description": "Developed at Caltech’s Center for Autonomous Systems and Technologies, a new robot can autonomously choose from a variety of motions to move through a complex environment.", "url": "https://www.caltech.edu/about/news/new-bioinspired-robot-flies-rolls-walks-and-more", "urlToImage": "https://caltech-prod.s3.amazonaws.com/main/images/Gharib_Mory-Lab-M4-Robot-0634-WEB.width-600.jpg", "publishedAt": "2023-06-27T15:28:45Z", "content": "A newly created real-life Transformer is capable of reconfiguring its body to achieve eight distinct types of motion and can autonomously assess the environment it faces to choose the most effective … [+4002 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "Biodegradable Implants Made from New Hydrogel Could Aid Cartilage Regeneration - HospiMedica", "description": "A new method can be used to create a biodegradable gel that combines stiffness and toughness, advancing the quest to develop biodegradable implants for joint injuries.", "url": "https://www.hospimedica.com/surgical-techniques/articles/294797699/biodegradable-implants-made-from-new-hydrogel-could-aid-cartilage-regeneration.html", "urlToImage": "https://mobile.hospimedica.com/images/stories/articles/article_images/2023-06-27/SDD-294797699.jpg", "publishedAt": "2023-06-27T14:55:04Z", "content": "By HospiMedica International staff writersPosted on 27 Jun 2023\r\nMimicking articular cartilage, which enables seamless movement in the knee and hip joints, is a complex task. Damage to this cartilage… [+3626 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "Why astronauts develop skin rashes, viral infections in space - The Siasat Daily", "description": "Toronto: Space travel alters gene expression in white blood cells, weakening the immune system, making astronauts more susceptible to infections and skin rashes while in space, according to a study. Astronauts on board the International Space Station (ISS) ar…", "url": "https://www.siasat.com/why-astronauts-develop-skin-rashes-viral-infections-in-space-2626486/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/05/Saudi-astronauts.jpg", "publishedAt": "2023-06-27T14:19:00Z", "content": "Toronto: Space travel alters gene expression in white blood cells, weakening the immune system, making astronauts more susceptible to infections and skin rashes while in space, according to a study.\r… [+2604 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Tech Explorist", "title": "'Smiling cat' nebula captured in new ESO image - Tech Explorist", "description": "This cloud of orange and red, part of the Sh2-284 nebula, is shown here in spectacular detail using data from the VLT Survey Telescope, hosted by the", "url": "https://www.techexplorist.com/smiling-cat-nebula-captured-in-new-eso-image/63100/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Sh2-284-nebula.jpeg", "publishedAt": "2023-06-27T13:39:42Z", "content": "This cloud of orange and red, part of the Sh2-284 nebula, is shown here in spectacular detail using data from the VLT Survey Telescope, hosted by the European Southern Observatory (ESO). This nebula … [+2057 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Fermin Koop", "title": "This surprising parasite can make ants live at least three times longer - ZME Science", "description": "Infected ants don’t work, are cared for and live much longer than usual.", "url": "https://www.zmescience.com/science/this-surprising-parasite-can-make-ants-live-at-least-three-times-longer/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/06/Temnothorax_Nylanderi.jpg", "publishedAt": "2023-06-27T13:33:26Z", "content": "Getting infected by a parasite isnt usually a good thing, but there can be some exceptions to the rule. Scientists found that ants infected by a tapeworm live several times longer than their otherwis… [+2897 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "A New Search for Brown Dwarfs, Cool Neighbors of our Sun | Science Mission Directorate - Science@NASA", "description": "Help scientists uncover brown dwarfs, celestial neighbors of our Sun! Brown dwarfs are objects with masses in the range between stars and giant planets like Jupiter. Picture them as oversized versions of Jupiter, drifting alone in the vastness of space. They …", "url": "https://science.nasa.gov/science-news/citizenscience/a-new-search-for-brown-dwarfs-cool-neighbors-of-our-sun", "urlToImage": null, "publishedAt": "2023-06-27T13:06:06Z", "content": "Join the Backyard Worlds: Cool Neighbors project, and be the first to spot an undiscovered brown dwarf!  (Credit: Matteo Gulla.)\r\nHelp scientists uncover brown dwarfs, celestial neighbors of our Sun!… [+961 chars]"}, {"source": {"id": null, "name": "Oneindia.com"}, "author": null, "title": "Astronomers stumble upon a massive black hole with mass 30 billion times that of sun - Oneindia", "description": "A group of astronomers have discovered the largest black hole known to mankind, using some really unconventional methods. They have found this supermassive black hole using bent light and gravity. Astronomers have identified that this massive colossal black h…", "url": "https://www.oneindia.com/videos/astronomers-stumble-upon-a-massive-black-hole-with-mass-30-billion-times-that-of-sun-3897930.html", "urlToImage": "https://www.oneindia.com/image/560x292x81/2023/06/924815142-astronomers-stumble-upon-a-massive-black-hole-with-mass-30-billion-times-that-of-sun.jpg", "publishedAt": "2023-06-27T12:45:05Z", "content": "SettingsX\r\nSettingsX"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "In 1998, a bet was made between a neuroscientist and a philosopher. 25 years later, we have a winner - WION", "description": "In 1998, a bet was made between a neuroscientist and a philosopher. 25 years later, we have a winner", "url": "https://www.wionews.com/trending/in-1998-a-bet-was-made-between-a-neuroscientist-and-philosopher-25-years-after-we-have-a-winner-609300", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/27/362668-ber.png", "publishedAt": "2023-06-27T12:35:37Z", "content": "In 1998, a neuroscientist and a philosopher had placed a bet. It took them 25 years to decide who was the ultimate winner.\r\nA day after lecturing at a conference on consciousness, neuroscientist Chri… [+2510 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Jonathan D Grinstein, PhD", "title": "Human Extra-Embryoid Model Open New Window into Development - Genetic Engineering & Biotechnology News", "description": "These \"human extra-embryoids\" are structures developed from human stem cells that resemble human embryos at days 9–14 after fertilization.", "url": "https://www.genengnews.com/topics/translational-medicine/human-extra-embryoid-model-opens-new-window-into-development/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2023/06/GettyImages-173297406_1-e1687874661454.jpg", "publishedAt": "2023-06-27T11:29:51Z", "content": "When Berna Sozen, PhD, assistant professor of Developmental Stem Cell Biology at Yale, was in her first weeks of pregnancy, she couldnt help but wonder about what exactly was going on in the black bo… [+7310 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Anna Demming", "title": "Scientists tried to solve the mystery of the helium nucleus — and ended up more confused than ever - Livescience.com", "description": "Helium is the simplest element in the periodic table with more than one particle in its nucleus, yet state of the art theory and experiments on it don't add up.", "url": "https://www.livescience.com/physics-mathematics/particle-physics/scientists-tried-to-solve-the-mystery-of-the-helium-nucleus-and-ended-up-more-confused-than-ever", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nSgtov9DjY3cRhW5mRUvoH-1200-80.jpg", "publishedAt": "2023-06-27T11:00:00Z", "content": "One of nature's simplest elements is giving scientists a big headache after new research shows that protons and neutrons in helium atoms are not behaving as theory suggests they should. The mismatch … [+4721 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Chandrayaan-3 spacecraft ready to be encapsulated into rocket, says ISRO - Zee News", "description": "The Chandrayaan-3 mission is scheduled to launch between July 12 and July 19 of this year. According to the most recent update, ISRO's Chandrayaan-3 has been mated with the payload adapter. The payload adapter is a piece of hardware that connects a satellite …", "url": "https://zeenews.india.com/video/news/chandrayaan-3-spacecraft-ready-to-be-encapsulated-into-rocket-says-isro-2627726.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/06/27/00000003_64.jpg", "publishedAt": "2023-06-27T10:35:01Z", "content": "By clicking Accept All Cookies, you agree to the storing of cookies on your device and the processing of information obtained via those cookies (including about your preferences, device and online ac… [+357 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristin Hugo", "title": "25 million-year-old 'slasher' dolphin with weird teeth discovered in museum collection - Livescience.com", "description": "Researchers believe the creature, named Nihohae matakoi, used its horizontal teeth to thrash at prey before gulping it down.", "url": "https://www.livescience.com/animals/extinct-species/25-million-year-old-slasher-dolphin-with-weird-teeth-discovered-in-museum-collection", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7wNwiuoFPgxByhu2nb7zjm-1200-80.jpg", "publishedAt": "2023-06-27T09:27:22Z", "content": "The fossilized skull of Nihohae matakoi — first found in 1998 —  has now been described by scientists.  (Image credit: Te Ara - the Encyclopedia of New Zealand)\r\nA bizarre predatory dolphin that live… [+3105 chars]"}, {"source": {"id": null, "name": "Nnn.ng"}, "author": "NNN", "title": "The Enthralling World of NASA's YouTube Channel - Nigeria News June 27, 2023 - NNN NEWS NIGERIA", "description": "The Enthralling World of NASA's YouTube Channel As we move closer to the future, space exploration and research will likely become more critical. NASA has played a crucial role in our understanding of June 27, 2023", "url": "https://nnn.ng/videodownload/the-enthralling-world-of-nasas-youtube-channel/", "urlToImage": null, "publishedAt": "2023-06-27T08:56:05Z", "content": "June 27, 2023\r\nAs we move closer to the future, space exploration and research will likely become more critical. NASA has played a crucial role in our understanding of space and has made significant … [+5891 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Innovative Paper-Like, Battery-Free, AI-Enabled Sensor for Holistic Wound Monitoring - Technology Networks", "description": "Researchers have developed a new battery-free, AI-enabled sensor patch comprised of five colorimetric sensors that can monitor wound healing.", "url": "https://www.technologynetworks.com/applied-sciences/news/innovative-paper-like-battery-free-ai-enabled-sensor-for-holistic-wound-monitoring-375330", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/375330/innovative-paper-like-battery-free-ai-enabled-sensor-for-holistic-wound-monitoring-375330-640x360.jpg?cb=20230627", "publishedAt": "2023-06-27T08:48:11Z", "content": "Timely and effective monitoring of wound healing status is critical to wound care and management. Impaired wound healing, such as chronic wounds (i.e. those that do not heal after 3 months) and post-… [+6348 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Ocean currents did not raise atmospheric carbon dioxide during the Holocene, deep sea coral dating reveals - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/ocean-currents-did-not-raise-atmospheric-carbon-dioxide-during-the-holocene-deep-sea-coral-dating-reveals/596868.html", "urlToImage": "", "publishedAt": "2023-06-27T08:25:05Z", "content": "New Delhi, Jun 27 (PTI) Ocean currents, bringing carbon-rich deep waters up to the ocean's surface and thought to release marine carbon into the air, did not contribute to increasing atmospheric carb… [+580 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Ancient galactic clash unleashes stellar gamma-ray burst: Astronomers witness collision - WION", "description": "Ancient galactic clash unleashes stellar gamma-ray burst: Astronomers witness collision", "url": "https://www.wionews.com/science/ancient-galactic-clash-unleashes-stellar-gamma-ray-burst-astronomers-witness-collision-609166", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/27/362555-the-battle-for-kyiv-13.jpg", "publishedAt": "2023-06-27T08:10:58Z", "content": "In a scenario straight out of a comic book, a tantalising method for striking fear into enemies has emerged. Picture this: two ancient stellar remnants violently converging right before your nemesis'… [+3273 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Paola Totaro", "title": "Can human beings actually ‘smell’ fear? A new book says yes - Scroll.in", "description": "An excerpt from ‘On the Scent: Unlocking the Mysteries of Smell and How its Loss Can Change Your World’, by Paola Totaro and Robert Wainwright.", "url": "https://scroll.in/article/1051501/can-human-beings-actually-smell-fear-a-new-book-says-yes", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/191563-bltdczokpx-1687600426.jpg", "publishedAt": "2023-06-27T08:00:00Z", "content": "While most olfactory scientists are students of the human brain, nose and smell-driven behaviours, Professor Jonathan Williams, an atmospheric chemist at the Max Planck Institute in Germany, studies … [+7231 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm looming over Earth as POWERFUL solar flares set to explode today, says NOAA - HT Tech", "description": "NOAA forecasters have revealed there is a 40 percent chance of an M-class solar flare eruption today, June 27, as the sunspot AR3340 turns unstable. Is another solar storm coming towards Earth? Find out.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-looming-over-earth-as-powerful-solar-flares-set-to-explode-today-says-noaa-71687846343301.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/27/1600x900/clement-714404_1674110601961_1687846382818.jpg", "publishedAt": "2023-06-27T06:16:03Z", "content": "After an unremarkable weekend, solar activity is again picking up speed. Last week, we witnessed two separate radio blackout events triggered by an X-class solar flare and an M-class solar flare. Whi… [+2764 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Extremely weak magnetic fields detected on the surface of Mars' Utopia basin - Tech Explorist", "description": "This indicates no detectable magnetization anomalies below Zhurong's landing site.", "url": "https://www.techexplorist.com/extremely-weak-magnetic-fields-detected-surface-mars-utopia-basin/63026/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Zhurong-rover.jpg", "publishedAt": "2023-06-27T06:13:58Z", "content": "Mars’ magnetic field has been measured at a large scale by orbiting spacecraft and at a very small scale via Martian meteorites. Magnetic surveys probe crustal magnetism on length scales comparable t… [+2015 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Could the expanding Universe truly be a mirage? - Big Think", "description": "A cute mathematical trick can \"rescale\" the Universe so that it isn't actually expanding. But can that \"trick\" survive all our cosmic tests?", "url": "https://bigthink.com/starts-with-a-bang/expanding-universe-mirage/", "urlToImage": "https://bigthink.com/wp-content/uploads/2017/03/origin-127.jpg?resize=1200,630", "publishedAt": "2023-06-27T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "AFP", "title": "Will AI really destroy humanity? - Moneycontrol", "description": "Most disaster scenarios start in the same place: machines will outstrip human capacities, escape human control and refuse to be switched off.", "url": "https://www.moneycontrol.com/news/world/will-ai-really-destroy-humanity-10863751.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/AI-3-770x433.png", "publishedAt": "2023-06-27T05:23:08Z", "content": "The warnings are coming from all angles: artificial intelligence poses an existential risk to humanity and must be shackled before it is too late.\r\nBut what are these disaster scenarios and how are m… [+4272 chars]"}, {"source": {"id": null, "name": "Argusenglish.in"}, "author": null, "title": "Sound of space: Milky Way's central black hole sonification audio will amaze you - Argus English", "description": "Recently, NASA took to its official Instagram handle and shared data sonification of the supermassive black hole at the center of the Milky Way galaxy, Sagittarius A*. Listen to the sound of space.", "url": "https://argusenglish.in/article/international/sound-of-space-milky-ways-central-black-hole-sonification-audio-will-amaze-you", "urlToImage": "https://d1ttqxosekmk9r.cloudfront.net/posts/argusnews-collage-maker-27-jun-2023-10-39-am-2260-daecbadd-1d07-4ed6-8a63-8c2e1f80e3b8.jpg", "publishedAt": "2023-06-27T05:12:00Z", "content": "New Delhi, June 27: India’s current account deficit (CAD) witnessed a narrow fall to $1.3 billion in the fourth quarter (January-March) of 2022-23According to RBI data released on Tuesday, the modera… [+2826 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Space miracle or dud? Comet Tsuchinshan-ATLAS to fly by Earth; know when to watch - HT Tech", "description": "Comet C/2023 A3 is set to pass Earth in 2024 and it will outshine the night sky, as per astronomers", "url": "https://tech.hindustantimes.com/tech/news/space-miracle-or-dud-comet-tsuchinshan-atlas-to-fly-by-earth-know-when-to-watch-71687842295935.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/27/1600x900/comet_1_1677992934323_1687842371518.jpg", "publishedAt": "2023-06-27T05:09:11Z", "content": "While asteroids pass by Earth virtually every day and some small ones crash into it, Comets are a rarity and when they come calling, it is exciting time not just for the astronomers, but also for the… [+2108 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar system sends another asteroid shooting towards Earth; this aircraft-sized rock expected today - HT Tech", "description": "Yet another asteroid is expected to make its closest approach to Earth, and NASA has revealed details of this shocking close encounter.", "url": "https://tech.hindustantimes.com/tech/news/solar-system-sends-another-asteroid-shooting-towards-earth-this-aircraft-sized-rock-expected-today-71687840689211.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/27/1600x900/orbit-viewer-snapshot_1687840794176_1687840798949.jpg", "publishedAt": "2023-06-27T04:45:34Z", "content": "Even though there are millions of asteroids in our solar system, only a handful of them have been observed. As per NASA, the current known asteroid count is roughly 1,298,148. But why is studying the… [+2101 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Mind blowing ultraviolet images of Mars captured by NASA’s MAVEN spacecraft - Indiatimes.com", "description": "Trending News: Stunning ultraviolet images of Mars are released by NASA’s MAVEN acquired from different angles.", "url": "https://timesofindia.indiatimes.com/etimes/trending/mind-blowing-ultraviolet-images-of-mars-captured-by-nasas-maven-spacecraft/articleshow/101285668.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101285681,width-1070,height-580,imgsize-212713,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-27T03:30:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Obesity Breakthrough: Protein Molecular Structure Discovery Could Unlock Fat Burning - SciTechDaily", "description": "Researchers have uncovered the molecular structure of the protein UCP1, which allows brown fat tissue to burn calories as heat. This breakthrough could pave the way for treatments that artificially activate UCP1, thereby combating obesity and diabetes by burn…", "url": "https://scitechdaily.com/new-obesity-breakthrough-protein-molecular-structure-discovery-could-unlock-fat-burning/", "urlToImage": "https://scitechdaily.com/images/Fitness-Measurement-Weight-Loss-Success.jpg", "publishedAt": "2023-06-26T23:39:41Z", "content": "BySt Catharines College, CambridgeJune 26, 2023\r\nScientists have made a significant discovery in the understanding of obesity and related diseases like diabetes. The researchers unveiled the molecula… [+5855 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Zaria Gorvett", "title": "The underwater search for an alien meteor - BBC", "description": "The relics of the first interstellar meteor are thought to lie at the bottom of the Pacific Ocean. Last week one controversial scientist and his team claimed to have found them.", "url": "https://www.bbc.com/future/article/20230626-the-underwater-search-for-an-alien-object", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p0fxd5wp.jpg", "publishedAt": "2023-06-26T23:11:02Z", "content": "Everything we know about the space beyond our own patch comes from observing the light that has made it at least 40 trillion km (25 trillion miles) the distance from the next nearest Solar System, Al… [+3211 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How coral reefs can survive climate change - Science Daily", "description": "Similar to the expeditions of a hundred or two hundred years ago, the Tara Pacific expedition lasted over two years. The goal: to research the conditions for life and survival of corals. The ship crossed the entire Pacific Ocean, assembling the largest geneti…", "url": "https://www.sciencedaily.com/releases/2023/06/230626163854.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-06-26T21:12:10Z", "content": "Similar to the expeditions of a hundred or two hundred years ago, the Tara Pacific expedition lasted over two years. The goal: to research the conditions for life and survival of corals. The ship cro… [+4580 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Solving the strength-toughness dilemma in superhard ceramics with a chemically tuned solid solution approach - Phys.org", "description": "Materials with superior mechanical strengths are crucial to many areas of modern industries and the scientific enterprise by providing cutting and drilling tools, structural components, protective coatings, and abrasives that find wide applications. Solid sol…", "url": "https://phys.org/news/2023-06-strength-toughness-dilemma-superhard-ceramics-chemically.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/solving-the-strength-t.jpg", "publishedAt": "2023-06-26T21:00:02Z", "content": "Materials with superior mechanical strengths are crucial to many areas of modern industries and the scientific enterprise by providing cutting and drilling tools, structural components, protective co… [+2842 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "120-year-old Cassius is pushing limit of crocodile longevity — and he's got 'years to come,' expert says - Yahoo Life", "description": "The ancient, 18-foot-long crocodile — the world's largest living in captivity — is healthy but occasionally displays signs of trauma from his troubled youth ...", "url": "https://www.livescience.com/animals/alligators-crocodiles/120-year-old-cassius-is-pushing-limit-of-crocodile-longevity-and-hes-got-years-to-come-expert-say", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/tRKnuWE0RnWFOuGaXHDfkQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/ce5ca544000ccf99f3224f10392d452f", "publishedAt": "2023-06-26T20:40:36Z", "content": "Cassius the 120-year-old crocodile swims with his head above water.\r\nCassius the 120-year-old crocodile swims with his head above water.\r\nCassius, a 120-year-old crocodile living in captivity in Aust… [+3779 chars]"}, {"source": {"id": null, "name": "Jara.news"}, "author": "JARA News Media", "title": "What the 3 Body Problem Means for Nuclear War - JARA News", "description": "Share If you like it Isaac Newton was baffled. He was already famous for discovering how gravity holds the universe together and for using that knowledge to predict the movements of celestial bodies, such as the moon’s path around the Earth. Now, by taking th…", "url": "https://jara.news/what-the-3-body-problem-means-for-nuclear-war/", "urlToImage": "https://i0.wp.com/jara.news/wp-content/uploads/2023/06/27SCI-problemofthrees-facebookJumbo.jpg?resize=1000%2C550&ssl=1", "publishedAt": "2023-06-26T18:40:40Z", "content": "The main worry of military planners is that Beijing will not only achieve weapons parity with Washington but also form a military pact with Moscow.\r\nWere not seeing yet a full-fledged, really cemente… [+1247 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Hotter than sun, one year lasts just 2.3 hours: The weirdest object in space spotted - WION", "description": "Hotter than sun, one year lasts just 2.3 hours: The weirdest object in space spotted", "url": "https://www.wionews.com/science/hotter-than-sun-one-year-lasts-just-23-hours-the-weirdest-object-in-space-spotted-608994", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/26/362449-capture.JPG", "publishedAt": "2023-06-26T18:01:18Z", "content": "A fascinating celestial body known as WD0032-317B is pushing the boundaries of astronomers' knowledge regarding the differentiation between stars and planets. This enigmatic object, categorised as a … [+2796 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA identifies potential major cost growth in Mars Sample Return - SpaceNews", "description": "NASA has confirmed that one scenario for the cost of its Mars Sample Return (MSR) program is far higher than previous estimates.", "url": "https://spacenews.com/nasa-identifies-potential-major-cost-growth-in-mars-sample-return/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/06/msr-illustration.jpg", "publishedAt": "2023-06-26T16:48:31Z", "content": "WASHINGTON NASA has confirmed that one scenario for the cost of its Mars Sample Return (MSR) program is far higher than previous estimates, heightening concerns among scientists about its impacts on … [+4688 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Georgia Institute of Technology Leads NASA Center on Lunar Research and Exploration - India Education Diary", "description": "Georgia Tech researchers have been selected by NASA to lead a $7.5 million center that will study the lunar environment and the generation and properties of volatiles and dust. The Center for Lunar Environment and Volatile Exploration Research (CLEVE", "url": "https://indiaeducationdiary.in/georgia-institute-of-technology-leads-nasa-center-on-lunar-research-and-exploration/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/22CLEVER_GRAPHIC_1300dpi-1024x606.png", "publishedAt": "2023-06-26T16:47:17Z", "content": "Georgia Tech researchers have been selected by NASA to lead a $7.5 million center that will study the lunar environment and the generation and properties of volatiles and dust. The Center for Lunar E… [+2515 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China conducts parachute tests for asteroid sample return mission - SpaceNews", "description": "China conducts parachute tests for asteroid sample return mission China’s main space contractor has conducted several successful high-altitude parachute deployment tests as part of plans to collect asteroid samples and deliver them safely to Earth.", "url": "https://spacenews.com/china-conducts-parachute-tests-for-asteroid-sample-return-mission/", "urlToImage": "https://spacenews.com/wp-content/uploads/2020/08/ZhengHe-probe-2019-CNSA.jpg", "publishedAt": "2023-06-26T16:16:28Z", "content": "HELSINKI Chinas main space contractor has conducted several successful high-altitude parachute deployment tests as part of plans to collect asteroid samples and deliver them safely to Earth.\r\nThe Aca… [+3006 chars]"}, {"source": {"id": null, "name": "Cam.ac.uk"}, "author": null, "title": "Act now to prevent uncontrolled rise in carbon footprint of computational science - University of Cambridge news", "description": "Cambridge scientists have set out principles for how computational science – which powers discoveries from unveiling the mysteries of the universe to", "url": "https://www.cam.ac.uk/research/news/act-now-to-prevent-uncontrolled-rise-in-carbon-footprint-of-computational-science", "urlToImage": "https://www.cam.ac.uk/sites/www.cam.ac.uk/files/news/research/news/software-557604-1280.jpg", "publishedAt": "2023-06-26T15:15:08Z", "content": "Writing in Nature Computational Science, researchers from the Department of Public Health and Primary Care at the University of Cambridge argue that the scientific community needs to act now if it is… [+7592 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Asgard Archaea and All Eukaryotes Share Common Ancestor, Study Says - Sci.News", "description": "Understanding how complex eukaryotic cells emerged from prokaryotic ancestors represents a major challenge in biology.", "url": "https://www.sci.news/genetics/asgard-eukaryotes-12035.html", "urlToImage": "https://cdn.sci.news/images/2022/04/image_10751-Asgard-Archaeon.jpg", "publishedAt": "2023-06-26T14:55:08Z", "content": "Understanding how complex eukaryotic cells emerged from prokaryotic ancestors represents a major challenge in biology. A main point of contention in refining eukaryogenesis scenarios revolves around … [+4940 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Astronomers directly capture world described as 'Jupiter's younger sibling' - Interesting Engineering", "description": "It is the first time astrometry has been used to find 'a giant planet orbiting a young analog of the Sun,' one of the researchers said.", "url": "https://interestingengineering.com/science/astronomers-directly-capture-world-jupiters-sibling", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/26/image/jpeg/E7urgm3xvMLGFsVCeJokogXhlyBBrGHLIcgbK2Xy.jpg", "publishedAt": "2023-06-26T13:45:00Z", "content": "Another successful exoplanet photo shoot @keckobservatory using direct imaging + astrometry, this time of AF Lep b, a Jupiter-like planet orbiting a Sun-like star https://t.co/c3Lceu5bZt Congrats to … [+1372 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Jyoti", "title": "Reasons Why You Should Ditch Your Bra In Bed - HerZindagi", "description": "While there are numerous theories and beliefs about bras, one of the most common is that you shouldn’t wear one while sleeping. So, here’s a breakdown of reasons why it is suggested that you ditch your bra before going to bed.", "url": "https://www.herzindagi.com/web-stories/health/why-you-should-not-wear-a-bra-at-night-in-bed-ws-13371", "urlToImage": "https://images.herzindagi.info/webstories/13371/social--11--1687721117.jpeg", "publishedAt": "2023-06-26T13:30:59Z", "content": "<ul>While there are numerous theories and beliefs about bras, one of the most common is that you shouldnt wear one while sleeping. So, heres a breakdown of reasons why it is suggested that you ditch … [+866 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kiley Price", "title": "New state of matter discovered using ultradense crystals - Space.com", "description": "By shining a strong beam of light through two chemical compounds, scientists discovered a unique new state of matter made of particles called excitons.", "url": "https://www.livescience.com/physics-mathematics/exotic-new-state-of-matter-discovered-by-squishing-subatomic-particles-into-an-ultradense-crystal", "urlToImage": "https://cdn.mos.cms.futurecdn.net/a5Z3NsHGjXcbPbW3SjgJAo-1200-80.gif", "publishedAt": "2023-06-26T12:00:53Z", "content": "Physicists have discovered an exotic new state of matter that takes the form of a highly ordered crystal of subatomic particles. The new state of matter, called a \"bosonic correlated insulator,\" coul… [+2822 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Protein is essential for neuronal axon structure and circuit connections in flies and humans - Tech Explorist", "description": "Perlecan is key for sustaining the structural integrity of neuronal axons.", "url": "https://www.techexplorist.com/protein-essential-neuronal-axon-structure-circuit-connections-flies-humans/62999/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/retractiopn-ball.jpg", "publishedAt": "2023-06-26T11:54:20Z", "content": "Neurons require controlled polarisation and synaptic material travel to preserve their individual structure and electrical characteristics. Indeed, axonal transport disruption has been linked to vari… [+3839 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "James Webb Space Telescope makes sensational discovery on coolest exoplanet TRAPPIST-1 c - HT Tech", "description": "NASA’s James Webb Space Telescope discovers that TRAPPIST-1 c is likely to have no atmosphere at all or a thin atmosphere.", "url": "https://tech.hindustantimes.com/tech/news/james-webb-space-telescope-makes-sensational-discovery-on-coolest-exoplanet-trappist-1-c-71687780137717.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/26/1600x900/NASA_1687780203579_1687780221600.jpg", "publishedAt": "2023-06-26T11:53:55Z", "content": "Back in February 2017, researchers with the help of the Spitzer Space Telescope discovered a large batch of Earth-sized rocky exoplanets. Ever since then, researchers have been trying to study the at… [+1966 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "CityU Physicist Develops a Novel Quantum Theory of Light-Induced Matter, Opening the Door to Cutting-Edge Optical Technologies - AZoOptics", "description": "A team led by a physicist from City University of Hong Kong (CityU) recently developed a new quantum theory that explains the “light-induced phase” of matter and predicts its novel functionalities.", "url": "https://www.azooptics.com/News.aspx?newsID=28344", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_28344_16877748830891109.png", "publishedAt": "2023-06-26T10:13:00Z", "content": "A team led by a physicist from City University of Hong Kong (CityU) recently developed a new quantum theory that explains the “light-induced phase” of matter and predicts its novel functionalities. T… [+4971 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "20 Million Years of ‘Hot Spot’ Unearthed - India Education Diary", "description": "Ten years ago, Samer Naif made an unexpected discovery in Earth’s mantle: a narrow pocket, proposed to be filled with magma, hidden some 60 kilometers beneath the seafloor of the Cocos Plate.Mantle melts are buoyant and typically float toward the sur", "url": "https://indiaeducationdiary.in/20-million-years-of-hot-spot-unearthed/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/Global-hotspots-1024x791.jpg", "publishedAt": "2023-06-26T09:44:46Z", "content": "Ten years ago, Samer Naif made an unexpected discovery in Earths mantle: a narrow pocket, proposed to be filled with magma, hidden some 60 kilometers beneath the seafloor of the Cocos Plate.\r\nMantle … [+6231 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Using electric fields to control the movement of defects in crystals - Nanowerk", "description": "This work has important implications for improving the properties and manufacturing processes of typically brittle ionic and covalent crystals, including semiconductors.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=63229.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id63229.jpg", "publishedAt": "2023-06-26T09:20:42Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "Do dead stars crash with the light of 500 million suns? - INSIGHTSIAS - Insights IAS", "description": "Source: TH  Context: Astrophysicists are studying the origins and nature of fast radio bursts (FRBs), powerful radio frequency emissions from distant galaxies, which last only milliseconds. Recent findings suggest that FRBs may be triggered by the collision o…", "url": "https://www.insightsonindia.com/2023/06/26/do-dead-stars-crash-with-the-light-of-500-million-suns/", "urlToImage": null, "publishedAt": "2023-06-26T09:20:09Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Donavyn Coffey", "title": "How does water put out fire? - Livescience.com", "description": "Water extinguishes fire, but it doesn't act on the flames themselves.", "url": "https://www.livescience.com/chemistry/how-does-water-put-out-fire", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9rN9i3Zaq2FiTT3dQZzhb-1200-80.jpg", "publishedAt": "2023-06-26T09:00:00Z", "content": "At a very young age, we're taught that water puts out fire. As children, we're told why this aspect of fire safety is so important, but we don't usually learn the science of how water subdues flames.… [+2860 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "Youth on Tech Latest Episode: Revealing Moon Mysteries, Exploring the Universe - PR Newswire", "description": "/PRNewswire/ -- This is a report from Science and Technology Daily: China has revealed its plan to send astronauts to the moon by 2030. Themed by the...", "url": "https://www.prnewswire.com/news-releases/youth-on-tech-latest-episode-revealing-moon-mysteries-exploring-the-universe-301862909.html", "urlToImage": "https://mma.prnewswire.com/media/2103035/Youth_on_Tech_EP3.mp4?p=medium", "publishedAt": "2023-06-26T08:25:00Z", "content": "BEIJING, June 26, 2023 /PRNewswire/ -- This is a report from Science and Technology Daily:  China has revealed its plan to send astronauts to the moon by 2030. Themed by the \"Revealing Moon Mysteries… [+4764 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Aggregate Formation by Ocean-Nourishing Bacteria Demystified - Technology Networks", "description": "Researchers have shown how an ocean-fertilizing bacterium, <i>Trichodesmium</i>, forms aggregates.", "url": "https://www.technologynetworks.com/immunology/news/aggregate-formation-by-ocean-nourishing-bacteria-demystified-375245", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/375245/aggregate-formation-by-ocean-nourishing-bacteria-demystified-375245-640x360.jpg?cb=20230626", "publishedAt": "2023-06-26T08:15:54Z", "content": "The marine microorganism Trichodesmium has long attracted human attention. British Captain James Cook was one of the first to document his observations in the Red Sea in 1770. He did not need a micro… [+7270 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Tool Developed To Study Viral Infections - Technology Networks", "description": "Researchers have developed a new tool that can identify cells that are actively responding to a SARS-CoV-2 infection and can be used to screen for effective COVID-19 therapies.", "url": "https://www.technologynetworks.com/immunology/news/new-tool-developed-to-study-viral-infections-375253", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/375253/new-tool-developed-to-study-viral-infections-375253-640x360.jpg?cb=20230626", "publishedAt": "2023-06-26T08:10:45Z", "content": "When we breathe, the SARS-CoV-2 virus enters the body through the cells of the upper respiratory tract. Sensing an invader, the epithelial cells, which are the first line of defence, mount an immedia… [+4875 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Earth was formed faster than we thought - Tech Explorist", "description": "This makes the chance of other habitable planets in the Universe more likely.", "url": "https://www.techexplorist.com/earth-formed-faster-thought/62980/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/planet-forming-disk.jpg", "publishedAt": "2023-06-26T07:44:39Z", "content": "The classical theory for terrestrial planet formation involves a phase of giant impacts between embryos over timescales of 50100Myr. The Earth’s formation was thought to have taken more than 100 mill… [+3052 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "How NASA's OSIRIS-REx will return 4.5 billion-year-old asteroid sample - NewsBytes", "description": "NASA's OSIRIS-REx probe will bring back sample from an early solar system asteroid, called Bennu, this September", "url": "https://www.newsbytesapp.com/news/science/nasa-osiris-rex-mission-will-bring-back-asteroid-sample-in-september/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l62520230626120907.png", "publishedAt": "2023-06-26T07:14:56Z", "content": "TechnologyHow NASA's OSIRIS-REx will return 4.5 billion-year-old asteroid sample\r\nArtistic representation of the OSIRIS-REx spacecraft collecting a sample from asteroid Bennu (Photo credit: NASA/Godd… [+2806 chars]"}, {"source": {"id": null, "name": "Intelligentliving.co"}, "author": "Luana Steffen", "title": "7 Clues Your Hair Reveals About Your Health - Intelligent Living", "description": "Your hair can give away information about your health. According to research, changes in your hair’s appearance, texture, or thickness may indicate underlying medical concerns. Here’s how to determine whether your hair changes are brought on by a medical cond…", "url": "https://www.intelligentliving.co/7-clues-your-hair-reveals-about-your-health/", "urlToImage": "https://www.intelligentliving.co/wp-content/uploads/2022/06/7-Things-Your-Hair-Says-About-Your-Health0.jpg", "publishedAt": "2023-06-26T04:09:26Z", "content": "Your hair can give away information about your health. According to research, changes in your hair’s appearance, texture, or thickness may indicate underlying medical concerns. Here’s how to determin… [+6356 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Inno Flores", "title": "NASA Achieves 98% Water Recovery Rate on the ISS by Recycling All Astronaut Pee, Sweat - Tech Times", "description": "NASA said the International Space Station (ISS) had achieved a 98% water recovery rate using a system that includes astronauts' pee and sweat recycling.", "url": "https://www.techtimes.com/articles/293023/20230625/nasa-achieves-98-water-recovery-rate-iss-recycling-astronaut-pee.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/430317/nasa-achieves-98-water-recovery-rate-on-the-iss-by-recycling-all-astronaut-pee-sweat.jpg", "publishedAt": "2023-06-26T01:59:58Z", "content": "NASA has revealed that the International Space Station (ISS) is recycling 98% of all water astronauts bring onboard the station.\r\nAccording to Space.com, the space agency said they had achieved this … [+3357 chars]"}]}