{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Thamarasee Jeewandara", "title": "Single-pulse real-time billion-frames-per-second planar imaging of ultrafast nanoparticle-laser dynamics - Phys.org", "description": "The soot produced by unburnt hydrocarbon flames is the second largest contributor to global warming, while also harming human health. Researchers have developed state-of-the-art, high-speed imaging techniques to study turbulent flames, yet they are limited to…", "url": "https://phys.org/news/2023-03-single-pulse-real-time-billion-frames-per-second-planar-imaging.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/single-pulse-real-time.jpg", "publishedAt": "2023-03-06T14:45:03Z", "content": "LS-CUP for time-resolved 2D imaging of laser-induced flame signals. (a) Photograph of the studied flame. The regions of investigation at heights h1 and h2 are labeled. (b) Illustrations of four optic… [+9643 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA can now predict solar flares! - HT Tech", "description": "Amazingly, solar flares can now be predicted. NASA explains how.", "url": "https://tech.hindustantimes.com/tech/news/nasa-can-now-predict-solar-flares-71678027789108.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/05/1600x900/m73-flare-zoom_0_1678027869904_1678027870145_1678027870145.jpg", "publishedAt": "2023-03-05T14:52:56Z", "content": "Solar flares can be very dangerous for the power grid, satellites, even mobile phones. How dangerous a flare can be depends on how powerful it is. If a warning is received by NASA and other space age… [+2611 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Cosmic Model To Reveal What's Inside Colliding Black Holes - SciTechDaily", "description": "A research paper uses new methods to analyze the waves that black holes emit when they collide. In 2015, scientists for the first time detected gravitational waves, ripples in space-time that occur when major cosmic events—like the collision and merging of tw…", "url": "https://scitechdaily.com/a-new-cosmic-model-to-reveal-whats-inside-colliding-black-holes/", "urlToImage": "https://scitechdaily.com/images/Two-Black-Holes-Collide-Merge.jpg", "publishedAt": "2023-03-05T03:17:00Z", "content": "ByColumbia UniversityMarch 4, 2023\r\nAn artists impression of two black holes about to collide and merge. New research has led to the development of a more sophisticated model for modeling cosmic even… [+2466 chars]"}]}