{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Webb stuns scientists with new view of Saturn's moon Titan - The Indian Express", "description": "After a long wait, scientists have been treated to the James Webb Space Telescope's infrared views of Saturn's moon Titan.", "url": "https://indianexpress.com/article/technology/science/james-webb-space-telescope-saturn-moon-titan-8302378/", "urlToImage": "https://images.indianexpress.com/2022/12/James-Webb-Space-Telescope-Saturn-Moon-Titan-20221202.jpg", "publishedAt": "2022-12-02T09:45:36Z", "content": "Saturns Moon Titan is very similar to Earth in many ways while also being very different. It has rivers, lakes and seas just like the Earth but the liquid filling these bodies is composed of hydrocar… [+2062 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Artemis 1: Orion leaves Moon's orbit; heads back home for splashdown on December 11 - Republic World", "description": "Orion has left Moon's orbit and begun its journey back to Earth, NASA said. The Artemis 1 mission will end with Orion's splashdown in Pacific Ocean on Dec 11.", "url": "https://www.republicworld.com/science/space/artemis-1-orion-leaves-moons-orbit-heads-back-home-for-splashdown-on-december-11-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ba9nxb7nb7tbskdh_1669972245.jpeg", "publishedAt": "2022-12-02T09:15:00Z", "content": "The Orion spacecraft has left the Moons orbit beginning its journey back to Earth, NASA revealed. On December 2, the 16th day into the Artemis 1 mission, engineers fired Orion's main engine for a dep… [+1966 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New analysis approach could help boost sensitivity of large telescopes - Phys.org", "description": "Some of the largest and most sophisticated telescopes ever made are under construction at the Simons Observatory in Northern Chile. They are designed to measure cosmic microwave background—electromagnetic radiation left over from the formation of the universe…", "url": "https://phys.org/news/2022-12-analysis-approach-boost-sensitivity-large.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-analysis-approach-1.jpg", "publishedAt": "2022-12-02T08:47:43Z", "content": "Some of the largest and most sophisticated telescopes ever made are under construction at the Simons Observatory in Northern Chile. They are designed to measure cosmic microwave backgroundelectromagn… [+5103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Newly-discovered dinosaur species gives clues about T.rex evolution - The Indian Express", "description": "A newly-discovered species suggests that tyrannosaurs should be added to a growing list of dinosaurs for which anagenesis, or linear evolution, has been proposed", "url": "https://indianexpress.com/article/technology/science/daspletosaurus-wilsoni-dinosaur-t-rex-evolution-8302156/", "urlToImage": "https://images.indianexpress.com/2022/12/D-wilsoni-tyrannosaurus-rex-dinosaur-20221202.jpg", "publishedAt": "2022-12-02T08:05:36Z", "content": "Say the word dinosaur to someone and chances are, the first image that pops up in their head will be that of the Tyrannosaurus Rex. But despite our long-standing fascination with the dinosaur species… [+2452 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Felicity Nelson", "title": "Millions of 'Silent Synapses' Could Be The Key to Lifelong Learning - ScienceAlert", "description": "Newborns need to store vast amounts of new information quickly as they learn to navigate the world.", "url": "https://www.sciencealert.com/millions-of-silent-synapses-could-be-the-key-to-lifelong-learning", "urlToImage": "https://www.sciencealert.com/images/2022/12/neuron-synapse-firing.jpg", "publishedAt": "2022-12-02T06:16:00Z", "content": "Newborns need to store vast amounts of new information quickly as they learn to navigate the world. Silent synapses the immature connections between neurons that have no neurotransmitter activity yet… [+3412 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Positively charged nanomaterials reduce fat at targeted locations - Tech Explorist", "description": "Inhibiting the unhealthy lipid storage of enlarged fat cells.", "url": "https://www.techexplorist.com/positively-charged-nanomaterials-reduce-fat-targeted-locations/55166/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/12/depot-specific-targeting-of-fat.jpg", "publishedAt": "2022-12-02T05:52:55Z", "content": "Several studies suggest that obesity is a serious condition that can lead to hypertension, diabetes, chronic inflammation, and cardiovascular diseases. What’s more, there is a strong correlation betw… [+3426 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Western Ontario: Bright fireball may have dropped meteorites in Niagara region - India Education Diary", "description": "A cosmic drama unfolded over southern Ontario on the night of Friday, Nov. 18, triggering an international collaboration and a meteorite hunt. Just before midnight Eastern time, the Catalina Sky Survey in Arizona detected a small object heading towar", "url": "https://indiaeducationdiary.in/university-of-western-ontario-bright-fireball-may-have-dropped-meteorites-in-niagara-region/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/05/University-of-Western-Ontario.jpg?fit=1024%2C640&ssl=1", "publishedAt": "2022-12-02T05:12:21Z", "content": "A cosmic drama unfolded over southern Ontario on the night of Friday, Nov. 18, triggering an international collaboration and a meteorite hunt. Just before midnight Eastern time, the Catalina Sky Surv… [+4768 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mysterious Bright Sky Flash Was A Black Hole Pointing Straight At Earth, Scientists Say - NDTV", "description": "An incredibly bright flash that appeared in the night sky in February came from a black hole pointing straight at Earth, astronomers have said.", "url": "https://www.ndtv.com/science/mysterious-bright-sky-flash-was-a-black-hole-pointing-straight-at-earth-scientists-say-3571209", "urlToImage": "https://c.ndtvimg.com/2022-12/7l23cuc_black-hole_625x300_02_December_22.jpg", "publishedAt": "2022-12-02T04:31:40Z", "content": "This rare event occurred 8.5 billion light years away from Earth. (Pixabay/Representative Pic)\r\nAn incredibly bright flash that appeared in the night sky in February came from a black hole pointing s… [+2893 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Natovenator polydontus: A goose-necked dinosaur from Mongolia, built like a diving bird - The Indian Express", "description": "The dinosaur, called Natovenator polydontus, lived about 72 million years ago during the Cretaceous Period and was built like a diving bird with a streamlined body while possessing a goose-like elongated neck and a long flattened snout with a mouth bearing mo…", "url": "https://indianexpress.com/article/explained/explained-sci-tech/new-dinosaur-natovenator-polydontus-cretaceous-period-8301740/", "urlToImage": "https://images.indianexpress.com/2022/12/goose-1.jpg", "publishedAt": "2022-12-02T04:20:57Z", "content": "The expansive dinosaur group that included big predators such as T. rex also was populated by a number of oddballs, weirdos and outcasts. A newly described dinosaur from Mongolia – the size of a goos… [+3634 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Study of toothed bird fossil reveals insight about the structure of birds' beaks | DH NEWS, DH Latest News, Latest News, NEWS, Science , Study of toothed bird fossil reveals insight about the structure of birds' beaks, Study of toothed bird fossil, struct - East Coast Daily (English)", "description": "Our lower jaw moves as we chew food. The upper jaw is completely immobile and fully fused with our skull. However, some contemporary birds, such as chickens and ducks, can also move their upper jaw. S", "url": "https://www.eastcoastdaily.in/2022/12/02/study-of-toothed-bird-fossil-reveals-insight-about-the-structure-of-birds-beaks.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/12/01-1.jpg", "publishedAt": "2022-12-02T01:12:00Z", "content": "Our lower jaw moves as we chew food. The upper jaw is completely immobile and fully fused with our skull. However, some contemporary birds, such as chickens and ducks, can also move their upper jaw. … [+1011 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Powerful linear accelerator begins smashing atoms. It could reveal rare forms of matter - EastMojo", "description": "Just a few hundred feet from where we are sitting is a large metal chamber devoid of air and draped with the wires needed to control the instruments", "url": "http://www.eastmojo.com/science-tech/2022/12/02/powerful-linear-accelerator-begins-smashing-atoms-it-could-reveal-rare-forms-of-matter/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/11/Untitled-design-34-2.png?fit=1200%2C675&ssl=1", "publishedAt": "2022-12-02T01:00:42Z", "content": "Just a few hundred feet from where we are sitting is a large metal chamber devoid of air and draped with the wires needed to control the instruments inside. A beam of particles passes through the int… [+8681 chars]"}, {"source": {"id": null, "name": "Hackster.io"}, "author": "Gareth Halfacree", "title": "The Laser-Packing TBIRD Flies High to Deliver 100 Gigabit Per Second Data From Space - Hackster.io", "description": "Launched in May on board a CubeSat mission, the TeraByte InfraRed Delivery System is 1,000 times faster than its predecessors.", "url": "https://www.hackster.io/news/the-laser-packing-tbird-flies-high-to-deliver-100-gigabit-per-second-data-from-space-4a75778f0c51", "urlToImage": "https://hackster.imgix.net/uploads/attachments/1529188/_vXZnkDMOWK.blob?auto=compress%2Cformat&w=600&h=450&fit=min", "publishedAt": "2022-12-01T22:37:59Z", "content": "TBIRD, the TeraByte InfraRed Delivery developed at the Massachusetts Institute of Technology's Lincoln Laboratory, has hit a record data transmission rate of 100 gigabits per second via laser meaning… [+2928 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Distant black hole is caught in the act of annihilating a star; Chinese astronauts board space station in historic mission and more - Devdiscourse", "description": "Researchers announced on Wednesday that they forged two miniscule simulated black holes - those extraordinarily dense celestial objects with gravity so powerful that not even light can escape - in a quantum computer and transmitted a message between them thro…", "url": "https://www.devdiscourse.com/article/technology/2272270-science-news-roundup-distant-black-hole-is-caught-in-the-act-of-annihilating-a-star-chinese-astronauts-board-space-station", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/15_10_2022_00_32_53_6983091.jpg?width=920&format=jpeg", "publishedAt": "2022-12-01T21:02:02Z", "content": "Following is a summary of current science news briefs.\r\nElon Musk expects Neuralink's brain chip to begin human trials in 6 months\r\nElon Musk said on Wednesday he expects a wireless brain chip develo… [+2717 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Rayne", "title": "Meteorites reveal how they brought space water to Earth - Space.com", "description": "Meteorites that fall to Earth are ancient time capsules, and scientists merging two imaging techniques could tell us if and how they brought water to Earth.", "url": "https://www.space.com/meteorite-water-found-with-new-method", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zxDdaLfwrNBs2uT7wC5rT4-1200-80.jpg", "publishedAt": "2022-12-01T21:00:00Z", "content": "Space rocks that fall to Earth are ancient time capsules, and scientists who merged two imaging techniques may be able to tell us if and how they brought water to Earth. \r\nMeteorites are shards that … [+3409 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "Sometimes Astronomy isn't About What you see, but What you don't see - Universe Today", "description": "Constraints are critical in any scientific enterprise. If a hypothesis predicts that there should be an observable phenomenon, and there isn’t any trace of it, that’s a pretty clear indication that the hypothesis is wrong. And even false hypotheses still move…", "url": "https://www.universetoday.com/158933/sometimes-astronomy-isnt-about-what-you-see-but-what-you-dont-see/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/12/8191.jpg", "publishedAt": "2022-12-01T19:49:59Z", "content": "Constraints are critical in any scientific enterprise. If a hypothesis predicts that there should be an observable phenomenon, and there isn’t any trace of it, that’s a pretty clear indication that t… [+4090 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Chris Gebhardt", "title": "Solid Rocket Boosters meet performance targets in first-look data review for Artemis I - NASASpaceFlight.com - NASASpaceflight.com", "description": "The Artemis I launch of the Space Launch System (SLS) rocket from LC-39B at the…", "url": "https://www.nasaspaceflight.com/2022/12/artemis-i-srb-review/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/11/ENGN7551-min-467x350.jpg", "publishedAt": "2022-12-01T19:17:08Z", "content": "The Artemis I launch of the Space Launch System (SLS) rocket from LC-39B at the Kennedy Space Center on Nov. 16, 2022, marked the first time in 11 years that the Solid Rocket Boosters (SRBs) formerly… [+5569 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X staff", "title": "Using nanodiamonds to convert a greenhouse gas to an industrial raw material - Tech Xplore", "description": "Rather than being released into the atmosphere and exacerbating the problem of climate change, CO2 can also be used as a raw material for substances required in industrial processes, such as formic acid or methanol. The conversion of CO2 has already been inve…", "url": "https://techxplore.com/news/2022-12-nanodiamonds-greenhouse-gas-industrial-raw.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/from-a-greenhouse-gas.jpg", "publishedAt": "2022-12-01T19:00:04Z", "content": "Rather than being released into the atmosphere and exacerbating the problem of climate change, CO2 can also be used as a raw material for substances required in industrial processes, such as formic a… [+6194 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Image: Pillars of Creation (NIRCam and MIRI composite image) - Phys.org", "description": "By combining images of the iconic Pillars of Creation from two cameras aboard the NASA/ESA/CSA James Webb Space Telescope, the Universe has been framed in its infrared glory. Webb's near-infrared image was fused with its mid-infrared image, setting this star-…", "url": "https://phys.org/news/2022-12-image-pillars-creation-nircam-miri.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/image-pillars-of-creat.jpg", "publishedAt": "2022-12-01T18:39:02Z", "content": "By combining images of the iconic Pillars of Creation from two cameras aboard the NASA/ESA/CSA James Webb Space Telescope, the Universe has been framed in its infrared glory. Webb's near-infrared ima… [+2641 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "James Webb Space Telescope Captures A Pair Of Merging Galaxies In A Chaotic Shape. All About It - ABP Live", "description": "James Webb Space Telescope image: The galactic pair is roughly 500 million light-years from Earth, and is located in the constellation Delphinus. In Webb's image, background galaxies can also be seen.", "url": "https://news.abplive.com/science/james-webb-space-telescope-captures-a-pair-of-merging-galaxies-in-a-chaotic-shape-all-about-it-1566935", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/01/6e9b1df64cc57d8ae8a0db7028e178781669916279866324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-12-01T18:09:02Z", "content": "NASA's James Webb Space Telescope (JWST) has once again left the world spellbound with an enthralling image of a cosmic object. JWST, also called Webb, has captured a pair of merging galaxies, called… [+1691 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meghan Bartels", "title": "Europa Clipper instrument delays worry scientists eyeing 2024 launch - Space.com", "description": "NASA's bold Europa Clipper mission to explore Jupiter's icy moon is facing tight schedules getting instruments installed and ready for the planned 2024 launch.", "url": "https://www.space.com/europa-clipper-instrument-schedule-concerns", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rYsumanAWD2ursdEZ6Nktj-1200-80.jpg", "publishedAt": "2022-12-01T18:00:58Z", "content": "NASA's bold mission to explore Jupiter's icy moon is facing tight schedules getting instruments installed and ready for the planned 2024 launch.\r\nEuropa is a particularly tantalizing destination beca… [+3411 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "What's Up - December 2022 - NASA Jet Propulsion Laboratory", "description": "", "url": "https://www.jpl.nasa.gov/videos/whats-up-december-2022", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/whats-up-dec-2022-16.jpg", "publishedAt": "2022-12-01T18:00:53Z", "content": "What's Up for December? Your evening planet highlights, including the disappearance of Mars, and the constellation Pegasus.\r\nThe month begins and ends with the Moon visiting the giant planets. On Dec… [+3234 chars]"}, {"source": {"id": null, "name": "Newsroomodisha.com"}, "author": "Newsroom Odisha Network", "title": "Researchers discover new minerals in massive meteorite in Somalia - Newsroom Odisha", "description": "San Francisco:  A team of researchers has discovered at least two new minerals in a 15-tonne meteorite in Somalia -- the ninth largest meteorite ever discovered.According to Forbes, the two newly-discovered minerals have been named 'Elaliite' and 'El", "url": "https://newsroomodisha.com/researchers-discover-new-minerals-in-massive-meteorite-in-somalia/", "urlToImage": "https://newsroomodisha.com/wp-content/uploads/2022/12/02433bd82fe72f5589cabde3db667e33-yLA0zx.jpeg", "publishedAt": "2022-12-01T16:20:36Z", "content": "San Francisco:  A team of researchers has discovered at least two new minerals in a 15-tonne meteorite in Somalia — the ninth largest meteorite ever discovered.\r\nAccording to Forbes, the two newly-di… [+1457 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Shivali Best", "title": "Scientists develop a smartwatch for COWS - msnNOW", "description": "Researchers from Southwest Jiaotong University in China have developed a smartwatch that can be used to monitor cows' health, reproductivity and location.", "url": "https://www.dailymail.co.uk/sciencetech/article-11490723/Scientists-develop-smartwatch-COWS-monitor-health-reproductivity-location.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/01/13/65132421-0-image-a-32_1669901053653.jpg", "publishedAt": "2022-12-01T16:00:50Z", "content": "From vibrating yoga leggings to temporary smart tattoos, a range of weird and wonderful wearable gadgets have hit the headlines in recent years.\r\nNow, a study claims that wearables could also be used… [+5316 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "Pic shows polar ice cap on Mars as the planet comes the closest to Earth - Inshorts", "description": "Astrophotographer Andrew McCarthy has captured a picture of Mars using a 14\" telescope that shows the northern polar ice cap on the red planet. He took the picture at a time when Mars made its closest approach to Earth. Several people reacted to his photo, wi…", "url": "https://inshorts.com/en/news/pic-shows-polar-ice-cap-on-mars-as-the-planet-comes-the-closest-to-earth-1669907520074", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2022/12_dec/1_thu/img_1669904679617_435.jpg?", "publishedAt": "2022-12-01T15:22:11Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Whispering gallery modes with fractional optical angular momentum in photonic crystal micro-rings - Phys.org", "description": "Whispering gallery modes, a type of wave that can travel around concave surfaces, have proved to be promising for the development of new technologies, particularly in photonics. Due to geometrical limitations, in circularly symmetric optical microresonators (…", "url": "https://phys.org/news/2022-12-gallery-modes-fractional-optical-angular.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/whispering-gallery-mod.jpg", "publishedAt": "2022-12-01T15:20:02Z", "content": "Whispering gallery modes, a type of wave that can travel around concave surfaces, have proved to be promising for the development of new technologies, particularly in photonics. Due to geometrical li… [+6462 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Mammoth DNA found in sediments likely came from long-dead animals: Research - ThePrint", "description": "Washington [US], December 1 (ANI): Precisely when mammoths went extinct has fascinated paleontologists for generations, perhaps because their decline coincided with the arrival of people to North and South America. So it’s only natural to wonder if humans con…", "url": "https://theprint.in/science/mammoth-dna-found-in-sediments-likely-came-from-long-dead-animals-research/1244672/", "urlToImage": null, "publishedAt": "2022-12-01T15:16:18Z", "content": "Washington [US], December 1 (ANI): Precisely when mammoths went extinct has fascinated paleontologists for generations, perhaps because their decline coincided with the arrival of people to North and… [+4145 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Aisling Ní Chúláin", "title": "NASA is sending this briefcase-sized spacecraft to orbit the Moon in search of water - Euronews", "description": "If the Lunar Flashflight detects the presence of water ice on the Moon, NASA says it could prove a valuable resource for future Artemis missions.", "url": "https://www.euronews.com/next/2022/12/01/nasa-is-sending-this-briefcase-sized-spacecraft-to-orbit-the-moon-in-search-of-water", "urlToImage": "https://static.euronews.com/articles/stories/07/22/29/62/1000x563_cmsv2_72073197-cca6-5772-8452-3a3abe89395c-7222962.jpg", "publishedAt": "2022-12-01T15:16:13Z", "content": "After years of preparation, a team of researchers is hoping their small satellite will soon leave Earth and begin its mission to probe for water ice on the Moon.\r\nThe Lunar Flashlight was developed b… [+2093 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Ocean Fertilization for Carbon Storage - AZoCleantech", "description": "As per an international research team headed by Michael Hochella of the Department of Energy’s Pacific Northwest National Laboratory, the immediate necessity to eliminate surplus carbon dioxide from the Earth’s environment could consist of enrolling a few of …", "url": "https://www.azocleantech.com/news.aspx?newsID=32669", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_32669_16698995150842352.jpg", "publishedAt": "2022-12-01T15:09:00Z", "content": "Dec 1 2022Reviewed by Alex Smith\r\nAs per an international research team headed by Michael Hochella of the Department of Energy’s Pacific Northwest National Laboratory, the immediate necessity to elim… [+3755 chars]"}, {"source": {"id": null, "name": "insideHPC"}, "author": "staff", "title": "Argonne Researchers Win Gordon Bell Special Prize for Using Language Models to Track Virus Variants - High-Performance Computing News Analysis | insideHPC - insideHPC", "description": "Nov. 29, 2022 — Scientists from the U.S. Department of Energy’s (DOE) Argonne National Laboratory and a team of collaborators have won the Association for Computing Machinery’s 2022 Gordon Bell Special Prize for High Performance Computing-Based COVID-19 Resea…", "url": "https://insidehpc.com/2022/12/argonne-researchers-win-gordon-bell-special-prize-for-using-language-models-to-track-virus-variants/", "urlToImage": "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Roadrunner_supercomputer_HiRes.jpg/2560px-Roadrunner_supercomputer_HiRes.jpg", "publishedAt": "2022-12-01T14:59:57Z", "content": "Their work resulted in the first genome-scale language model (GenSLM), which is a model that can analyze genes and rapidly identify VOCs. The model discussed in the paper was trained on data from the… [+5032 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Achieving 'More Signal, Less Background' in Photonics - AZoOptics", "description": "This article describes the applications of photonics technologies in selecting desired information by maximizing the transmission of light to the photodetector.", "url": "https://www.azooptics.com/Article.aspx?ArticleID=2359", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/Article_Images/ImageForArticle_2359_16698714287968369.jpg", "publishedAt": "2022-12-01T14:36:00Z", "content": "Remote sensing, optical communications, astronomy, and bio/chemical and molecular analysis employ photonics technologies to filter out the desired information (such as telecommunication signals or im… [+9635 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Morgan Rehnberg", "title": "If There Is Phosphine on Venus, There Isn't Much - Eos", "description": "New observations of the Venusian atmosphere collected from an airborne observatory showed no sign of the potential biosignature gas, casting additional doubt on a previous report of its detection.", "url": "http://eos.org/research-spotlights/if-there-is-phosphine-on-venus-there-isnt-much", "urlToImage": "https://eos.org/wp-content/uploads/2022/11/venus-atmosphere-false-color-mariner-10.jpg", "publishedAt": "2022-12-01T14:07:14Z", "content": "Source: Geophysical Research Letters\r\nIn the absence of direct observations of extraterrestrial life, scientists often focus on searching for biosignatures, chemical by-products of life, that can be … [+2872 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Melissa Pappas", "title": "Tiny swimming robots can restructure materials on a microscopic level - Tech Xplore", "description": "Controlling microscopic processes is inherently challenging. The everyday tools we use to manipulate matter on the macroscale can't simply be shrunk down to the size of cell, and even if they could, the physical forces they rely on work differently when their…", "url": "https://techxplore.com/news/2022-12-tiny-robots-materials-microscopic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/tiny-swimming-robots-c.jpg", "publishedAt": "2022-12-01T13:51:26Z", "content": "Controlling microscopic processes is inherently challenging. The everyday tools we use to manipulate matter on the macroscale can't simply be shrunk down to the size of cell, and even if they could, … [+6539 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "Quantum entanglement will make quantum internet \"unhackable\" thanks to quantum steering - TechSpot", "description": "Professor Mehul Malik has been studying quantum technologies for 15 years. With his team at Heriot-Watt's Institute of Photonic and Quantum Sciences, Malik has conceived a new...", "url": "https://www.techspot.com/news/96819-quantum-entanglement-make-quantum-internet-unhackable-thanks-quantum.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/12/2022-12-01-image-2.jpg", "publishedAt": "2022-12-01T13:45:00Z", "content": "Forward-looking: Quantum entanglement would virtually eliminate all the security issues the modern internet is facing. That's the theory, at least. According to new research, there's a (theoretical) … [+2730 chars]"}, {"source": {"id": null, "name": "Chromatographyonline.com"}, "author": null, "title": "Ep. 7: At the Scene of the Crime: Using Spectroscopy for Forensic Analysis - LCGC Chromatography Online", "description": null, "url": "https://www.chromatographyonline.com/view/ep-7-at-the-scene-of-the-crime-using-spectroscopy-for-forensic-analysis", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/chroma/5fc4f5560829473af5c0941f21691a1f4c9f002b-230x140.png?fit=crop&auto=format", "publishedAt": "2022-12-01T13:01:11Z", "content": "Welcome to Analytically Speaking, the new podcast from LCGC and Spectroscopy.\r\nHere in Episode #7, podcast host Jerry Workman speaks with Professor Igor K. Lednev who is a Distinguished Professor of … [+6185 chars]"}, {"source": {"id": null, "name": "Morningexpress.in"}, "author": "https://www.facebook.com/morningexpress", "title": "Distant nebula! Could James Webb find the first star of the world's first galaxy? - Morning Express", "description": "Also read: Iran: Youngster celebrating country's defeat in Qatar World Cup, shot dead by police...", "url": "https://morningexpress.in/distant-nebula-could-james-webb-find-the-first-star-of-the-worlds-first-galaxy/", "urlToImage": "https://i1.wp.com/bengali.cdn.zeenews.com/bengali/sites/default/files/2022/12/01/398281-jameswebb.png", "publishedAt": "2022-12-01T12:36:13Z", "content": "G 24 Hours Digital Bureau: Constellation Its name is Sparkler Galaxy. And his identity is – he is the first constellation of this universe. The cluster was recently discovered by the James Webb Space… [+2077 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Oldest Dog Bone Reveals Dogs Were Domesticated 17,000 Years Ago | Weather.com - The Weather Channel", "description": "Radiocarbon dating of a canine humerus recovered from Erralla cave in the Basque Country, Spain, reveals that dogs were domesticated at least 17,000 years ago.", "url": "https://weather.com/en-IN/india/science/news/2022-12-01-oldest-dog-bone-reveals-dogs-were-domesticated-17000-years-ago", "urlToImage": "https://s.w-x.co/in-dog_pet.jpg", "publishedAt": "2022-12-01T12:34:36Z", "content": "The divergence of the fearsome, bloodthirsty wolves that could rip your head off without a second thought into humanity's most loyal companions is definitely among the most heartwarming things to hav… [+2225 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "Flying an interstellar telescope - Space Daily", "description": "Goleta CA (SPX) Dec 01, 2022 - \r\nToday, he is among the millions of space enthusiasts enjoying the exquisite photography from that instrument that NASA is publishing to give academics as well as armchair astronomers a look back bil", "url": "https://www.spacedaily.com/reports/Flying_an_interstellar_telescope_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/webb-telescope-fully-deployed-marker-hg.jpg", "publishedAt": "2022-12-01T12:05:50Z", "content": "Today, he is among the millions of space enthusiasts enjoying the exquisite photography from that instrument that NASA is publishing to give academics as well as armchair astronomers a look back bill… [+5915 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": null, "title": "Plating Cells: Preparation and Media Options With Ann Rossi Bilodeau - Technology Networks", "description": "This Teach Me in 10 explores the different media options available for plating mammalian cells. It covers preparation techniques, storage options, and how to choose the right media for your experiment.<br />", "url": "https://www.technologynetworks.com/cell-science/videos/plating-cells-preparation-and-media-options-with-ann-rossi-bilodeau-367802", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367802/plating-cells-preparation-and-media-options-with-ann-rossi-bilodeau-367802-640x360.jpg?cb=20221201", "publishedAt": "2022-12-01T12:03:46Z", "content": "Plating Cells: Preparation and Media Options With Ann Rossi Bilodeau\r\nCell culture media is one of the most important components of the in vitro tissue environment. It provides the nutrients, mineral… [+267 chars]"}, {"source": {"id": null, "name": "Indiaai.gov.in"}, "author": null, "title": "Caltech's ML algorithm can classify 1000 supernovae - INDIAai", "description": "A supernova is the biggest explosion humans have ever seen. Each blast is the extremely bright, super-powerful explosion of a star.", "url": "https://indiaai.gov.in/article/caltech-s-ml-algorithm-can-classify-1000-supernovae", "urlToImage": "https://d12aarmt01l54a.cloudfront.net/cms/images/Media-20221201164932/1200-630.png", "publishedAt": "2022-12-01T11:32:01Z", "content": "Although ANN has become a modern-day buzzword, its roots go back more than 60 years. Stanford researchers created the first neural network to solve a real-world problem in the late 1950s to eliminate… [+3201 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Artemis 1 moon rocket, NASA's most powerful ever, aced its debut launch, agency says - Space.com", "description": "\"The first launch of the Space Launch System rocket was simply eye-watering.\"", "url": "https://www.space.com/artemis-1-sls-moon-rocket-aced-debut-launch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7o9wXpvkA6dgTgG8RwZDVB-1200-80.jpg", "publishedAt": "2022-12-01T11:00:51Z", "content": "NASA's Space Launch System (SLS) megarocket hit all of its marks during its first-ever liftoff two weeks ago, agency officials said.\r\nThat Nov. 16 launch kicked off NASA's highly anticipated Artemis … [+3586 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Mohammed Faaiz Dastagir", "title": "A Villanelle for Sisyphus - LiveWire", "description": "This poem highlights the importance of taking a step back and realising the importance of giving up amidst 'hustle culture'.", "url": "https://livewire.thewire.in/fiction-and-verse/a-villanelle-for-sisyphus/", "urlToImage": "https://livewire.thewire.in/wp-content/uploads/2022/12/640px-Punishment_sisyph.jpg", "publishedAt": "2022-12-01T10:14:32Z", "content": "Do you still want me?Im the outcome that you so dearly desireWhy would you be so naive?\r\nMaybe youre a dreamer, a lover, a fighter indeedHolding on to the hope of achieving me, as I conspire.Do you s… [+726 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "When the 8th Planet Neptune, was discovered by astronomers - HT Tech", "description": "In the year of 1846, on the night of 23-24 September, astronomers discovered the 8th planet called Neptune orbiting the Sun and thereby created history, NASA said. That was 176 years ago.", "url": "https://tech.hindustantimes.com/web-stories/when-the-8th-planet-neptune-was-discovered-by-astronomers-71669883873454.html", "urlToImage": null, "publishedAt": "2022-12-01T10:08:26Z", "content": "In the year of 1846, on the night of 23-24 September, astronomers discovered the 8th planet called Neptune orbiting the Sun and thereby created history, NASA said. That was 176 years ago. (Pixabay)"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Oscillating flower colour changes of Causonis japonica (Thunb.) Raf. (Vitaceae) linked to sexual phase changes | Scientific Reports - Nature.com", "description": "Scientific Reports - Oscillating flower colour changes of Causonis japonica (Thunb.) Raf. (Vitaceae) linked to sexual phase changes", "url": "https://www.nature.com/articles/s41598-022-24252-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-24252-z/MediaObjects/41598_2022_24252_Fig1_HTML.png", "publishedAt": "2022-12-01T10:05:47Z", "content": "Time-course observations on 43 flowers of Causonis japonica revealed changes in flower disc colour and sexual expression (Table 1). Temporal changes in floral features showed no difference between di… [+6231 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "Scientists simulate a 'baby wormhole' using a quantum computer for 1st time - Inshorts", "description": "Scientists have developed a quantum experiment that allows them to study the behaviour of a special kind of theoretical wormhole for the first time. The experiment hasn't created an actual wormhole (a rupture in space and time), rather it allows probing conne…", "url": "https://inshorts.com/en/news/scientists-simulate-a-baby-wormhole-using-a-quantum-computer-for-1st-time-1669885882980", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2022/12_dec/1_thu/img_1669882491744_479.jpg?", "publishedAt": "2022-12-01T09:13:34Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Asteroid today: Massive space rock dashing towards Earth at break-neck speed! - msnNOW", "description": "NASA has issued an asteroid alert! A terrifying space rock is headed for us today. Know its details, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-today-massive-space-rock-dashing-towards-earth-at-break-neck-speed-71669883613680.html?utm_source=microsoft-ht", "urlToImage": "https://static-entertainment-eus-s-msn-com.akamaized.net/sc/c6/519670.jpg", "publishedAt": "2022-12-01T08:35:37Z", "content": "Another day, another asteroid is set to pass by Earth extremely closely. After no less than 4 asteroids passed the planet extremely closely yesterday, November 30, space agencies are on alert again a… [+2205 chars]"}, {"source": {"id": null, "name": "Sustainability-times.com"}, "author": null, "title": "Unique bird species are at the greatest risk of extinction - Big News Network", "description": "", "url": "https://www.sustainability-times.com/environmental-protection/unique-bird-species-are-at-the-greatest-risk-of-extinction/", "urlToImage": "https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg", "publishedAt": "2022-12-01T08:25:00Z", "content": "Photo: Pixabay/griti\r\nBirds come in a variety of shapes and sizes to the delight of ornithologists everywhere. Yet those with rare and unusual trails are especially feeling the brunt of habitat loss,… [+2444 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "SpaceX Again Delays Japan's Plan To Launch World's 1st Private Moon Lander - NDTV", "description": "SpaceX on Wednesday postponed the launch of the world's first private lander to the Moon, a mission undertaken by Japanese firm ispace.", "url": "https://www.ndtv.com/world-news/spacex-again-delays-japans-plan-to-launch-worlds-1st-private-moon-lander-3568612", "urlToImage": "https://c.ndtvimg.com/2022-12/8493t3fo_spacex-moon-lander-spacex-twitter_625x300_01_December_22.jpg", "publishedAt": "2022-12-01T07:53:06Z", "content": "The mission by ispace is the first of a program called Hakuto-R.\r\nWashington: SpaceX on Wednesday postponed the launch of the world's first private lander to the Moon, a mission undertaken by Japanes… [+2213 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chelyabinsk disaster shows how dangerous an asteroid really is; Know this HORROR story - HT Tech", "description": "Astrophysicist Neil deGrasse Tyson spoke about the asteroid horror story, dubbed the Chelyabinsk disaster, in Russia. Know just how dangerous an asteroid can be.", "url": "https://tech.hindustantimes.com/tech/news/chelyabinsk-disaster-shows-how-dangerous-an-asteroid-really-is-know-this-horror-story-71669880112466.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/01/1600x900/Screenshot_2022-12-01_134102_1669882321204_1669882335083_1669882335083.png", "publishedAt": "2022-12-01T07:38:34Z", "content": "On February 15, 2013, an asteroid exploded over the city of Chelyabinsk, Russia. The explosion resulted in the asteroid breaking down into small pebbles which rained onto Earth in the form of debris.… [+2000 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Study sheds light on the nature of atomic nuclei - Tech Explorist", "description": "Nuclear popcorn: Heavy nucleus changes shapes at different energies.", "url": "https://www.techexplorist.com/study-sheds-light-nature-atomic-nuclei/55153/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/12/atomic-nuclei.jpg", "publishedAt": "2022-12-01T07:18:50Z", "content": "Four fundamental forces- the electromagnetic force, gravity, and the weak and strong nuclear forces- that govern the universe simultaneously describe particle interaction and how this interaction mak… [+3630 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "In A World Where The Dinosaurs Never Went Extinct, Would The Human Race Still Have Succeeded? - The Weather Channel", "description": "While our perceptions are limited to what pop culture has fed us over the years, palaeontologist Dale Russell's thought experiment requires some serious out-of-the-box thinking.", "url": "https://weather.com/en-IN/india/science/news/2022-12-01-a-world-where-the-dinosaurs-never-went-extinct", "urlToImage": "https://s.w-x.co/in-dinosaurs_1.jpg", "publishedAt": "2022-12-01T07:16:19Z", "content": "If we were to think about humans and dinosaurs existing in the same timeline, two very different scenarios come to mind: You're either thinking of the hostile relationship between humans and the terr… [+4183 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Curious Kids: how many galaxies are there in the universe? - The Indian Express", "description": "Working out how many galaxies there are in the universe is actually pretty difficult. Many galaxies are too faint or small for us to observe easily, even with the most powerful telescopes. Despite this, astronomers came up with a clever way of working this out", "url": "https://indianexpress.com/article/parenting/curious-kids-how-many-galaxies-are-there-in-the-universe-milky-way-universe-earth-sun-8275647/", "urlToImage": "https://images.indianexpress.com/2022/12/galaxy.jpg", "publishedAt": "2022-12-01T05:04:57Z", "content": "How many galaxies are there beyond the Milky Way? Rosella, aged 15, Hong Kong A galaxy is a massive collection of gas, dust and billions of stars all bound together by the force of gravity. Galaxies … [+3040 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Prehistoric Superpredator: Weird Whatcheeria Was the “T. rex of Its Time” - SciTechDaily", "description": "Ancient Iowan superpredator got big by front-loading its growth in its youth. Fossils found only at the Field Museum reveal the growth history of Whatcheeria. Although the Field Museum in Chicago is famous for SUE the T. rex, it is also home to the best, most…", "url": "https://scitechdaily.com/prehistoric-superpredator-weird-whatcheeria-was-the-t-rex-of-its-time/", "urlToImage": "https://scitechdaily.com/images/Whatcheeria-Illustration-scaled.jpg", "publishedAt": "2022-12-01T03:33:39Z", "content": "ByField MuseumNovember 30, 2022\r\nWhatcheeria was a prehistoric superpredator. It was a six-foot-long lake-dwelling creature with a salamander-like body and a long, narrow head. Credit: Adrienne Strou… [+8673 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New monochromator optics for tender X-rays - Science Daily", "description": "Until now, it has been extremely tedious to perform measurements with high sensitivity and high spatial resolution using X-ray light in the tender energy range of 1.5 -- 5.0 keV. Yet this X-ray light is ideal for investigating energy materials such as batteri…", "url": "https://www.sciencedaily.com/releases/2022/11/221130114602.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-01T01:10:14Z", "content": "Until now, it has been extremely tedious to perform measurements with high sensitivity and high spatial resolution using X-ray light in the tender energy range of 1.5 -- 5.0 keV. Yet this X-ray light… [+2612 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Cyborgs v ‘holdout humans’ - Bangalore Mirror", "description": "A typical mammalian species can be expected to exist for a million years. Modern humans, Homo sapiens, have been around for roughly 300,000 years. So what will happen if we make it to a million years", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/cyborgs-v-holdout-humans/articleshow/95892993.cms", "urlToImage": "https://bangaloremirror.indiatimes.com/photo/52761249.cms", "publishedAt": "2022-12-01T00:30:00Z", "content": "What the world might be like if our species survives for a million yearsMost species are transitory. They go extinct, branch into new species or change over time due to random mutations and environme… [+6239 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "DNA sequence helps in understanding origins of jaws: Study - ThePrint", "description": "Washington [US], November 30 (ANI): Researchers at Uppsala University have discovered and characterised a DNA sequence found in jawed vertebrates, such as sharks and humans, but absent in jawless vertebrates, such as lampreys. This DNA is important for the sh…", "url": "https://theprint.in/science/dna-sequence-helps-in-understanding-origins-of-jaws-study/1243347/", "urlToImage": null, "publishedAt": "2022-11-30T18:16:12Z", "content": "Washington [US], November 30 (ANI): Researchers at Uppsala University have discovered and characterised a DNA sequence found in jawed vertebrates, such as sharks and humans, but absent in jawless ver… [+2627 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Russia launches final GLONASS-M navigation satellite into orbit - Space.com", "description": "The spacecraft lifted off atop a Soyuz rocket on Monday (Nov. 28).", "url": "https://www.space.com/russia-launches-final-glonass-m-navigation-satellite", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7bW6nu93RsUXek2QoyevZ5-1200-80.png", "publishedAt": "2022-11-30T18:00:40Z", "content": "Russia added another piece to its GLONASS satellite-navigation network on Monday (Nov. 28).\r\nA Soyuz rocket rocket topped with a GLONASS-M satellite lifted off from Plesetsk Cosmodrome in northwester… [+2198 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Latest Test of Gigantic Starship Booster Takes SpaceX Closer to Launch - Gizmodo Australia", "description": "Yesterday, SpaceX performed a static fire test of a prototype booster in which 11 of its 33 Raptor engines were...", "url": "https://www.gizmodo.com.au/2022/12/latest-test-of-gigantic-starship-booster-takes-spacex-closer-to-launch/", "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2022/12/01/b5f6c2dcc9c300b88cc1ad4db03f564e.jpg?quality=80&resize=1280,720", "publishedAt": "2022-11-30T17:46:00Z", "content": "Yesterday, SpaceX performed a static fire test of a prototype booster in which 11 of its 33 Raptor engines were briefly engaged. The private company could very well be on target to launch the fully s… [+2460 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "What Is The Origin Of Earth's Oxygen? New Study Gives Answers - ABP Live", "description": "Subduction, a phenomenon in which an oceanic plate slides beneath a continental plate, could have led to formation of free oxygen, according to a new study.", "url": "https://news.abplive.com/science/what-is-the-origin-of-earth-s-oxygen-new-study-gives-answers-1566660", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/30/ebe4e12a81475b0845528a49459cdaad1669819882037324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-11-30T17:40:59Z", "content": "Have you ever wondered what the origin of Earth's oxygen is? A new study published in the journal Nature Geoscience has found some clues to solving this mystery. Earth's early oxygen originated from … [+5501 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of New South Wales: Astronomers observe intra-group light – the elusive glow between distant galaxies - India Education Diary", "description": "An international team of astronomers have turned a new technique onto the faint light between galaxies – known as ‘intra-group light’ – to characterise the stars that dwell there.Lead author of the study published in MNRAS, Dr Cristina Martínez-Lombi", "url": "https://indiaeducationdiary.in/university-of-new-south-wales-astronomers-observe-intra-group-light-the-elusive-glow-between-distant-galaxies/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/04/University-Of-New-South-Wales.png?fit=600%2C254&ssl=1", "publishedAt": "2022-11-30T16:50:40Z", "content": "An international team of astronomers have turned a new technique onto the faint light between galaxies known as intra-group light to characterise the stars that dwell there.\r\nLead author of the study… [+4123 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Scientists hunt for the 2nd-closest supermassive black hole near Earth - HT Tech", "description": "Two astrophysicists at the Center for Astrophysics Harvard & Smithsonian have suggested a way to observe what could be the second-closest supermassive black hole to Earth.", "url": "https://tech.hindustantimes.com/tech/news/scientists-hunt-for-the-2nd-closest-supermassive-black-hole-71669807046283.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/30/1600x900/_2fc83c14-94fa-11e5-b13b-1ee01ddf34ff_1669817459319_1669817459319.jpg", "publishedAt": "2022-11-30T15:50:50Z", "content": "Two astrophysicists at the Center for Astrophysics Harvard &amp; Smithsonian have suggested a way to observe what could be the second-closest supermassive black hole to Earth: a behemoth 3 million ti… [+3039 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Paw Mozter", "title": "Ocean Ecosystems Have Not Changed Much Over Millions of Years, Giving Insight to Future Climate Change - Nature World News", "description": "A recent study casts doubt on the notion that ocean ecosystems have undergone little change over millions of years, leading scientists to rethink conservation strategies and public policy.", "url": "https://www.natureworldnews.com/articles/54377/20221130/ocean-ecosystems-changed-much-over-millions-years-led-scientists-rethink.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/62879/us-environment-animals-oceans-death.jpg", "publishedAt": "2022-11-30T15:46:54Z", "content": "Have we damaged marine life too much for it to recover?\r\nA recent study casts doubt on the notion that ocean ecosystems have undergone little change over millions of years, leading scientists to reth… [+3841 chars]"}, {"source": {"id": null, "name": "Cool Hunting"}, "author": "Kelly Pau", "title": "New Research Supports the Idea that There Was Once Life on Mars - Cool Hunting", "description": "A recent study from the journal “Earth and Planetary Science Letters” presents new findings about the early evolution of Mars. By creating a newly developed model of Martian atmosphere …", "url": "http://coolhunting.com/culture/new-research-supports-the-idea-that-there-was-once-life-on-mars/", "urlToImage": "https://i0.wp.com/coolhunting.com/wp-content/uploads/2022/11/mars-life.jpg?fit=800%2C800&ssl=1", "publishedAt": "2022-11-30T15:25:49Z", "content": "A recent study from the journal “Earth and Planetary Science Letters” presents new findings about the early evolution of Mars. By creating a newly developed model of Martian atmosphere through time, … [+862 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Japan successfully propelled a moon spacecraft using steam for the first time ever - Interesting Engineering", "description": "Japan's EQUULEUS CubeSat will travel far beyond the Moon and into space to test the location of a potential future deep spaceport.", "url": "https://interestingengineering.com/science/japans-spacecraft-using-steam", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/11/30/image/jpeg/h39YGcj0jKRYVdUygUZAmDNTkLWxPeG1XWPdLz0d.jpg", "publishedAt": "2022-11-30T15:16:00Z", "content": "\"This is the world's first successful orbit control beyond low-Earth orbit using water propellant propulsion system,\" JAXA said in a statement on Saturday.\r\nJapan's deep space CubeSat spacecraft\r\nJAX… [+1671 chars]"}, {"source": {"id": null, "name": "Hot Hardware"}, "author": "Tim Sweezy", "title": "Astronomers Discover Andromeda Is A Cosmic Cannibal Feasting On Smaller Galaxies - Hot Hardware", "description": "The findings of two honor students leads a team of international scientists to determine the Andromeda galaxy is a cannibal.", "url": "https://hothardware.com/news/astronomers-discover-andromeda-is-cosmic-cannibal", "urlToImage": "https://images.hothardware.com/contentimages/newsitem/60243/content/andromeda-galaxy.jpg", "publishedAt": "2022-11-30T14:52:00Z", "content": "New evidence points to the Andromeda galaxy being a cannibal that has been growing with intermittent feasts of smaller galaxies. An international team of scientists recently published a paper with th… [+2459 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers reveal 'Yin and Yang' mechanisms of stress granules by Caprin-1 - Phys.org", "description": "In a study published in PNAS, a research team led by Prof. Gong Weiming from the University of Science and Technology (USTC) of the Chinese Academy of Sciences and his collaborators revealed the \"Yin and Yang\" regulation of stress granules (SGs) by Caprin-1.", "url": "https://phys.org/news/2022-11-reveal-yin-yang-mechanisms-stress.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-reveal-yin.jpg", "publishedAt": "2022-11-30T13:51:28Z", "content": "In a study published in PNAS, a research team led by Prof. Gong Weiming from the University of Science and Technology (USTC) of the Chinese Academy of Sciences and his collaborators revealed the \"Yin… [+2419 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Mike Williams-Rice", "title": "Method predicts asymmetrical edges of 2D crystals - Futurity: Research News", "description": "Researchers have developed a new method that can predict the shapes of asymmetrical crystals. It's an algebraic sleight-of-hand.", "url": "https://www.futurity.org/asymmetrical-crystals-2837282/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/11/asymmetry_crystals_1600.jpg", "publishedAt": "2022-11-30T13:41:01Z", "content": "A new method can predict the shapes of asymmetrical crystals.\r\nA crystal’s shape is determined by its inherent chemistry, a characteristic that ultimately determines its final form from the most basi… [+4594 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Is our universe a hologram? Physicists debate famous idea on its 25th anniversary - Deccan Herald", "description": "Twenty-five years ago this month, a conjecture shook the world of theoretical physics. It had the aura of revelation. “At first, we had a magical statement …almost out of nowhere,” says Mark Van Raamsdonk, a theoretical physicist at the University of British …", "url": "https://www.deccanherald.com/science-and-environment/is-our-universe-a-hologram-physicists-debate-famous-idea-on-its-25th-anniversary-1167151.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/30/istock-1085287936-1-999427-1624168708-1167151-1669813516.jpg", "publishedAt": "2022-11-30T13:04:50Z", "content": "Twenty-five years ago this month, a conjecture shook the world of theoretical physics. It had the aura of revelation. At first, we had a magical statement almost out of nowhere, says Mark Van Raamsdo… [+15977 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Fossilized brain of 525 million-year-old deep sea worm likely the oldest ever discovered - Livescience.com", "description": "An ancient worm unearthed in China has one of the oldest fossilized brains ever found. The brain's shape could also help solve a centuries-old debate about the evolution of arthropods.", "url": "https://www.livescience.com/oldest-fossilized-brain-worm", "urlToImage": "https://cdn.mos.cms.futurecdn.net/k9txTFmBPxT4U46eu8SCuV-1200-80.jpg", "publishedAt": "2022-11-30T11:44:11Z", "content": "An abstract artist's impression of what the fossilized worm, Cardiodictyon catenulum, may have looked like.  (Image credit: Nicholas Strausfeld/The University of Arizona)\r\n(opens in new tab)A 525 mil… [+4306 chars]"}]}