{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lizette Ortega", "title": "A big asteroid is coming close to Earth. Be excited, not afraid. - The Washington Post", "description": "To be clear, the asteroid is not going to hit Earth — not in our lifetime nor our children’s lifetimes, anyway.", "url": "https://www.washingtonpost.com/science/2024/08/05/asteroid-apophis-earth/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DRT3NZICM5FF5GM6CXIS4KVZNY.gif&w=1440", "publishedAt": "2024-08-05T10:35:38Z", "content": "A massive space rock will go hurtling past Earth in a few years, zooming by 10 times faster than a bullet.\r\nThis is the first time an asteroid of its size is coming close enough that people in parts … [+192 chars]"}, {"source": {"id": null, "name": "Awazthevoice.in"}, "author": "Sumana", "title": "Fossil study finds how sea level changes shaped early life on Earth - Awaz The Voice", "description": "A newly developed timeline of early animal fossils suggests a relationship between sea level fluctuations variations in marine oxygen and the appearance of the earliest ancestors of present day animals", "url": "https://www.awazthevoice.in/gadgets-news/fossil-study-finds-how-sea-level-changes-shaped-early-life-on-earth-30543.html", "urlToImage": "https://www.awazthevoice.in/upload/news/1722850438fossil.webp", "publishedAt": "2024-08-05T09:33:58Z", "content": "Edinburgh\r\nA newly developed timeline of early animal fossils suggests a relationship between sea level fluctuations, variations in marine oxygen, and the appearance of the earliest ancestors of pres… [+3203 chars]"}, {"source": {"id": null, "name": "News18"}, "author": null, "title": "Explained: How Saturn Flung Comet A117uUD Out Of The Solar System In 2022 - News18", "description": "The first comet thrown out of the solar system was Comet C/1980 E1 after encountering Jupiter.", "url": "https://www.news18.com/viral/explained-how-saturn-flung-comet-a117uud-out-of-the-solar-system-in-2022-8990273.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/08/img-2-2024-08-05t110018.516-2024-08-237092e4f55b5c9f67bb09c91fa0f85e-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-08-05T05:31:19Z", "content": "Scientists have found that Saturn has thrown Comet A117uUD out of the solar system in 2022. It has been claimed in an Instagram post. As described in the post, this discovery was made by an ATLAS (As… [+1997 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "Naman Bansal", "title": "What Is Newly Discovered Super Jupiter? - NewsPatrolling", "description": "Nasa Astronomers Discovered a Giant Alien Gas Planet – Super Jupiter Our Universe is filled with innumerable surprises and the Super Jupiter is just one of them Human curiosity has led to some excitin", "url": "https://newspatrolling.com/what-is-newly-discovered-super-jupiter/", "urlToImage": null, "publishedAt": "2024-08-05T04:47:31Z", "content": "<ul><li>Nasa Astronomers Discovered a Giant Alien Gas Planet Super Jupiter</li><li>Our Universe is filled with innumerable surprises and the Super Jupiter is just one of them</li></ul>Human curiosity… [+3017 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Aditya Madanapalle", "title": "Elusive white dwarf stars caught snacking on planets - News9 LIVE", "description": "Astronomers have found dead stars smeared with the remains of shredded exoplanets.", "url": "https://www.news9live.com/science/elusive-white-dwarf-stars-caught-snacking-on-planets-2643697", "urlToImage": "https://images.news9live.com/wp-content/uploads/2024/08/Polluted-White-Dwarf.jpg", "publishedAt": "2024-08-05T03:33:02Z", "content": "An exoplanet and a debris disk surrounding a polluted white dwarf star. (Image Credit: NASA/JPL-Caltech). \r\nNew Delhi: White Dwarf are the final stages of stellar evolution, and are the exploded core… [+1839 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "NASA Beamed a Laser Message to Earth From 10 Million Miles Away - ScienceAlert", "description": "Eventually, we're going to want to expand the World Wide Web across the galaxy, and NASA recently demonstrated a key piece of tech that could help, beaming messages via laser across a distance of almost 16 million kilometers (10 million miles).", "url": "https://www.sciencealert.com/nasa-beamed-a-laser-message-to-earth-from-10-million-miles-away", "urlToImage": "https://www.sciencealert.com/images/2023/11/GettyImages-1247965075-1.jpg", "publishedAt": "2024-08-05T01:28:23Z", "content": "Eventually, we're going to want to expand the World Wide Web across the galaxy, and NASA recently demonstrated a key piece of tech that could help, beaming messages via laser across a distance of alm… [+3178 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Using data from DART's impact, scientists investigate characteristics of Dimorphos and Didymos - NASASpaceflight.com", "description": "In September 2022, NASA’s Double Asteroid Redirection Test (DART) mission successfully slammed into the side…", "url": "https://www.nasaspaceflight.com/2024/08/dart-impact-data/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/09/DART_still-revisedA-622x350.jpeg", "publishedAt": "2024-08-04T21:41:11Z", "content": "3In September 2022, NASAs Double Asteroid Redirection Test (DART) mission successfully slammed into the side of asteroid moonlet Dimorphos. Initial data from the event indicated that DART had success… [+6544 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "The moon and Venus join close together in the night sky Aug. 5 - Space.com", "description": "Of all of the monthly meetings between the moon and Venus this year, this one is by far the closest. The only caveat is that the pair won't be very high, as the dynamic duo sets just one hour after the sun.", "url": "https://www.space.com/moon-venus-august-5-2024", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bWWqzkZf5tpysLuJUwKNXC-1200-80.jpg", "publishedAt": "2024-08-04T12:00:12Z", "content": "Few sights are as memorable as Venus, the brightest planet, passing very close to a crescent moon in a twilight sky. Such an event may have inspired the symbols on the flag of Turkey or the famous li… [+4397 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Aditya Madanapalle", "title": "Scientists discovery new type of wood highly efficient at storing carbon - News9 LIVE", "description": "The discovery paves the way for capturing and storing carbon using plantation forests.", "url": "https://www.news9live.com/science/scientists-discovery-new-type-of-wood-highly-efficient-at-storing-carbon-2643146", "urlToImage": "https://images.news9live.com/wp-content/uploads/2024/08/Tulip-Tree.jpg", "publishedAt": "2024-08-04T10:28:59Z", "content": "Tulip Trees have been discovered to contain a totally unique type of wood. (image Credit: Douglas Sacha/Moment/Getty Images). \r\nNew Delhi: Scientists have conducted an evolutionary survey of the micr… [+2343 chars]"}]}