{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "Watch: UAE spacecraft takes close-up photos of Mars' little moon - The Economic Times", "description": "A spacecraft around Mars has ventured closer to the red planet’s little moon Deimos than any humanmade object in almost a half-century. The United Arab Emirates’ Amal spacecraft flew within 62 miles of the small moon in March. The spacecraft also observed the…", "url": "https://economictimes.indiatimes.com/news/science/watch-uae-spacecraft-takes-close-up-photos-of-mars-little-moon/videoshow/99745281.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99745281,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-25T02:01:01Z", "content": "A spacecraft around Mars has ventured closer to the red planets little moon Deimos than any humanmade object in almost a half-century. The United Arab Emirates Amal spacecraft flew within 62 miles of… [+116 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Falcon Heavy delay affects space station manifest - SpaceNews", "description": "A delayed launch of commercial satellites on a Falcon Heavy could upend the schedule of flights to the International Space Station.", "url": "https://spacenews.com/falcon-heavy-delay-affects-space-station-manifest/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/04/crew6-dusk.jpg", "publishedAt": "2023-04-25T01:00:03Z", "content": "WASHINGTON A delayed launch of commercial satellites on a Falcon Heavy could upend the schedule of flights to the International Space Station, including a private astronaut mission that was scheduled… [+3797 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Why A New Spacecraft Is Now On Its Way To Photograph Saturn’s ‘Dead’ Moon 21 Times - Forbes", "description": "The European Space Agency’s new JUICE mission is on its way to orbit Jupiter's giant moon Ganymede, but before it gets there it will flyby tiny Callisto a stunning 21 times.", "url": "https://www.forbes.com/sites/jamiecartereurope/2023/04/24/why-a-new-spacecraft-is-now-on-its-way-to-photograph-saturns-dead-moon-21-times/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/641d98d561c94987a6580d4a/0x0.jpg?format=jpg&crop=1852,1041,x725,y420,safe&width=1200", "publishedAt": "2023-04-24T23:15:00Z", "content": "Europes first-ever mission to Jupiter will examine its moons Europa, Callisto and Ganymede.\r\ngetty\r\nJupiters second largest moon has a lifeless look about it. About 2.6 times smaller than Earth, Call… [+4294 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA alert! Asteroid 2023 HJ2 set to buzz Earth from dangerously close distance TODAY - msnNOW", "description": "Asteroid 2023 HJ2 is set to make a dangerously close approach to Earth at a blistering speed of 42608 km per hour, NASA warned.", "url": "https://tech.hindustantimes.com/tech/news/nasa-alert-asteroid-2023-hj2-set-to-buzz-earth-from-dangerously-close-distance-today-71682321011575.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/24/1600x900/SPACE-ASTRONOMY-ASTEROID-0_1682321138959_1682321153263.jpg", "publishedAt": "2023-04-24T21:15:11Z", "content": "NASA says that most asteroids come from the asteroid belt situated between Mars and Jupiter. These asteroids have an elliptical orbit, and their rotation is often erratic, tumbling through space. How… [+2310 chars]"}, {"source": {"id": null, "name": "BroBible"}, "author": "Douglas Charles", "title": "Four People Are About To Move Into An Ultra-Realistic Mars Base Here On Earth - BroBible", "description": "Four people will soon be moving into what has been called the most realistic Mars base ever created to experience what it would be like to live in space, 157.12 million miles from Earth. The Space Analog for the Moon and Mars (SAM) base is a hermetically seal…", "url": "https://brobible.com/culture/article/people-move-into-mars-base-earth/", "urlToImage": "https://brobible.com/wp-content/uploads/2023/04/astronaut-on-mars-base-on-earth.png", "publishedAt": "2023-04-24T20:44:49Z", "content": "iStockphoto\r\nFour people will soon be moving into what has been called the most realistic Mars base ever created to experience what it would be like to live in space, 157.12 million miles from Earth.… [+1875 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Building better superconductors with palladium - Phys.org", "description": "It is one of the most exciting races in modern physics: How can we produce the best superconductors that remain superconducting even at the highest possible temperatures and ambient pressure? In recent years, a new era of superconductivity has begun with the …", "url": "https://phys.org/news/2023-04-superconductors-palladium.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/3-superconduct.jpg", "publishedAt": "2023-04-24T19:53:56Z", "content": "It is one of the most exciting races in modern physics: How can we produce the best superconductors that remain superconducting even at the highest possible temperatures and ambient pressure? In rece… [+4661 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "NASA scientists identify new stellar danger to planets - Daily Excelsior", "description": "NEW DELHI, Apr 24: Astronomers using data from NASA’s Chandra X-ray Observatory and other telescopes have identified a new threat to life on planets like Earth: a period during which intense X-rays from exploded stars can affect planets over 100 light-years a…", "url": "https://www.dailyexcelsior.com/nasa-scientists-identify-new-stellar-danger-to-planets/", "urlToImage": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2023/03/nasa-2.jpg", "publishedAt": "2023-04-24T19:47:22Z", "content": "NEW DELHI, Apr 24: Astronomers using data from NASA’s Chandra X-ray Observatory and other telescopes have identified a new threat to life on planets like Earth: a period during which intense X-rays f… [+2840 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "Karnataka assembly polls: Will Congress bid to localise polls work? - msnNOW", "description": "Union Home Minister Amit Shah said the assembly polls in Karnataka was all about Prime Minister Narendra Modi's development politics versus Congress' appeasement politics, and defended the state BJP government's decision to scrap the four per cent reservation…", "url": "https://www.msn.com/en-in/news/other/karnataka-assembly-polls-will-congress-bid-to-localise-polls-work/vi-AA1ah55s", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1ahlfn.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=542&y=193", "publishedAt": "2023-04-24T18:35:49Z", "content": "Like us on Facebook to see similar stories\r\nI am already a fan, don't show this again"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists have full state of a quantum liquid down cold: New research, using ultracold atoms, reveals particular properties of quantum systems - Science Daily", "description": "A team of physicists has illuminated certain properties of quantum systems by observing how their fluctuations spread over time. The research offers an intricate understanding of a complex phenomenon that is foundational to quantum computing.", "url": "https://www.sciencedaily.com/releases/2023/04/230424133553.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-04-24T18:07:06Z", "content": "A team of physicists has illuminated certain properties of quantum systems by observing how their fluctuations spread over time. The research offers an intricate understanding of a complex phenomenon… [+2576 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA, Rocket Lab Set Coverage for Tropical Cyclones Mission - NASA", "description": "NASA and Rocket Lab are targeting 9 p.m. EDT, Sunday, April 30 (1 p.m. New Zealand Standard Time, Monday, May 1), to launch two storm tracking CubeSats into orbit.", "url": "https://www.nasa.gov/press-release/nasa-rocket-lab-set-coverage-for-tropical-cyclones-mission", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/hurricaneian_tmo_2022270_lrg_0.jpg", "publishedAt": "2023-04-24T17:58:29Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tiffany Challe", "title": "Harnessing the ocean's power to combat the climate crisis - Phys.org", "description": "Earth Day is an opportunity to celebrate the awe-inspiring wonders on this planet—a place full of biodiversity hotspots, from lush rainforests to scenic mountain ranges, home to rich, endemic species. These pristine, ecologically unique landscapes are increas…", "url": "https://phys.org/news/2023-04-harnessing-ocean-power-combat-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/harnessing-the-oceans.jpg", "publishedAt": "2023-04-24T17:53:05Z", "content": "Earth Day is an opportunity to celebrate the awe-inspiring wonders on this planeta place full of biodiversity hotspots, from lush rainforests to scenic mountain ranges, home to rich, endemic species.… [+8224 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Researchers use AI to discover new planet outside solar system: The exoplanet was detected using machine learning, a branch of artificial intelligence - Science Daily", "description": "A research team has confirmed evidence of a previously unknown planet outside of our solar system, and they used machine learning tools to detect it. A recent study by the team showed that machine learning can correctly determine if an exoplanet is present by…", "url": "https://www.sciencedaily.com/releases/2023/04/230424133426.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-04-24T17:51:13Z", "content": "A University of Georgia research team has confirmed evidence of a previously unknown planet outside of our solar system, and they used machine learning tools to detect it.A recent study by the team s… [+2456 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Nancy Atkinson", "title": "Here's How NASA is Planning to Protect Earth From Asteroids and Comets - Universe Today", "description": "The large impact craters dotting our planet are powerful reminders that asteroids and comets strike the Earth from time to time. As often said, it’s not a question of “if”; it’s a matter of “when” our planet will face an impending strike from space. But an im…", "url": "https://www.universetoday.com/161058/heres-how-nasa-is-planning-to-protect-earth-from-asteroids-and-comets/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/12/1_orbital-diagram.width-1320.jpg", "publishedAt": "2023-04-24T17:36:56Z", "content": "The large impact craters dotting our planet are powerful reminders that asteroids and comets strike the Earth from time to time. As often said, it’s not a question of “if”; it’s a matter of “when” ou… [+6261 chars]"}, {"source": {"id": null, "name": "Bizzbuzz.news"}, "author": "Alon Loeffler And Zdenka Kuncic", "title": "Networks of silver nanowires can learn, remember like human brain - Bizz Buzz", "description": "Nanowire networks could possibly lead to ‘synthetic intelligence’", "url": "https://www.bizzbuzz.news/eco-buzz/networks-of-silver-nanowires-can-learn-remember-like-human-brain-1213831", "urlToImage": "https://www.bizzbuzz.news/h-upload/2023/04/24/1703894-european-union.jpg", "publishedAt": "2023-04-24T17:28:45Z", "content": "AI systems aren't structured like our brains and don't learn the same way. Their ability to adapt and function in dynamic, hard-to-predict and noisy environments is poor in comparison to ours, and th… [+4186 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Video Team", "title": "Are aliens that may visit Earth likely to be AI-powered beings? - WION", "description": "Artificial Intelligence is foreseen as the 'New Normal'. The use of AI is burgeoning in every field. Powerful new chatbots, AI-powered apps and search engines are being released every day. AI boom is taking over the world. Nowadays, AI has become quintessenti…", "url": "https://www.wionews.com/videos/are-aliens-that-may-visit-earth-likely-to-be-ai-powered-beings-585777", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/04/24/2404_Artificial_Intelligence_Web_V2-1682356225-00000003.jpg", "publishedAt": "2023-04-24T17:10:06Z", "content": "© 2023. Indiadotcom Digital Private Limited. All Rights Reserved."}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Watch SpaceX's Starship soar in slow motion - Devdiscourse", "description": "Read more about Watch SpaceX's Starship soar in slow motion on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2428439-watch-spacexs-starship-soar-in-slow-motion", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/24_04_2023_22_07_15_3816838.jpg?width=920&format=jpeg", "publishedAt": "2023-04-24T17:09:08Z", "content": "Video Credit: Twitter (@@elonmusk)\r\nSpaceX CEO Elon Musk recently shared a 23-second slow-motion video of Starship lifting off from Starbase on Twitter. The slow-motion footage shows the giant vehicl… [+1669 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Repair crews may move in to help fix the oxidative damage in protein factories - News-Medical.Net", "description": "In a discovery fundamental to the inner workings of cells, scientists have discovered that if oxidative stress damages protein factories called ribosomes, repair crews may move in to help fix the damage so work can quickly resume.", "url": "https://www.news-medical.net/news/20230424/Repair-crews-may-move-in-to-help-fix-the-oxidative-damage-in-protein-factories.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Protein-620x480.jpg", "publishedAt": "2023-04-24T16:58:00Z", "content": "In a discovery fundamental to the inner workings of cells, scientists have discovered that if oxidative stress damages protein factories called ribosomes, repair crews may move in to help fix the dam… [+4476 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Adam Zewe", "title": "Miniscule device could help preserve the battery life of tiny sensors - Tech Xplore", "description": "Scientists are striving to develop ever-smaller Internet of Things devices, like sensors tinier than a fingertip that could make nearly any object trackable. These diminutive sensors have miniscule batteries which are often nearly impossible to replace, so en…", "url": "https://techxplore.com/news/2023-04-miniscule-device-battery-life-tiny.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/miniscule-device-could.jpg", "publishedAt": "2023-04-24T16:52:50Z", "content": "Scientists are striving to develop ever-smaller Internet of Things devices, like sensors tinier than a fingertip that could make nearly any object trackable. These diminutive sensors have miniscule b… [+7166 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "First stars in the universe formed in groups, machine-learning study reveals – Physics World - physicsworld.com", "description": "Study focussed on elements inherited from supernovae", "url": "https://physicsworld.com/a/first-stars-in-the-universe-formed-in-groups-machine-learning-study-reveals/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2023/04/Artistic-impression-of-a-supernova.jpg", "publishedAt": "2023-04-24T16:17:10Z", "content": "Metalworks: artistic impression of a supernova. (Courtesy: NASA/ESA/G Bacon (STScI))\r\nMachine learning has been used to characterize the heavy elements that the first stars in the universe passed on … [+4659 chars]"}, {"source": {"id": null, "name": "Znewsservice.com"}, "author": null, "title": "Grassy Environments In Africa First Appeared Million Years Age - Z News Service", "description": "A fresh picture of apes, ancient Africa, and the origins of humans is painted by two research that were published in the journal Science on April 14. The", "url": "https://znewsservice.com/environment/a45843598868/grassy-environments-in-africa-first-appeared-million-years-age/", "urlToImage": "https://znewsservice.com/wp-content/uploads/2023/04/environment.jpg", "publishedAt": "2023-04-24T15:34:42Z", "content": "A fresh picture of apes, ancient Africa, and the origins of humans is painted by two research that were published in the journal Science on April 14. The earliest apes to emerge in Africa more than 2… [+5964 chars]"}, {"source": {"id": null, "name": "Natureasia.com"}, "author": null, "title": "Astronomy: JWST finds planetary ingredients in stellar nursery | Nature Astronomy | Nature Portfolio - Nature Middle East", "description": "The detection of planet-forming ingredients around hundreds of young stars in the Small Magellanic Cloud (SMC), a dwarf galaxy neighbouring the Milky Way, is presented in a paper published in Nature A", "url": "https://www.natureasia.com/en/research/highlight/14470", "urlToImage": "https://www.natureasia.com/static/common/img/logos/journals/natastron-logo-sq.png", "publishedAt": "2023-04-24T15:21:49Z", "content": "The detection of planet-forming ingredients around hundreds of young stars in the Small Magellanic Cloud (SMC), a dwarf galaxy neighbouring the Milky Way, is presented in a paper published in Nature … [+1391 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Transforming highways for high-speed travel and energy transport: Revolutionary design could combine superconductor levitation, lossless electricity transmission, and liquid hydrogen transportation into one system. - Science Daily", "description": "Researchers developed a proof of concept for a superconducting highway that could transport vehicles and electricity, cooling the necessary superconductors with a pipeline of liquid hydrogen. Most magnetic levitation designs feature the superconductor inside …", "url": "https://www.sciencedaily.com/releases/2023/04/230424102921.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-04-24T15:19:37Z", "content": "Superconductors can conduct electricity without any resistance or power loss, and they can effortlessly cause magnets to levitate above them. These properties would make superconductors useful for hi… [+2470 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Efficient evolution of human antibodies from general protein language models - Nature.com", "description": "A general protein language model guides protein evolution with 20 or fewer variants needed for testing.", "url": "https://www.nature.com/articles/s41587-023-01763-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41587-023-01763-2/MediaObjects/41587_2023_1763_Fig1_HTML.png", "publishedAt": "2023-04-24T15:14:53Z", "content": "Acquiring amino acid substitutions via language model consensus\r\nWe select amino acid substitutions recommended by a consensus of language models. We take as input a single wild-type sequence x=(x1,,… [+36114 chars]"}, {"source": {"id": null, "name": "Azernews.az"}, "author": null, "title": "China plans to test use of 3D printing tech for construction on moon - AzerNews.Az", "description": "China plans to use its lunar exploration program to explore the feasibility of using 3D printing technology to construct buildings on the moon, China Daily reported on Monday, Azernews reports citing Xinhua.", "url": "https://www.azernews.az/region/209048.html", "urlToImage": "https://www.azernews.az/media/2023/04/24/moon_crater_210921.jpg", "publishedAt": "2023-04-24T14:20:00Z", "content": "China plans to use its lunar exploration program to explore the\r\nfeasibility of using 3D printing technology to construct buildings\r\non the moon, China Daily reported on Monday, Azernews reports\r\ncit… [+911 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "NASA's Perseverance rover loses its hitchhiking 'pet rock' after more than a year together on Mars - Livescience.com", "description": "The rover has finally lost a pesky rock that had become lodged in its front left wheel \"like a pebble in its shoe.\" The stone had accompanied the rover for more than half its time on the Red Planet.", "url": "https://www.livescience.com/space/mars/nasas-perseverance-rover-loses-its-hitchhiking-pet-rock-after-more-than-a-year-together-on-mars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XsjJyxgv4FEdmj3snWyhzR-1200-80.png", "publishedAt": "2023-04-24T14:17:40Z", "content": "An image of Perseverance's \"pet rock\" stuck in the rover's front left wheel taken on May 26. (Image credit: NASA/JPL-Caltech)\r\nAfter more than a year together on the Red Planet, NASA's Perseverance r… [+2334 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Kavita Verma", "title": "NASA reveals strange sounds of Earth's magnetic field - Interesting Engineering", "description": "Waves of plasma from the sun slam into the Earth's magnetosphere to create fluctuations or vibrations in the plasma shield.", "url": "https://interestingengineering.com/science/nasas-harp-project-captures-eerie-sounds-earths-magnetosphere", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/04/24/image/jpeg/wxHjn5yfDPnrnNrGyp52kbQN8xmGEoFzo99nXdyR.jpg", "publishedAt": "2023-04-24T13:54:00Z", "content": "Waves of plasma from the sun slam into the Earth's magnetosphere to create fluctuations or vibrations in the plasma shield. This gives off \"ultralow-frequency\" radio waves. These radio waves can be d… [+1481 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers discover significant variation in anatomy of human digestive system - ANI News", "description": "According to a recent study, the human digestive system's structure varies significantly from person to person, with obvious variances amongst healthy people. The discovery could help explain how the structure of the digestive tract affects human health and c…", "url": "https://www.aninews.in/news/health/researchers-discover-significant-variation-in-anatomy-of-human-digestive-system20230424190929", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230424133617.jpg", "publishedAt": "2023-04-24T13:41:05Z", "content": "North Carolina [US], April 24 (ANI): According to a recent study, the human digestive system's structure varies significantly from person to person, with obvious variances amongst healthy people. The… [+3007 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Uncovering the Secret Lives of Desert Ants With Revolutionary Tracking Technology - SciTechDaily", "description": "Groundbreaking tracking technology that has revealed new insights into how desert ants navigate their complex worlds could inspire the next generation of smart, efficient robots. New ‘decade in the making’ low-cost tracking technology reveals remarkable speed…", "url": "https://scitechdaily.com/uncovering-the-secret-lives-of-desert-ants-with-revolutionary-tracking-technology/", "urlToImage": "https://scitechdaily.com/images/Ant-Insect-Close-Up.jpg", "publishedAt": "2023-04-24T13:29:45Z", "content": "ByUniversity of SheffieldApril 24, 2023\r\nResearchers have developed a low-cost tracking technology called CATER, which uses computer vision and AI to study desert ants navigation, revealing their rem… [+7582 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Nasa's new 3d-printed superalloy can handle high temperatures - Tech Explorist", "description": "A 3D printable alloy designed for environments.", "url": "https://www.techexplorist.com/nasas-new-3d-printed-superalloy-handle-high-temperatures/59347/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/04/GRX-810.png", "publishedAt": "2023-04-24T12:43:52Z", "content": "Multiprincipal-element alloys are an important class of materials due to their mechanical and oxidation-resistant properties. A team of innovators from NASA and The Ohio State University detailed the… [+2219 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Dead Nasa satellite plunges to Earth over Sahara Desert - msnNOW", "description": "Most of the 300-kilogram satellite, called Rhessi, was expected to burn up while plummeting through the atmosphere.", "url": "https://www.indiatoday.in/science/story/dead-nasa-satellite-plunges-to-earth-over-sahara-desert-2362930-2023-04-21", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1a8LlZ.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-04-24T12:26:11Z", "content": "© Provided by India Today\r\n Dead Nasa satellite plunges to Earth over Sahara Desert\r\nAn old NASA satellite that studied the sun for more than a decade fell to Earth over the Sahara Desert, the space … [+844 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Hubble clicks news suns being born to celebrate 33rd anniversary - India Today", "description": "To mark its 33rd anniversary in space, Hubble took an ethereal photo of a nearby star-forming region.", "url": "https://www.indiatoday.in/science/story/hubble-space-telescope-33-year-annivarsary-stars-forming-suns-solar-system-2364047-2023-04-24", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202304/hubble_telescope_picture-sixteen_nine.jpg?VersionId=6GN8kLGCeTdMBmUtqenH4hTk1i.DJ6uL", "publishedAt": "2023-04-24T12:06:13Z", "content": "By India Today Science Desk: The Hubble space telescope has marked 33 years of its launch with a spectacular image that shows star-forming regions in a part of the sky that is 960 light-years away fr… [+2602 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "New inflammation gene may help personalise kidney disease treatment - Morung Express", "description": "Sydney, April 24 (IANS) Researchers have identified a gene that controls the cut-off switch for kidney inflammation and could pave the way for more precise disease diagnostics and personalised treatment for kidney diseases.", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2023/04/14918012_1682335834_83a6a368c73810b0df963c8c5d905441.jpg", "publishedAt": "2023-04-24T11:35:20Z", "content": "Sydney, April 24 (IANS) Researchers have identified a gene that controls the cut-off switch for kidney inflammation and could pave the way for more precise disease diagnostics and personalised treatm… [+2348 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "India gives green light to gravitational-wave observatory – Physics World - physicsworld.com", "description": "When built by 2030, LIGO-India will allow gravitational-wave sources to be better pinpointed and monitored", "url": "https://physicsworld.com/a/india-gives-green-light-to-gravitational-wave-observatory/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2023/04/ligo-livingston-aerial-02.jpg", "publishedAt": "2023-04-24T11:27:18Z", "content": "New views: the LIGO-India observatory will be an identical copy of the two US advanced LIGO observatories located in Hanford, Washington and Livingston, Louisiana (pictured) (courtesy: Caltech/MIT/LI… [+3834 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "World's Second-Deepest Blue Hole Where Dinosaur-Killing Asteroid Landed Discovered - Times Now", "description": "The world's second-deepest blue hole has been discovered off the coast of the Yucatan Peninsula in Mexico’s Chetumal Bay.", "url": "https://www.timesnownews.com/viral/worlds-second-deepest-blue-hole-where-dinosaur-killing-asteroid-landed-discovered-article-99731650", "urlToImage": "https://static.tnn.in/thumb/msid-99731650,updatedat-1682335440846,width-1280,height-720,resizemode-75/99731650.jpg", "publishedAt": "2023-04-24T11:24:00Z", "content": "Horoscope Today, April 25, 2023: Taurus will Make Their Parents Proud, Aquarius will Discover Some New Facts"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Mihai Andrei", "title": "Glow-in-the-dark medicinal plants could be useful in a very different way - ZME Science", "description": "Imaging science could get some unexpected help.", "url": "https://www.zmescience.com/science/news-science/glow-in-the-dark-medicinal-plants-could-be-useful-in-a-very-different-way/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/04/761px-Toddalia_asiatica.jpg", "publishedAt": "2023-04-24T11:04:41Z", "content": "Medicinal plants have been used since prehistoric times, helping mankind fight back against various diseases and health problems. As modern medicine became better and better, medicinal plants fell in… [+2753 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New Melanin Properties ‘Ingredient’ Could Advance Bioelectronics - India Education Diary", "description": "After nearly a century of scientific inquiry, scientists have at last been able to characterize a key component in the substance responsible for giving countless living organisms their color. In the study, published online today in the journal Nature", "url": "https://indiaeducationdiary.in/new-melanin-properties-ingredient-could-advance-bioelectronics/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/ohio-1024x683.jpg", "publishedAt": "2023-04-24T10:36:26Z", "content": "After nearly a century of scientific inquiry, scientists have at last been able to characterize a key component in the substance responsible for giving countless living organisms their color. \r\nIn th… [+3862 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "The potential of fungal genetics in the development of innovative biotechnologies - Tech Explorist", "description": "Fungal Biotechnology: A Historical Perspective and Future Outlook.", "url": "https://www.techexplorist.com/potential-fungal-genetics-development-innovative-biotechnologies/59329/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/04/mushroom.jpg", "publishedAt": "2023-04-24T10:25:35Z", "content": "Fungal genetics is an emerging field that has the potential to revolutionize biotechnology. Fungi are highly adaptable organisms that have evolved to live in diverse environments, and their genetics … [+5167 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Researchers Analyse The Rapid Disappearing Of Stable Glacier In Greenland - India Education Diary", "description": "As climate change causes ocean temperatures to rise, one of Greenland’s previously most stable glaciers is now retreating at an unprecedented rate, according to a new study. Led by researchers at The Ohio State University, a team found that between 2", "url": "https://indiaeducationdiary.in/researchers-analyse-the-rapid-disappearing-of-stable-glacier-in-greenland/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/04/1920_nasa039s-observes-effects-of-summer-melt-on-greenland-ice-sheet-29609834052-1024x682.jpg", "publishedAt": "2023-04-24T10:11:28Z", "content": "As climate change causes ocean temperatures to rise, one of Greenlands previously most stable glaciers is now retreating at an unprecedented rate, according to a new study. \r\nLed by researchers at Th… [+5268 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Cryo-imaging reveals the layers of fuel cell catalysts - Tech Explorist", "description": "Nanostructure of platinum catalyst layers to optimize fuel cell efficiency.", "url": "https://www.techexplorist.com/cryo-imaging-reveals-layers-fuel-cell-catalysts/59323/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/04/platinum-nanoparticles.jpg", "publishedAt": "2023-04-24T09:45:54Z", "content": "Platinum-group-metal nanocatalysts based on carbon aggregates provide a porous structure through which an ionomer network percolates in proton exchange membrane fuel cells. This local structural char… [+3854 chars]"}, {"source": {"id": null, "name": "Geospatial World"}, "author": "Jeffy Jacob", "title": "First Mission to Measure Earth's Wind Patterns Powers Down - Geospatial World", "description": "The Aeolus mission closing on 30 April 2023 with a series of end life activities after achieving many significant accomplishments.", "url": "https://www.geospatialworld.net/prime/worlds-first-mission-measure-earths-wind-patterns-powers-down/", "urlToImage": "https://www.geospatialworld.net/wp-content/uploads/2023/04/Aeolus.jpeg", "publishedAt": "2023-04-24T09:33:45Z", "content": null}, {"source": {"id": null, "name": "EL PAÍS"}, "author": "Anthony King", "title": "Shedding light on the Sun - EL PAÍS USA", "description": "As questions abound about the Earth’s closest star, scientists are seeking answers critical to forecasting solar flares that threaten satellites and other electronics", "url": "https://english.elpais.com/science-tech/2023-04-24/shedding-light-on-the-sun.html", "urlToImage": "https://images.english.elpais.com/resizer/9V6lN_Eyzv1tTxJSOJ040gVZ0Pk=/1200x0/cloudfront-eu-central-1.images.arcpublishing.com/prisa/WDSFWEXBZFPVDP22V6OSIE2TJE.jpg", "publishedAt": "2023-04-24T09:26:40Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "AI experts to join future exoplanet hunt - Mint Lounge", "description": "The ongoing Ariel Data Challenge 2023 is inviting artificial intelligence and machine learning experts to help a new space mission on exoplanets", "url": "https://lifestyle.livemint.com/smart-living/innovation/ai-experts-to-join-future-exoplanet-hunt-111682317404352.html", "urlToImage": "https://images.livemint.com/img/2023/04/24/1140x641/Webb-Space-Telescope-Exoplanet-0_1682317650671_1682317678684.jpg", "publishedAt": "2023-04-24T09:03:20Z", "content": "Artificial intelligence (AI) experts have been invited to join the hunt for exoplanets by the Ariel Data Challenge 2023 which launched earlier this month on 14 April. AI experts will help a new space… [+2587 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Previously Unknown Relative of Giant Viruses Discovered - Technology Networks", "description": "Scientists have discovered the existence of mirusviruses: a major group of viruses abundant on the surface of the seas and oceans, where they infect single-celled plankton.", "url": "https://www.technologynetworks.com/immunology/news/previously-unknown-relative-of-giant-viruses-discovered-372487", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/372487/previously-unknown-relative-of-giant-viruses-discovered-372487-640x360.jpg?cb=20230424", "publishedAt": "2023-04-24T08:52:40Z", "content": "A team from the CEA and CNRS have discovered the existence of mirusviruses: a major group of viruses abundant on the surface of the seas and oceans, where they infect single-celled plankton. These fi… [+3389 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Experts Present Comprehensive Map Of Volcanoes On Venus — All 85,000 Of Them - India Education Diary", "description": "Intrigued by reports of recent volcanic eruptions on Venus? WashU planetary scientists Paul Byrne and Rebecca Hahn want you to use their new map of 85,000 volcanoes on Venus to help locate the next active lava flow.Their study was posted online ahead", "url": "https://indiaeducationdiary.in/experts-present-comprehensive-map-of-volcanoes-on-venus-all-85000-of-them/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/04/global-catalog-1536x1026-1-1024x684.jpg", "publishedAt": "2023-04-24T08:35:51Z", "content": "Intrigued by reports of recent volcanic eruptions on Venus? WashU planetary scientists Paul Byrne and Rebecca Hahn want you to use their new map of 85,000 volcanoes on Venus to help locate the next a… [+5270 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "NASA posts video of northern lights captured from International Space Station - News9 LIVE", "description": "The aurorae were captured from the cupola of the space station by NASA astronauts Josh Cassada and Nicole Mann", "url": "https://www.news9live.com/science/nasa-posts-video-of-northern-lights-captured-from-international-space-station-au941-2115729", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/04/iss053e023965-Cropped.jpg", "publishedAt": "2023-04-24T08:35:32Z", "content": "The aurorae were captured from the cupola of the space station by NASA astronauts Josh Cassada and Nicole Mann\r\nNASA has shared a time-lapse video of the northern lights or aurora borealis captured f… [+1726 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of Aging: Sirtuin Enzymes in the Spotlight - SciTechDaily", "description": "Penn State researchers have revealed how sirtuin enzymes interact with nucleosomes to regulate aging and metabolic processes. Their findings, using cryo-electron microscopy, may inform drug discovery efforts targeting sirtuins for biomedical applications. New…", "url": "https://scitechdaily.com/?p=269280", "urlToImage": "https://scitechdaily.com/images/SIRT6-in-Complex-With-Nucleosome.jpg", "publishedAt": "2023-04-24T08:27:13Z", "content": "ByPenn State UniversityApril 24, 2023\r\nNew images of the SIRT6 sirtuin enzymewhich regulates aging and other metabolic processeshelp explain how it is able to access genetic material within the cell.… [+6656 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Unraveling mystery of Medulla Nebula: What powers this Brain-like supernova remnant - Devdiscourse", "description": "Read more about Unravelling mystery of Medulla Nebula: What powers this brain-like supernova remnant? on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2427658-unravelling-mystery-of-medulla-nebula-what-powers-this-brain-like-supernova-remnant", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_04_2023_12_10_30_9133673.jpg?width=920&format=jpeg", "publishedAt": "2023-04-24T06:40:31Z", "content": "NASA's Astronomy Picture of the Day (APOD) features CTB-1, also known as the Medulla Nebula, a supernova remnant that resulted from the explosion of a massive star in the constellation of Cassiopeia … [+1074 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Webb Reveals Early-Universe Prequel to Huge Galaxy Cluster - NASA", "description": "NASAs James Webb Space Telescope has confirmed, for the first time, a protocluster of seven galaxies at a distance that astronomers refer to as redshift 7.9, or a mere 650 million years after the big bang.", "url": "https://www.nasa.gov/feature/goddard/2023/webb-reveals-early-universe-prequel-to-huge-galaxy-cluster", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/protocluster_small.png", "publishedAt": "2023-04-24T06:32:58Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 24 April 2023: What Star Death left behind-a Supernova - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is CTB-1, also known as the Medulla Nebula Supernova Remnant.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-24-april-2023-what-star-death-left-behind-a-supernova-71682316857143.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/24/1600x900/supernova_remnant_1682316923574_1682316934009.jpg", "publishedAt": "2023-04-24T06:16:37Z", "content": "When a star explodes during its death throes, it is known as a Supernova and it is the largest explosion to occur in space. According to NASA, a supernova happens where there is a change in the core,… [+1825 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Two Russian cosmonauts take part in spacewalk - AP Archive", "description": "(19 Apr 2023) RESTRICTION SUMMARY: MANDATORY CREDIT NASANASA - MANDATORY CREDIT NASAInternational Space Station - 19 April 2023 ++COMMENTARY AT SOURCE++++BUG...", "url": "https://www.youtube.com/watch?v=SNlCAGsM71w", "urlToImage": "https://i.ytimg.com/vi/SNlCAGsM71w/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AH-BIAC6AKKAgwIABABGDkgVChyMA8=&rs=AOn4CLCqmnnxqxNRCN63N2CvkfV6ExJZ7A", "publishedAt": "2023-04-24T05:33:29Z", "content": null}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Astronomers find discrepancy in methods used to measure composition of galaxies - News9 LIVE", "description": "The research can help better interpret observations by the James Webb Space Telescope", "url": "https://www.news9live.com/science/astronomers-find-discrepancy-in-methods-used-to-measure-composition-of-galaxies-au941-2115445", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/04/cover_suggestion_YChen-copy-sm-Cropped.jpg", "publishedAt": "2023-04-24T04:50:17Z", "content": "The research can help better interpret observations by the James Webb Space Telescope\r\nHydrogen, helium and lithium exist in space, but most other elements are cooked up in the furnaces within stars.… [+1861 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Chinese astronomers discover binary system with extremely low mass white dwarf - News9 LIVE", "description": "The discovered white dwarf is smaller than the theoretical limit for such objects", "url": "https://www.news9live.com/science/chinese-astronomers-discover-binary-system-resulting-in-extremely-low-mass-white-dwarf-au941-2115433", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/04/W020230421356496961293-Cropped.jpg", "publishedAt": "2023-04-24T04:40:24Z", "content": "The discovered white dwarf is smaller than the theoretical limit for such objects\r\nChinese astronomers have discovered an extremely low mass white dwarf (ELM-WD) in a binary system, using the Large S… [+1758 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "NASA is Sending Humans Back to the Moon, But it Won't Stop There. Next Comes Mars - Universe Today", "description": "NASA has released its Architecture Concept Review, which outlines the elements needed to accomplish it's \"Moon to Mars\" objectives.", "url": "https://www.universetoday.com/160994/nasa-is-sending-humans-back-to-the-moon-but-it-wont-stop-there-next-comes-mars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/04/nsp-2018_concept_01b-no-text_moon-mars2.jpeg", "publishedAt": "2023-04-24T04:37:21Z", "content": "NASA recently announced the astronauts that will make up the Artemis II crew. This mission will see the four-person crew conduct a circumlunar flight, similar to what the uncrewed Artemis I mission p… [+10125 chars]"}, {"source": {"id": null, "name": "The Hitavada"}, "author": "The Hitavada", "title": "What goes ‘moo’ and then explodes? - The Hitavada", "description": "By Gwynne Dyer  “WHEN I do a puzzle with my daughters, there is usually an elephant next to a giraffe next to a rhino,” said Prof Ron Milo of the Weizmann Institute of Science. “But if I was trying to gi", "url": "https://www.thehitavada.com/Encyc/2023/4/24/What-goes-moo-and-then-explodes-.html", "urlToImage": "https://www.thehitavada.com/Encyc/2023/4/24/explodes_202304241106257998_H@@IGHT_300_W@@IDTH_500.jpg", "publishedAt": "2023-04-24T04:30:00Z", "content": "“WHEN I do a puzzle with my daughters, there is usually an elephant next to a giraffe next to a rhino,” said Prof Ron Milo of the Weizmann Institute of Science. “But if I was trying to give them a mo… [+3977 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nuts About Science: The Brazil Nut Effect Shakes Up Physics - SciTechDaily", "description": "Physicists from the University of Utrecht and the Faculty of Physics at the University of Warsaw have observed — for the first time experimentally — the Brazil nut effect in a mixture of charged colloidal particles. Until now, it was thought that an influx of…", "url": "https://scitechdaily.com/nuts-about-science-the-brazil-nut-effect-shakes-up-physics/", "urlToImage": "https://scitechdaily.com/images/Brazil-Nut-Effect.jpg", "publishedAt": "2023-04-24T01:38:57Z", "content": "In a bag of mixed nuts, after shaking, smaller nuts fill in the gaps created at the bottom, pushing the larger Brazil nuts to the top. Credit: Melchoir, CC BY-SA 3.0, via Wikimedia Commons\r\nPhysicist… [+4250 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Shuvangi Sen Chaudhury", "title": "A guide to treating and avoiding skin peeling - Sportskeeda", "description": "Skin peeling is a common condition where the top layer of skin, or epidermis, begins to flake off.", "url": "https://www.sportskeeda.com/health-and-fitness/a-guide-treating-avoiding-skin-peeling", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/04/585a2-16822815452948-1920.jpg", "publishedAt": "2023-04-23T20:48:00Z", "content": "Skin peeling is a common condition where the top layer of skin, or epidermis, begins to flake off. That can happen for a variety of reasons, including exposure to sun, dryness, medical conditions and… [+3792 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Ian Atkinson", "title": "As megaconstellations grow, scientists become concerned with their impacts on astronomy - NASASpaceFlight.com - NASASpaceflight.com", "description": "Since their initial launch in 2019, SpaceX’s Starlink internet satellites have become infamous for photobombing…", "url": "https://www.nasaspaceflight.com/2023/04/megaconstellations-effects-on-astronomy/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2018/12/2018-12-07-23_28_59-hubble-photos-Google-Search.jpg", "publishedAt": "2023-04-23T20:23:11Z", "content": "11Since their initial launch in 2019, SpaceX’s Starlink internet satellites have become infamous for photobombing observations from ground-based telescopes. While Starlink — along with other satellit… [+7943 chars]"}, {"source": {"id": null, "name": "Themorningnews.com"}, "author": "Jay M", "title": "NASA Drone Completes 50 Flights Around Mars - The Morning News", "description": "NASA’s helicopter drone has completed its 50th flight around Mars, the agency revealed. The agency recently revealed that their ingenuity helicopter made history by completing 50 flights over the Red Planet. NASA’s ingenuity drone officially completed the mil…", "url": "https://themorningnews.com/news/2023/04/23/nasa-drone-completes-50-flights-around-mars/", "urlToImage": "https://themorningnews.com/wp-content/uploads/2023/04/hero-image.fill_.size_1200x675-1.jpg", "publishedAt": "2023-04-23T15:40:00Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Hybrid solar eclipse, once-in-a-decade natural phenomenon, draws tourists to small Australian town - WTVR CBS 6", "description": "Thursday's hybrid solar eclipse will last for 62 seconds. But for a small town in rural northwest Australia, the effects could linger on for a lifetime.  Tha...", "url": "https://www.youtube.com/watch?v=Z2nHTo7W_qg", "urlToImage": "https://i.ytimg.com/vi/Z2nHTo7W_qg/maxresdefault.jpg", "publishedAt": "2023-04-23T14:00:08Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Geomagnetic Storm alert! STRONG G3-class storm may hit Earth tomorrow - HT Tech", "description": "A stream of CMEs may trigger a strong geomagnetic storm on Earth tomorrow, NOAA forecasters suggested. What impact will it have on Earth? Read on.", "url": "https://tech.hindustantimes.com/tech/news/geomagnetic-storm-alert-strong-g3-class-storm-may-hit-earth-tomorrow-71682253056536.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/23/1600x900/matt-houghton-q_X-lyHxcdk-unsplash_1648564105696_1682253532609.jpg", "publishedAt": "2023-04-23T12:39:54Z", "content": "Earth-directed explosion on the Sun left the planet in the strike zone! A massive magnetic filament that was slithering across the southern hemisphere of the sun erupted on April 21st, hurling a clus… [+1989 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Lyrids Meteor Shower to peak today! - HT Tech", "description": "Lyrids Meteor Shower to peak today All you need to know about the Lyrids Meteor Shower as it peaks on April 2223. Check it out. In this year the Lyrids Meteor Shower would peak in the predawn hours of April 23. According to NASA on average the shower can prod…", "url": "https://tech.hindustantimes.com/web-stories/lyrids-meteor-shower-to-peak-today-71682250424021.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/23/1600x900/Geminids_Wirtanen_1682252006547_1682252093254.jpg/", "publishedAt": "2023-04-23T12:15:44Z", "content": "Photo Credit: NASA\r\n All you need to know about the Lyrids Meteor Shower as it peaks on April 22-23. Check it out.\r\nPhoto Credit: Pixabay\r\n In this year the Lyrids Meteor Shower would peak in the pre… [+1101 chars]"}, {"source": {"id": null, "name": "Spectrum"}, "author": "Michael Fergenson", "title": "Community Newsletter: Mass resignation at NeuroImage; new mouse brain atlas - Spectrum - Autism Research News ", "description": "The resignation of all the editors from two brain imaging journals caused quite a stir on social media this week, and a new 3D brain atlas turned some heads.", "url": "https://www.spectrumnews.org/news/community-newsletter-mass-resignation-at-neuroimage-new-mouse-brain-atlas/", "urlToImage": "https://spectrumnews-web-assets.s3.amazonaws.com/wp-content/uploads/2022/04/15150807/CommunitySpeech-844.jpg", "publishedAt": "2023-04-23T10:52:49Z", "content": "An announcement about a mass resignation from NeuroImage and NeuroImage: Reports caused a stir on Twitter this week.\r\nAll 42 of the journals editors resigned over opposition to author fees charged by… [+5150 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Daniel Strain", "title": "Grad student helps design 'artificial muscles' you can toss in the compost bin - Tech Xplore", "description": "Say \"hello\" to the robots of the future: They're soft and flexible enough to bounce off walls or squeeze into tight spaces. And when you're done with them, you can toss these machines into a compost bin to decompose.", "url": "https://techxplore.com/news/2023-04-grad-student-artificial-muscles-toss.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/grad-student-helps-des.jpg", "publishedAt": "2023-04-23T10:10:01Z", "content": "Say \"hello\" to the robots of the future: They're soft and flexible enough to bounce off walls or squeeze into tight spaces. And when you're done with them, you can toss these machines into a compost … [+6152 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "ANIKET DIXIT", "title": "Telescopes should be constructed by humans on the Moon - News Track English", "description": "USA: A revival in lunar exploration is taking place. By the end of this decade, dozens of missions coordinated by various space agencies—and increasingly by private companies—are planned to travel to the Moon. The majority of these will use modest robotic spa…", "url": "https://english.newstracklive.com/news/telescopes-should-be-constructed-by-humans-on-the-moon-sc71-nu355-ta355-1274567-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Apr/23/big_thumb/Screenshot-2023-04-23-151219_6444fdbd69e2c.png", "publishedAt": "2023-04-23T10:00:07Z", "content": "USA: A revival in lunar exploration is taking place. By the end of this decade, dozens of missions coordinated by various space agencies—and increasingly by private companies—are planned to travel to… [+4500 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hydrogen's Hidden Phase: Machine Learning Unlocks the Secrets of the Universe's Most Abundant Element - SciTechDaily", "description": "Putting hydrogen on solid ground: simulations with a machine learning model predict a new phase of solid hydrogen. A machine-learning technique developed by University of Illinois Urbana-Champaign researchers has revealed a previously undiscovered high-pressu…", "url": "https://scitechdaily.com/hydrogens-hidden-phase-machine-learning-unlocks-the-secrets-of-the-universes-most-abundant-element/", "urlToImage": "https://scitechdaily.com/images/New-Phase-of-Solid-Hydrogen-Predicted.jpg", "publishedAt": "2023-04-23T08:34:36Z", "content": "ByUniversity of Illinois Grainger College of EngineeringApril 23, 2023\r\nPhases of solid hydrogen. The left is the well-studied hexagonal close packed phase, while the right is the new phase predicted… [+7400 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 23 April 2023: Chilling water tornado - HT Tech", "description": "NASA Astronomy Picture of the Day for 23rd April shows a stunning waterspout in Florida. What is it? Read on.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-23-april-2023-chilling-water-tornado-71682233405746.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/23/1600x900/NASA_APOD_april_23_1682233580569_1682233593672.jpg", "publishedAt": "2023-04-23T07:07:36Z", "content": "NASA shares with the public a different captivating image of the fascinating universe every day. Today, NASA has shown a rare and chilling sight of a water phenomenon on Earth. \"What's happening over… [+1960 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Solar Orbiter gets closer to answering mystery of why Sun’s atmosphere is hotter than surface - The Indian Express", "description": "The Sun's corona is much hotter than its surface, and the reason for this has been a mystery for nearly eighty years. But now, the European Space Agency's Solar Orbiter may have brought in some new clues.", "url": "https://indianexpress.com/article/technology/science/solar-orbiter-sun-atmosphere-hotter-than-surface-magnetic-connection-8569961/", "urlToImage": "https://images.indianexpress.com/2023/04/Sun-magnetic-reconnection-20230422.jpg", "publishedAt": "2023-04-23T03:52:00Z", "content": "Even though the Sun is the primary source of energy for most lifeforms on the planet, there is a lot that we do not know about it. For example, we are not quite sure why its corona, in the outer atmo… [+2217 chars]"}]}