{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Discover a Weird Material Made of Subatomic Particles - ScienceAlert", "description": "Scientists are always looking for the next weird and wonderful material, and they've just found it: A bosonic correlated insulator to give it its technical name, which is both a new material and, indeed, a whole new state of matter.", "url": "https://www.sciencealert.com/scientists-discover-a-weird-material-made-of-subatomic-particles", "urlToImage": "https://www.sciencealert.com/images/2023/06/MoirePattern.jpg", "publishedAt": "2023-06-20T06:17:39Z", "content": "Scientists are always looking for the next weird and wonderful material, and they've just found it: A bosonic correlated insulator to give it its technical name, which is both a new material and, ind… [+3173 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Astronomers proposed a novel method to measure galaxy distances - Tech Explorist", "description": "Now, scientists don't need to rely on spectroscopic observations.", "url": "https://www.techexplorist.com/novel-method-measure-galaxy-distances/62480/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Local-Group.jpg", "publishedAt": "2023-06-20T06:09:13Z", "content": "Classical Cepheids and RR Lyrae (RR Lyr) are standard candles to measure galactic distances. Typically, fundamental-mode RR Lyr stars are used for distance measurements, and their accuracy is strongl… [+1299 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "A flash of green: NASA`s Juno spacecraft captures image of lightning on Jupiter - WION", "description": "A flash of green: NASAs Juno spacecraft captures image of lightning on Jupiter", "url": "https://www.wionews.com/science/a-flash-of-green-nasas-juno-spacecraft-captures-image-of-lightning-on-jupiter-606325", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/20/360760-copy-of-untitled-2.png", "publishedAt": "2023-06-20T05:24:56Z", "content": "NASA's Juno spacecraft is a gift that keeps on giving. Looping around Jupiter - the largest planet in our solar system, Juno recently captured an incredible shot of the greenish glow from a lightning… [+2120 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study discovers spectacular patterns found in 407-million-year-old plant - ThePrint", "description": "Washington [US], June 20 (ANI): Researchers found Leaf arrangements in the earliest plants differ from those in most modern plants, casting doubt on a long-held theory about the origins of a well-known mathematical pattern found in nature. The study was publi…", "url": "https://theprint.in/science/study-discovers-spectacular-patterns-found-in-407-million-year-old-plant/1633517/", "urlToImage": null, "publishedAt": "2023-06-20T05:14:14Z", "content": "Washington [US], June 20 (ANI): Researchers found Leaf arrangements in the earliest plants differ from those in most modern plants, casting doubt on a long-held theory about the origins of a well-kno… [+4322 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study finds new tool to study complex genome interactions - Devdiscourse", "description": "Researchers uncovered previously unknown information about the genome's spatial architecture by relying solely on Hi-C, a workhorse tool developed in 2009 to study DNA interactions.", "url": "https://www.devdiscourse.com/article/science-environment/2494335-study-finds-new-tool-to-study-complex-genome-interactions", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/20_06_2023_04_50_41_6617544.jpg?width=920&format=jpeg", "publishedAt": "2023-06-20T04:50:44Z", "content": "Researchers uncovered previously unknown information about the genome's spatial architecture by relying solely on Hi-C, a workhorse tool developed in 2009 to study DNA interactions. The study was pub… [+2945 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Here's why there could still be a ninth planet in our Solar System - EastMojo", "description": "In 2006 the solar system was left with only eight planets, when Pluto was no longer classified as such. Is it still possible there is a planet out there beyond Neptune – possibly way beyond it?", "url": "http://www.eastmojo.com/space/2023/06/20/there-could-still-be-a-ninth-planet-in-our-solar-system-heres-why/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/Untitled-design-2022-08-03T172309.053.png?fit=1920%2C1080&ssl=1", "publishedAt": "2023-06-20T02:50:00Z", "content": "We all used to think there were nine planets. But in 2006 the solar system was left with only eight planets, when Pluto was no longer classified as such. Is it still possible there is a planet out th… [+9177 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid hurtling towards Earth at fast pace; Will come dangerously close today! - HT Tech", "description": "An asteroid is expected to make its closest approach to Earth today, NASA has revealed. Will it impact Earth? Know shocking details.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-hurtling-towards-earth-at-fast-pace-will-come-dangerously-close-today-71687227269198.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/20/1600x900/asteroid_1681212528521_1681718818919_1681719004344_1687227413748.jpg", "publishedAt": "2023-06-20T02:17:18Z", "content": "An asteroid, given the designation of Asteroid 2023 LT1, is on its way towards Earth today, June 20. The asteroid was spotted by NASA's Defense Coordination Office (PDCO), which is responsible for mo… [+1801 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Earth's “Boring Billion” – Study Unveils 19-Hour Days in Earth's Deep Past - SciTechDaily", "description": "Contrary to traditional belief, Earth's day length was not consistently shorter in the past but may have stalled at about 19 hours for about a billion years, according to a study published in Nature Geoscience. This period of stable day length intriguingly co…", "url": "https://scitechdaily.com/earths-boring-billion-study-unveils-19-hour-days-in-earths-deep-past/", "urlToImage": "https://scitechdaily.com/images/Earths-Opposing-Tides.jpg", "publishedAt": "2023-06-20T02:06:03Z", "content": "ByChinese Academy of SciencesJune 19, 2023\r\n600-million-year-old sedimentary rock preserving Milankovitch cycles that allow for Earths ancient day length to be detected. Credit: Ross Mitchell\r\nContra… [+5014 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sounak Mukhopadhyay", "title": "Venus, Mars, Moon to light up the twilight sky for summer solstice: Date, when and how to watch | Mint - Mint", "description": "On June 21, a right-angle triangle will form between Mars, Venus, and a 13% illuminated crescent moon. Stargazers will be treated to remarkable sights throughout the solstice week.", "url": "https://www.livemint.com/science/news/venus-mars-moon-to-light-up-the-twilight-sky-for-summer-solstice-date-when-and-how-to-watch-11687225263143.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/06/20/600x338/Sun_Moon_1687225832290_1687225847439.jpg", "publishedAt": "2023-06-20T01:55:41Z", "content": "The summer solstice, which falls on June 21, usually marks a significant celestial event with the sun reaching its highest point in the Northern Hemisphere. However, this year, stargazers are in for … [+2135 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Skipping Evolution: The Kangaroos That Didn't Hop - SciTechDaily", "description": "According to a comprehensive analysis by scientists from the University of Bristol and the University of Uppsala, extinct kangaroos didn't hop like their modern counterparts do. Despite the popular view of hopping as a hallmark of kangaroo evolution, the rese…", "url": "https://scitechdaily.com/skipping-evolution-the-kangaroos-that-didnt-hop/", "urlToImage": "https://scitechdaily.com/images/Kangaroo-Jumping.jpg", "publishedAt": "2023-06-20T00:24:03Z", "content": "ByUniversity of BristolJune 19, 2023\r\nExtinct kangaroos displayed more diverse locomotion patterns than their modern counterparts, including quadrupedal bounding, climbing, and slower hopping, accord… [+5235 chars]"}, {"source": {"id": null, "name": "Asu.edu"}, "author": null, "title": "ASU study: Satellite captures carbon dioxide aurora from space - ASU News Now", "description": "While the night sky, with its display of \"northern lights\" or aurora, has captivated the attention of scientists and sky gazers for centuries, much less is known about the aurora associated with carbon dioxide until now. To observe elevated infrared signals f…", "url": "https://news.asu.edu/20230619-asu-study-satellite-captures-carbon-dioxide-aurora-space", "urlToImage": "https://news.asu.edu/sites/default/files/screen_shot_2023-06-15_at_4.37.39_pm.png", "publishedAt": "2023-06-19T21:53:34Z", "content": "June 19, 2023While the night sky, with its display of \"northern lights\" or auroras, has captivated the attention of scientists and sky gazers for centuries, much less is known about the aurora associ… [+4030 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jared Sagoff", "title": "Scientists use supercomputer to detail HIV protein mechanism crucial for drug development - Phys.org", "description": "Every disease has a protein basis.", "url": "https://phys.org/news/2023-06-scientists-supercomputer-hiv-protein-mechanism.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/scientists-use-superco.jpg", "publishedAt": "2023-06-19T20:32:29Z", "content": "Every disease has a protein basis.\r\nFor some diseases, like HIV, changes in protein structure are critical for how the virus infects a person's cells.\r\nResearchers at the University of Illinois Chica… [+4789 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Astronomers Discover Second-Ever White Dwarf Pulsar - Sci.News", "description": "White dwarf pulsars include a rapidly spinning, burnt-out stellar remnant called a white dwarf, which lashes a companion red dwarf with powerful beams of electrical particles and radiation.", "url": "https://www.sci.news/astronomy/second-white-dwarf-pulsar-12016.html", "urlToImage": "https://cdn.sci.news/images/2016/07/image_4059f-AR-Scorpii.jpg", "publishedAt": "2023-06-19T19:28:27Z", "content": "White dwarf pulsars include a rapidly spinning, burnt-out stellar remnant called a white dwarf, which lashes a companion red dwarf with powerful beams of electrical particles and radiation, causing t… [+4192 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "VIDEO: Can research in space help treat infectious diseases on Earth? - Healio", "description": "HOUSTON &mdash; In this video, Cheryl A. Nickerson, PhD, professor of life sciences at the Biodesign Center for Fundamental and Applied Microbiomics at Arizona State University, explains the benefits of microbiological research in space.", "url": "https://www.healio.com/news/infectious-disease/20230619/video-can-research-in-space-help-treat-infectious-diseases-on-earth", "urlToImage": "https://www.healio.com/~/media/images/fscss/i3wyanokecdncom/healio_safe_image.png", "publishedAt": "2023-06-19T19:14:15Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nHOUSTON — In this video, Cheryl A. Nicke… [+505 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Cassini data reveals the presence of phosphorus in Enceladus' ocean plumes - NASASpaceFlight.com - NASASpaceflight.com", "description": "A team of scientists, using archival data from NASA’s now-retired Cassini mission, has discovered the…", "url": "https://www.nasaspaceflight.com/2023/06/enceladus-phosphorus/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/06/1_pia11688_enceladus-geysers-1041.jpg", "publishedAt": "2023-06-19T18:49:12Z", "content": "12A team of scientists, using archival data from NASA’s now-retired Cassini mission, has discovered the presence of phosphorus in the massive plumes of water being ejected from the southern regions o… [+7264 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Matt Williams, Universe Today", "title": "The Biggest Hazard for Astronauts on the Moon May Be Right Under Their Feet - Inverse", "description": "Lunar regolith is a major hazard for missions heading to the Moon. And it could be worse on some missions than others.", "url": "https://www.inverse.com/science/astronauts-will-be-tracking-dust-into-the-lunar-gateway-is-this-a-problem", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/6/14/138cb2a9-0fd2-4b4d-9ae5-e3b90516906d-nasa-astronauts-lunar-south-pole.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-19T18:00:24Z", "content": "Lunar regolith (also known as Moondust) is a major hazard for missions heading to the Moon. Its everywhere on the surface 5 to 10 meters (~16.5 to 33 feet) in depth in some places not to mention jagg… [+7204 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": "Keith Cowing", "title": "Hubble Captures a Billowing Irregular Galaxy - Space Ref", "description": "The galaxy NGC 7292 billows across this image from the NASA/ESA Hubble Space Telescope", "url": "https://spaceref.com/science-and-exploration/hubble-captures-a-billowing-irregular-galaxy/", "urlToImage": "https://media2.spaceref.com/wp-content/uploads/2023/06/19130637/hubble_ngc7292_potw2324a.jpg", "publishedAt": "2023-06-19T17:48:47Z", "content": "The galaxy NGC 7292 billows across this image from the NASA/ESA Hubble Space Telescope, accompanied by a handful of bright stars and the indistinct smudges of extremely distant galaxies in the backgr… [+1311 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "Theoretical Breakthrough Could Finally Solve the Mystery of Invisible Dark Matter - The Debrief", "description": "A team of researchers says the lack of clumpiness in the universe could help to shed new light on the composition of dark matter.", "url": "https://thedebrief.org/theoretical-breakthrough-could-finally-solve-the-mystery-of-invisible-dark-matter/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2023/06/dark-matter.jpg", "publishedAt": "2023-06-19T16:42:23Z", "content": "A team of Canadian researchers says that the lack of clumpiness in the structure of the universe could help to shed new light on the composition of dark matter.\r\nA hypothetical form of matter believe… [+4983 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "EPFL researchers achieve near-perfect control of individual molecules for improving sensing precision - News-Medical.Net", "description": "Aleksandra Radenovic, head of the Laboratory of Nanoscale Biology in the School of Engineering, has worked for years to improve nanopore technology, which involves passing a molecule like DNA through a tiny pore in a membrane to measure an ionic current.", "url": "https://www.news-medical.net/news/20230619/EPFL-researchers-achieve-near-perfect-control-of-individual-molecules-for-improving-sensing-precision.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/78486183-620x480.jpg", "publishedAt": "2023-06-19T16:23:00Z", "content": "Aleksandra Radenovic, head of the Laboratory of Nanoscale Biology in the School of Engineering, has worked for years to improve nanopore technology, which involves passing a molecule like DNA through… [+3799 chars]"}, {"source": {"id": null, "name": "Screen Rant"}, "author": "Nathaniel Roark", "title": "George Lucas Was 37 Years Ahead Of Science: New Tatooine-Like Planet With Twin Suns Discovered - Screen Rant", "description": "Planets like Tatooine existing in real life were long thought impossible, but George Lucas was 37 years ahead of science when creating Star Wars.", "url": "https://screenrant.com/star-wars-george-lucas-tatooine-twin-suns-science/", "urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2021/05/Tatooine-Star-Wars.jpg", "publishedAt": "2023-06-19T16:00:00Z", "content": "Star Warscreator George Lucas truly was ahead of his time, as a recent scientific discovery confirms the existence of a Tatooine-like planet with twin suns. For decades, the idea of planets orbiting … [+3398 chars]"}, {"source": {"id": null, "name": "World Nuclear News"}, "author": null, "title": "Nuclear-powered 'flashlight' to be developed for lunar studies : New Nuclear - World Nuclear News - World Nuclear News", "description": "An X-ray \"flashlight\" which would use an energy source based on Ultra Safe Nuclear Corporation's EmberCore nuclear chargeable ceramic technology to map the lunar surface has been selected for early-stage funding under the NASA Innovative Advanced Concepts pro…", "url": "https://www.world-nuclear-news.org/Articles/Nuclear-powered-flashlight-to-be-developed-for-lun", "urlToImage": null, "publishedAt": "2023-06-19T15:46:48Z", "content": "19 June 2023\r\nAn X-ray \"flashlight\" which would use an energy source based on Ultra Safe Nuclear Corporation's (USNC) EmberCore nuclear chargeable ceramic technology to map the lunar surface has been… [+2977 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "JWST molecular mapping and characterization of Enceladus’ water plume feeding its torus - Nature.com", "description": "The extensive water plume that originates from Enceladus and extends up to 40 Enceladus radii is mapped and characterized by JWST. Data suggest a sustained and uninterrupted plume activity spanning decades and a surface dominated by crystalline H2O ice. No ot…", "url": "https://www.nature.com/articles/s41550-023-02009-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41550-023-02009-6/MediaObjects/41550_2023_2009_Fig1_HTML.png", "publishedAt": "2023-06-19T15:38:37Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Powerful M-class solar flare sparks blackout over Atlantic Ocean! NOAA shares details - HT Tech", "description": "An unstable sunspot, AR3335 has exploded producing a solar flare that triggered blackouts over the Atlantic Ocean.", "url": "https://tech.hindustantimes.com/tech/news/powerful-m-class-solar-flare-sparks-blackout-over-atlantic-ocean-noaa-shares-details-71687186301079.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/19/1600x900/sun_1680171356966_1687186424522.jpg", "publishedAt": "2023-06-19T14:55:30Z", "content": "Over the recent weeks, the Sun has emitted massive amounts of energy in the form of solar flares. While some of these flares unleashed from the Sun pass harmlessly into space, others hit Earth, resul… [+2110 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Earth Knocked Over By 80Cm On Rotational Axis: Groundwater Overuse Leads To Earth Being Tilted| BUZZ - India Today", "description": "Humans have pumped so much water out of the ground that it has effectively affected Earth's spin, and the pole has drifted at a speed of 4.36 centimeters per...", "url": "https://www.youtube.com/watch?v=NvjCeIQt3Qk", "urlToImage": "https://i.ytimg.com/vi/NvjCeIQt3Qk/maxresdefault.jpg", "publishedAt": "2023-06-19T14:39:47Z", "content": null}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "New Method of Analyzing and Imaging Biological Samples - AZoOptics", "description": "On a microscopic level, there are several ways to image biological samples, and every way has its own advantages and disadvantages.", "url": "https://www.azooptics.com/News.aspx?newsID=28333", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_28333_16871757482727652.png", "publishedAt": "2023-06-19T14:25:00Z", "content": "On a microscopic level, there are several ways to image biological samples, and every way has its own advantages and disadvantages. For the first time, a team of researchers, along with those from th… [+4101 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Mysterious spiral signals in the human brain could be key to our cognition - Livescience.com", "description": "Scientists suggest strange swirls across the outer layer of the brain might be used to link different parts of it together and help process information faster", "url": "https://www.livescience.com/health/neuroscience/mysterious-spiral-signals-in-the-human-brain-could-be-key-to-our-cognition", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YCrFyncMQmzUKHkK3r8XcP-1200-80.jpg", "publishedAt": "2023-06-19T14:17:47Z", "content": "Mysterious, spiral signals have been discovered in the human brain, and the scientists who found the swirls think they could help to organize complex brain activity.\r\nThe signals, which appeared as s… [+3820 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "Geminid meteors - INSIGHTSIAS - Insights IAS", "description": "Source: Hindustan Times  Context: Researchers demystify the unusual origin of the Geminids meteor shower. NASA’s Parker Solar Probe mission is providing new evidence that a violent, catastrophic event created the Geminids. Findings: While most meteor showers …", "url": "https://www.insightsonindia.com/2023/06/19/geminid-meteors/", "urlToImage": null, "publishedAt": "2023-06-19T13:48:20Z", "content": null}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Nukso Chakma", "title": "5 Exciting Exoplanets Detected by NASA Since 2020 - Asiana Times", "description": "Since the unveiling of the first full-colour images by the James Webb Space Telescope in July 2022 as well as footage from the Kepler Space Telescope, our knowledge of the universe and space has greatly expanded over recent years. Alongside jaw-dropping disco…", "url": "https://asianatimes.com/5-exciting-exoplanets-detected-by-nasa-since-2020/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/06/Exoplanets-Image.jpg", "publishedAt": "2023-06-19T13:35:22Z", "content": "Since the unveiling of the first full-colour images by the James Webb Space Telescope in July 2022 as well as footage from the Kepler Space Telescope, our knowledge of the universe and space has grea… [+3385 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "Climate modeling suggests monsoon origination up to 40 million years ago - Phys.org", "description": "Monsoons are seasonal climate conditions resulting from changes in wind that bring extreme drought or rain, depending upon the time of year. Those occurring in south Asia and east Asia are affected by a combination of atmospheric and oceanographic conditions.…", "url": "https://phys.org/news/2023-06-climate-monsoon-million-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/climate-modelling-sugg.jpg", "publishedAt": "2023-06-19T13:26:50Z", "content": "Monsoons are seasonal climate conditions resulting from changes in wind that bring extreme drought or rain, depending upon the time of year. Those occurring in south Asia and east Asia are affected b… [+4997 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Video Team", "title": "Are Aliens likely to make first contact with AI & not humans? - WION", "description": "The AI boom is happening all over the world. The majority of buzzwords these days are related to AI. And it's only a matter of time before AI would be linked to phenomena such as aliens & UFOs. Likely to feel a kinship with AI, aliens may soon make contact wi…", "url": "https://www.wionews.com/videos/are-aliens-likely-to-make-first-contact-with-ai-not-humans-606148", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/19/1906_WION_ORG_ALIENS_AI_WEB-1687179622-00000003.jpg", "publishedAt": "2023-06-19T13:00:01Z", "content": "© 2023. Indiadotcom Digital Private Limited. All Rights Reserved."}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Euclid Telescope Poised to Unravel Universe's Mysteries - Transcontinental Times", "description": "UNITED KINGDOM: In a few weeks’ time, scientists hope to unlock the secrets of the cosmos as the highly anticipated European space probe, Euclid, prepares to embark on a groundbreaking mission. With a staggering budget of €1 billion ($1.10 billion), it aims t…", "url": "https://www.transcontinentaltimes.com/euclid-telescope-universes-mysteries/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/ESA.jpg", "publishedAt": "2023-06-19T12:16:56Z", "content": "UNITED KINGDOM: In a few weeks’ time, scientists hope to unlock the secrets of the cosmos as the highly anticipated European space probe, Euclid, prepares to embark on a groundbreaking mission. With … [+3162 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Delineation of partial melts and crustal heterogeneities within the crust beneath Kumaon Himalaya, India from Lg wave attenuation | Scientific Reports - Nature.com", "description": "Scientific Reports - Delineation of partial melts and crustal heterogeneities within the crust beneath Kumaon Himalaya, India from Lg wave attenuation", "url": "https://www.nature.com/articles/s41598-023-36269-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-36269-z/MediaObjects/41598_2023_36269_Fig1_HTML.png", "publishedAt": "2023-06-19T12:11:49Z", "content": null}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Ameya Paleja", "title": "SUIT: Special telescope to track Sun's magnetic field ready for India's first solar mission - Interesting Engineering", "description": "The Solar Ultraviolet Imaging Telescope, which will provide full disk images of the Sun in the 2000 to 4000 A wavelength range, will be part of the Aditya-L1 mission.", "url": "https://interestingengineering.com/science/suit-telescope-sun-magnetic-india-solar-mission", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/19/image/jpeg/JaeEtGa88saM9TBTwwirs7hPMHhjl3qHaZ7sxysp.jpg", "publishedAt": "2023-06-19T11:56:00Z", "content": "The mission will carry seven payloads to study various aspects of the Sun such as the photosphere - the visible surface, chromosphere - the layer of plasma, and corona - the outermost layer using a r… [+1064 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Chemically engineered unzipped multiwalled carbon nanotube and rGO nanohybrid for ultrasensitive picloram detection in rice water and soil samples | Scientific Reports - Nature.com", "description": "Scientific Reports - Chemically engineered unzipped multiwalled carbon nanotube and rGO nanohybrid for ultrasensitive picloram detection in rice water and soil samples", "url": "https://www.nature.com/articles/s41598-023-34536-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-34536-7/MediaObjects/41598_2023_34536_Fig1_HTML.png", "publishedAt": "2023-06-19T11:50:32Z", "content": null}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Gravitational Influence on Quantum Spins - AZoQuantum", "description": "A collaborative research group led by Prof. Dong Sheng and Prof. Zhengtian Lu from the Chinese Academy of Sciences (CAS) investigated the coupling effect between neutron spin and gravitational force using a high-precision xenon isotope magnetometer.", "url": "https://www.azoquantum.com/News.aspx?newsID=9625", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/SocialSharingImage_9625_16871742001014722.jpg", "publishedAt": "2023-06-19T11:30:00Z", "content": "A collaborative research group led by Prof. Dong Sheng and Prof. Zhengtian Lu from the Chinese Academy of Sciences (CAS) investigated the coupling effect between neutron spin and gravitational force … [+2574 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Texas A&M Expert, Collaborators Spot Universe’s Most Distant Organic Molecules - India Education Diary", "description": "An international team of astronomers has detected complex organic molecules in the most distant galaxy to date using NASA’s James Webb Space Telescope.The discovery of the molecules, which are familiar on Earth in smoke, soot and smog, demonstrates t", "url": "https://indiaeducationdiary.in/texas-am-expert-collaborators-spot-universes-most-distant-organic-molecules/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/spilker-justin-jwst-nature-002-2048x1152-1-1024x576.jpg", "publishedAt": "2023-06-19T11:19:09Z", "content": "An international team of astronomers has detected complex organic molecules in the most distant galaxy to date using NASAs James Webb Space Telescope.\r\nThe discovery of the molecules, which are famil… [+5552 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Astronomers observed the longest tails of gas yet escaping a planet - Tech Explorist", "description": "The planet losing its atmosphere.", "url": "https://www.techexplorist.com/longest-tails-gas-yet-escaping-planet/62456/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/HAT-P-32b.jpg", "publishedAt": "2023-06-19T11:16:06Z", "content": "Using observations from Hobby-Eberly Telescope (HET), astronomers at the University of Texas at Austins McDonald Observatory have discovered some of the longest tails of Helium escaping a Jupiter-lik… [+1909 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Europe's BepiColombo spacecraft to zoom within 150 miles of Mercury in close flyby today - Space.com", "description": "The flyby will help the BepiColombo spacecraft reduce its speed so that it can enter Mercury's orbit in two and a half years.", "url": "https://www.space.com/mercury-flyby-bepicolombo-spacecraft-june-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/i4R2VPgzZrVh2JYZ35dKje-1200-80.jpg", "publishedAt": "2023-06-19T10:00:41Z", "content": "Europe's Mercury probe BepiColombo will take a close look at its target planet on Monday (June 19), and we can expect some exciting new images to reach Earth soon after that. \r\nThe flyby will be Bepi… [+4389 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "A space object revolving around a star is hotter than the Sun - WION", "description": "A space object revolving around a star is hotter than the Sun", "url": "https://www.wionews.com/science/a-space-object-revolving-around-a-star-is-hotter-than-the-sun-606060", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/19/360581-brown-dwarf.jpg", "publishedAt": "2023-06-19T09:50:23Z", "content": "So what does our default understanding of the Universe say? If a space object is revolving around a star, it will be a planet and relatively a cool body, right? This logic is in keeping with things i… [+2005 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists developed a new method to manipulate the shape and tight packing of DNA - Tech Explorist", "description": "Folding the code of life.", "url": "https://www.techexplorist.com/new-method-manipulate-shape-tight-packing-dna/62432/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/packaging-of-DNA.jpg", "publishedAt": "2023-06-19T09:47:18Z", "content": "The compaction and organization of genomic DNA is a central mechanism in eukaryotic cells, but engineered architectural control over double-stranded DNA (dsDNA) is notably challenging. Aarhus Univers… [+2603 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 19 June 2023: Spooky Lagoon Nebula! - HT Tech", "description": "NASA Astronomy Picture of the Day for June 19, 2023, features a breathtaking view of the center of Lagoon Nebula. What is it? NASA explains.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-19-june-2023-spooky-lagoon-nebula-71687167595762.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/19/1600x900/LagoonCenter_HubblePobes_960_1687167694119_1687167702514.jpg", "publishedAt": "2023-06-19T09:42:27Z", "content": "Nebulae are vast cosmic formations consisting of dust and gas -- which originate from various sources, such as the ejected material of a dying star, like a supernova explosion. Moreover, certain nebu… [+2143 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "NASA Timelapse Video Captures Earth in All Its Glory at Night from Space - Times Now", "description": "NASA has shared a stunning timelapse video of the Earth at night, recorded from the International Space Station (ISS). The footage provides a captivating glimpse of atmospheric phenomena, including the dance of the northern lights and thunderstorms, from the …", "url": "https://www.timesnownews.com/viral/nasa-timelapse-video-captures-earth-in-all-its-glory-at-night-from-space-article-101103092", "urlToImage": "https://static.tnn.in/thumb/msid-101103092,updatedat-1687167426476,width-1280,height-720,resizemode-75/101103092.jpg", "publishedAt": "2023-06-19T09:37:00Z", "content": "04:04\r\nAdipurush Row: After Kathmandu, Nepals Pokharo Bans Indian Cinema, PIL Filed In Delhi, Mumbai"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Parasites As Fountain Of Youth? Study Finds Infected Ants Live Much Longer - NDTV", "description": "The parasite that affects these ants is a tapeworm called Anomotaenia brevis that is found in several types of woodpecker.", "url": "https://www.ndtv.com/science/parasites-as-fountain-of-youth-study-finds-infected-ants-live-much-longer-4133526", "urlToImage": "https://c.ndtvimg.com/2022-09/u9l1dag8_ant-generic-unsplash_625x300_26_September_22.jpg", "publishedAt": "2023-06-19T09:23:32Z", "content": "The parasite also gives these ants a strangely idyllic lifestyle. (Representational Pic)\r\nParasitic infections are usually harmful to their hosts, but there can be some exceptions. Scientists recentl… [+1795 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Research Finds Planted Vegetation Speeds Up Dune Erosion During Extreme Storms - India Education Diary", "description": "Newly planted vegetation on coastal sand dunes can accelerate erosion from extreme waves, a study involving researchers from the Oregon State University College of Engineering suggests.The authors note the findings run counter to the widely accepted", "url": "https://indiaeducationdiary.in/research-finds-planted-vegetation-speeds-up-dune-erosion-during-extreme-storms/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/header_138-1024x481.jpg", "publishedAt": "2023-06-19T07:57:59Z", "content": "Newly planted vegetation on coastal sand dunes can accelerate erosion from extreme waves, a study involving researchers from the Oregon State University College of Engineering suggests.\r\nThe authors … [+2961 chars]"}, {"source": {"id": null, "name": "SaltWire Network"}, "author": "Reuters Inc.", "title": "Indonesia, SpaceX launch satellite to boost internet connectivity - Saltwire", "description": "Explore stories from Atlantic Canada.", "url": "https://www.saltwire.com/nova-scotia/business/indonesia-spacex-launch-satellite-to-boost-internet-connectivity-100865440/", "urlToImage": "https://www.saltwire.com/static/img/default_og_image.png", "publishedAt": "2023-06-19T07:08:09Z", "content": "JAKARTA (Reuters) - Indonesia and Elon Musk's rocket company SpaceX on Monday launched the country's largest telecommunication satellite from the United States, in a $540 million project intended to … [+1147 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Only Scientist To Walk On The Moon Discovered He Was Allergic To Lunar Dust - Indiatimes.com", "description": "Imagine landing on the Moon only to realise that you're allergic to Moon dust. That's exactly what happened with Apollo 17 astronaut Harrison H. Schmitt, who realised that the dust on Moon was triggering his allergies.Schmitt is now 87-years-old and is among …", "url": "https://www.indiatimes.com/technology/science-and-future/scientist-walk-on-the-moon-allergic-to-lunar-dust-606381.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jun/FBImage---2023-06-19T125949241_649003f8ac0c8.jpg", "publishedAt": "2023-06-19T07:02:26Z", "content": "Imagine landing on the Moon only to realise that you're allergic to Moon dust. That's exactly what happened with Apollo 17 astronaut Harrison H. Schmitt, who realised that the dust on Moon was trigge… [+2930 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Surreal 'Einstein Cross' Spotted in Space After Distant Supernova - ScienceAlert", "description": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it – collectively referred to as the cosmic distance ladder.", "url": "https://www.sciencealert.com/surreal-einstein-cross-spotted-in-space-after-distant-supernova", "urlToImage": "https://www.sciencealert.com/images/2023/06/GravitationalLensEinsteinCross_UT.jpg", "publishedAt": "2023-06-19T06:30:07Z", "content": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it collectively referred to as the cosmic distance ladder.\r\nOne particularly crucial tool is type I… [+4141 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": "Puja Molpariya", "title": "‘It’s a Perfect Probiotic’ to Take Mercury-like Heavy Metals Out of the Body and Absorb Useful Nutritional Ones - Revyuh", "description": "Now it is safe to consume fish-based diets, as a new study demonstrates how a 'Probiotic' removes methylmercury from the intestines while leaving the", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/its-a-perfect-probiotic-to-take-mercury-like-heavy-metals-out-of-the-body-and-absorb-useful-nutritional-ones/", "urlToImage": "https://www.revyuh.com/wp-content/uploads/2023/06/Its-a-Perfect-Probiotic-to-Take-Mercury-like-Heavy-Metals-Out-of-the-Body-and-Absorb-Nutritional-Ones.jpg", "publishedAt": "2023-06-19T06:18:48Z", "content": "Fish, as a primary source of protein and healthful fats, constitutes a vital part of the diet for over three billion individuals across the globe. In particular, dietary regimens such as the Mediterr… [+3284 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Astronomers discover pair of Hot Neptune exoplanets using TESS observations - News9 LIVE", "description": "Both TOI 3353b and TOI 3353c are in close orbits around the host star, which is at a distance of 257 lightyears from the Earth.", "url": "https://www.news9live.com/science/astronomers-discover-pair-of-hot-neptune-exoplanets-using-tess-observations-2183219", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/935086e2-4692-4233-bbd5-47ac13e0762f-Cropped.jpg", "publishedAt": "2023-06-19T06:12:52Z", "content": "Both TOI 3353 b and TOI 3353 c are in close orbits around the host star, which is at a distance of 257 lightyears from the Earth. The two worlds have been discovered in orbit around a young Sun-like … [+1883 chars]"}, {"source": {"id": null, "name": "Editorialge.com"}, "author": null, "title": "Is It Possible that a Black Hole Contains Earth? - Editorialge", "description": "When people on Earth look up into space, the Milky Way seems to be filled with billions of stars. But if we look even further out, could we find proof that we", "url": "https://editorialge.com/is-it-possible-that-a-black-hole-contains-earth/", "urlToImage": "https://editorialge.com/wp-content/uploads/2023/06/Black-Hole-1.jpg", "publishedAt": "2023-06-19T06:07:44Z", "content": "When people on Earth look up into space, the Milky Way seems to be filled with billions of stars. But if we look even further out, could we find proof that we are in a place even more amazing, like a… [+3574 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Scientists detect gaseous urea in atmosphere of Earth for first time - News9 LIVE", "description": "Reduced nitrogen which is an important nutrient to support life, can be redistributed across the planet by the atmosphere.", "url": "https://www.news9live.com/science/scientists-detect-gaseous-urea-in-atmosphere-of-earth-for-first-time-2183084", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/hugh-whyte-AK0GpTNwDlA-unsplash-Cropped.jpg", "publishedAt": "2023-06-19T05:50:57Z", "content": null}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Naima Syed", "title": "Insights on Sun with NASA’s Parker Probe - Asiana Times", "description": "Sun, unlike earth, is not a hard mass of land and water. Instead, the sun is defined equal to an igneous orb containing typically elemental helium and hydrogen. The sun, which is the center of our solar system and the magnanimous object of our solar system, h…", "url": "https://asianatimes.com/insights-on-sun-with-nasas-parker-probe/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/06/Nat-geo.jpg", "publishedAt": "2023-06-19T05:34:29Z", "content": "Sun, unlike earth, is not a hard mass of land and water. Instead, the sun is defined equal to an igneous orb containing typically elemental helium and hydrogen. The sun, which is the center of our so… [+2465 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Earth Could Feasibly Descend Into Chaos, Physicists Warn - ScienceAlert", "description": "The impact of human activity on the Earth system could result in unpredictable chaos from which there is no return, physicists have calculated.", "url": "https://www.sciencealert.com/earth-could-feasibly-descend-into-chaos-physicists-warn", "urlToImage": "https://www.sciencealert.com/images/2023/06/SunriseOverEarthHorizon.jpg", "publishedAt": "2023-06-19T02:59:21Z", "content": "The impact of human activity on the Earth system could result in unpredictable chaos from which there is no return, physicists have calculated.\r\nUsing a theory conceived to model superconductivity, a… [+4272 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": null, "title": "Heterogeneous Catalysis Reaction Optimisation | Lab Equipment - Technology Networks", "description": "At the forefront of flow reactor design, FlowSyn™ from Uniqsis sets the standard for automated optimisation of heterogeneous catalysis reactions. Continuous flow catalytic reactions using FlowSyn™ reactors have shown considerable time savings, high reproducib…", "url": "https://www.technologynetworks.com/biopharma/products/heterogeneous-catalysis-reaction-optimisation-374061", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374061/heterogeneous-catalysis-reaction-optimisation-374061-640x360.jpg?cb=20230613", "publishedAt": "2023-06-19T01:07:47Z", "content": null}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Links: June 18, 2023 | Hackaday - Hackaday", "description": "Will it or won’t it? That’s the question much on the minds of astronomers, astrophysicists, and the astro-adjacent this week as Betelgeuse continued its pattern of mysterious behavior t…", "url": "https://hackaday.com/2023/06/18/hackaday-links-june-18-2023/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2023-06-18T23:00:00Z", "content": "Will it or won’t it? That’s the question much on the minds of astronomers, astrophysicists, and the astro-adjacent this week as Betelgeuse continued its pattern of mysterious behavior that might port… [+4246 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Why Peanuts ‘Dance’ When Dropped in Beer - VOA Learning English", "description": "When peanuts are dropped into a glass of beer, they sink to the bottom before floating up and \"dancing\" in the glass. The scientists say the research helps them understand mineral extraction or bubbling magma in the layer of Earth called the crust.", "url": "https://learningenglish.voanews.com/a/why-peanuts-dance-when-dropped-in-beer/7137354.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-6157-08db6ca9bfd9_w1200_r1.jpg", "publishedAt": "2023-06-18T21:57:08Z", "content": "When peanuts are dropped into a glass of beer, they sink to the bottom before floating up and \"dancing\" in the glass.\r\nScientists investigated this process in a study involving the alcoholic drink be… [+3169 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Black Hole Emits Jets of X-rays 60,000 Times Hotter than Sun–the Brightest Quasar Ever Observed - Good News Network", "description": "Jets of light 60,000 times hotter than the sun have been captured by astronomers observing a quasar—the most powerful object in the universe.", "url": "https://www.goodnewsnetwork.org/black-hole-emits-jets-of-x-rays-60000x-hotter-than-sun/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/06/Artist-impression-of-quasar-Credit-NOIRLabNSFAURAJ.-da-Silva-CC-license-SWNS.jpg", "publishedAt": "2023-06-18T21:18:41Z", "content": "Artists impression of a quasar Credit NOIRLab / NSF / AURA / J. da Silva, CC license SWNS\r\nJets of light 100,000 billion times brighter than the sun have been captured by astronomers observing a quas… [+2997 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "NASA's Perseverance Rover Captures View of Mars' Belva Crater - Pragativadi", "description": "The six-wheeled scientist encountered the crater during its latest science campaign in search of rock samples that could be brought to Earth for deeper investigation.The Mastcam-Z instrument aboard NASA’s Perseverance Mars rover recently collected 15", "url": "https://pragativadi.com/nasas-perseverance-rover-captures-view-of-mars-belva-crater/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2023/06/Mars-Belva-Crater.png", "publishedAt": "2023-06-18T20:24:59Z", "content": "The six-wheeled scientist encountered the crater during its latest science campaign in search of rock samples that could be brought to Earth for deeper investigation.\r\nThe Mastcam-Z instrument aboard… [+3524 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Alberto Domínguez, David Valls-Gabaud, Hervé Dole, Jonathan Biteau, José Fonseca, Juan Garcia-Bellido, Simon Driver", "title": "Why is the sky dark at night? The 200-year history of a question that transformed our understanding of the Universe - The Conversation", "description": "The darkness of the night sky seems so obvious as to need no explanation – yet it has intrigued and baffled scientists for centuries.", "url": "https://theconversation.com/why-is-the-sky-dark-at-night-the-200-year-history-of-a-question-that-transformed-our-understanding-of-the-universe-206575", "urlToImage": "https://images.theconversation.com/files/528678/original/file-20230527-19-36mvgt.jpeg?ixlib=rb-1.1.0&rect=0%2C25%2C3428%2C1711&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2023-06-18T20:08:12Z", "content": "As dawn rose over the German city of Bremen on May 7 1823, Heinrich Olbers put the finishing touches to an article that left his name in history. After the deaths of his wife and daughter, Dr Olbers … [+7313 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Fungus farming ants work hard to maintain healthy gardens - Earth.com", "description": "Fungus farming ants work hard to maintain healthy gardens • Earth.com", "url": "https://www.earth.com/news/fungus-farming-ants-work-hard-to-maintain-healthy-gardens/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/18135535/ants_agaricus_fungus-farming_1medium-1000x750.jpg", "publishedAt": "2023-06-18T19:59:27Z", "content": "The secret to a flourishing, healthy garden is to ‘weed early and often.’ Surprisingly, we share this gardening principle with certain ant species. They are master gardeners who have been perfecting … [+7091 chars]"}, {"source": {"id": null, "name": "Hot Hardware"}, "author": "Tim Sweezy", "title": "NASA Reports A 110-Foot Asteroid Is Heading Earth’s Way At High Speed - Hot Hardware", "description": "Five space rocks will be making close approaches to Earth between today and June 21, with the largest spanning 180-feet in diameter.", "url": "https://hothardware.com/news/110-foot-asteroid-is-heading-earths-way", "urlToImage": "https://images.hothardware.com/contentimages/newsitem/61866/content/hero-asteroid-psyche-nasa.jpg", "publishedAt": "2023-06-18T16:15:00Z", "content": "NASA has reported that two asteroids 100-feet (30-meters) or larger are making their closest approach to Earth today, June 18, 2023. The larger of the two asteroids is estimated to be 110-feet (34-me… [+2011 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "First Measurement of Electron Spin in Kagome Quantum Materials - SciTechDaily", "description": "An international research team has succeeded for the first time in measuring the electron spin in matter — i.e., the curvature of space in which electrons live and move — within \"kagome materials,\" a new class of quantum materials. The results obtained — publ…", "url": "https://scitechdaily.com/first-measurement-of-electron-spin-in-kagome-quantum-materials/", "urlToImage": "https://scitechdaily.com/images/Abstract-Physics-Spin.jpg", "publishedAt": "2023-06-18T12:02:39Z", "content": "ByUniversity of BolognaJune 18, 2023\r\nFor the first time, an international research team has measured the electron spin in a new class of quantum materials called kagome materials, potentially transf… [+5035 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Handing over European Service Module for Artemis II - European Space Agency", "description": null, "url": "https://www.esa.int/Science_Exploration/Human_and_Robotic_Exploration/Orion/Handing_over_European_Service_Module_for_Artemis_II", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/06/european_service_module-2_for_artemis_ii/24926417-2-eng-GB/European_Service_Module-2_for_Artemis_II_pillars.jpg", "publishedAt": "2023-06-15T15:19:16Z", "content": "Science &amp; Exploration15/06/20235420 views68 likes\r\nMoving European Service Module-2 for Artemis II\r\nIn the presence of one of the four Artemis astronauts that will rely on the European Service Mo… [+1888 chars]"}]}