{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Structural biology: Molecular scissors caught in the act: Structure of an enzyme crucial for tRNA maturation sheds light on cause of neurodegenerative disorders - Science Daily", "description": "In all living organisms, the biomolecule transfer RNA (tRNA) plays a fundamental role in protein production. tRNAs are generated from precursor molecules in several steps. The enzyme tRNA splicing endonuclease (TSEN), among other things, catalyzes one step in…", "url": "https://www.sciencedaily.com/releases/2023/07/230713142016.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-14T02:08:01Z", "content": "Transfer RNAs (tRNAs) are among the most common types of RNA in a cell and are indispensable for protein production in all known organisms. They have an important \"translation\" function: They determi… [+3364 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "Webb Space Telescope reveals moment of stellar birth, dramatic close-up of 50 baby stars - HT Tech", "description": "NASA unveiled the latest snapshot on Wednesday, revealing 50 baby stars in a cloud complex 390 light-years away. A light-year is nearly 6 trillion miles (9.7 trillion kilometers).", "url": "https://tech.hindustantimes.com/tech/news/webb-space-telescope-reveals-moment-of-stellar-birth-dramatic-close-up-of-50-baby-stars-71689272645296.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/14/1600x900/Webb_Space_Telescope__1689298764529_1689298764775.jpg", "publishedAt": "2023-07-14T01:43:54Z", "content": "The Webb Space Telescope is marking one year of cosmic photographs with one of its best yet: the dramatic close-up of dozens of stars at the moment of birth.\r\nNASA unveiled the latest snapshot on Wed… [+2216 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SETI Live: Searching for ET at the Heart of the Milky Way - SETI Institute", "description": "If an alien civilization wanted to communicate with other civilizations throughout the Milky Way, the galaxy’s core holds potential as a strategic site for a...", "url": "https://www.youtube.com/watch?v=XMa9YFRDZG0", "urlToImage": "https://i.ytimg.com/vi/XMa9YFRDZG0/maxresdefault_live.jpg", "publishedAt": "2023-07-13T21:31:12Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "China to land astronauts on the moon! Preliminary plan released - VideoFromSpace", "description": "China intends to land astronauts on the moon by 2030. The \"preliminary plan\" is explained by Chinese Manned Space Agency (CMSA) deputy chief designer Zhang H...", "url": "https://www.youtube.com/watch?v=8bI8n6GeKiI", "urlToImage": "https://i.ytimg.com/vi/8bI8n6GeKiI/maxresdefault.jpg", "publishedAt": "2023-07-13T21:23:10Z", "content": null}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Earth’s Day was a Constant 19.5 Hours for Almost 1.5 Billion Years, Study Says - Sci.News", "description": "New research shows that from approximately 2 billion until 600 million years ago, an atmospheric tide driven by the Sun countered the effect of the Moon, keeping Earth’s rotational rate steady and the length of day at a constant 19.5 hours.", "url": "https://www.sci.news/othersciences/geoscience/earth-day-length-12093.html", "urlToImage": "https://cdn.sci.news/images/2021/05/image_9674f-Early-Earth.jpg", "publishedAt": "2023-07-13T21:19:43Z", "content": "New research from the University of Toronto shows that from approximately 2 billion until 600 million years ago, an atmospheric tide driven by the Sun countered the effect of the Moon, keeping Earths… [+3276 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "James Webb Telescope catches glimpse of possible first-ever 'dark stars' - EurekAlert", "description": "Three bright objects initially identified as galaxies in observations from the James Webb Space Telescope might actually represent an exotic new form of star. If confirmed, the discovery would also shed light on the nature of dark matter.", "url": "https://www.eurekalert.org/news-releases/995502", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/8c045016-6915-48aa-8479-ead4aab5972e/Rendition/thumbnail/Content/Public", "publishedAt": "2023-07-13T20:52:29Z", "content": "image: These three objects (JADES-GS-z13-0, JADES-GS-z12-0, and JADES-GS-z11-0) were originally identified as galaxies in December 2022 by the JWST Advanced Deep Extragalactic Survey (JADES). Now, a … [+5829 chars]"}, {"source": {"id": null, "name": "Rtinsights.com"}, "author": "Elizabeth Wallace", "title": "Robots Designed for Space Could Serve on Earth, Too - RTInsights", "description": "Squishy Robotics has collaborated with major fire departments and is developing mobile robots in addition to its current stationary ones.", "url": "https://www.rtinsights.com/robots-designed-for-space-could-serve-on-earth-too/", "urlToImage": "https://www.rtinsights.com/wp-content/uploads/2023/07/squishy-robotics-e1689280178270.jpg", "publishedAt": "2023-07-13T20:31:30Z", "content": "Squishy Robotics has collaborated with major fire departments and aims to develop mobile models of its robots in addition to its current stationary ones.\r\nSpherical robots funded by the NASA Early St… [+2583 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul M. Sutter", "title": "Tidal capture of an asteroid by a magnetar - Phys.org", "description": "Recently astronomers have been able to associate two seemingly unrelated phenomena: an explosive event known as a fast radio burst and the change in speed of a spinning magnetar. And now new research suggests that the cause of both of these is the destruction…", "url": "https://phys.org/news/2023-07-tidal-capture-asteroid-magnetar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/tidal-capture-of-an-as.jpg", "publishedAt": "2023-07-13T20:26:30Z", "content": "Recently astronomers have been able to associate two seemingly unrelated phenomena: an explosive event known as a fast radio burst and the change in speed of a spinning magnetar. And now new research… [+3806 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul M. Sutter", "title": "Dynamical dark energy might explain strange 21-cm signal - Phys.org", "description": "Dark energy may evolve in time, and it may even connect through a new force of nature with dark matter. A researcher believes that we may have already seen evidence for this. Their findings have been reported on the preprint server arXiv.", "url": "https://phys.org/news/2023-07-dynamical-dark-energy-strange-cm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/dynamical-dark-energy.jpg", "publishedAt": "2023-07-13T20:07:27Z", "content": "Dark energy may evolve in time, and it may even connect through a new force of nature with dark matter. A researcher believes that we may have already seen evidence for this. Their findings have been… [+2954 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "Climate change has shifted colour of over half of world's oceans: Study - Daily Excelsior", "description": "NEW DELHI, July 13: The colour of over 56 per cent of the world’s oceans, larger than Earth’s total land expanse, has changed significantly over the last two decades and human-caused climate change is likely the driver, according to researchers. These colour …", "url": "https://www.dailyexcelsior.com/climate-change-has-shifted-colour-of-over-half-of-worlds-oceans-study/", "urlToImage": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2019/12/sea-levels-in-indian-ocean.jpg", "publishedAt": "2023-07-13T19:18:07Z", "content": "NEW DELHI, July 13: The colour of over 56 per cent of the world’s oceans, larger than Earth’s total land expanse, has changed significantly over the last two decades and human-caused climate change i… [+2847 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "After Chandrayaan-3, these are the missions rushing to Moon in 2023 - Republic World", "description": "ISRO's Chandrayaan-3 mission to the Moon will be followed by Russia's Luna-25, Japan's SLIM and two others by private US companies.", "url": "https://www.republicworld.com/science/space/after-chandrayaan-3-these-are-the-missions-rushing-to-moon-in-2023-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/i9lt5witlnpq3o6y_1689261447.jpeg", "publishedAt": "2023-07-13T18:35:00Z", "content": "The Moon truly has become the hotbed for space exploration as several private and government-owned agencies have planned their missions to the Earth's nearest neighbour. In the second half of 2023 al… [+3207 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "SpaceX preps for launch of new batch of Starlink internet satellites on Friday - Devdiscourse", "description": "Read more about SpaceX preps for launch of new batch of Starlink internet satellites on Friday on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2522708-spacex-preps-for-launch-of-new-batch-of-starlink-internet-satellites-on-friday", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_02_2023_10_33_43_09215.jfif?width=920&format=jpeg", "publishedAt": "2023-07-13T17:50:20Z", "content": "SpaceX is gearing up for yet another Starlink mission launch to low-Earth orbit. The company is targeting Friday, July 14 at 12:40 a.m. ET (4:40 UTC) for the launch of 54 Starlink satellites on a Fal… [+1420 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Pallava Bagla", "title": "Various Phases Of Chandryaan-3's Long Mission Explained - NDTV", "description": "Chandrayaan-3 is all about showcasing India's ability to soft land on a celestial body. It is a complex mission and lessons have been learnt from the failure of the lander Vikram, which crash-landed on the moon during Chandrayaan-2. NDTV's former science edit…", "url": "https://www.ndtv.com/video/news/news/various-phases-of-chandryaan-3-s-long-mission-explained-711241", "urlToImage": "https://c.ndtvimg.com/2023-07/p4ko6bec_chandryaan_160x120_13_July_23.jpg", "publishedAt": "2023-07-13T17:49:05Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "ULA delays Vulcan rocket's debut to late 2023 after fireball during test - Space.com", "description": "The rocket was originally supposed to fly in early May.", "url": "https://www.space.com/ula-vulcan-rocket-first-flight-delay-late-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pGRoHz3cDdRjXjJrGHQTv5-1200-80.jpg", "publishedAt": "2023-07-13T17:30:57Z", "content": "We'll have to wait a bit longer for the first flight of United Launch Alliance's (ULA) new heavy-lift rocket.\r\nThe Vulcan Centaur is now scheduled to debut in late 2023, provided the rest of its deve… [+3817 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "In Pics | CME clouds to collide with Earth and cause solar storm - Moneycontrol", "description": "Solar storms propel streams of electrically charged particles, as well as magnetic fields, towards Earth at incredibly high speeds, often exceeding millions of miles per hour.", "url": "https://www.moneycontrol.com/news/photos/science/in-pics-cme-clouds-to-collide-with-earth-and-cause-solar-storm-10954671.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/07/solarstorm-effects-770x433.jpg", "publishedAt": "2023-07-13T15:37:21Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "The 21-cm forest probe may unlock secrets of early universe, nature of dark matter - Phys.org", "description": "The mystery of the formation of the first galaxies in the universe is a puzzle for researchers. The nature of dark matter is also one of the most important mysteries faced by fundamental physicists. However, understanding the nature of dark matter—for example…", "url": "https://phys.org/news/2023-07-cm-forest-probe-secrets-early.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/exploring-dark-matter.jpg", "publishedAt": "2023-07-13T14:49:57Z", "content": "The mystery of the formation of the first galaxies in the universe is a puzzle for researchers. The nature of dark matter is also one of the most important mysteries faced by fundamental physicists. … [+5035 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Fell", "title": "'Lava lamp' vesicles show how cells could self-organize - Phys.org", "description": "The inside of a living cell is crowded with large, complex molecules. New research on how these molecules could spontaneously organize themselves could further our understanding of how cells manage their essential biochemistry in the crowded space. This resea…", "url": "https://phys.org/news/2023-07-lava-lamp-vesicles-cells-self-organize.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/lava-lamp-vesicles-sho.jpg", "publishedAt": "2023-07-13T14:44:20Z", "content": "The inside of a living cell is crowded with large, complex molecules. New research on how these molecules could spontaneously organize themselves could further our understanding of how cells manage t… [+3836 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Amazing Video Soars Through James Webb's Dazzling 3D View of Universe - Futurism", "description": "Scientists have created a breathtaking, three-dimensional visualization of a recent James Webb Space Telescope survey of ancient galaxies.", "url": "https://futurism.com/the-byte/video-james-webb-3d-universe", "urlToImage": "https://wp-assets.futurism.com/2023/07/video-james-webb-3d-universe.jpg", "publishedAt": "2023-07-13T13:50:41Z", "content": "Soaring through space -- at 200 million light-years per second.\r\nStar Field\r\nScientists have created a breathtaking three-dimensional visualization of a recent James Webb Space Telescope survey of an… [+1779 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Sade Agard", "title": "Video: First-of-its-kind microscope captures stunning views of the brain - Interesting Engineering", "description": "You can watch it being engineered right here.", "url": "https://interestingengineering.com/innovation/first-of-its-kind-microscope-brain", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/13/image/jpeg/4eP9BkpRY17BxF2WpxeEtmo0Y5SAeYsLHk9zu1pW.jpg", "publishedAt": "2023-07-13T13:44:00Z", "content": "Impressively, they could image specific features, such as corticospinal neurons in the motor cortex of macaque monkeys and trace axons in human white matter.\r\nThe researchers utilized special fluores… [+2213 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Euclid's large halo around indefinitely small point - European Space Agency", "description": null, "url": "https://www.esa.int/Enabling_Support/Operations/Euclid_s_large_halo_around_indefinitely_small_point", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2023/07/euclid_s_orbit_from_launch_to_lagrange_point_2/24988621-1-eng-GB/Euclid_s_orbit_from_launch_to_Lagrange_point_2_pillars.png", "publishedAt": "2023-07-13T13:43:27Z", "content": "Enabling &amp; Support13/07/2023286 views7 likes\r\nThis animation, created using Gaia Sky, shows Euclids path from Earth to this unique and useful position in space. Located about 1.5 million kilometr… [+4164 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Ken Kingery", "title": "Sticky, slippery, water repellent channels form maze-like, gravity-powered biomedical devices - Medical Xpress", "description": "Biomedical engineers at Duke University have developed an entirely new approach to building point-of-care diagnostic devices that only use gravity to transport, mix and otherwise manipulate the liquid droplets involved. The demonstration requires only commerc…", "url": "https://medicalxpress.com/news/2023-07-sticky-slippery-repellent-channels-maze-like.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/sticky-slippery-water.jpg", "publishedAt": "2023-07-13T13:09:10Z", "content": "Biomedical engineers at Duke University have developed an entirely new approach to building point-of-care diagnostic devices that only use gravity to transport, mix and otherwise manipulate the liqui… [+5988 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Discovery leads to controversy as scientists collect fragments from interstellar meteor | The World - ABC News (Australia)", "description": "An expedition to recover fragments from the first interstellar meteor known to have landed on Earth has attracted controversy in the Pacific. The ABC can rev...", "url": "https://www.youtube.com/watch?v=pX7vwFjA698", "urlToImage": "https://i.ytimg.com/vi/pX7vwFjA698/maxresdefault.jpg", "publishedAt": "2023-07-13T13:08:24Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA shelves Janus asteroid mission after launch delay - Space.com", "description": "The two small spacecraft, which were supposed to launch with the agency's Psyche asteroid probe, will be put in storage.", "url": "https://www.space.com/nasa-shelves-janus-asteroid-mission", "urlToImage": null, "publishedAt": "2023-07-13T13:00:41Z", "content": "NASA has put its Janus asteroid mission on ice after a launch delay made the twin probes' target systems inaccessible.\r\nThe two small Janus spacecraft were originally supposed to launch with the agen… [+3161 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Deep space orbit to provide non-traditional resting place; Stunning Webb telescope image shows closest star-forming region and more - Devdiscourse", "description": "Both the rockets will enter the moon's orbit and after a successful docking the astronauts will enter the lunar lander to descend onto the moon's surface, state media reported on Wednesday, citing a China Manned Space Agency engineer.", "url": "https://www.devdiscourse.com/article/science-environment/2522220-science-news-roundup-deep-space-orbit-to-provide-non-traditional-resting-place-stunning-webb-telescope-image-shows-closest", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_07_2023_17_16_57_9142363.png?width=920&format=jpeg", "publishedAt": "2023-07-13T12:59:16Z", "content": "Following is a summary of current science news briefs.\r\nDeep space orbit to provide non-traditional resting place\r\nGerry and Elizabeth Paulus love taking road trips across the United States, and soon… [+3572 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Sudeep Singh Rawat", "title": "NASA CHAPEA 1 mission: Locked volunteers inside Mars simulator for 378 days - Business Standard", "description": "NASA's Mars Mission: NASA began its ambitious mission by locking four volunteers inside a Mars simulator, CHAPEA 1 for 378 days. It is one of the three simulators that volunteers will have to experience in the future", "url": "https://www.business-standard.com/technology/tech-news/nasa-chapea-1-mission-locked-volunteers-inside-mars-simulator-for-378-days-123071300655_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2023-07/13/full/1689247588-3068.png", "publishedAt": "2023-07-13T12:02:57Z", "content": "NASA locked four volunteers inside a Mars simulator, called CHAPEA 1"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Dhanshree Shripad Shenwai, Dhanshree Shripad Shenwai", "title": "Microsoft AI Research Introduce a Novel Deep Learning Framework Called Distributional Graphormer (DiG) to Predict the Equilibrium Distribution of Molecular Systems. - MarkTechPost", "description": "A molecule's structure dictates its properties and functions. That is why structure prediction is a major issue in molecular science. Molecular scientists are hailing the breakthrough accuracy of deep learning approaches like AlphaFold and RoseTTAFold in iden…", "url": "https://www.marktechpost.com/2023/07/13/microsoft-ai-research-introduce-a-novel-deep-learning-framework-called-distributional-graphormer-dig-to-predict-the-equilibrium-distribution-of-molecular-systems/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/07/Screenshot-2023-07-12-at-11.15.00-PM.png", "publishedAt": "2023-07-13T12:00:00Z", "content": "A molecule’s structure dictates its properties and functions. That is why structure prediction is a major issue in molecular science. Molecular scientists are hailing the breakthrough accuracy of dee… [+3727 chars]"}, {"source": {"id": null, "name": "Biotecnika.org"}, "author": "Diluxi Arya", "title": "AI Breakthrough: Revolutionary Protein Design Tools Transforming Medicine and Beyond - BioTecNika", "description": "AI Breakthrough: Revolutionary Protein Design Tools Transforming Medicine and Beyond. Cutting-edge AI technology creates custom proteins.", "url": "https://www.biotecnika.org/2023/07/ai-breakthrough-revolutionary-protein-design-tools-transforming-medicine-beyond/", "urlToImage": "https://cdn.biotecnika.org/wp-content/uploads/2023/07/NABI-Project-Vacancies-For-1.jpg", "publishedAt": "2023-07-13T11:34:37Z", "content": "AI Breakthrough: Revolutionary Protein Design Tools Transforming Medicine and Beyond\r\nCutting-edge AI technology creates custom proteins with game-changing potential for therapeutics, vaccines, and b… [+4884 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "7 Animals With The Best Eyesight - Zee News", "description": "7 Animals With The Best Eyesight.", "url": "https://zeenews.india.com/web-stories/viral/7-animals-with-the-best-eyesight-2634945", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/07/13/1240221-animals-best-eyesight.jpg", "publishedAt": "2023-07-13T11:26:59Z", "content": "Eagles have highly evolved vision, which allows them to see their prey moving around on the ground from a distance. The big-footed birds of prey can see clearly about eight times as far as humans can."}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Pale blue dot 2.0: Tiny Earth and tinier Moon spotted by Mars orbiter - WION", "description": "Pale blue dot 2.0: Tiny Earth and tinier Moon spotted by Mars orbiter", "url": "https://www.wionews.com/science/pale-blue-dot-20-tiny-earth-and-tinier-moon-spotted-by-mars-orbiter-615141", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/07/13/366593-copy-of-untitled-6.png", "publishedAt": "2023-07-13T11:07:40Z", "content": "Three decades on, scientists have captured a picture, eerily similar to the one captured by the Voyager 1 spacecraft that Carl Sagan described as seeing a \"pale blue dot\", referring to our home - pla… [+2499 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "The 'man in the moon' may be hundreds of millions of years older than we thought - Livescience.com", "description": "Much of the moon's surface is 200 million years older than previously estimated, a new analysis suggests.", "url": "https://www.livescience.com/space/the-moon/the-man-in-the-moon-may-be-hundreds-of-millions-of-years-older-than-we-thought", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jKH8Msbe67iK34RugSUthS-1200-80.jpg", "publishedAt": "2023-07-13T11:00:00Z", "content": "Part of the moon's surface is much older than experts previously thought, with many of the craters pockmarking the iconic \"man in the moon\" predating that landform by hundreds of millions of years, n… [+3276 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Speculations of solar storms causing 'internet apocalypse' spark confusion, NASA offers clarification - The Economic Times", "description": "NASA has debunked rumours about an  internet apocalypse  caused by solar storms, that could disrupt global connectivity for months. While a severe solar storm is unlikely, its potential economic impact in the US alone could be $11bn per day. Computer science …", "url": "https://economictimes.indiatimes.com/news/new-updates/speculations-of-solar-storms-causing-internet-apocalypse-spark-confusion-nasa-offers-clarification/articleshow/101728250.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101728180,width-1070,height-580,imgsize-8238,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-13T10:53:00Z", "content": "With speculation of an \"internet apocalypse\" on the horizon, NASA has been forced to offer clarification on the rumours. Rumours have spread that the probability of solar storms reaching a 'maximum,'… [+1454 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Scientists discover extensive array of protein folds unexplored in nature - Drug Target Review", "description": "A study out of Japan reveals diversity of protein structures and how they fold in nature, uncovering a myriad of protein topologies.", "url": "https://www.drugtargetreview.com/news/110807/scientists-discover-extensive-array-of-protein-folds-unexplored-in-nature/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/protein-folds.jpg", "publishedAt": "2023-07-13T10:21:35Z", "content": "Posted: 13 July 2023 | Izzy Wood (Drug Target Review) | No comments yet\r\nA study out of Japan reveals diversity of protein structures and how they fold in nature, uncovering a myriad of protein topol… [+3883 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Life beyond Earth? NASA's Perseverance rover finds diverse organic matter on Mars - Down To Earth Magazine", "description": "A high possibility for past habitability exists at the rover&rsquo;s landing site in Jezero Crater", "url": "https://www.downtoearth.org.in/news/science-technology/life-beyond-earth-nasa-s-perseverance-rover-finds-diverse-organic-matter-on-mars-90595", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2023-07-13/0.58722900_1689229627_mars.jpg", "publishedAt": "2023-07-13T10:01:41Z", "content": "A high possibility for past habitability exists at the rover’s landing site in Jezero CraterThe United States National Aeronautics and Space Administration’s (NASA) Perseverance rover has discovered … [+4275 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Liquid Water on Earth-Like Alien Worlds Hundred Times More Likely, Study Reveals | Weather.com - The Weather Channel", "description": "Recently, a group of scientists from the USA presented their work at the Goldschmidt Conference in Lyon, France, revealing that Earth-like exoplanets teeming with liquid water may be far more abundant than previously believed.", "url": "https://weather.com/en-IN/india/space/news/2023-07-13-liquid-water-on-earth-like-alien-worlds-hundred-times-more-likely", "urlToImage": "https://s.w-x.co/in-exoplanet_frozen.jpg", "publishedAt": "2023-07-13T08:33:33Z", "content": "While at first glance, the vast expanse of our cosmos doesnt scream habitability, and Earth may seem the only exception. But the closer we look, the more possibilities we unravel. Analysing Earth-lik… [+3173 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Universe's Age Under Scrutiny: New Study Suggests It Could Be Twice As Old - Indiatimes.com", "description": "The funniest thing about the universe is that whenever we feel like we know enough about it, a new detail creeps in. This time, a new study has the potential to upend our basic understanding of how old the universe might be.For the longest time, scientists ha…", "url": "https://www.indiatimes.com/technology/science-and-future/universes-age-under-scrutiny-608970.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jul/FBImage17_64afbd663be42.jpg", "publishedAt": "2023-07-13T08:33:04Z", "content": "The funniest thing about the universe is that whenever we feel like we know enough about it, a new detail creeps in. This time, a new study has the potential to upend our basic understanding of how o… [+2353 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Davenport", "title": "Physicists work to prevent information loss in quantum computing - Phys.org", "description": "Nothing exists in a vacuum, but physicists often wish this weren't the case. If the systems that scientists study could be completely isolated from the outside world, things would be a lot easier.", "url": "https://phys.org/news/2023-07-physicists-loss-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/physicists-work-to-pre.jpg", "publishedAt": "2023-07-13T08:32:35Z", "content": "Nothing exists in a vacuum, but physicists often wish this weren't the case. If the systems that scientists study could be completely isolated from the outside world, things would be a lot easier.\r\nT… [+4541 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Heena Sharma", "title": "10 Most Captivating Stargazing Spots Across the Globe! - WION", "description": "10 Most Captivating Stargazing Spots Across the Globe!", "url": "https://www.wionews.com/web-stories/travel/10-most-captivating-stargazing-spots-across-the-globe-1689234786794", "urlToImage": null, "publishedAt": "2023-07-13T08:07:28Z", "content": "Located in southwestern Africa, it is a vast expanse of pristine desert. It is an International Dark Sky Reserve, meaning it has exceptionally low light pollution."}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Butterfly species with large brains have a survival benefit - Tech Explorist", "description": "Heliconius butterflies developed larger brains.", "url": "https://www.techexplorist.com/butterfly-species-large-brains-survival-benefit/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/Butterfly.jpg", "publishedAt": "2023-07-13T07:31:24Z", "content": "Animal behavior, senses, and cognitive capacities result from evolutionary advances and brain system modifications. The nervous system has evolved to allow animals to sense and interact with their su… [+4901 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "Oldest Ever Genetic Data Recovered from Ancient Human who Lived 2 Million Years Ago - NewsClick", "description": "The genetic information is from the African hominin named Paranthropus Robustus.", "url": "https://www.newsclick.in/oldest-ever-genetic-data-recovered-ancient-human-who-lived-2-million-years-ago", "urlToImage": "https://www.newsclick.in/sites/default/files/2023-07/oldest_DNA.jpg", "publishedAt": "2023-07-13T07:27:46Z", "content": "Scientists have recently reported about extracting genetic information from an ancient human relative that lived around two million years ago. This has been said to be the oldest of such data. The ge… [+3989 chars]"}, {"source": {"id": null, "name": "ecns"}, "author": null, "title": "New superconductor discovered by scientists in Guangzhou - ecns", "description": "Chinese scientists have observed high-temperature superconductivity in single crystals of a nickelate, which will help solve the superconductivity mechanism and unleash more applications in fields such as information technology and aerospace technology.", "url": "http://www.ecns.cn/news/2023-07-13/detail-ihcrchef5347923.shtml", "urlToImage": "http://i2.chinanews.com.cn/simg/hpic/2023/07-13/pic1-41472283.jpeg", "publishedAt": "2023-07-13T05:35:41Z", "content": "Chinese scientist Wang Meng shows a sample of a nickelate, which has been found to have high-temperature superconductivity. (Photo provided to chinadaily.com.cn)\r\nChinese scientists have observed hig… [+1334 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Colossal 890-foot asteroid approaching Earth rapidly! NASA reveals key details - HT Tech", "description": "While smaller asteroids tend to pass Earth nearly every day, NASA has issued an alert against a mammoth, stadium-sized asteroid that will come very close to the planet soon.", "url": "https://tech.hindustantimes.com/tech/news/colossal-890-foot-asteroid-approaching-earth-rapidly-nasa-reveals-key-details-71689223086055.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/13/1600x900/orbit-viewer-snapshot_1689223150794_1689223165652.jpg", "publishedAt": "2023-07-13T04:40:41Z", "content": "NASA monitors asteroids for any potential danger to Earth and tracks their orbits to minimize the uncertainty around the close approaches. When its telescopes track a new Near-Earth Asteroid (NEA), N… [+2195 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Mass Of Earth-Like Rock Found Under The Far Side Of The Moon, Say Scientists - Forbes", "description": "A mass of granite has been found under the surface of the moon. Only traces of granite have previously been found on the moon in samples from NASA's Apollo missions.", "url": "https://www.forbes.com/sites/jamiecartereurope/2023/07/12/mass-of-hot-rock-found-under-the-far-side-of-the-moon-say-scientists/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/604ba4c1b5078d1ac3b701df/0x0.jpg?format=jpg&crop=1976,1889,x0,y159,safe&width=1200", "publishedAt": "2023-07-12T23:15:00Z", "content": "A NASA satellite image shows the far side of the moon as it crosses between the DSCOVR spacecraft ... [+] and the Earth, at one million miles away,.released August 5, 2015.\r\nGetty Images\r\nScientists … [+2773 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Astronaut Stephen Bowen speaks from the International Space Station - WAAY-TV 31 News", "description": "CNN video NA-18WE. Subscribe to WAAY on YouTube: https://bit.ly/3RbqKw6", "url": "https://www.youtube.com/watch?v=BSObrKiKyUg", "urlToImage": "https://i.ytimg.com/vi/BSObrKiKyUg/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGD0gXyhyMA8=&rs=AOn4CLCgjHKczSSGMUhSiBiulFlTDN1L2w", "publishedAt": "2023-07-12T22:32:15Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sea Snakes Regained Color Vision via Rare Genetic Evolution - Neuroscience News", "description": "Early snakes lost their color vision during their adaptation to dim-light burrowing lifestyles, but sea snakes, which inhabit brighter marine environments, regained color vision.", "url": "https://neurosciencenews.com/color-vision-snake-genetics-23618/", "urlToImage": "https://neurosciencenews.com/files/2023/07/sea-snake-color-vision-neurosicnes.jpg", "publishedAt": "2023-07-12T21:43:36Z", "content": "Summary: A new study reveals the annulated sea snake has evolved to perceive a wider range of colors than its ancestors.\r\nEarly snakes lost their color vision during their adaptation to dim-light bur… [+5507 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Meet the Mars Samples: Robine and Malay (Samples 6 and 7) - NASA Jet Propulsion Laboratory", "description": "Meet two of the Martian samples that have been collected and are awaiting return to Earth as part of the Mars Sample Return campaign. As of late June 2023, N...", "url": "https://www.youtube.com/watch?v=LtazZzbAxN0", "urlToImage": "https://i.ytimg.com/vi/LtazZzbAxN0/maxresdefault.jpg", "publishedAt": "2023-07-12T21:13:49Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking Dark Matter Mysteries Through Gravitational Waves - SciTechDaily", "description": "Gravitational waves from merging black holes could unveil the nature of dark matter, according to computer simulations presented at the 2023 National Astronomy Meeting. Using computer simulations, an international team of cosmologists has discovered that obse…", "url": "https://scitechdaily.com/unlocking-dark-matter-mysteries-through-gravitational-waves/", "urlToImage": "https://scitechdaily.com/images/Gravitational-Waves-Dark-Matter-Astrophysics-Illustration.jpg", "publishedAt": "2023-07-12T20:21:58Z", "content": "ByRoyal Astronomical SocietyJuly 12, 2023\r\nResearchers have revealed that the observation of gravitational waves from merging black holes may provide new insights into the nature of dark matter, acco… [+3753 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Lunch Break: Deals of the week - CBS Sacramento", "description": "Our produce man Michael Marks has the best deals in seasonal fruits and veggies.", "url": "https://www.youtube.com/watch?v=mCMTGpwYgeE", "urlToImage": "https://i.ytimg.com/vi/mCMTGpwYgeE/maxresdefault.jpg", "publishedAt": "2023-07-12T19:48:13Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Retrotransposons hijack cell's dna repair machinery to form circular DNA - News-Medical.Net", "description": "Like its viral cousins, a somewhat parasitic DNA sequence called a retrotransposon has been found borrowing the cell's own machinery to achieve its goals.", "url": "https://www.news-medical.net/news/20230712/Retrotransposons-hijack-cells-dna-repair-machinery-to-form-circular-DNA.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/6/Anatomical_structure_of_biological_animal_cell_with_organelles-eranicle_1d73b50575dc4546875a4a2fc7d429a6-620x480.jpg", "publishedAt": "2023-07-12T18:44:00Z", "content": "Like its viral cousins, a somewhat parasitic DNA sequence called a retrotransposon has been found borrowing the cell's own machinery to achieve its goals.\r\nIn a new work appearing online Wednesday in… [+4245 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Video Team", "title": "Are Elon Musk's Starlink satellites leaking radiation? - WION", "description": "There are faults in Elon Musk's Starlink satellites. They are leaking electromagnetic radiation. Launched into space to enhance broadband connectivity across the planet. Elon Musk's Starlink satellite constellation is leaking 'unintended electromagnetic radia…", "url": "https://www.wionews.com/videos/are-elon-musks-starlink-satellites-leaking-radiation-614835", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/07/12/1207_STARLINK_Web-1689181532-00000003.jpg", "publishedAt": "2023-07-12T17:05:01Z", "content": "© 2023. Indiadotcom Digital Private Limited. All Rights Reserved."}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Where Does Space Begin? We Asked a NASA Expert - NASA", "description": "Where does space begin? Well, it depends. There’s no sharp boundary that marks the end of atmosphere and beginning of space. But no matter where you draw the...", "url": "https://www.youtube.com/watch?v=2aVWZOFrjdc", "urlToImage": "https://i.ytimg.com/vi/2aVWZOFrjdc/maxresdefault.jpg", "publishedAt": "2023-07-12T16:41:24Z", "content": null}, {"source": {"id": null, "name": "Softonic"}, "author": "Pedro Domínguez Rojas", "title": "Astonishing Find: James Webb Telescope Uncovers Unseen Cosmic Mystery - Softonic EN", "description": "NASA's James Webb telescope has made a discovery that has left the entire scientific community speechless.", "url": "https://en.softonic.com/articles/the-james-webb-telescope-has-discovered-something-we-had-never-seen-before", "urlToImage": "https://articles-img.sftcdn.net/f_auto,t_article_cover_xl/auto-mapping-folder/sites/3/2023/07/Agujero-negro-supermasivo-Inters.jpg", "publishedAt": "2023-07-12T14:27:13Z", "content": "Black holes are, by definition, one of the greatest scientific mysteries humanity faces. First discovered in 1971 (although Albert Einstein calculated their existence in 1916), black holes remain a c… [+1460 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "M  Ramesh", "title": "Way to go — the intriguing route of Chandrayaan-3 to the Moon - BusinessLine", "description": "India's Chandrayaan-3 mission will use Earth's gravity to reach Moon, then circle it 5-6 times before lander begins descent. ISRO will use Earth's gravity to give Chandrayaan-3 enough velocity to reach Moon. It will circle Earth 5-6 times, then Moon 5-6 times…", "url": "https://www.thehindubusinessline.com/news/science/way-to-go-the-intriguing-route-of-chandrayaan-3-to-the-moon/article67072143.ece", "urlToImage": "https://bl-i.thgim.com/public/incoming/yn4nkj/article67072766.ece/alternates/LANDSCAPE_1200/Chandrayan.jpg", "publishedAt": "2023-07-12T14:24:40Z", "content": "More than five decades ago, the Americans reached the Moon in four days, but Indias Chandrayaan missions take a month to complete the same journey. Besides, the Chandrayaan-3, like its predecessor, t… [+2752 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "“Chasing Light”: Astronomers claim to identify shiniest planet with metallic clouds - Gadgets Now", "description": "The European Space Agency’s (ESA) exoplanet mission, Cheops has found the shiniest planet yet, planet LTT9779 b which orbits its host star, LTT9779 about 260 light years away from Earth. Although the planet was first discovered in 2020, new detailed measureme…", "url": "https://www.gadgetsnow.com/tech-news/chasing-light-astronomers-claim-to-identify-shiniest-planet-with-metallic-clouds/articleshow/101702480.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-101702480,imgsize-5700,width-800/101702480.jpg", "publishedAt": "2023-07-12T13:24:00Z", "content": "The European Space Agencys (ESA) exoplanet mission, Cheops has found the shiniest planet yet, planet LTT9779 b which orbits its host star, LTT9779 about 260 light years away from Earth. Although the … [+2181 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "See the world's largest telescope come together beneath the Milky Way (video) - Space.com", "description": "The revolutionary ground-based telescope in Chile's Atacama Desert will provide Earth's largest view of the cosmos.", "url": "https://www.space.com/extremely-large-telescope-half-finished-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AsSXHBSXtzc2yWVtada9MF-1200-80.jpg", "publishedAt": "2023-07-12T13:00:00Z", "content": "Newly released stunning images show that the Extremely Large Telescope is now halfway complete.\r\nThe images taken in June show the structure of the revolutionary ground-based Extremely Large Telescop… [+3931 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Lauren Haughey", "title": "Crows and magpies are using anti-bird spikes to build their nests, study finds - Daily Mail", "description": "Experts at the Netherlands' Naturalis Biodiversity Center and the Natural History Museum of Rotterdam discovered that birds make use of roof spikes to scare off predators.", "url": "https://www.dailymail.co.uk/sciencetech/article-12290549/Crows-magpies-using-anti-bird-spikes-build-nests-study-finds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/07/12/12/73124427-0-image-a-8_1689159688002.jpg", "publishedAt": "2023-07-12T11:41:08Z", "content": "Roof spikes have long been used by humans to keep birds at bay.\r\nBut it seems that crows and magpies aren't so scared at all, having stolen countless sharp metal pieces to build their own fortified n… [+3522 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Blair's Social Second: In what realms do you think artificial intelligence would be most beneficial? - FOX 2 St. Louis", "description": "In what realms do you think artificial intelligence would be most beneficial?", "url": "https://www.youtube.com/watch?v=nnPVm8TVsoA", "urlToImage": "https://i.ytimg.com/vi/nnPVm8TVsoA/maxresdefault.jpg", "publishedAt": "2023-07-12T11:38:15Z", "content": null}, {"source": {"id": null, "name": "Gearrice.com"}, "author": "Advay Hora", "title": "NASA explores creating alternative versions of its new space suits - Gearrice", "description": "join the conversation", "url": "https://www.gearrice.com/update/nasa-explores-creating-alternative-versions-of-its-new-space-suits/", "urlToImage": "https://www.mundodeportivo.com/urbantecno/hero/2023/07/imagen-de-uno-de-los-modelos-de-traje-espacial-que-sera-utilizado-en-las-proximas-misiones-artemis.png", "publishedAt": "2023-07-12T11:14:22Z", "content": "Image of one of the spacesuit models that will be used in the next Artemis missions.\r\nThere are many boys and girls who dream of one day being astronauts. NASA, in collaboration with a couple of priv… [+2272 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NIQS Tech | Emerging Technologies 2023 Health Winner - Royal Society Of Chemistry", "description": "Congratulations to Nicholas Furtak-Wells and NIQS Tech, winners of our Royal Society Chemistry #RSCEmergingTech 2023 competition #Health category, for their ...", "url": "https://www.youtube.com/watch?v=k9lnUPVZum8", "urlToImage": "https://i.ytimg.com/vi/k9lnUPVZum8/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgZShlMA8=&rs=AOn4CLBeGZMCnP-lLUU_938LPxpLNcR02A", "publishedAt": "2023-07-12T10:50:53Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Lambda Energy Ltd | Emerging Technologies 2023 Energy Winners - Royal Society Of Chemistry", "description": "Congratulations to Lambda Energy Ltd, winners of our Royal Society of Chemistry #RSCEmergingTech 2023 competition #Energy category for Passive Light Manageme...", "url": "https://www.youtube.com/watch?v=6XyLi8hqBaw", "urlToImage": "https://i.ytimg.com/vi/6XyLi8hqBaw/maxresdefault.jpg", "publishedAt": "2023-07-12T10:31:54Z", "content": null}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Second Israeli lunar lander faces funding uncertainty - SpaceNews", "description": "As India prepares to launch its second lunar lander mission, the fate of a second Israeli lander is in doubt after backers lost a major source of funding.", "url": "https://spacenews.com/second-israeli-lunar-lander-faces-funding-uncertainty/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/10/beresheet-model.jpg", "publishedAt": "2023-07-12T10:11:53Z", "content": "WASHINGTON As India prepares to launch its second lunar lander mission, the fate of a second Israeli lander is in doubt after the organization developing it lost a major source of funding.\r\nIndias Ch… [+3140 chars]"}, {"source": {"id": null, "name": "Audacy.com"}, "author": "Rex Ravita II", "title": "NASA's Webb Telescope has now captured images of all four gas giants in our solar system - KRLD", "description": "The James Webb Space Telescope recently captured an image of Saturn, the last of the quartet of gas giants to be observed by the telescope. Here’s a look at how they compare to previous images taken by the Hubble Telescope.", "url": "https://www.audacy.com/krld/news/national/jwst-has-now-captured-images-of-all-4-gas-giants", "urlToImage": "https://images.radio.com/aiu-media/KRLD-ARTICLE-PHOTOS75-34810111-a366-4cd9-b3a1-9bb09f8943eb.jpg", "publishedAt": "2023-07-12T10:00:04Z", "content": "Though we all have differences, there’s one commonality that has prevailed for all of humanity: we are all floating on a rock, flying through outer space at over a million miles an hour.﻿\r\nThanks to … [+1446 chars]"}, {"source": {"id": null, "name": "Geospatial World"}, "author": "Nibedita Mohanta", "title": "Carbon Mapper Builds Global Methane Emission Database - Geospatial World", "description": "Carbon Mapper has made enhancements to the Carbon Mapper Data Portal which now features new data on global sources of methane plus improved..", "url": "https://www.geospatialworld.net/prime/business-and-industry-trends/carbon-mapper-global-methane-emission-database/", "urlToImage": "https://www.geospatialworld.net/wp-content/uploads/2023/07/MicrosoftTeams-image-41-e1689152435499.jpg", "publishedAt": "2023-07-12T09:18:11Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Evidence of potential life on Venus found! - Economic Times", "description": "Scientists have discovered phosphine gas in the atmosphere of Venus, indicating the possibility of extraterrestrial life on the planet. The gas, typically released by living organisms, has been found at a depth deeper than previously observed. The discovery w…", "url": "https://economictimes.indiatimes.com/news/new-updates/evidence-of-potential-life-on-venus-found/articleshow/101691402.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101691557,width-1070,height-580,imgsize-670,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-12T07:32:00Z", "content": "In a groundbreaking discovery, scientists from Cardiff University in Wales has detected signs of life on Venus, the second planet from the Sun in our solar system.The team of scientists claimed to ha… [+1819 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Red Planet held water for longer than previously believed - Tech Explorist", "description": "Life on Mars?", "url": "https://www.techexplorist.com/red-planet-held-water-longer-previously-believed/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/mars-planet-spinning.jpg", "publishedAt": "2023-07-12T06:08:22Z", "content": "Mars doesn’t now have a core dynamo, but the strong crustal magnetic fields connected to many of its ancient terrains suggest that there once did. However, the high altitude and low spatial resolutio… [+4311 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New target for antibiotics promises treatment for multi-drug resistant superbugs - Science Daily", "description": "The World Health Organization lists bacteria that are resistant to antibiotics as one of the top 10 global health threats. Therefore, researchers are looking for new antibiotics to counter this resistance. Biophysicist have now discovered that the relatively …", "url": "https://www.sciencedaily.com/releases/2023/07/230711133210.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-12T04:43:37Z", "content": "The World Health Organization lists bacteria that are resistant to antibiotics as one of the top 10 global health threats. Therefore, researchers are looking for new antibiotics to counter this resis… [+4222 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A better understanding of turbulence - Science Daily", "description": "Experiments at a unique wind tunnel show that laws formulated more than 80 years ago and their extensions only incompletely explain turbulent flows.", "url": "https://www.sciencedaily.com/releases/2023/07/230711133200.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-12T03:18:53Z", "content": "Experiments at the unique wind tunnel of the Max Planck Institute for Dynamics and Self-Organization (MPI-DS) in Göttingen show that laws formulated more than 80 years ago and their extensions only i… [+2298 chars]"}]}