{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Two Earth-like planets have been discovered in a newly discovered star system - BollyInside", "description": "Only 33 light-years distant from us, a planetary system with two Earth-like planets has been identified. This fascinating solar system, one of the closest", "url": "https://www.bollyinside.com/news/two-earth-like-planets-have-been-discovered-in-a-newly-discovered-star-system", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Two-Earth-like-planets-have-been-discovered-in-a-newly-discovered.jpeg", "publishedAt": "2022-06-22T06:08:42Z", "content": "Only 33 light-years distant from us, a planetary system with two Earth-like planets has been identified.\r\nThis fascinating solar system, one of the closest to Earth, was discovered in October 2021 by… [+2584 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "In space, a new satellite is a “Swiss Army Knife” - BollyInside", "description": "Researchers will soon be able to examine Earth’s surface in incredible detail, from the status of the planet’s soil to the plants that blossom on its", "url": "https://www.bollyinside.com/news/in-space-a-new-satellite-is-a-swiss-army-knife", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/In-space-a-new-satellite-is-a-Swiss-Army-Knife.jpeg", "publishedAt": "2022-06-22T05:56:38Z", "content": "Researchers will soon be able to examine Earths surface in incredible detail, from the status of the planets soil to the plants that blossom on its surface to the composition of urban sprawl, thanks … [+3105 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The United States develops technology to refuel satellites and create factories in space - BollyInside", "description": "The US government prefers that more expensive hardware be maintained and even developed in space rather than on Earth. Space operations contribute", "url": "https://www.bollyinside.com/news/the-united-states-develops-technology-to-refuel-satellites-and-create-factories-in-space", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/The-United-States-develops-technology-to-refuel-satellites-and-create.jpeg", "publishedAt": "2022-06-22T05:08:38Z", "content": "The US government prefers that more expensive hardware be maintained and even developed in space rather than on Earth.\r\nSpace operations contribute billions of dollars to the US economy, but the inab… [+6564 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Enormous sunspot creates solar flare scare for Earth; NASA says high risk of blackouts - HT Tech", "description": "A dangerous sunspot has doubled in size in the last 24 hours, says NASA. And now, it threatens the Earth with the possibility of a solar flare emission that can cause radio blackouts across the planet.", "url": "https://tech.hindustantimes.com/tech/news/gigantic-enormous-sunspot-creates-solar-flare-scare-for-earth-nasa-says-high-risk-of-blackouts-71655873633583.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/22/1600x900/latest_1024_hmiic_0_1655873854647_1655873870913.jpg", "publishedAt": "2022-06-22T04:59:28Z", "content": "Just yesterday, it was reported that as many as eight sunspots emerged on the Earth-facing solar disk (the side of the Sun visible from Earth). And today, NASA has reported that one of the sunspots, … [+1958 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA sends two astronauts to test the Starliner - BollyInside", "description": "In the latest reshuffling of people assigned to the long-delayed mission, NASA has assigned two seasoned astronauts to the first crewed flight of Boeing’s", "url": "https://www.bollyinside.com/news/nasa-sends-two-astronauts-to-test-the-starliner", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/NASA-sends-two-astronauts-to-test-the-Starliner.jpeg", "publishedAt": "2022-06-22T04:12:19Z", "content": "In the latest reshuffling of people assigned to the long-delayed mission, NASA has assigned two seasoned astronauts to the first crewed flight of Boeings CST-100 Starliner spaceship.\r\nSuni Williams a… [+3291 chars]"}, {"source": {"id": null, "name": "Asiafinancial.com"}, "author": null, "title": "China ‘Space Fireballs’ Light Up Spanish Sky – MailOnline - Asia Financial", "description": "Asia Financial News - Read the latest Asian stock market news and analysis, today China business news. AsiaFinancial.com brings you the Asian business, finance, economy and tech stories.", "url": "https://www.asiafinancial.com/", "urlToImage": "https://www.asiafinancial.com/wp-content/uploads/2021/05/AF-News-General-large.png", "publishedAt": "2022-06-22T02:13:04Z", "content": "Asia Financial is owned by Capital Link International Holdings Ltd,\r\n902, Wilson House 19-27 Wyndham Street, Central, Hong Kong. www.capitallinkintl.com"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andy Gregory", "title": "New map of Earth's tectonic plates 'could help predict natural disasters' - The Independent", "description": "In new research, scientists have redrawn the boundaries of our planet’s architecture, Andy Gregory reports", "url": "https://www.independent.co.uk/independentpremium/world/tectonic-plates-map-earthquakes-volcanoes-b2106280.html", "urlToImage": "https://static.independent.co.uk/2022/06/21/20/newFile-3.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-06-21T21:53:30Z", "content": "New scientific models mapping the Earths tectonic plates could help to sharpen our collective understanding of natural disasters like earthquakes and volcanic eruptions, scientists have said.\r\nThe pa… [+546 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Abhishek Pratap", "title": "Rock hits Jupiter with the force of 2 million tons of TNT and causes the biggest flash seen since 1994 | ... - Play Crazy Game", "description": "A space rock hit Jupiter's gaseous \"surface\" in October last year and the impact of that collision, which may have been the biggest in 28 yearswas so strong that observers here on Earth were able to capture the phenomenon. China's plan to launch rockets and d…", "url": "https://playcrazygame.com/2022/06/22/rock-hits-jupiter-with-the-force-of-2-million-tons-of-tnt-and-causes-the-biggest-flash-seen-since-1994-science-2/", "urlToImage": "https://s2.glbimg.com/o7QL-VkTYUddeu4jaHTGoxAsWT4=/1200x/smart/filters:cover():strip_icc()/i.s3.glbimg.com/v1/AUTH_59edd422c0c84a879bd37670ae4f538a/internal_photos/bs/2022/F/U/vAhcKDRfSAuN17IifVFg/fb3ejx1vgaa3g-7.jpg", "publishedAt": "2022-06-21T21:22:20Z", "content": "A space rock hit Jupiter’s gaseous “surface” in October last year and the impact of that collision, which may have been the biggest in 28 yearswas so strong that observers here on Earth were able to … [+2154 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX Falcon 9 Carries 53 Satellites to Space - Bloomberg Technology", "description": "A SpaceX Falcon 9 rocket carries 53 Starlink satellites to low-Earth orbit. The Falcon 9 rocket landed back on a droneship in the Atlantic ocean a short time...", "url": "https://www.youtube.com/watch?v=u6wD1kEnNJw", "urlToImage": "https://i.ytimg.com/vi/u6wD1kEnNJw/maxresdefault.jpg", "publishedAt": "2022-06-21T20:41:06Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Unraveling sex determination in Bursaphelenchus nematodes: A path towards pest control - EurekAlert", "description": "The mechanisms underlying sex determination in nematodes, commonly known as roundworms, have not been fully understood. Now, an international team of researchers has conducted a study to determine the sex determination process in two fungal feeding/plant dise…", "url": "https://www.eurekalert.org/news-releases/956551", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/808ffa3b-3f87-4252-acdb-f75a429a15a0/Rendition/thumbnail/Content/Public", "publishedAt": "2022-06-21T20:15:34Z", "content": "image: Scientists discover that sex determination in nematodes of the genus Bursaphelenchus can be attributed to random events rather than well-known mechanisms such as genetic or environmental sex d… [+7525 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "De-extinction: What would happen if the dinosaurs came back to life? - Code List", "description": "In Jurassic Park, the film by the great Steven Spielberg released in the 90s, a tycoon decides to build a dinosaur theme park. To achieve this, he invests a lot of money so that scientists can develop a method to recover dinosaur blood stored in the abdomen o…", "url": "https://codelist.biz/2022/06/21/de-extinction-what-would-happen-if-the-dinosaurs-came-back-to-life/", "urlToImage": "https://media.cdn.eldestapeweb.com/eldestape/062022/1655406368509.jpeg?&cw=600&ch=365", "publishedAt": "2022-06-21T19:30:55Z", "content": "In Jurassic Park, the film by the great Steven Spielberg released in the 90s, a tycoon decides to build a dinosaur theme park. To achieve this, he invests a lot of money so that scientists can develo… [+4281 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Fast Radio Bursts in Space: Scientists Attempt to Get to the Bottom of its Mysterious Cause Once and For All - Galaxy Reporters", "description": "In 2007, scientists at the University of West Virginia began observing an unusual explosion of space waves. Since then, this rapid radio explosion, or FRB, has been a mystery to astronomers. They only knew that FRBs were radio waves and came from space within…", "url": "https://galaxyreporters.com/fast-radio-bursts-in-space-scientists-attempt-to-get-to-the-bottom-of-its-mysterious-cause-once-and-for-all/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/Scientists-Consider-Cause-of-Fast-Radio-Bursts-in-Space.webp", "publishedAt": "2022-06-21T18:39:23Z", "content": "In 2007, scientists at the University of West Virginia began observing an unusual explosion of space waves. Since then, this rapid radio explosion, or FRB, has been a mystery to astronomers.\r\nThey on… [+1891 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Jaw-Dropping New Maps of Asteroid Psyche Reveal a Secret Ancient World - Galaxy Reporters", "description": "Later this year, NASA will launch an investigation equivalent to the tennis court to the asteroid belt, the region between the orbits of Mars and Jupiter where the remains of the original solar system orbit the Sun. Once inside the asteroid belt, the spacecra…", "url": "https://galaxyreporters.com/jaw-dropping-new-maps-of-asteroid-psyche-reveal-a-secret-ancient-world/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/New-maps-of-the-asteroid-Psyche.jpg", "publishedAt": "2022-06-21T18:34:31Z", "content": "Later this year, NASA will launch an investigation equivalent to the tennis court to the asteroid belt, the region between the orbits of Mars and Jupiter where the remains of the original solar syste… [+2136 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "One Model to Describe Them All—Well, Ice Giants Anyway - Physics", "description": "The spectral responses of the atmospheres of Uranus and Neptune can now both be fully characterized with the same model, an achievement that has implications for characterizing the atmospheres of exoplanets.", "url": "https://physics.aps.org/articles/v15/89", "urlToImage": "https://physics.aps.org/assets/6b08f59a-1e68-4c5f-b992-7ca01e094351/e89_1_thumb.png", "publishedAt": "2022-06-21T18:07:53Z", "content": "A new model provides an explanation for why Uranus (left) and Neptune (right) are different shades of blue.\r\nWhen it comes to space missions, the focus has largely lain with planets close to Earth, w… [+4787 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Blue Stars In A New Class Of Stellar System. Know All About The New Discovery - ABP Live", "description": "The new stellar systems contain only young, blue stars, and are about the size of tiny dwarf galaxies. The blue stars are distributed in an irregular pattern.", "url": "https://news.abplive.com/science/blue-stars-in-a-new-class-of-stellar-system-know-all-about-the-new-discovery-1538509", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/06/21/6a7ec4a859d04d951d5ac25c15063264_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-06-21T17:08:39Z", "content": "Astronomers at University of Arizona have identified five examples of a new class of stellar system that are not quite galaxies and only exist in isolation. The new stellar systems appear as \"blue bl… [+4990 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Quantum sensor can detect electromagnetic signals of any frequency - India Education Diary", "description": "Quantum sensors, which detect the most minute variations in magnetic or electrical fields, have enabled precision measurements in materials science and fundamental physics. But these sensors have only been capable of detecting a few specific frequenc", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-quantum-sensor-can-detect-electromagnetic-signals-of-any-frequency/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg", "publishedAt": "2022-06-21T17:02:54Z", "content": "Quantum sensors, which detect the most minute variations in magnetic or electrical fields, have enabled precision measurements in materials science and fundamental physics. But these sensors have onl… [+4532 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Helsinki: Finnish technology helps to find out how the Solar System was formed – ESA will start to build Comet Interceptor - India Education Diary", "description": "Comet Interceptor, including a main spacecraft and two smaller probes, is equipped with a hyperspectral camera based on VTT’s technology. This technology will provide information about how the Solar System was formed and how it has developed over tim", "url": "https://indiaeducationdiary.in/university-of-helsinki-finnish-technology-helps-to-find-out-how-the-solar-system-was-formed-esa-will-start-to-build-comet-interceptor/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/university-of-helsinki.png", "publishedAt": "2022-06-21T16:58:44Z", "content": "Comet Interceptor, including a main spacecraft and two smaller probes, is equipped with a hyperspectral camera based on VTTs technology. This technology will provide information about how the Solar S… [+3691 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "World's largest liquid mirror telescope ready to observe - Space.com", "description": "Astronomers must brave a 10-hour drive into the Himalayas to get there.", "url": "https://www.space.com/largest-liquid-mirror-telescope-opens-india", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ktwjq8T3khZaEZAMwATaxj-1200-80.jpg", "publishedAt": "2022-06-21T16:19:51Z", "content": "The world's largest liquid mirror telescope is ready to gaze at the stars.\r\nLocated at the Devasthal Observatory in India's Himalayas, at an elevation of 8,038 feet (2,450 meters), the four-meter Int… [+2178 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "SpaceX's Falcon 9 rocket aces landing on droneship in the Atlantic; Watch viral video - Republic World", "description": "SpaceX launched three Falcon 9 rockets from three different launch pads within 36 hours for one Starlink and two commercial missions starting June 17.", "url": "https://www.republicworld.com/science/space/spacexs-falcon-9-rocket-aces-landing-on-droneship-in-the-atlantic-watch-viral-video-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/gwcwvxplznzm0ha5_1655825032.jpeg", "publishedAt": "2022-06-21T15:30:00Z", "content": "SpaceX had a pretty busy week as it launched and landed three Falcon 9 rockets within a span of 36 hours. Each of the rockets lifted off from a different launch site and each launch was dedicated to … [+2201 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "E-Tattoo Developed for Continuous Mobile Blood Pressure Monitoring - AZoSensors", "description": "One of the most crucial indicators of heart health is blood pressure. However, it is challenging to reliably and frequently measure blood pressure outside of a medical setting.", "url": "https://www.azosensors.com/news.aspx?newsID=15082", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/news/ImageForNews_15082_16558052798537586.jpg", "publishedAt": "2022-06-21T15:24:00Z", "content": "One of the most crucial indicators of heart health is blood pressure. However, it is hard to reliably and frequently measure blood pressure outside of a medical setting. For several years, cuff-based… [+4706 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals remote sensing supports track of carbon storage in mangroves - ANI News", "description": "Tokyo [Japan], June 21 (ANI): A question that always arises that how much amount of carbon is stored by Mangrove forests globally? Recently, a group of researchers from Japan have found a new model that is used for remote sensing of environmental conditions a…", "url": "https://www.aninews.in/news/science/study-reveals-remote-sensing-supports-track-of-carbon-storage-in-mangroves20220621204952", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/jikkkjumkhjumhumukmu2022062114333420220621151942.jpg", "publishedAt": "2022-06-21T15:19:00Z", "content": "Tokyo [Japan], June 21 (ANI): A question that always arises that how much amount of carbon is stored by Mangrove forests globally? Recently, a group of researchers from Japan have found a new model t… [+2431 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Chinese scientists find high-pressure minerals in Chang'e-5 samples for the first time - Global Times", "description": "Chinese scientists found for the first time high-pressure minerals in the lunar regolith samples brought back by the Chang'e-5 lunar probe. The discovery provides important evidence of the presence of impact ejecta near the craters in the sampling area of Cha…", "url": "https://www.globaltimes.cn/page/202206/1268704.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-07-12/6c11f54a-97c6-4acc-9882-150537651ba7.jpeg", "publishedAt": "2022-06-21T15:09:00Z", "content": "The lunar samples No. 001 brought back by China's Chang'e-5 probe is displayed at the National Museum of China in Beijing, capital of China, February 27, 2021. Photo: Xinhua\r\nChinese scientists found… [+1672 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists identify a possible source for Charon's red cap - Phys.org", "description": "Southwest Research Institute scientists combined data from NASA's New Horizons mission with novel laboratory experiments and exospheric modeling to reveal the likely composition of the red cap on Pluto's moon Charon and how it may have formed. This first-ever…", "url": "https://phys.org/news/2022-06-scientists-source-charon-red-cap.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/swri-scientists-identi.jpg", "publishedAt": "2022-06-21T15:05:48Z", "content": "Southwest Research Institute scientists combined data from NASA's New Horizons mission with novel laboratory experiments and exospheric modeling to reveal the likely composition of the red cap on Plu… [+4429 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Beating NASA, China Set To Become 1st Country To Get Martian Sample Back On Earth — Chinese Expert - EurAsian Times", "description": "The space race has been silently intensifying with the geopolitical battle raging on the ground. With the United States having delayed its Mars mission to bring back samples to Earth, China could beat its rival in achieving that milestone. 4th Failure? NASA’s…", "url": "https://eurasiantimes.com/martian-samples-china-set-to-beat-nasa-esa-to-get-mars-soil/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/03/mars-scaled-e1647147833816.jpg", "publishedAt": "2022-06-21T14:16:01Z", "content": "The space race has been silently intensifying with the geopolitical battle raging on the ground. With the United States having delayed its Mars mission to bring back samples to Earth, China could bea… [+4853 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Alison Halliday, PhD", "title": "Dissecting the Complexity of the Brain at a Single Cell Level - Technology Networks", "description": "Understanding the brain requires an in-depth knowledge of its components. Advanced single-cell sequencing technologies are enabling researchers to explore the secrets of this complex and mysterious organ in unprecedented detail.", "url": "https://www.technologynetworks.com/neuroscience/articles/dissecting-the-complexity-of-the-brain-at-a-single-cell-level-362680", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/362680/dissecting-the-complexity-of-the-brain-at-a-single-cell-level-362680-640x360.jpg?cb=20220621", "publishedAt": "2022-06-21T13:54:38Z", "content": "Understanding the brain requires an in-depth knowledge of its components. Advanced single-cell sequencing technologies are enabling researchers to explore the secrets of this complex and mysterious o… [+8520 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "IANS", "title": "Nasa's Artemis 1 moon mission completes crucial fueling test - Gadgets Now", "description": "Washington, After halting Artemis 1 moon rocket's \"wet dress rehearsal\" several times, Nasa has successfully completed the crucial fuelling test of its Space Launch System (SLS) megarocket.The Artemis 1 wet dress rehearsal ended at 7.37 pm EDT on June 20, Nas…", "url": "https://www.gadgetsnow.com/tech-news/nasas-artemis-1-moon-mission-completes-crucial-fueling-test/articleshow/92365833.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-92365833,imgsize-238676,width-800/92365833.jpg", "publishedAt": "2022-06-21T13:39:00Z", "content": "Washington, After halting Artemis 1 moon rocket's \"wet dress rehearsal\" several times, Nasa has successfully completed the crucial fuelling test of its Space Launch System (SLS) megarocket.The Artemi… [+2092 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Claire Andreoli", "title": "Image: Hubble snaps globular cluster Terzan 9 - Phys.org", "description": "This star-studded image shows the globular cluster Terzan 9 in the constellation Sagittarius, toward the center of the Milky Way. The NASA/ESA Hubble Space Telescope captured this glittering scene using its Wide Field Camera 3 and Advanced Camera for Surveys.", "url": "https://phys.org/news/2022-06-image-hubble-snaps-globular-cluster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/hubble-snaps-globular.jpg", "publishedAt": "2022-06-21T13:06:43Z", "content": "This star-studded image shows the globular cluster Terzan 9 in the constellation Sagittarius, toward the center of the Milky Way. The NASA/ESA Hubble Space Telescope captured this glittering scene us… [+1498 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "James Webb Space Telescope’s 1st images; ESA reveals time and how to watch live - Republic World", "description": "The James Webb Space Telescope will release its first full colour images along with spectroscopic data about the cosmic objects on July 12.", "url": "https://www.republicworld.com/science/space/james-webb-space-telescopes-1st-images-esa-reveals-time-and-how-to-watch-live-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/09ukijp6btcg4eo1_1655815228.jpeg", "publishedAt": "2022-06-21T13:02:00Z", "content": "The James Webb Space Telescope is nearing its awakening and will begin observing the universe in a few weeks. But before that, it will release the first images of the cosmos that were captured using … [+2018 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Daniel Sims", "title": "NASA begins switching off Voyager instruments after almost 45 years - TechSpot", "description": "Scientific American reports that NASA is preparing to wind down the Voyager mission, which has endured for over ten times its original projected length. By powering down...", "url": "https://www.techspot.com/news/95012-nasa-begins-switching-off-voyager-instruments-after-almost.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/06/2022-06-20-image-20.jpg", "publishedAt": "2022-06-21T11:55:00Z", "content": "In brief: The Voyager spacecraft were initially supposed to last only four years. Nearly 45 years later, they can still communicate with NASA from the edge of interstellar space. Now, the agency plan… [+2041 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Fastest nova ever recorded produced by suspected intermediate polar star system - News9 LIVE", "description": "A nova is a white dwarf star that periodically and explosively sheds material cannibalised from a...", "url": "https://www.news9live.com/science/fastest-nova-ever-recorded-produced-by-suspected-intermediate-polar-star-system-177740", "urlToImage": "https://media.news9live.com/h-upload/2022/06/21/435208-intermediate-polar-system-garlick900x600cropped1.jpg", "publishedAt": "2022-06-21T11:53:16Z", "content": "Astronomers have observed the fastest nova ever recorded. Novas are extremely bright explosions where material accreted by a white dwarf star from a stellar companion is shed in a violent explosion. … [+5505 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Robotic lightning bugs - Massachusetts Institute of Technology (MIT)", "description": "Inspired by fireflies, a team of researchers has created insect-scale robots that can emit light when they fly, which enables motion tracking and communicati...", "url": "https://www.youtube.com/watch?v=V5ZJOhkSRWk", "urlToImage": "https://i.ytimg.com/vi/V5ZJOhkSRWk/maxresdefault.jpg", "publishedAt": "2022-06-21T11:45:37Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA satellite sees strange cloud drifting over Caspian: What makes it look more peculiar than most? - Devdiscourse", "description": "Read more about NASA satellite sees strange cloud drifting over Caspian: What makes it look more peculiar than most? on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2081024-nasa-satellite-sees-strange-cloud-drifting-over-caspian-what-makes-it-look-more-peculiar-than-most", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_06_2022_17_03_25_4554284.jpg?width=920&format=jpeg", "publishedAt": "2022-06-21T11:33:56Z", "content": "NASA's Terra satellite recently captured a lone cloud drifting over the Caspian Sea, the planet's largest inland body of water, that stands out from other clouds hovering over the sea. The NASA Earth… [+1745 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "NASA-Roscosmos Tiff – Russia Says Looking Into Consequences Of US Spacecraft’s Failure To Adjust ISS Orbit - EurAsian Times", "description": "Russia’s space agency is looking into the situation that arose due to the failure of the US freight spaceship Cygnus NG-17 to adjust the orbit of the International Space Station (ISS) as NASA is unsure about what had caused the boost maneuver to fail, Roscosm…", "url": "https://eurasiantimes.com/nasa-roscosmos-tiff-russia-says-looking-into-consequences-iss/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/02/nasa-roscosmos.jpg", "publishedAt": "2022-06-21T10:43:22Z", "content": "Russia’s space agency is looking into the situation that arose due to the failure of the US freight spaceship Cygnus NG-17 to adjust the orbit of the International Space Station (ISS) as NASA is unsu… [+2463 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Like a Space Icarus, a rare comet close to the Sun was ‘roasted to death’ - BollyInside", "description": "323P/SOHO, a near-sun comet, should have taken a Greek mythology class. During a near encounter with the sun, scientists were able to monitor the elusive", "url": "https://www.bollyinside.com/news/like-a-space-icarus-a-rare-comet-close-to-the-sun-was-roasted-to-death", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Like-a-Space-Icarus-a-rare-comet-close-to-the.jpeg", "publishedAt": "2022-06-21T09:44:19Z", "content": "323P/SOHO, a near-sun comet, should have taken a Greek mythology class. During a near encounter with the sun, scientists were able to monitor the elusive rocky space object, and it didnt go well for … [+1995 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "In Pics: 290-million-year-old ‘rare’ forest unearthed in Brazil - WION", "description": "A fossilised upright forest, which seems to have been 290 million years old, has been found in southern Brazil by a team of researchers. It is being considered as a “window to the past” and can help in the study of plant’s evolution.\r\n\r\nThe trees in this fore…", "url": "https://www.wionews.com/photos/in-pics-290-million-year-old-rare-forest-unearthed-in-brazil-490202", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/photo_page/public/2022/06/21/272626-t6.jpg", "publishedAt": "2022-06-21T09:29:57Z", "content": "A fossilised upright forest, which seems to have been 290 million years old, has been found in southern Brazil by a team of researchers. It is being considered as a window to the past and can help in… [+241 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "A massive protostellar disk found in Milky Way’s center - Tech Explorist", "description": "A close encounter more than 10,000 years ago stirred up spirals in the accretion disk.", "url": "https://www.techexplorist.com/massive-protostellar-disk-found-milky-way-center/50252/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/accretion-disk.jpg", "publishedAt": "2022-06-21T08:02:28Z", "content": "Accretion disks, also known as ‘protostellar disks,’ are key components in star formation. These disks continuously feed gas into protostars from the environment. In this sense, they are stellar crad… [+3661 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A Dead Star Has Been Caught Ripping Apart Its Planetary System - ScienceAlert", "description": "When a star dies, what happens to its planets? Well, if that star is a certain white dwarf 86 light-years away, those planets are currently in the process of being torn apart and eaten by the star, like some grotesque cosmic performance of Kronos dev", "url": "https://www.sciencealert.com/a-dead-star-has-been-caught-ripping-apart-the-planetary-system-that-once-orbited-it", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/hungry-white-dwarf-G238-44_1024.jpg", "publishedAt": "2022-06-21T06:17:18Z", "content": "When a star dies, what happens to its planets? Well, if that star is a certain white dwarf 86 light-years away, those planets are currently in the process of being torn apart and eaten by the star, l… [+4938 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Asteroid strike on Earth? NASA DART mission all fired-up - HT Tech", "description": "If you’ve ever wondered how we will protect ourselves against an asteroid strike on Earth, then know that NASA is all fired-up about it.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-strike-on-earth-nasa-dart-mission-all-firedup-71655790664124.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/21/1600x900/NASA_DART_1633579074740_1655790727302.jpg", "publishedAt": "2022-06-21T05:52:53Z", "content": "An asteroid strike on Earth will create the same situation that destroyed the planet and killed off all the dinosaurs. This time, humans will be at teh receiving end. There are very few options avail… [+2049 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Extending excitons’ life - Tech Explorist", "description": "The findings show that excitons last long enough for a broad range of potential applications.", "url": "https://www.techexplorist.com/extending-excitons-life/49544/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/LAST.jpg", "publishedAt": "2022-06-21T05:47:32Z", "content": "The electrical conductivity of semiconductors can be externally controlled via doping or electrical gating. This makes them vital elements for the diodes and transistors that underpin all modern elec… [+5091 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": "Alice Jane", "title": "NASA's OSIRIS-REx Spacecraft Finds That the Asteroid Bennu Protects From Small Meteoroid Infestations - Galaxy Reporters", "description": "The Asteroid Bennu rocky outcrop protects from small meteoroid infestations, according to craters detected by NASA’s OSIRIS-REx spacecraft (Origin, Spectral Interpretation, Resource Identification, Security-Regolith Explorer). OSIRIS-REx went near the Earth a…", "url": "https://galaxyreporters.com/nasas-osiris-rex-spacecraft-finds-that-the-asteroid-bennu-protects-from-small-meteoroid-infestations/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/NASAs-OSIRIS-REx-Spacecraft.webp", "publishedAt": "2022-06-21T05:29:41Z", "content": "The Asteroid Bennu rocky outcrop protects from small meteoroid infestations, according to craters detected by NASA’s OSIRIS-REx spacecraft (Origin, Spectral Interpretation, Resource Identification, S… [+2428 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Amazing NASA photo of our neighbouring Andromeda Galaxy released - HT Tech", "description": "NASA has released an amazingly detailed photo of our neighbouring galaxy, the Andromeda Galaxy. Here’s more about it.", "url": "https://tech.hindustantimes.com/tech/news/amazing-nasa-photo-of-our-neighbouring-andromeda-galaxy-released-71655786413801.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/21/1600x900/Untitled_design_1655786632469_1655786645118.jpg", "publishedAt": "2022-06-21T04:45:01Z", "content": "NASA released the incredibly detailed image of the neighbouring Andromeda Galaxy on June 7. In the image released on NASAs all social media platforms, the galaxy was surrounded by stars and cosmic du… [+1848 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Spirals of Blue Light Spotted in New Zealand Skies Leave Stargazers Awestruck - News18", "description": "At around 7:25 pm, a huge blue spiral light appeared amid the vast darkness and left people curious about its origin. The spiral mimicked the shape of a galaxy or a portal, triggering all kinds of theories among netizens on social media.", "url": "https://www.news18.com/news/buzz/spirals-of-blue-light-spotted-in-new-zealand-skies-leave-stargazers-awestruck-5408545.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/sky-lights-165578547716x9.png", "publishedAt": "2022-06-21T04:44:58Z", "content": "A puzzling sight in the New Zealand skies left stargazers stunned on Sunday night. At around 7:25 pm, a huge blue spiral light appeared amid the vast darkness and left people curious about its origin… [+1709 chars]"}, {"source": {"id": null, "name": "Lankatimes.com"}, "author": "Izer", "title": "Why exposure to space dust is an inevitable aspect of space travel - Lanka Times", "description": "On June 8, NASA revealed that its powerful new space observatory, the James Webb Space Telescope, now has a small dome in one of its primary mirrors after", "url": "https://www.lankatimes.com/why-exposure-to-space-dust-is-an-inevitable-aspect-of-space-travel/", "urlToImage": "https://www.lankatimes.com/wp-content/uploads/2022/06/Why-exposure-to-space-dust-is-an-inevitable-aspect-of.jpg", "publishedAt": "2022-06-20T20:21:43Z", "content": "On June 8, NASA revealed that its powerful new space observatory, the James Webb Space Telescope, now has a small dome in one of its primary mirrors after it was pelted by larger-than-expected micros… [+6654 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Astronomers Find Evidence Of Most Powerful Pulsar In Distant Galaxy - NDTV", "description": "Astronomers using data from the VLA Sky Survey have discovered one of the youngest known neutron stars possibly as young as only 14 years.", "url": "https://www.ndtv.com/science/astronomers-find-evidence-of-most-powerful-pulsar-in-distant-galaxy-3085347", "urlToImage": "https://c.ndtvimg.com/2018-09/um9lqgqo_space-generic-pixabay_625x300_22_September_18.jpg", "publishedAt": "2022-06-20T18:36:18Z", "content": "The astronomers plan to conduct further observations to learn more about the object\r\nWashington: Astronomers using data from the VLA Sky Survey have discovered one of the youngest known neutron stars… [+4786 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Astronomers Have Detected a 'Missing Link' Shockwave in Merging Galaxies - ScienceAlert", "description": "The colossal shock wave generated by the first stages of a collision between some of the most massive structures in the Universe has just been seen and imaged for the first time.", "url": "https://www.sciencealert.com/a-giant-shock-wave-has-been-seen-between-two-galaxy-clusters-about-to-merge", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/Abell98CompositeImage_1024.png", "publishedAt": "2022-06-20T18:00:40Z", "content": "The colossal shock wave generated by the first stages of a collision between some of the most massive structures in the Universe has just been seen and imaged for the first time.\r\nThe detection was f… [+3310 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Erin Matthews", "title": "How to store more carbon in soil during climate change - Phys.org", "description": "Researchers from Cornell University, Ohio State University, Technical University of Munich, and the Connecticut Agricultural Experiment Station are using synchrotron light to investigate how moisture affects soil carbon—an important ingredient for healthy cro…", "url": "https://phys.org/news/2022-06-carbon-soil-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/soil.jpg", "publishedAt": "2022-06-20T17:10:17Z", "content": "Researchers from Cornell University, Ohio State University, Technical University of Munich, and the Connecticut Agricultural Experiment Station are using synchrotron light to investigate how moisture… [+2397 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Check out this stunning view of Jupiter's auroras snapped by Hubble - Devdiscourse", "description": "Hubble captures stunning light shows in Jupiter's atmosphere.", "url": "https://www.devdiscourse.com/article/science-environment/2080197-check-out-this-stunning-view-of-jupiters-auroras-snapped-by-hubble", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/20_06_2022_22_17_19_0051228.jpg?width=920&format=jpeg", "publishedAt": "2022-06-20T16:47:49Z", "content": "The NASA/ESA Hubble Space Telescope captured this view of Jupiter's auroras, one of the beautiful features of the largest planet in the solar system, in 2016.\r\nAurora's are stunning light shows in a … [+1796 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "http://www.facebook.com/thegoodnewsnetwork", "title": "Astronomers Think They've Detected a 'Dark' Free-Floating Black Hole For the First Time - Good News Network", "description": "Astronomers at University of California - Berkeley think they've detected a 'dark' free-floating black hole for the first time.", "url": "https://www.goodnewsnetwork.org/astronomers-think-theyve-detected-a-dark-free-floating-black-hole/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2022/06/black-hole-released-uc-berkeley.jpg", "publishedAt": "2022-06-20T16:27:27Z", "content": "UC Berkeley\r\nIf, as astronomers believe, the death of large stars leave behind black holes, there should be hundreds of millions of them scattered throughout the Milky Way galaxy. The problem is, iso… [+2859 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Gaia space telescope rocks science of asteroids: Study - ThePrint", "description": "Washington [US], June 20 (ANI): According to a study by the University of Helsinki, the European Gaia space mission has produced an unprecedented amount of new, improved, and detailed data for almost two billion objects in the Milky Way galaxy and the surroun…", "url": "https://theprint.in/science/gaia-space-telescope-rocks-science-of-asteroids-study/1004813/", "urlToImage": null, "publishedAt": "2022-06-20T15:14:17Z", "content": "Washington [US], June 20 (ANI): According to a study by the University of Helsinki, the European Gaia space mission has produced an unprecedented amount of new, improved, and detailed data for almost… [+7196 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA chief express excitement on Artemis I development; hails partnership with NASA - Republic World", "description": "ESA's chief Josef Aschbacher expressed his excitement over the ongoing pre-launch tests of NASA’s Space Launch System (SLS) rocket for Artemis I.", "url": "https://www.republicworld.com/science/space/esa-chief-express-excitement-on-artemis-i-development-hails-partnership-with-nasa-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/019xhpysgwvbyaxz_1655730561.jpeg", "publishedAt": "2022-06-20T13:31:00Z", "content": "The Director-General of the European Space Agency (ESA), Josef Aschbacher, expressed his excitement over the ongoing pre-launch tests of NASAs Space Launch System (SLS) rocket. The SLS will launch to… [+2755 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Astronaut recreates 'Gravity' movie scene aboard ISS; poses a query to Sandra Bullock - Republic World", "description": "European astronaut Samantha Christoforetti, who is currently aboard the International Space Station, re-enacted a scene from Sandra Bullock-starrer 'Gravity'.", "url": "https://www.republicworld.com/science/space/astronaut-recreates-gravity-movie-scene-aboard-iss-poses-a-query-to-sandra-bullock-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/mtcxueoyfkek7ntq_1655727918.jpeg", "publishedAt": "2022-06-20T13:11:00Z", "content": "European astronaut Samantha Christoforetti, who is currently on a six-month-long outer space mission, is leaving no stone unturned in keeping her fans entertained. From being the first TikToker in sp… [+1986 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "MARS Helicopter — Designed To Operate On Red Planet, NASA To Test Its ‘Super Chopper’ In Asia - EurAsian Times", "description": "NASA will test whether its Mars helicopter, also known as Mars Science Helicopter (MSH) can take flight in the red planet’s thin atmosphere.", "url": "https://eurasiantimes.com/mars-helicopter-designed-to-operate-on-red-planet-nasa/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/06/NASA-Mars-Helicopter.jpg", "publishedAt": "2022-06-20T12:27:47Z", "content": "NASA has teamed up with Japan’s Tohoku University to test whether its next-generation Mars helicopter, also known as Mars Science Helicopter (MSH), can take flight in the red planet’s fragile atmosph… [+5119 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Sustainable Synthesis of Carbon-Based Oxygen Reduction Reaction Electrocatalyst - AZoNano", "description": "A simple approach for producing graphitic carbon nitride on reduced graphene oxide was shown using semi-closed pyrolysis of graphene oxide and urea in ambient conditions contributing to viable carbon-based ORR electrocatalysts.", "url": "https://www.azonano.com/news.aspx?newsID=39293", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39293_16557276779218098.jpg", "publishedAt": "2022-06-20T12:22:00Z", "content": "Graphitic carbon nitride/graphene hybrids for electrocatalysis of oxygen reduction reactions (ORR) in metal-air fuel cells and batteries are proven to be viable, inexpensive, and long-lasting alterna… [+5497 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Astronomers discover fastest growing Black Hole of the last 9 billion years, consumes equivalent of 1 Earth ev - Times Now", "description": "The black hole is said to shine 7,000 times brighter than all the light from our own galaxy as per the report.", "url": "https://www.timesnownews.com/technology-science/astronomers-discover-fastest-growing-black-hole-of-the-last-9-billion-years-consumes-equivalent-of-1-earth-every-second-article-92338967", "urlToImage": "https://static.tnn.in/thumb/msid-92338967,imgsize-100,width-1280,height-720,resizemode-75/92338967.jpg", "publishedAt": "2022-06-20T12:16:00Z", "content": "Vishal Dadlani sends a message to Indian muslims amid prophet row, says, 'You are seen and heard, loved and treasured'"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "'Betelgeuse on steroids' sheds light on how rare massive stars die - Space.com", "description": "VY Canis Majoris is dying, and astronomers are watching the red hypergiant star's final era to better understand what happens at the end of a stellar life cycle.", "url": "https://www.space.com/rare-hypergiant-star-death", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VjG3dhw2vMxY42BCVEGQuU-1200-80.jpeg", "publishedAt": "2022-06-20T11:50:57Z", "content": "A new map of one of the most massive stars in our galaxy is shedding light on what happens in the final stages of a giant star's death.\r\nAstronomers created a detailed 3D map of VY Canis Majoris, a d… [+5791 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Physicists build coherent atom laser that can stay on continuously - News9 LIVE", "description": "For the first time, scientists have created continuous beams instead of pulses of matter waves", "url": "https://www.news9live.com/science/physicists-build-coherent-atom-laser-that-can-stay-on-continuously-177512", "urlToImage": "https://media.news9live.com/h-upload/2022/06/20/434701-m-m-vdeppugqixq-unsplashcropped.jpg", "publishedAt": "2022-06-20T11:19:37Z", "content": "Lasers are coherent waves of light, with all the light being coherent, or having the exact same frequency and waveform. This allows lasers to be tightly focused, allowing for a range of applications … [+3716 chars]"}, {"source": {"id": null, "name": "Advanced Science News"}, "author": "Andrey Feldman", "title": "Standard Model tested with record-breaking accuracy - Advanced Science News", "description": "Researchers put quantum electrodynamics to the test, pushing the boundaries of the Standard Model of physics.", "url": "https://www.advancedsciencenews.com/standard-model-tested-with-record-breaking-accuracy/", "urlToImage": "https://k9f7a9j9.rocketcdn.me/wp-content/uploads/2022/06/Standard-Model-of-physics-tested-in-new-experiment.jpg", "publishedAt": "2022-06-20T11:15:00Z", "content": "Our understanding of charged particles interactions with each other and electromagnetic fields is based on quantum electrodynamics (QED), which is an integral part of the Standard Model our best work… [+5300 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA adds another target for its Lucy mission; asteroid number jumps to nine - Republic World", "description": "NASA's Lucy spacecraft, which launched last October to study eight distinct asteroids in Jupiter's orbit, has found its ninth target. Know details here.", "url": "https://www.republicworld.com/science/space/nasa-adds-another-target-for-its-lucy-mission-asteroid-number-jumps-to-nine-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ytm5czxjndq6fxo6_1655720437.jpeg", "publishedAt": "2022-06-20T10:39:00Z", "content": "NASA's Lucy spacecraft, which launched last October to study eight distinct asteroids in Jupiter's orbit has found its ninth target. This new object was identified by scientists when they discovered … [+2034 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Find Fossil Of Prehistoric Bear-Dog That Lived In France 12 Million Years Ago - NDTV", "description": "Scientists said the jawbone they found had a unique lower premolar, suggesting it belonged to a genus of the predator species never seen before.", "url": "https://www.ndtv.com/science/scientists-find-fossil-of-prehistoric-bear-dog-that-lives-in-france-12-million-years-ago-3083104", "urlToImage": "https://c.ndtvimg.com/2022-06/fcdgghe_bear-dog-fossil-650_625x300_20_June_22.jpg", "publishedAt": "2022-06-20T08:28:38Z", "content": "Many different types of amphicyonid species existed in Europe during the early Miocene period.\r\nA group of scientists has found a fossilised lower jaw of a giant creature that one roamed the Earth. N… [+1495 chars]"}, {"source": {"id": null, "name": "Timebulletin.com"}, "author": "Raeesa Sayyad", "title": "France signs NASA’s worldwide pact Artemis Accords, joining the lunar mission - Time Bulletin", "description": "France is the latest signatory to NASA's worldwide pact to make best practices for constant participation in moon investigation, the Artemis Accords. The signing occurred on June 7 and adds to a quickly developing list of countries, with Colombia just joining…", "url": "https://www.timebulletin.com/france-signs-nasas-worldwide-pact-artemis-accords-joining-the-lunar-mission/", "urlToImage": "https://www.timebulletin.com/wp-content/uploads/2022/06/France-signs-NASA-worldwide-pact-Artemis-Accords-joining-the-lunar-mission.jpg", "publishedAt": "2022-06-20T07:54:34Z", "content": "France is the latest signatory to NASA’s worldwide pact to make best practices for constant participation in moon investigation, the Artemis Accords.\r\nThe signing occurred on June 7 and adds to a qui… [+3017 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Dinosaurs indeed had belly buttons - Tech Explorist", "description": "The oldest belly button ever found in reptiles and mammals.", "url": "https://www.techexplorist.com/dinosaurs-indeed-belly-buttons/48294/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/Psittacosaurus.jpg", "publishedAt": "2022-06-20T07:16:40Z", "content": "Dinosaurs, unlike humans, had no umbilical cord because they deposited eggs. Dinosaur yolk sacs were connected to the body by a slit-like aperture, also discovered in other egg-laying terrestrial ani… [+2760 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Did a giant radio telescope in China just discover aliens? Not so FAST… - Deccan Herald", "description": "By Danny C Price for The Conversation This phrase is the standard that astronomers will be applying to a curious signal captured with China’s \"Sky Eye\" telescope that might be a transmission from alien technology. An article reporting the signal was posted on…", "url": "https://www.deccanherald.com/science-and-environment/did-a-giant-radio-telescope-in-china-just-discover-aliens-not-so-fast-1119712.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/06/20/radio-signals-istock-1266326319-1119712-1655707597.jpg", "publishedAt": "2022-06-20T06:46:37Z", "content": "By Danny C Price for The Conversation\r\nThis phrase is the standard that astronomers will be applying to a curious signal captured with Chinas \"Sky Eye\" telescope that might be a transmission from ali… [+4985 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Check out this amazing retro NASA game called Roman Space Observer; catch black holes, galaxies! - HT Tech", "description": "NASA has launched an amazing 8-bit retro space to spread information about the Nancy Grace Roman Telescope among the youth. Here’s more about the game named after the 'mother of Hubble Telescope', Nancy Roman.", "url": "https://tech.hindustantimes.com/gaming/news/check-out-this-amazing-retro-nasa-game-called-roman-space-observer-catch-black-holes-galaxies-71655705980698.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/20/1600x900/Screenshot_2022-06-20_115335_1655706226752_1655706242891.jpg", "publishedAt": "2022-06-20T06:24:55Z", "content": "NASA has launched its latest game, called the Roman Space Observer to spread information about the Nancy Grace Roman Telescope among the younger generations. This is not NASAs first venture into the … [+1747 chars]"}]}