{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Your liver is just under three years old - Science Daily", "description": "The liver has a unique ability to regenerate after damage. However, it was unknown whether this ability decreases as we age. Scientists have now used a technique known as retrospective radiocarbon birth dating to determine the age of the human liver. They sho…", "url": "https://www.sciencedaily.com/releases/2022/05/220531111844.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-31T18:11:21Z", "content": "The liver has a unique ability to regenerate after damage. However, it was unknown whether this ability decreases as we age. International scientists led by Dr. Olaf Bergmann at the Center for Regene… [+5836 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": "Alice Jane", "title": "New Paper Offers Surprisingly Ingenious Way We Might Colonize Planets in the Galaxy in Future - Galaxy Reporters", "description": "The challenges of traveling among the stars are enormous. However, another scientist has suggested a simple (albeit slow-moving) way move between the stars: let the floating planets freely carry us. If it were true, it might change how we want to live somewhe…", "url": "https://galaxyreporters.com/new-paper-offers-surprisingly-ingenious-way-we-might-colonize-planets-in-the-galaxy-in-future/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/Distant-galaxy-is-not-a-galaxy-in-the-least-—-however-one-in-all-the-brightest-pulsars-ever-detected.webp", "publishedAt": "2022-05-31T18:07:47Z", "content": "The challenges of traveling among the stars are enormous. However, another scientist has suggested a simple (albeit slow-moving) way move between the stars: let the floating planets freely carry us. … [+2676 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Novel cloud-based platform to discover hidden asteroids - Devdiscourse", "description": "Read more about Novel cloud-based platform to discover hidden asteroids on Devdiscourse", "url": "https://www.devdiscourse.com/article/technology/2056933-novel-cloud-based-platform-to-discover-hidden-asteroids", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_01_2022_10_42_11_4427312.jpg?width=920&format=jpeg", "publishedAt": "2022-05-31T17:26:39Z", "content": "B612 Foundation's Asteroid Institute has found a new way of discovering hidden asteroids in existing datasets. The novel cloud-based method has found and validated 104 new asteroids, opening the poss… [+1786 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Scotty Hendricks", "title": "Martian sands offer new look into the planet's ancient climate - Big Think", "description": "A new study of Martian dust gives insights into the ancient Martian climate. The findings hint at a wetter world.", "url": "https://bigthink.com/hard-science/ancient-martian-climate/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/05/mars-ga5c969775_1280.png", "publishedAt": "2022-05-31T17:00:00Z", "content": null}, {"source": {"id": null, "name": "Hitechwiki.com"}, "author": "https://www.facebook.com/kajusweety", "title": "NASA needs you to go to Mars - Hitechwiki.com", "description": "If you’ve always had a passion for space and want to humbly help NASA, you may have the chance of a lifetime to do so. Indeed, the American space agency has just asked for the help of many private space companies, and other prestigious universities to work on…", "url": "https://hitechwiki.com/nasa-needs-you-to-go-to-mars/", "urlToImage": null, "publishedAt": "2022-05-31T16:59:08Z", "content": "If you’ve always had a passion for space and want to humbly help NASA, you may have the chance of a lifetime to do so. Indeed, the American space agency has just asked for the help of many private sp… [+2678 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "CAPSTONE: A pathfinding moon cubesat for the Artemis program - Space.com", "description": "CAPSTONE is a vital step in returning humans to the lunar surface.", "url": "https://www.space.com/capstone-moon-cubesat-mission", "urlToImage": "https://cdn.mos.cms.futurecdn.net/McaTsst8sPDrubb3cqfWr5-1200-80.gif", "publishedAt": "2022-05-31T16:11:04Z", "content": "CAPSTONE is an important mission for the next generation of space exploration.\r\nA significant step on this ambitious journey will be a crewed mission to the surface of the moon under the Artemis prog… [+10207 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Boost Your Productivity With the Zeigarnik Effect - SciTechDaily", "description": "The Zeigarnik effect describes the way unfinished tasks remain active in our mind, intruding into our thoughts and our sleep until they are dealt with, much like a hungry person will notice every restaurant and appetizing smell on their way home and then lose…", "url": "https://scitechdaily.com/boost-your-productivity-with-the-zeigarnik-effect/", "urlToImage": "https://scitechdaily.com/images/Boosting-Productivity-Illustration.jpg", "publishedAt": "2022-05-31T16:05:47Z", "content": "You can boost your productivity by taking advantage of the Zeigarnik effect.\r\nThe Zeigarnik effect describes the way unfinished tasks remain active in our mind, intruding into our thoughts and our sl… [+9929 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Researchers Develop Coating Material from TiO2 Nanocrystals to Produce Light-sensitive, Rewritable System - AZoM", "description": "Researchers have succeeded in developing a coating material that can be written on with UV light and then removed with oxygen. Modifications on rewritable paper might help cut down on paper waste in a number of settings.", "url": "https://www.azom.com/news.aspx?newsID=59216", "urlToImage": "https://www.azom.com/images/news/ImageForNews_59216_16540003759525263.gif", "publishedAt": "2022-05-31T15:53:00Z", "content": "Researchers have succeeded in developing a coating material that can be written on with UV light and then removed with oxygen. Modifications on rewritable paper might help cut down on paper waste in … [+2892 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Boeing capsule returns to Earth from space station - AP Archive", "description": "(26 May 2022) RESTRICTION SUMMARY: MUST CREDIT NASA++ON SCREEN GRAPHICS AND COMMENTARY AT SOURCE++NASA - MUST CREDIT NASAWhite Sands Missile Range, New Mexic...", "url": "https://www.youtube.com/watch?v=hOo_qHualoA", "urlToImage": "https://i.ytimg.com/vi/hOo_qHualoA/hqdefault.jpg", "publishedAt": "2022-05-31T15:45:36Z", "content": null}, {"source": {"id": null, "name": "Republic World"}, "author": "Republic World", "title": "7 stargazing apps for you to spot constellations, asteroids and much more - Republic World", "description": "7 stargazing apps for you to spot constellations, asteroids and much more", "url": "https://www.republicworld.com/amp/web-stories/7-stargazing-apps-for-you-to-spot-constellations-asteroids-and-much-more-9300.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/images/xxhdpi/3gurvz2029cfhgvj_1654010362.jpeg", "publishedAt": "2022-05-31T15:42:48Z", "content": "This app called Star Tracker helps you identify 88 constellations and over 8,000 space objects in real-time. It is available for free in both Android and iOS. \r\n Image: Star Tracker/@Google Playstore… [+1077 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "IANS", "title": "Webb telescope to explore two rocky, Earths-like planets - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/tech/webb-telescope-to-explore-two-rocky-earths-like-planets", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-04%2Fe7c70fde-5215-4ccc-a5cd-483655ea5b1a%2FIMG_20220415_105641.jpg?rect=0%2C104%2C512%2C269&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-05-31T15:28:49Z", "content": "It turns out that different types of rock have different spectra,\" said Laura Kreidberg at the Max Planck Institute for Astronomy.\r\n\"You can see with your eyes that granite is lighter in color than b… [+856 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Stargazers can witness the Tau Herculids meteor shower in clear night skies - Economic Times", "description": "The Tau Herculids meteor shower is a once-in-five-years event which promises an ethereal view of more than 1000 shooting stars. Find out from where you can witness this celestial event.", "url": "https://economictimes.indiatimes.com/news/international/us/stargazers-can-witness-the-tau-herculids-meteor-shower-in-clear-night-skies/articleshow/91923592.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91923570,width-1070,height-580,imgsize-136866,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-31T15:13:00Z", "content": "Different countries worldwide can witness the Tau Herculids meteor shower on the nights of 29th and 30th May 2022. The event is reported to be a meteor storm with 1000 shooting stars every hour. Acco… [+1794 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A new arrangement: Using quantum dots to quench the smallest ferrimagnetism - Phys.org", "description": "Most people are not aware of magnetic forces in their everyday lives, but continuously rely on them in electric motors, hard drives, and electric sensors. In the race to develop smaller electronic components, quantum mechanisms of these components need to be …", "url": "https://phys.org/news/2022-05-quantum-dots-quench-smallest-ferrimagnetism.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-new-arrangement-usin.jpg", "publishedAt": "2022-05-31T14:19:31Z", "content": "Most people are not aware of magnetic forces in their everyday lives, but continuously rely on them in electric motors, hard drives, and electric sensors. In the race to develop smaller electronic co… [+3403 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Two dimensional Airy beam soliton | Scientific Reports - Nature.com", "description": "Scientific Reports - Two dimensional Airy beam soliton", "url": "https://www.nature.com/articles/s41598-022-12758-5", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-12758-5/MediaObjects/41598_2022_12758_Fig1_HTML.png", "publishedAt": "2022-05-31T14:09:49Z", "content": "<li>Siviloglou, G. A. &amp; Christodoulides, D. N. Accelerating finite energy Airy beams. Opt. Lett.32, 979 (2007).\r\nADS \r\n Article \r\nGoogle Scholar \r\n</li><li>Berry, M. V. &amp; Balazs, N. L. Nonspr… [+6284 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA's projected asteroid mission is being questioned by a House committee - BollyInside", "description": "House Science Committee members used a hearing on the decadal assessment of planetary science to criticise a proposal in NASA’s budget request to postpone", "url": "https://www.bollyinside.com/news/nasas-projected-asteroid-mission-is-being-questioned-by-a-house-committee", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/NASAs-projected-asteroid-mission-is-being-questioned-by-a-House.jpeg", "publishedAt": "2022-05-31T13:49:42Z", "content": "House Science Committee members used a hearing on the decadal assessment of planetary science to criticise a proposal in NASAs budget request to postpone development on a space telescope to track nea… [+3985 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Low-Cost Gel Film Can Pull Drinking Water From Air In Deserts: US Study - ABP Live", "description": "Scientists developed a low-cost gel film made up of abundant materials that can pull water from the air in even the driest climates. The materials facilitating this reaction cost $2 per kilogram.", "url": "https://news.abplive.com/trending/low-cost-gel-film-can-pull-drinking-water-from-air-in-deserts-us-study-1534834", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/05/31/d172b11ad65db4048c3848bda4fcafd0_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-05-31T13:25:03Z", "content": "New Delhi: More than one-third of the world's population lives in drylands, which are areas experiencing significant water shortages. Scientists and engineers at University of Texas in Austin, United… [+3214 chars]"}, {"source": {"id": null, "name": "Search Engine Journal"}, "author": "https://www.facebook.com/martinibuster", "title": "Inlinks Launches New Keyword & Topic Research Tool - Search Engine Journal", "description": "Inlinks launches keyword topic and content planning tool that speeds up the content creation process", "url": "https://www.searchenginejournal.com/inlinks-launches-new-keyword-topic-research-tool/452370/", "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/05/inlinks-6295b7f45a29e-sej.jpg", "publishedAt": "2022-05-31T13:24:32Z", "content": "Inlinks published an update to its keyword topic research tool that finds and clusters keywords by intent.\r\nThe tool is available today for all subscribers. Here’s what’s new.\r\nKeyword Research\r\nIn t… [+2908 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "A new kind of solar sail could let us explore difficult places to reach in the solar system - Phys.org", "description": "Solar sailing technology has been a dream of many for decades. The simple elegance of sailing on the light waves of the sun does have a dreamy aspect to it that has captured the imagination of engineers as well as writers. However, the practicalities of the a…", "url": "https://phys.org/news/2022-05-kind-solar-explore-difficult.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-new-kind-of-solar-sa.jpg", "publishedAt": "2022-05-31T13:17:19Z", "content": "Solar sailing technology has been a dream of many for decades. The simple elegance of sailing on the light waves of the sun does have a dreamy aspect to it that has captured the imagination of engine… [+3444 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Functional nonlinear optical nanoparticles synthesized by laser ablation - Phys.org", "description": "Nonlinear optics is an important research direction with various applications in laser manufacturing, nanostructures' fabrication, sensor design, optoelectronics, biophotonics, and quantum optics, etc. Nonlinear optical materials are the fundamental building …", "url": "https://phys.org/news/2022-05-functional-nonlinear-optical-nanoparticles-laser.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/functional-nonlinear-o.jpg", "publishedAt": "2022-05-31T13:09:06Z", "content": "Nonlinear optics is an important research direction with various applications in laser manufacturing, nanostructures' fabrication, sensor design, optoelectronics, biophotonics, and quantum optics, et… [+5407 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA's Tik-Toker astronaut shows what happens inside ISS during orbit adjustment; WATCH - Republic World", "description": "ESA astronaut Samantha Christoforetti arrived at the International Space Station last month for a six-month-long stay with NASA’s Crew-4 team.", "url": "https://www.republicworld.com/science/space/esas-tik-toker-astronaut-shows-what-happens-inside-iss-during-orbit-adjustment-watch-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/fz3qqv9d5drmozpa_1654000907.jpeg", "publishedAt": "2022-05-31T12:49:00Z", "content": "ESA astronaut Samantha Christoforetti arrived at the International Space Station (ISS) last month for a six-month-long stay with NASAs Crew-4 team. Ever since her mission began, she has kept her foll… [+2105 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "The Sun is spinning round again - Tech Explorist", "description": "An international team has successfully developed a model to solve part of the solar problem.", "url": "https://www.techexplorist.com/sun-spinning-round-again/47728/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/rotation-of-sun.jpg", "publishedAt": "2022-05-31T12:43:15Z", "content": "The Sun is a great starting point for modeling the many physical processes in stellar interiors. However, the results of helioseismology, which provide information on the nature of the Sun’s interior… [+3088 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breakthrough Takes Us a Step Closer to Real-World Terahertz Technologies - SciTechDaily", "description": "Scientists have discovered a new effect in two-dimensional conductive systems that promises improved performance of terahertz detectors. A recent physics discovery in two-dimensional conductive systems enables a new type of terahertz detector. Terahertz frequ…", "url": "https://scitechdaily.com/breakthrough-takes-us-a-step-closer-to-real-world-terahertz-technologies/", "urlToImage": "https://scitechdaily.com/images/Body-Scanner-Security-Concept.gif", "publishedAt": "2022-05-31T12:42:41Z", "content": "Terahertz technology could enable advanced scanners for security, medicine, and materials science. It could also enable much faster wireless communications devices than are currently possible.\r\nScien… [+5915 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Dev Shah", "title": "Ineffective air conditioning on my 10 day old VW Taigun 1.0 TSI MT - Team-BHP", "description": "BHPian adigup recently shared this with other enthusiasts. The A/C of my Taigun Highline 1.0 MT (Just 10 days old) with blower speed of 4 and temperature set to 19 degrees, isn't cooling at all. Outside temperature is 41 degrees, and it has literally made me …", "url": "https://www.team-bhp.com/news/ineffective-air-conditioning-my-10-day-old-vw-taigun-10-tsi-mt", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/taigun_12.jpg", "publishedAt": "2022-05-31T11:55:52Z", "content": "BHPian adigup recently shared this with other enthusiasts.\r\nThe A/C of my Taigun Highline 1.0 MT (Just 10 days old) with blower speed of 4 and temperature set to 19 degrees, isn't cooling at all. Out… [+2763 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Russia to launch its Luna-25 probe to Moon in September amid snubbing by Europe - Republic World", "description": "Russia will launch its Luna-25 probe to the Moon at the end of September this year, Dmitry Rogozin, head of the Russian space agency Roscosmos said.", "url": "https://www.republicworld.com/science/space/russia-to-launch-its-luna-25-probe-to-moon-in-september-amid-snubbing-by-europe-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ag8ub3zaycaliyt2_1653995406.jpeg", "publishedAt": "2022-05-31T11:22:00Z", "content": "In a key development, Russia will launch its Luna-25 probe to the Moon by the end of September this year, Dmitry Rogozin, head of the Russian space agency Roscosmos informed on Tuesday, May 31. Accor… [+2213 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "What are asteroids and why do they come so frighteningly close to Earth? NASA tells us - HT Tech", "description": "As the largest asteroid of 2022 flew past the Earth on May 27th, the question arises: what are asteroids, how are they formed and why do so many of them approach so frightfully close to our planet? NASA reveals the truth.", "url": "https://tech.hindustantimes.com/tech/news/what-are-asteroids-and-why-do-they-come-so-frighteningly-close-to-earth-nasa-tells-us-71653994338490.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/31/1600x900/asteroid_(Flickr)_1638627105271_1653994501947.jpg", "publishedAt": "2022-05-31T10:58:34Z", "content": "Last week, we witnessed the largest asteroid of the year 2022 make its way very near Earth and then fly past. The Earth is approached by an asteroid almost every other week. In fact, there are around… [+3221 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Mirror world of dark particles could explain cosmic anomaly – Physics World - physicsworld.com", "description": "Differing values of the Hubble constant might be reconciled via the dark sector", "url": "https://physicsworld.com/a/mirror-world-of-dark-particles-could-explain-cosmic-anomaly/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/05/Cosmic-microwave-background.jpg", "publishedAt": "2022-05-31T10:48:32Z", "content": "In tension: the cosmic microwave background as seen by the Planck space telescope. It yields a value of the Hubble constant that is different from values measured in the nearby universe. (Courtesy: E… [+6357 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "https://www.facebook.com/malewar.amit", "title": "NASA’s Ingenuity Mars Helicopter captures its longest, fastest flight - Inceptive Mind", "description": "Ingenuity is currently preparing for its 29th flight.", "url": "https://www.inceptivemind.com/nasa-ingenuity-mars-helicopter-captures-longest-fastest-flight/24902/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2022/05/Ingenuity-flight.jpg", "publishedAt": "2022-05-31T10:33:24Z", "content": "On April 18, 2022, NASA’s Ingenuity Mars Helicopter made a record-breaking 25th flight. The black-and-white navigation camera aboard the rotorcraft captured its longest and fastest flight to date on … [+1870 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "Meet Mercury: Fascinating details about the smallest planet in our solar system - Interesting Engineering", "description": "Mercury, the smallest planet in our solar system, is a land of contradictions. Simultaneously freezing cold and boiling hot, Earth's cousin is a true survivor.", "url": "https://interestingengineering.com/mercury-smallest-planet-solar-system", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/bM6Al0R7G7/sizes/729223main-728322main-messenger-orbit-image20130218-2-full-full-full_md.jpg", "publishedAt": "2022-05-31T10:21:25Z", "content": "Aptly named after the speedy messenger god of the Roman pantheon (Hermes in the ancient Greek one), the planet Mercury is the \"speed freak\" of our Solar System.\r\nNot only that, but Mercury, like all … [+16998 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "NASA's SOFIA flying telescope spots eclipse of odd binary star - Space.com", "description": "NASA's flying telescope SOFIA has been watching an eclipse of a binary star, allowing astronomers to study how the two exchange stardust.", "url": "https://www.space.com/sofia-telescope-captures-binary-star-eclipse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FAdsPhgqfjZ3B8MTcMuf6k-1200-80.jpg", "publishedAt": "2022-05-31T10:13:23Z", "content": "A composite image of the R Aquarii binary star captured by NASA's flying telescope SOFIA. (Image credit: NASA)\r\nNASA's flying telescope SOFIA has been watching a dance between two stars orbiting each… [+3608 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Humans Not Enough: Astronomer Thinks Mars Colonisers Would Have To Become Cyborgs - Indiatimes.com", "description": "In order to solidify humanity's long-term presence on Mars, humans would have to fuse with robots, an astronomer thinks. Lord Martin Rees, a British cosmologist, and the fifteenth Astronomer Royal recently said that humans on Mars would have to become cyborgs…", "url": "https://www.indiatimes.com/technology/news/humans-not-enough-astronomer-thinks-mars-colonisers-would-have-to-become-cyborgs-570977.html", "urlToImage": "https://im.indiatimes.in/content/2022/May/Social-image_6295e69d5dbad.jpg", "publishedAt": "2022-05-31T09:56:21Z", "content": "In order to solidify humanity's long-term presence on Mars, humans would have to fuse with robots, an astronomer thinks. Lord Martin Rees, a British cosmologist, and the fifteenth Astronomer Royal re… [+2108 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA prepares to move ahead with next-gen spacesuit development for Artemis missions - Republic World", "description": "NASA, along with its partners, is working on next-generation Artemis spacesuits which would provide better protection, more flexibility and better cooling.", "url": "https://www.republicworld.com/science/space/nasa-prepares-to-move-ahead-with-next-gen-spacesuit-development-for-artemis-missions-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ephhzlrxsxqqmdvk_1653989769.jpeg", "publishedAt": "2022-05-31T09:52:00Z", "content": "When astronauts depart for the Moon later this decade under the Artemis Program, they will not just bounce around and return with rock samples. This time, NASA and its collaborators have plans to sen… [+2606 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Ural Federal University: Scientists Synthesize Material for Fuel Cells - India Education Diary", "description": "Scientists at Ural Federal University and the Institute of High Temperature Electrochemistry, Ural Branch of the Russian Academy of Sciences have synthesized a proton conductor, a solid electrolyte in which positively charged hydrogen (proton) partic", "url": "https://indiaeducationdiary.in/ural-federal-university-scientists-synthesize-material-for-fuel-cells/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/Ural_Federal_University_eng-3.jpg", "publishedAt": "2022-05-31T09:50:43Z", "content": "Scientists at Ural Federal University and the Institute of High Temperature Electrochemistry, Ural Branch of the Russian Academy of Sciences have synthesized a proton conductor, a solid electrolyte i… [+3908 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "This thermal imager on NASA's Europa Clipper will survey Jupiter moon's frozen surface | Science-Environment - Devdiscourse", "description": "Read more about This thermal imager on NASA's Europa Clipper will survey Jupiter moon's frozen surface on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2056174-this-thermal-imager-on-nasas-europa-clipper-will-survey-jupiter-moons-frozen-surface", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_12_2021_17_49_29_4323111.jpg?width=920&format=jpeg", "publishedAt": "2022-05-31T08:57:27Z", "content": "The Europa Thermal Emission Imaging System (E-THEMIS), one of the nine science instruments which will fly aboard NASA's Europa Clipper spacecraft, recently arrived at the agency's Jet Propulsion Labo… [+1842 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Sydney: Unusual neutron star discovered in stellar graveyard - India Education Diary", "description": "An international team led by a University of Sydney scientist has discovered an unusual radio signal emitting neutron star that rotates extremely slowly, completing one rotation every 76 seconds.The star is unique because it resides in the ‘neutron s", "url": "https://indiaeducationdiary.in/university-of-sydney-unusual-neutron-star-discovered-in-stellar-graveyard/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/04/University-of-Sydney-1.png", "publishedAt": "2022-05-31T08:41:17Z", "content": "An international team led by a University of Sydney scientist has discovered an unusual radio signal emitting neutron star that rotates extremely slowly, completing one rotation every 76 seconds.\r\nTh… [+1949 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "First Australians consumed the eggs of a two-meter tall bird - Tech Explorist", "description": "First humans did routinely raid nests and steal their giant eggs for food.", "url": "https://www.techexplorist.com/first-australians-consumed-eggs-two-meter-tall-bird/47688/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/Genyornis.jpg", "publishedAt": "2022-05-31T08:19:24Z", "content": "Burn markings discovered on old shell scraps some years ago revealed that the early Australians cooked and ate huge eggs laid by a long-extinct bird, igniting a vigorous debate about the species that… [+3172 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "How did first black holes form, looked like? Webb telescope to find clues by going back in time - India Today", "description": "Black holes have become the most enigmatic phenomenon in the universe. They are big and completely invisible. Webb will travel back in time to look for their origin.", "url": "https://www.indiatoday.in/science/story/how-did-first-black-holes-form-looked-like-webb-telescope-to-find-clues-by-going-back-in-time-1956418-2022-05-31", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/Black_hole_1_2-647x363.jpeg?qNFu5rRzkOAhzXDJYH5rP4Ai1jg_kRPh", "publishedAt": "2022-05-31T07:38:03Z", "content": "The James Webb Telescope is now at its optimal cooling temperature, its mirrors calibrated and has its targets set. The flying observatory will look for evidence of the first black holes that formed … [+2619 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "Researchers can now image cells, molecule movements in ‘6D’ - OI Canadian", "description": "Research from Matthew Lew's lab at Washington University in St. Louis offers entirely new ways to see the very small. The research – two papers written by PhD students at the McKelvey School of Engine", "url": "https://oicanadian.com/researchers-can-now-image-cells-molecule-movements-in-6d/", "urlToImage": "https://s3.eu-west-1.amazonaws.com/s3.housseniawriting.com/wp-content/uploads/2022/01/23074325/genetique-2.jpg", "publishedAt": "2022-05-31T07:27:10Z", "content": "Research from Matthew Lew’s lab at Washington University in St. Louis offers entirely new ways to see the very small.The research two papers written by PhD students at the McKelvey School of Engineer… [+2251 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "A galaxy hiding behind the Milky Way is discovered by the Hubble telescope - Times Now", "description": "Despite being relatively bright enough, thick cosmic gas, dark dust and glowing stars, hide the Galaxy from our view", "url": "https://www.timesnownews.com/technology-science/a-galaxy-hiding-behind-the-milky-way-is-discovered-by-the-hubble-telescope-article-91909960", "urlToImage": "https://static.tnn.in/thumb/msid-91909960,imgsize-100,width-1280,height-720,resizemode-75/91909960.jpg", "publishedAt": "2022-05-31T06:50:12Z", "content": "Visceral fat: A small, red-coloured berry could melt fat three times faster as compared to chilly peppers"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Themeinwp.", "title": "Artificial intelligence will help astronomers look for new exoplanets - The Times Hub", "description": "Photo: ESO/M. Kornmesser/Wikimedia Commons Artificial intelligence in the form of machine learning allows you to uncover unexpected connections hidden in the complex mathematics that follow from the theory of general relativity, and apply all this to the sear…", "url": "https://thetimeshub.in/artificial-intelligence-will-help-astronomers-look-for-new-exoplanets/8816/", "urlToImage": null, "publishedAt": "2022-05-31T05:04:27Z", "content": "Read Time:2 Minute, 8 Second\r\nPhoto: ESO/M. Kornmesser/Wikimedia Commons\r\nArtificial intelligence in the form of machine learning allows you to uncover unexpected connections hidden in the complex ma… [+2450 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "New class of substances detected in atmospheric chemistry - Chemie.de", "description": "An international research team has now succeeded in detecting hydrotrioxides (ROOOH) for the first time under atmospheric conditions. Until now, there was only speculation that these organic compo ...", "url": "https://www.chemeurope.com/en/news/1176296/new-class-of-substances-detected-in-atmospheric-chemistry.html", "urlToImage": "https://rs1.chemie.de/images//172119-76.jpg", "publishedAt": "2022-05-31T04:35:12Z", "content": "An international research team has now succeeded in detecting hydrotrioxides (ROOOH) for the first time under atmospheric conditions. Until now, there was only speculation that these organic compound… [+4249 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Astronaut reveals highlights of recent space voyage - Digital Trends", "description": "After returning from the ISS earlier this month, German astronaut Matthias Maurer has been talking about what it was like to live and work in space.", "url": "https://www.digitaltrends.com/space/astronaut-reveals-highlights-of-recent-space-voyage/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2021/07/international-space-station-exterior-earth.jpg?p=1", "publishedAt": "2022-05-31T04:10:48Z", "content": "With his six-month stay aboard the International Space Station (ISS) now behind him, German astronaut Matthias Maurer has been talking about what it was like to live and work in space.\r\nThe European … [+2048 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The Hubble Space Telescope bets on the observation of galactic scenarios - BollyInside", "description": "This Hubble Space Telescope image depicts the barred spiral galaxy NGC 7496, which is located in the constellation Grus and is roughly 24 million", "url": "https://www.bollyinside.com/news/the-hubble-space-telescope-bets-on-the-observation-of-galactic-scenarios", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/The-Hubble-Space-Telescope-bets-on-the-observation-of-galactic.jpeg", "publishedAt": "2022-05-30T22:25:30Z", "content": "This Hubble Space Telescope image depicts the barred spiral galaxy NGC 7496, which is located in the constellation Grus and is roughly 24 million light-years away from Earth. This constellation, name… [+1350 chars]"}, {"source": {"id": null, "name": "Newsazi.com"}, "author": "Amelia Podder", "title": "Researchers develop new type of camera to image quantum vortices for the first time - News Azi", "description": "(Left) A sketch of the experimental cell used to controllably destroy the superfluidity and image an accompanying quantum vortex tangle. The quasiparticle source (blackbody radiator, B", "url": "https://newsazi.com/researchers-develop-new-type-of-camera-to-image-quantum-vortices-for-the-first-time/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/physicists-develop-new.jpg", "publishedAt": "2022-05-30T20:48:04Z", "content": "(Left) A sketch of the experimental cell used to controllably destroy the superfluidity and image an accompanying quantum vortex tangle. The quasiparticle source (blackbody radiator, BBR) illuminates… [+4121 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Do Trojan exoplanets exist? - Space.com", "description": "Investigating these co-orbiting worlds in our own solar system may help us predict prevalence in extrasolar systems.", "url": "https://www.space.com/do-trojan-exoplanets-exist-study", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YPLzwGRadHRrWgNgu2DFyS-1200-80.jpg", "publishedAt": "2022-05-30T20:00:09Z", "content": "Co-orbiting worlds, also known as Trojans, have not been found yet outside the solar system. That's a strange thing, a new study suggests, given we see them constantly closer to home.\r\nOur solar syst… [+2998 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "What do we hear on Mars? The NASA recordings playlist - OI Canadian", "description": "The picture is fine. But when the sound isn't there, there's no denying it, something is really missing. And it is this something more about Mars that Perseverance brings us thanks to the sounds that", "url": "https://oicanadian.com/what-do-we-hear-on-mars-the-nasa-recordings-playlist/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/wide1920/1/0/d/10d19b77fe_50189864_perseverance-mars-playlist.jpg", "publishedAt": "2022-05-30T19:22:42Z", "content": "The picture is fine. But when the sound isn’t there, there’s no denying it, something is really missing. And it is this something more about Mars that Perseverance brings us thanks to the sounds that… [+2066 chars]"}, {"source": {"id": null, "name": "Ironbladeonline.com"}, "author": "Cheryl Riley", "title": "Astrophotographer captures swirling plasma on the surface of the sun in stunning high-resolution image - Ferrum College : Iron Blade Online", "description": "A photographer captured a 286-megapixel image of the sun during the most intense period of solar activity in decades.The image shows huge fireballs", "url": "https://ironbladeonline.com/astrophotographer-captures-swirling-plasma-on-the-surface-of-the-sun-in-stunning-high-resolution-image/", "urlToImage": "https://ironbladeonline.com/wp-content/uploads/2022/05/Astrophotographer-captures-swirling-plasma-on-the-surface-of-the-sun.jpg", "publishedAt": "2022-05-30T19:21:15Z", "content": "A photographer captured a 286-megapixel image of the sun during the most intense period of solar activity in decades.\r\nThe image shows huge fireballs rotating on the surface of the Sun, and it can be… [+7216 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA to roll out its SLS rocket on June 6 for crucial tests ahead of Artemis 1 mission - Republic World", "description": "NASA said that the Artemis 1 rocket will be rolled out of the Vehicle Assembly Building to the launch pad 39A of the Kennedy Space Center at midnight on June 6.", "url": "https://www.republicworld.com/science/space/nasa-to-roll-out-its-sls-rocket-on-june-6-for-crucial-tests-ahead-of-artemis-1-mission-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/6dcoilkauujidfdw_1653932004.jpeg", "publishedAt": "2022-05-30T18:56:00Z", "content": "The Space Launch System (SLS) rocket will be brought back to the launchpad for crucial tests ahead of the Artemis 1 mission on June 6, NASA revealed in an update. The agency said that the rocket will… [+2005 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "What exactly is reality? Brian Cox's 'Horizons' Tour Delves Into the Mysteries of the Universe - BollyInside - BollyInside", "description": "Brian Cox wants you to think about the nature of the space-time continuum and our location inside it. That may appear to be a large lift, so the", "url": "https://www.bollyinside.com/news/what-exactly-is-reality-brian-coxs-horizons-tour-delves-into-the-mysteries-of-the-universe", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/What-exactly-is-reality-Brian-Coxs-Horizons-Tour-Delves-Into.jpeg", "publishedAt": "2022-05-30T18:49:38Z", "content": "Brian Cox wants you to think about the nature of the space-time continuum and our location inside it.\r\nThat may appear to be a large lift, so the world-renowned physicist is here to help. Cox is pres… [+3494 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A strange cosmic entity opposes the Milky Way - BollyInside", "description": "It sounds like the plot of a lousy science fiction film: Beyond the borders of our galaxy, there is some mysterious creature pushing against us with great", "url": "https://www.bollyinside.com/news/a-strange-cosmic-entity-opposes-the-milky-way", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/A-strange-cosmic-entity-opposes-the-Milky-Way.jpeg", "publishedAt": "2022-05-30T16:49:29Z", "content": "It sounds like the plot of a lousy science fiction film: Beyond the borders of our galaxy, there is some mysterious creature pushing against us with great intensity. Were not sure what it is, and wer… [+4724 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Dance of South Pole Aurora Around Total Lunar Eclipse Captured in Stunning Image - Galaxy Reporters", "description": "This fantastic time-lapse portrait shows the Moon’s total eclipse on May 15 above the astronomical observatory at the South Pole behind the beautiful aurora and starry sky. A picture of the lunar eclipse was taken by Aman Chokshi, a Ph.D. student in astronomy…", "url": "https://galaxyreporters.com/dance-of-south-pole-aurora-around-total-lunar-eclipse-captured-in-stunning-image/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/South-Pole-aurora-dances.jpg", "publishedAt": "2022-05-30T16:31:36Z", "content": "This fantastic time-lapse portrait shows the Moon’s total eclipse on May 15 above the astronomical observatory at the South Pole behind the beautiful aurora and starry sky.\r\nA picture of the lunar ec… [+1395 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Mile-Wide Asteroid Make Safe Pass of Earth - Galaxy Reporters", "description": "A mile-wide asteroid passed through the Earth on Friday (May 27), ten times the distance between Earth and the Moon. The asteroid, known as the asteroid 7335 (1989 JA), is almost four times the size of the Empire State Building and is the largest ever to pass…", "url": "https://galaxyreporters.com/mile-wide-asteroid-make-safe-pass-of-earth/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/03/shutterstock_384421855-scaled.jpg", "publishedAt": "2022-05-30T16:31:10Z", "content": "A mile-wide asteroid passed through the Earth on Friday (May 27), ten times the distance between Earth and the Moon.\r\nThe asteroid, known as the asteroid 7335 (1989 JA), is almost four times the size… [+1234 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "New Light-Driven Catalysts Facilitate Manufacturing Processes - AZoM", "description": "Chemical reactions that are powered by light deliver a robust tool for chemists who are developing new methods to make pharmaceuticals and other beneficial compounds. Exploiting this light energy necessitates photoredox catalysts, which can capture light and …", "url": "https://www.azom.com/news.aspx?newsID=59196", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_59196_16539028398531275.jpg", "publishedAt": "2022-05-30T16:20:00Z", "content": "Chemical reactions powered by light are extremely helpful to chemists who are developing new methods to make pharmaceuticals and other beneficial compounds. Exploiting this light energy necessitates … [+6430 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Among the investigations taking SpaceX's CRS-25 Dragon to the International Space Station are modeling of soil, sutures, and weather. - BollyInside - BollyInside", "description": "EMIT, a JPL-developed mission to study the composition of minerals that create airborne dust, is one of the experiments set to travel to the space station", "url": "https://www.bollyinside.com/news/among-the-investigations-taking-spacexs-crs-25-dragon-to-the-international-space-station-are-modeling-of-soil-sutures-and-weather", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/Among-the-investigations-taking-SpaceXs-CRS-25-Dragon-to-the-International.jpeg", "publishedAt": "2022-05-30T15:25:43Z", "content": "EMIT, a JPL-developed mission to study the composition of minerals that create airborne dust, is one of the experiments set to travel to the space station next month.\r\nThe 25th SpaceX cargo resupply … [+6805 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Neeraj Bansal", "title": "All GTA Online Treasure Hunt locations with guide - Sportskeeda", "description": "The Treasure Hunt in GTA Online gives players the chance to explore different places where they have never been before and also find a hidden treasure simultaneously.", "url": "https://www.sportskeeda.com/gta/all-gta-online-treasure-hunt-locations-guide", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/05/381b6-16538813399452-1920.jpg", "publishedAt": "2022-05-30T14:48:04Z", "content": "The Treasure Hunt in GTA Online gives players the chance to explore different places where they have never been before and also find a hidden treasure simultaneously. This guide will help players on … [+5074 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shocking Earth problem revealed! Know the enemy within - HT Tech", "description": "A new research found evidence for possible rusting in the Earth’s core. What does it mean for Earth? Find out.", "url": "https://tech.hindustantimes.com/tech/news/shocking-earth-problem-revealed-know-the-enemy-within-71653921000539.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/30/1600x900/Earth_NASA_1653921317568_1653921326906.jpg", "publishedAt": "2022-05-30T14:37:08Z", "content": "The common phenomenon that we usually find happening on the surface with most iron objects is now being reported for inside the Earth! Rust - the common process that destroys iron is now impacting th… [+2444 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Super-Earth Exoplanet Discovered Near Habitable Zone Of Its Star: All You Need To Know - Indiatimes.com", "description": "A tiny group of stars has shed light on the existence of a Super-Earth exoplanet that also has the potential of being quite habitable.                        Gabriel Perez Diaz, SMM/IACReported first by ScienceAlert, the exoplanet named Ross 508b, is located …", "url": "https://www.indiatimes.com/technology/science-and-future/super-earth-exoplanet-discovered-near-habitable-zone-of-star-570870.html", "urlToImage": "https://im.indiatimes.in/content/2022/May/Facebook-Image-8_629473612fecc.jpg", "publishedAt": "2022-05-30T13:55:49Z", "content": "A tiny group of stars has shed light on the existence of a Super-Earth exoplanet that also has the potential of being quite habitable.\r\nGabriel Perez Diaz, SMM/IAC\r\nReported first by ScienceAlert, th… [+1802 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Something weird is going on with the Voyager 1 space probe - BollyInside", "description": "NASA launched the Voyager 1 space probe on September 5, 1977, four months after Star Wars was released in theatres for the first time. According to NASA’s", "url": "https://www.bollyinside.com/news/something-weird-is-going-on-with-the-voyager-1-space-probe", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/NASAs-Voyager-space-probes-will-redefine-what-it-means-to.jpeg", "publishedAt": "2022-05-30T13:49:26Z", "content": "NASA launched the Voyager 1 space probe on September 5, 1977, four months after Star Wars was released in theatres for the first time. According to NASAs Jet Propulsion Laboratorys live Mission Statu… [+2902 chars]"}, {"source": {"id": null, "name": "World Atlas"}, "author": "Aidan Remple", "title": "Solar System - Worldatlas.com", "description": "What is a solar system? A solar system is essentially a star orbited by one or more planets bound to it by its gravitational pull.", "url": "https://www.worldatlas.com/space/solar-system.html", "urlToImage": "https://www.worldatlas.com/r/w1200-q80/upload/d8/6e/21/shutterstock-311871896-01.jpg", "publishedAt": "2022-05-30T13:34:39Z", "content": "What is a solar system? A solar system is essentially a star orbited by one or more planets bound to it by its gravitational pull. Our solar system is home to eight planets, several dwarf planets, ov… [+6612 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA Refutes Claims Serious Heat Shield Problem Occurred During SpaceX's Ax-1 Flight - BollyInside", "description": "SpaceX launched Axiom 1 (Ax-1) on April 8, the first all-private crewed trip to the International Space Station (ISS). Ax-1 transported four passengers to", "url": "https://www.bollyinside.com/news/nasa-refutes-claims-serious-heat-shield-problem-occurred-during-spacexs-ax-1-flight", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/NASA-Refutes-Claims-Serious-Heat-Shield-Problem-Occurred-During-SpaceXs.jpeg", "publishedAt": "2022-05-30T12:49:29Z", "content": "SpaceX launched Axiom 1 (Ax-1) on April 8, the first all-private crewed trip to the International Space Station (ISS).\r\nAx-1 transported four passengers to the International Space Station, where they… [+3955 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "A black hole formed by a lopsided merger may have gone rogue - Space.com", "description": "A collision between black holes that sent one spiraling away at million 3 mph.", "url": "https://www.space.com/black-hole-escaping-galaxy-from-collision", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5LQqM8Y4UjVeh2UKPp9TbV-1200-80.jpg", "publishedAt": "2022-05-30T12:00:00Z", "content": "Astronomers have uncovered the first solid evidence that merger events between black holes can deliver a \"kick\" powerful enough to send a black hole spinning out of its galaxy.\r\nThe team, which inclu… [+6025 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Exposure to new things makes people ‘ready to learn’ - Tech Explorist", "description": "Latent learning occurs without any explicit teaching.", "url": "https://www.techexplorist.com/exposure-new-things-makes-people-ready-learn/47668/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/dogs.jpg", "publishedAt": "2022-05-30T11:43:20Z", "content": "We often observe new things in the real world without the goal of learning about them. But a new study from the Ohio State University found that exposure to new things increases the curiosity to lear… [+4486 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA expert predicts humans will land on asteroids within 50 years, on Mars by 2037 - Republic World", "description": "NASA scientist Jonathan Jiang has predicted that human space exploration will expand from the Moon to Mars, asteroids and eventually to Saturn by 2032.", "url": "https://www.republicworld.com/science/space/nasa-expert-predicts-humans-will-land-on-asteroids-within-50-years-on-mars-by-2037-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/dsnxvbzpmigj0qg3_1653908703.jpeg", "publishedAt": "2022-05-30T11:27:00Z", "content": "As scientists prepare to expand the reach of humans beyond the low-Earth orbit, a group of experts has made a bold claim. Jonathan Jiang, the principal scientist at NASAs Jet Propulsion Laboratory (J… [+2219 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Magma beneath tectonic collision zones is wetter than previously thought - India Education Diary", "description": "A new study by geologists at the Woods Hole Oceanographic Institution (WHOI), MIT, and elsewhere has found that colliding continental plates may draw down more water than previously thought. The results could help to explain the explosiveness of some", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-magma-beneath-tectonic-collision-zones-is-wetter-than-previously-thought/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg", "publishedAt": "2022-05-30T11:14:37Z", "content": "A new study by geologists at the Woods Hole Oceanographic Institution (WHOI), MIT, and elsewhere has found that colliding continental plates may draw down more water than previously thought. The resu… [+5102 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Daniella McCahey", "title": "A Century of Antarctic Agriculture Is Helping Scientists Grow Food in Space – The Wire Science - The Wire Science", "description": "Before sending people to the Moon or Mars, it might be wise to first prove that a settlement can survive on its own amid the frozen southern plains of Earth.", "url": "https://science.thewire.in/aerospace/century-antarctic-agriculture-scientists-grow-food-space/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/05/30163614/11697759663_14431da476_k.jpg", "publishedAt": "2022-05-30T11:09:42Z", "content": "A greenhouse of plants at a South Pole research station, December 2003. Photo: daview/Flickr, CC BY 2.0\r\n<ul><li>Just as in Antarctic history, the question of how to grow plants is central to any dis… [+7537 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Soviet probe launched to Venus in 1972 could soon crash on Earth - India Today", "description": "A Soviet probe launched to Venus in 1972 failed to go out of Earth's orbit. In the last 50 years, its orbit has fallen by over 7000 km, putting it on a course to crash on Earth.", "url": "https://www.indiatoday.in/science/story/venus-mission-vanera-kosmos-482-crash-earth-roscosmos-soviet-space-mission-nasa-1956041-2022-05-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/space_crash-647x363.jpeg?.e4MhQJqq_C3TOnvLKLg.kpsAPiiQIaw", "publishedAt": "2022-05-30T10:39:16Z", "content": "Fifty years after it was launched to Venus by the Soviets, a probe could crash on Earth after failing to get out of the planet's orbit. The probe dubbed Kosmos 482, renamed after it failed post-launc… [+3668 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Believe it or not: Male mice hate bananas. Find out why - WION", "description": "In the research paper, the scientists wrote that male mice, especially virgin males, are well known to engage in infanticidal aggression to advance their genetic fitness. To keep the potential predators away, the pregnant and lactating females depend on chemo…", "url": "https://www.wionews.com/science/believe-it-or-not-male-mice-hate-bananas-find-out-why-483365", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/30/266294-mice.jpg", "publishedAt": "2022-05-30T03:41:25Z", "content": "Male mice are scared of bananas, revealed a new study. The unusual discovery was made by researchers at McGill University in Montreal, Quebec. Scientists came up with this finding when they were look… [+1802 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Williams", "title": "A new quantum technique could enable telescopes the size of planet Earth - Phys.org", "description": "There's a revolution underway in astronomy. In fact, you might say there are several. In the past 10 years, exoplanet studies have advanced considerably, gravitational wave astronomy has emerged as a new field, and the first images of supermassive black holes…", "url": "https://phys.org/news/2022-05-quantum-technique-enable-telescopes-size.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-new-quantum-techniqu.jpg", "publishedAt": "2022-05-30T03:11:15Z", "content": "There's a revolution underway in astronomy. In fact, you might say there are several. In the past 10 years, exoplanet studies have advanced considerably, gravitational wave astronomy has emerged as a… [+7743 chars]"}]}