{"status": "ok", "totalResults": 50, "articles": [{"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Original Buzz Aldrin moon walk photo sells for $7,700 at auction - Devdiscourse", "description": "A series of original NASA photographs from the Apollo missions sold for a total of 1.16 million Danish crowns ($171,831) in an auction in Copenhagen on Wednesday.  The 74 privately-owned photographs from the Apollo 8-17 missions included the famous one of Buz…", "url": "https://www.devdiscourse.com/article/technology/1955629-original-buzz-aldrin-moon-walk-photo-sells-for-7700-at-auction", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_33_56_2660097.png?width=920&format=jpeg", "publishedAt": "2022-03-09T16:14:22Z", "content": "A series of original NASA photographs from the Apollo missions sold for a total of 1.16 million Danish crowns ($171,831) in an auction in Copenhagen on Wednesday.\r\nThe 74 privately-owned photographs … [+1302 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Black hole billiards in the centers of galaxies - Nanowerk", "description": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggested solution involves a chaotic triple drama inside a giant d…", "url": "https://www.nanowerk.com/news2/space/newsid=59985.php", "urlToImage": "https://www.nanowerk.com/news2/space/id59985_1.jpg", "publishedAt": "2022-03-09T16:13:26Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA selects UK-based firm to develop equipment for extracting oxygen from Moon dust - Republic World", "description": "ESA has selected a team led by Thales Alenia Space in the UK for the design and development of an experimental payload to extract oxygen from the lunar soil.", "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/esa-selects-uk-based-firm-to-develop-equipment-for-extracting-oxygen-from-moon-dust-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/jrhv2l51zesjghuf_1646838839.jpeg", "publishedAt": "2022-03-09T15:56:00Z", "content": "The European Space Agency (ESA) has selected a team led by Thales Alenia Space in the UK for the design and development of an experimental device to extract oxygen from the lunar soil. Comprised of f… [+2139 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "NASA’s Perseverance grabs 7th rock sample on Mars - The Siasat Daily", "description": "Washington: NASA's Perseverance rover has grabbed one more sample from Mars, taking the total number of collection to seven. Perseverance drilled the seventh sample from the floor of the Red Planet's Jezero Crater. The car-sized robot will drill one more samp…", "url": "https://www.siasat.com/nasas-perseverance-grabs-7th-rock-sample-on-mars-2288098/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/NASA.jpg", "publishedAt": "2022-03-09T13:38:59Z", "content": "Washington: NASA’s Perseverance rover has grabbed one more sample from Mars, taking the total number of collection to seven.\r\nPerseverance drilled the seventh sample from the floor of the Red Planet’… [+1746 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Juno spacecraft clicks Jupiter`s moon casting shadow on the gas giant - WION", "description": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on Earth as when Moon comes between the Sun and Earth, the sha…", "url": "https://www.wionews.com/science/nasa-juno-spacecraft-clicks-jupiters-moon-casting-shadow-on-gas-giant-460580", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/03/09/246450-jupiter.jpg", "publishedAt": "2022-03-09T12:51:21Z", "content": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on… [+1028 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Rocket Stage-Lunar Collision Saga Continues: Space Junk Crashes Into Far Side of the Moon; Leaves a 65-Foot Wide Crater | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Usually, when a human-made object strikes a celestial object, it's by design. And that very fact makes this impact an unplanned experiment for scientists studying the Moon. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-09-space-junk-crashes-into-far-side-of-the-moon-leaves-a-65-foot-wide", "urlToImage": "https://s.w-x.co/in-Rocket-Booster-Crash-Moon.gif", "publishedAt": "2022-03-09T12:33:37Z", "content": "A wayward rocket stage on a collision path with the Moon had been gaining a lot of attention since the beginning of 2022. While the incident brought up heated discussion on the many dangers of space … [+2409 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "Study Using Microrobots Demonstrates How Animal Swarms Respond to Danger - AZoRobotics", "description": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Bechinger, a member of the Cluster of Excellence \"Centre for t…", "url": "https://www.azorobotics.com/News.aspx?newsID=12798", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ThumbForNews_12798_16468293543237810.jpg", "publishedAt": "2022-03-09T12:27:00Z", "content": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Be… [+4446 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "China's Yutu 2 rover transmits intriguing panoramic images from hidden side of the Moon - Republic World", "description": "The Yutu 2 rover had landed on the far side of the Moon in January 2019 atop the Chang'e 4 lander and has been scanning the lunar surface ever since.", "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/chinas-yutu-2-rover-transmits-intriguing-panoramic-images-from-hidden-side-of-the-moon-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/qqbnih2xl7rmhssw_1646827602.jpeg", "publishedAt": "2022-03-09T12:23:00Z", "content": "China's Yutu 2 rover, which has completed three years on the Moon, has beamed back an intriguing panoramic picture of its location. The rover had landed on the far side of the Moon in January 2019 at… [+1966 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "What Happens to Matter Swallowed by Black Holes Could Be Explained by Wormholes. ⋆ Ceng News - Ceng News", "description": "By considering wormholes, hypothetical bridges connecting distant points in the Universe, physicists may have discovered what happens to matter that", "url": "https://www.cengnews.com/news/what-happens-to-matter-swallowed-by-black-holes-could-be-explained-by-wormholes-311765.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/03/1646819975_black-hole.jpg", "publishedAt": "2022-03-09T12:06:55Z", "content": "By considering wormholes, hypothetical bridges connecting distant points in the Universe, physicists may have discovered what happens to matter that is swallowed by black holes.\r\nThe researchers from… [+3563 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Meet the 10-armed, 325-mn-year-old octopus fossil named after Biden - Deccan Herald", "description": "By Tom Fletcher for The Conversation In an ancient shallow bay of what is now Montana, the body of an octopus-like creature the size of a fist was buried on the seafloor. Some 325-328 million years later, a new paper published in Nature Communications provide…", "url": "https://www.deccanherald.com/science-and-environment/meet-the-10-armed-325-mn-year-old-octopus-fossil-named-after-biden-1089683.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/03/09/2022-03-08t162324z19686872rc2uxs98elwwrtrmadp3science-octopus1-1089683-1646825612.jpg", "publishedAt": "2022-03-09T11:33:32Z", "content": "By Tom Fletcher for The Conversation\r\nIn an ancient shallow bay of what is now Montana, the body of an octopus-like creature the size of a fist was buried on the seafloor.\r\nSome 325-328 million years… [+4499 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akash Dutta", "title": "NASA Psyche gets ready to fly to this special ASTEROID! Know how it can change humanity forever - HT Tech", "description": "The Psyche mission by NASA is almost ready after getting huge solar arrays installed in the spacecraft. The mission will see the Psyche spacecraft take a trip to a mysterious metal-rich asteroid", "url": "https://tech.hindustantimes.com/tech/news/nasa-psyche-gets-ready-to-fly-to-this-special-asteroid-know-how-it-can-change-humanity-forever-71646825065274.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/09/1600x900/missionswebNASAPsyche_1646825116356_1646825140464.jpg", "publishedAt": "2022-03-09T11:27:41Z", "content": "The ambitious project of NASA - The Psyche Mission - is almost ready for its launch after getting huge solar arrays installed to the spacecraft. The Psyche spacecraft is going to explore a metal-rich… [+2148 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Jets from the supermassive black hole created massive bubbles at Milky Way’s center - Tech Explorist", "description": "The structures themselves are 11 kiloparsecs tall.", "url": "https://www.techexplorist.com/jets-supermassive-black-hole-created-massive-bubbles-milky-ways-center/45179/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/massive-bubbles.jpg", "publishedAt": "2022-03-09T11:04:56Z", "content": "There are two enormous bubbles of scorching gas expanding from the core of the Milky Way has into near-galactic space. First seen in 2020 by the X-ray telescope eRosita, the bubbles extend far above … [+4919 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "The sun readies for its close-up as Europe's Solar Orbiter approaches - Space.com", "description": "No spacecraft before has taken a camera so close to the sun.", "url": "https://www.space.com/solar-orbiter-scorching-close-approach", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KuSDFUQZvWEKJyikdqV2xg-1200-80.jpg", "publishedAt": "2022-03-09T11:00:31Z", "content": "The European Solar Orbiter mission will make its closest approach to the sun later this month, promising to capture images that could unravel some of the mysterious behaviours of the star at the hear… [+4166 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "​​​​​​​Research sheds light on mysterious messenger RNA modifications - Phys.org", "description": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long remained a fundamental mystery in molecular biology.", "url": "https://phys.org/news/2022-03-mysterious-messenger-rna-modifications.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2015/messengerrna.png", "publishedAt": "2022-03-09T10:00:02Z", "content": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long… [+3900 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Genes Inherited From Mom or Dad Could Shape Behaviors - Technology Networks", "description": "According to new research led by scientists at University of Utah Health, each parent has their own impact on hormones and other chemical messengers that control mood and behavior.", "url": "https://www.technologynetworks.com/genomics/news/how-genes-inherited-from-mom-or-dad-could-shape-behaviors-359377", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359377/how-genes-inherited-from-mom-or-dad-could-shape-behaviors-359377-640x360.jpg?cb=20220309", "publishedAt": "2022-03-09T09:27:11Z", "content": "Parenting is not the only way moms and dads impact the behavior of their offspring. Genes matter, too. And although most of our genes are inherited in pairsone copy from each parentmoms and dads exer… [+5742 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Biologists Just Totally Proved Wrong a Long-Standing Rumor About Sharks - ScienceAlert", "description": "It's been rumored that sharks don't sleep at all; the fact some sharks must stay on the move to facilitate their breathing has contributed to this idea.", "url": "https://www.sciencealert.com/marine-biologists-confirm-sharks-do-indeed-sleep-often-with-both-eyes-open", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/SpottedSwellSharkInDarkEnvironmentLitByGoldenLight_1024.jpg", "publishedAt": "2022-03-09T06:22:54Z", "content": "It's been rumored that sharks don't sleep at all; the fact some sharks must stay on the move to facilitate their breathing has contributed to this idea.\r\nA new study, however, finally confirms what a… [+3238 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Laurence Malcom", "title": "Earth will run out of oxygen: when, date - Persia Digest", "description": "Mediotempo Mexico City / 08.03.2022 21:44:20 over time, planet earth I encountered many climate-related problems, such as Natural disasersIn addition, of course, climate change. All of this, of course, has an effect In the planet’s atmosphere. It’s because of…", "url": "https://persiadigest.com/earth-will-run-out-of-oxygen-when-date/", "urlToImage": null, "publishedAt": "2022-03-09T04:07:10Z", "content": "over time, planet earth I encountered many climate-related problems, such as Natural disasersIn addition, of course, climate change. All of this, of course, has an effect In the planet’s atmosphere. … [+931 chars]"}, {"source": {"id": null, "name": "The Hitavada"}, "author": "The Hitavada", "title": "Chandrayaan-2 spectrometer makes first observations of global distribution of Argon-40 in Exosphere of Moon - The Hitavada", "description": "THE Chandra’s Atmospheric Composition Explorer-2 (CHACE-2), a quadrupole mass spectrometer onboard Chandrayaan-2 mission, has made the first-of-its-kind observations of the global distribution of Argon-40 in the tenuous lunar exosphere, according to the India…", "url": "https://www.thehitavada.com/Encyc/2022/3/9/Chandrayaan-2-spectrometer-makes-first-observations-of-global-distribution-of-Argon-40-in-Exosphere.html", "urlToImage": "https://www.thehitavada.com/Encyc/2022/3/9/Chandrayaan-2_202203090903014344_H@@IGHT_333_W@@IDTH_666.jpg", "publishedAt": "2022-03-09T03:36:57Z", "content": "THE Chandra’s Atmospheric Composition Explorer-2 (CHACE-2), a quadrupole mass spectrometer onboard Chandrayaan-2 mission, has made the first-of-its-kind observations of the global distribution of Arg… [+1735 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "JHU-created material could lead to stronger, lighter and safer helmets and vehicles - EurekAlert", "description": "A team of Johns Hopkins University researchers created shock-absorbing material that protects like a metal, but is lighter, stronger, reusable. The new foam-like material could be a game-changer for helmets, body armor, and automobile and aerospace parts.", "url": "https://www.eurekalert.org/news-releases/945823", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/3a6d6eef-cb08-4c69-9c17-4a1bfc19c7f9/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-09T02:04:44Z", "content": "video: Liquid crystal elastomer structure tested in drop tester machine.view more \r\nCredit: Johns Hopkins University\r\nA team of Johns Hopkins University researchers created shock-absorbing material t… [+2435 chars]"}, {"source": {"id": null, "name": "Globelynews.com"}, "author": "Wendy Whitman Cobb", "title": "UAE Mars Mission Seeks to Bring Hope to More Places Than the Red Planet - Globely News", "description": "Abu Dhabi's Mars Mission could enable a new generation of space exploration.", "url": "https://globelynews.com/middle-east/uae-mars-mission-project-hope/", "urlToImage": "https://i0.wp.com/globelynews.com/wp-content/uploads/2019/05/Omran_Sharaf_at_Hope_Scientific_Mission_Announcement_Event-e1561572802143.jpg?resize=1000%2C563&ssl=1", "publishedAt": "2022-03-08T22:36:10Z", "content": "On July 14, a new Mars-bound spacecraft will launch from Japan. While several Mars missions are planned to launch over the next month, what makes this different is whos launching it: the United Arab … [+4682 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Sound can stimulate blind retina to transmit signals to the brain via an ultrasonic retinal prosthesis - Medical Xpress", "description": "Retinal degenerative diseases, caused by progressive degeneration of the light-sensitive photoreceptors in the retina, is one of the major causes of vision loss and blindness, affecting tens of millions of people worldwide. Although the rods and cones which a…", "url": "https://medicalxpress.com/news/2022-03-retina-transmit-brain-ultrasonic-retinal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/retina.jpg", "publishedAt": "2022-03-08T21:27:18Z", "content": "Retinal degenerative diseases, caused by progressive degeneration of the light-sensitive photoreceptors in the retina, is one of the major causes of vision loss and blindness, affecting tens of milli… [+6117 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Check out 20 years of iconic images courtesy of NASA's Hubble telescope - TechSpot", "description": "The workhorse that is the Hubble Space Telescope has provided humanity with jaw-dropping images of our solar system and the universe at large for more than 30...", "url": "https://www.techspot.com/news/93698-check-out-20-years-iconic-images-courtesy-nasa.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/03/2022-03-08-image-36.jpg", "publishedAt": "2022-03-08T20:58:00Z", "content": "In brief: NASA is celebrating the 20th anniversary of the installation of the Advanced Camera for Surveys on the Hubble Space Telescope by looking back at some of the more than 125,000 pictures captu… [+2686 chars]"}, {"source": {"id": null, "name": "InsideHook"}, "author": "Tanner Garrity", "title": "Does NASA Have the Ability to Shoot Down a Life-Threatening Asteroid? - InsideHook", "description": "If \"Don't Look Up\" happens in real life, NASA does have some options for dangerous asteroids and comets that approach Earth.", "url": "https://www.insidehook.com/daily_brief/science/nasa-shoot-down-asteroids", "urlToImage": "https://www.insidehook.com/wp-content/uploads/2022/03/hero-1.jpg?w=1200", "publishedAt": "2022-03-08T20:44:13Z", "content": "Considering that in the last two years we’ve seen six million people die from a global virus, a mob of Americans attack the Capitol Building and the first major land war in Europe since the end of Wo… [+4429 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Francis Reddy", "title": "NASA's NICER telescope sees hot spots merge on a magnetar - Phys.org", "description": "For the first time, NASA's Neutron star Interior Composition Explorer (NICER) has observed the merging of multimillion-degree X-ray spots on the surface of a magnetar, a supermagnetized stellar core no larger than a city.", "url": "https://phys.org/news/2022-03-nasa-nicer-telescope-hot-merge.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/nasas-nicer-telescope.jpg", "publishedAt": "2022-03-08T18:51:58Z", "content": "For the first time, NASA's Neutron star Interior Composition Explorer (NICER) has observed the merging of multimillion-degree X-ray spots on the surface of a magnetar, a supermagnetized stellar core … [+5442 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Angie Jackman Works to Develop Rocket That Will Bring Mars Samples to Earth – NASA's Mars Exploration Program - NASA Mars Exploration", "description": "Meet the project manager of the first rocket to launch from the surface of another planet, the Mars Ascent Vehicle.", "url": "https://mars.nasa.gov/news/9141/nasas-angie-jackman-works-to-develop-rocket-that-will-bring-mars-samples-to-earth/", "urlToImage": "https://mars.nasa.gov/system/news_items/main_images/9141_PIA25078-web.jpg", "publishedAt": "2022-03-08T17:50:56Z", "content": "NASA’s Mars Sample Return mission will revolutionize our understanding of Mars by returning samples for study using the most sophisticated instruments around the world. These samples, collected by Pe… [+358 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Well-preserved fossils could be consequence of past global climate change - Science Daily", "description": "Climate change can affect life on Earth. According to new research, it can also affect the dead. A study of exceptionally preserved fossils has found that rising global temperatures and a rapidly changing climate 183 million years ago may have created fossili…", "url": "https://www.sciencedaily.com/releases/2022/03/220308130605.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T17:48:45Z", "content": "Climate change can affect life on Earth. According to new research, it can also affect the dead.A study of exceptionally preserved fossils led by a graduate student at The University of Texas at Aust… [+3624 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Spiders hunt in PACKS of hundreds, using web vibrations to coordinate attacks - Daily Mail", "description": "A species of spider called Anelosimus eximius takes down its prey in packs using specialised web vibrations, researchers at CNRS in Paris report.", "url": "https://www.dailymail.co.uk/sciencetech/article-10590411/Spiders-hunt-PACKS-hundreds-using-web-vibrations-coordinate-attacks.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/08/16/55103275-0-image-a-58_1646757735475.jpg", "publishedAt": "2022-03-08T17:12:23Z", "content": "It's usually the lion that's known for hunting in packs, using coordinated movements to ambush its unfortunate prey. \r\nBut a new study shows how a species of spider, called Anelosimus eximius, simila… [+8417 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Engineering NASA's Return to the Moon - NASA", "description": "These engineers developed and tested Space Launch System software that will tell the rocket how to operate for the first 8 minutes of Artemis during launch and ascent.", "url": "https://www.nasa.gov/image-feature/engineering-nasa-s-return-to-the-moon/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/ceb_2369.jpg", "publishedAt": "2022-03-08T16:31:10Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Tiny ‘skyscrapers’ help bacteria convert sunlight into electricity - India Education Diary", "description": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise ‘nano-housing’ where sun-loving bacteria can grow quickly. The researchers were then able to extract the bacteria’s waste electrons, left over from photo", "url": "https://indiaeducationdiary.in/university-of-cambridge-tiny-skyscrapers-help-bacteria-convert-sunlight-into-electricity/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg", "publishedAt": "2022-03-08T16:21:03Z", "content": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise nano-housing where sun-loving bacteria can grow quickly. The researchers were then able to extract the… [+3824 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Traces of life in the Earth's deep mantle - Science Daily", "description": "The rapid development of fauna 540 million years ago has permanently changed the Earth - deep into its lower mantle. A team has now found traces of this development in rocks from this zone.", "url": "https://www.sciencedaily.com/releases/2022/03/220308102802.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T16:09:07Z", "content": "The rapid development of fauna 540 million years ago has permanently changed the Earth -- deep into its lower mantle. A team led by ETH researcher Andrea Giuliani found traces of this development in … [+3933 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Using Plankton Shells to Gauge the Accuracy of Climate Models - AZoCleantech", "description": "Earth scientists have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s history. The results from this study help bridge the gap between empirical observations and existing cli…", "url": "https://www.azocleantech.com/news.aspx?newsID=31292", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31292_16467543670315250.jpg", "publishedAt": "2022-03-08T15:50:57Z", "content": "Earth scientists in the United States and the United Kingdom have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s … [+5395 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Animals evolved the ability to GALLOP 472 million years ago, study claims - Daily Mail", "description": "The ability to perform 'asymmetrical gaits' dates back before the first animals arrived on land 210 million years ago, reports an expert at College of Charleston in South Carolina.", "url": "https://www.dailymail.co.uk/sciencetech/article-10589925/Animals-evolved-ability-GALLOP-472-million-years-ago-study-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/08/15/55098369-0-image-a-37_1646751760395.jpg", "publishedAt": "2022-03-08T15:46:36Z", "content": "Animals evolved the ability to gallop 472 million years ago around 260 million years before they emerged onto land, a new study claims.\r\nResearchers have analysed existing scientific literature on th… [+7393 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Mars rover reveals new features on the red planet - CGTN", "description": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist on Monday.", "url": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/index.html", "urlToImage": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/img/3fdec88f93ed474187756d7b39fed3bb/3fdec88f93ed474187756d7b39fed3bb-750.png", "publishedAt": "2022-03-08T15:00:57Z", "content": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist o… [+1163 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "This extinct ten-armed fossil may be earliest known ancestor of vampire squid - Ars Technica", "description": "Syllipsimopodi bideni named to honor US President Joe Biden's commitment to science.", "url": "https://arstechnica.com/science/2022/03/this-extinct-ten-armed-fossil-may-be-earliest-known-ancestor-of-vampire-squid/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/squid1ROTATE-760x380.jpg", "publishedAt": "2022-03-08T13:43:49Z", "content": "Enlarge/ An artistic reconstruction of the newly described 328-million-year-old vampyropod, Syllipsimopodi bideni.\r\n31 with 23 posters participating\r\nPaleontologists believe they have discovered a ne… [+4819 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telanganatoday", "title": "Now, you can send your name to Space - Telangana Today", "description": "Hyderabad: If it has been your dream to fly to Space, then there is one way to at least partially fulfill it. Now, you can send your name to Space – all thanks to a new initiative by the National Aeronautics and Space Administration (NASA). All you have to do…", "url": "https://telanganatoday.com/now-you-can-send-your-name-to-space", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/03/Boarding-pass.jpg", "publishedAt": "2022-03-08T13:11:58Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "It seemed like the most dangerous asteroid in a decade, but it definitely won't hit Earth - Space.com", "description": "The asteroid threatened to hit Earth next year, not giving enough time for a deflection mission.", "url": "https://www.space.com/most-dangerous-asteroid-in-decade-miss-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vPsFVcbBycuGt9qYUSV6Ca-1200-80.jpg", "publishedAt": "2022-03-08T11:00:14Z", "content": "A recently discovered asteroid seemed to be on a trajectory to hit Earth next year, but orbit recalculation eventually revealed it will miss our planet. \r\nThe 230-feet-wide (70 meters) asteroid\r\n 202… [+3014 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Elon Musk's SpaceX Launched 646 Satellites in 2021 As Part of Starlink Internet Project: Report | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "- Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-08-elon-musks-spacex-launched-646-starlink-satellites-in-2021-report", "urlToImage": "https://s.w-x.co/in-satellite%20%281%29.jpg", "publishedAt": "2022-03-08T10:57:59Z", "content": "Tech billionaire Elon Musk-led SpaceX launched 646 Starlink satellites in 2021, marking a 48.9% increase in its March 2021 satellite population of 1,322, according to a report.\r\nIn the past 18 months… [+1248 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Scientists significantly improved micro-computed tomography - Tech Explorist", "description": "Advances in micro-computed tomography.", "url": "https://www.techexplorist.com/scientists-significantly-improved-micro-computed-tomography/45154/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/micro-computed-tomography-scanner.jpg", "publishedAt": "2022-03-08T10:57:30Z", "content": "Also known as microtomography, Micro-computed tomography (Micro-CT) is a 3D imaging technique that generates 3D images of the internal structure of samples with small dimensions. It is generally used… [+3475 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Hibernating Marmots Able To Halt Aging Process - Technology Networks", "description": "During hibernation, yellow-bellied marmots undergo metabolic suppression, which  allows them to save energy. At the same time, epigenetic aging stops.", "url": "https://www.technologynetworks.com/neuroscience/news/hibernating-marmots-able-to-halt-aging-process-359344", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359344/hibernating-marmots-able-to-halt-aging-process-359344-640x360.jpg?cb=20220308", "publishedAt": "2022-03-08T09:54:21Z", "content": "What if you were told there was a completely natural way to stop your body from aging? The trick: Youd have to hibernate from September to May each year.\r\nThats what a team of UCLA biologists and col… [+5180 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Curiosity rover spotted a beautiful “flower” on Mars - The Times Hub", "description": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens. Despite the fact that this object is very similar to terrestrial coral, it is …", "url": "https://thetimeshub.in/curiosity-rover-spotted-a-beautiful-flower-on-mars", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/03/rover-curiosity-zafiksiroval-krasivyj-cvetok-na-marse-28e0336.jpg", "publishedAt": "2022-03-08T09:30:05Z", "content": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens.\r\nDespite the fact … [+1380 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "US Wants To Send A Satellite To Patrol The Space Around Moon - Indiatimes.com", "description": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military capabilities to monitor the space beyond between Earth and Mo…", "url": "https://www.indiatimes.com/technology/science-and-future/us-satellite-to-patrol-moon-563914.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage11-copy_6227156dc6715.jpg", "publishedAt": "2022-03-08T08:39:21Z", "content": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military c… [+1864 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "Neurons Involved in Memory Recall Identified; Could Inform Therapeutic Strategies - Genetic Engineering & Biotechnology News", "description": "Researchers discover neurons that separate experience into segments, then help the brain \"time travel\" and remember.", "url": "https://www.genengnews.com/topics/translational-medicine/neurons-involved-in-memory-recall-identified-could-inform-therapeutic-strategies/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2018/08/Feb14_2018_Getty_478186687_MemoryLossBrain_6006417318918-2.jpg", "publishedAt": "2022-03-08T08:00:34Z", "content": "Researchers headed by a team at Cedars-Sinai have discovered two types of brain cells that play a key role in dividing continuous human experience into distinct segments that can be recalled later. M… [+7774 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Biologists observe a molecular 'hand-off' that plays a key role in reproduction - Phys.org", "description": "Everyone considers sperm to be made exclusively by males. Well, it turns out that females also contribute to what makes a sperm a sperm.", "url": "https://phys.org/news/2022-03-biologists-molecular-hand-off-key-role.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/sperm.jpg", "publishedAt": "2022-03-08T07:44:09Z", "content": "Everyone considers sperm to be made exclusively by males. Well, it turns out that females also contribute to what makes a sperm a sperm.\r\nNearly 20% of couples in the United States fail to conceive n… [+4042 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "This SUV-sized spacecraft will find if Jupiter's icy Moon Europa has conditions for life - India Today", "description": "When fully assembled, this spacecraft will be as large as an SUV with solar arrays long enough to span a basketball court.", "url": "https://www.indiatoday.in/science/story/nasa-europa-clipper-mission-jupiter-conditions-for-life-1922035-2022-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Europa_Clipper-647x363.jpeg?J_nbAYnhe1NLTFQselNG4aTyBqX9tNBO", "publishedAt": "2022-03-08T05:14:20Z", "content": null}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Scientists open 50-year-old sample from Moon to study lunar conditions before sending humans back - India Today", "description": "The samples had remained locked so far after it was collected and sealed in the vacuum of the Moon by Apollo 17 astronauts.", "url": "https://www.indiatoday.in/science/story/nasa-moon-mission-artemis-lunar-surface-sample-minerals-1922016-2022-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Moon_sample-647x363.jpeg?6oAyMogHkHJXasb.xOtz_XBWdVmxNz3V", "publishedAt": "2022-03-08T04:44:08Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "Carlie Porterfield", "title": "El Niño Events Will Become More Frequent By 2040 Even If Carbon Emissions Slashed, Study Finds - Forbes", "description": "Increases in El Niño events are “essentially unavoidable,” researchers say.", "url": "https://www.forbes.com/sites/carlieporterfield/2022/03/07/el-nio-events-will-become-more-frequent-by-2040-even-if-carbon-emissions-slashed-study-finds/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62265da36aad473b5bbeb606/0x0.jpg?format=jpg&crop=4548,2559,x0,y87,safe&fit=crop", "publishedAt": "2022-03-07T19:32:09Z", "content": "A new study found global weather events caused by El Niño will likely become more frequent within the next two decades regardless of any reduction in carbon emissions, which could drastically affect … [+2369 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA's surreal Hubble pic shows young star shooting supersonic jet; know all about it - Republic World", "description": "ESA's newly released photograph shows an extremely young star generating an energetic outburst running across the dark cosmic sky 1,250 light-years from Earth.", "url": "https://www.republicworld.com/science/space/esas-surreal-hubble-pic-shows-young-star-shooting-supersonic-jet-know-all-about-it-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/xmadydyer4ekbgnl_1646671860.jpeg", "publishedAt": "2022-03-07T17:03:00Z", "content": "The European Space Agency (ESA) has released a brand new image captured by the Hubble Space Telescope that showcases never-seen-before features. The photograph shows an extremely young star, which is… [+2009 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronomers take 'heartbeat' of black hole - Phys.org", "description": "A black hole gets a large corona before it emits jets. This is revealed, among other things, by the heartbeat graph that an international team of astronomers has made of a black hole and a star orbiting around each other. The team, led by Mariano Méndez from …", "url": "https://phys.org/news/2022-03-astronomers-heartbeat-black-hole.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/astronomers-take-heart-1.jpg", "publishedAt": "2022-03-07T16:19:37Z", "content": "A black hole gets a large corona before it emits jets. This is revealed, among other things, by the heartbeat graph that an international team of astronomers has made of a black hole and a star orbit… [+3352 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mike Williams", "title": "Exploring when a protein's prone to wander - Phys.org", "description": "Exactly how proteins interact with solid surfaces is a concern for health care manufacturers who design drugs, make biosensors or develop anti-fouling materials.", "url": "https://phys.org/news/2022-03-exploring-protein-prone.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/closer-look-helps-rice.jpg", "publishedAt": "2022-03-07T16:00:38Z", "content": "Exactly how proteins interact with solid surfaces is a concern for health care manufacturers who design drugs, make biosensors or develop anti-fouling materials.\r\nThe mechanisms that control these in… [+4178 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kara Headley", "title": "New insight on the source/sink balance of cyanobacteria - Phys.org", "description": "A new study from the Michigan State University-DOE Plant Research Laboratory (PRL) brings fresh insight on the source/sink balance of cyanobacteria and paves the way for further advancements in photosynthetic microbes for potential applications.", "url": "https://phys.org/news/2022-03-insight-sourcesink-cyanobacteria.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cyanobacteria-balancin.jpg", "publishedAt": "2022-03-07T15:04:13Z", "content": "A new study from the Michigan State University-DOE Plant Research Laboratory (PRL) brings fresh insight on the source/sink balance of cyanobacteria and paves the way for further advancements in photo… [+3311 chars]"}]}