{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "News9live.com"}, "author": "Aditya Madanapalle", "title": "NASA releases tool to track ongoing observations by Webb, Hubble space telescopes - News9 LIVE", "description": "NASA has released a new tool that allows anyone to track the ongoing observations by its flagship deep space observatories in realtime. The tool was originally developed to provide information of Hubble targets. The tool was developed for NASA by the Space Te…", "url": "https://www.news9live.com/science/nasa-releases-tool-to-track-ongoing-observations-by-webb-hubble-space-telescopes-2462181", "urlToImage": "https://images.news9live.com/wp-content/uploads/2024/03/NASA-Webb-Hubble-tool.jpg", "publishedAt": "2024-03-10T12:10:08Z", "content": "NASA has released a tool for the general public to track ongoing observations by Webb and Hubble. (Image Credit: NASA). \r\nNASA has updated a tool for providing realtime information on Hubble targets,… [+1810 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Research shows how altered protein folding drives multicellular evolution - ETHealthWorld", "description": "In a new study led by researchers from the University of Helsinki and the Georgia Institute of Technology, scientists turned to a tool called experimental evolution. In the ongoing Multicellularity Long Term Evolution Experiment (MuLTEE), laboratory yeast are…", "url": "https://health.economictimes.indiatimes.com/news/industry/research-shows-how-altered-protein-folding-drives-multicellular-evolution/108368770", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-108368770,imgsize-44588,width-1200,height=765,overlay-ethealth/industry/research-shows-how-altered-protein-folding-drives-multicellular-evolution.jpg", "publishedAt": "2024-03-10T11:05:03Z", "content": "Washington: Researchers discovered a mechanism that drives the creation of multicellular life. They found that altered protein folding causes multicellular evolution.In a new study led by researchers… [+2826 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Aditya Madanapalle", "title": "Webb space telescope captures star forming region NGC 604 - News9 LIVE", "description": "The James Webb Space Telescope has captured a stellar nursery in a nearby galaxy. The star forming region is producing particularly massive stars. The energetic outpourings from the stars are shaping the surrounding clouds of gas and dust.", "url": "https://www.news9live.com/science/webb-space-telescope-captures-star-forming-region-ngc-604-2462049", "urlToImage": "https://images.news9live.com/wp-content/uploads/2024/03/Webb-NGC-604-.jpg", "publishedAt": "2024-03-10T09:47:13Z", "content": "NGC 604 as captured by the James Webb Space Telescope. (Image Credit: NASA, ESA, CSA, STScI). \r\nAstronomers have used the sensitive infrared gaze of the James Webb Space Telescope to peer into the st… [+1863 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deciphering the Dark: The Accelerating Universe and the Quest for Dark Energy - SciTechDaily", "description": "Dark energy's role in propelling the universe's accelerated expansion presents a pivotal challenge in astrophysics, driving ongoing research and space missions dedicated to uncovering the nature of this mysterious force. Some 13.8 billion years ago, the unive…", "url": "https://scitechdaily.com/deciphering-the-dark-the-accelerating-universe-and-the-quest-for-dark-energy/", "urlToImage": "https://scitechdaily.com/images/History-Universe-Infographic-scaled.jpg", "publishedAt": "2024-03-10T08:32:48Z", "content": "The history of the universe is outlined in this infographic. Credit: NASA\r\nDark energy’s role in propelling the universe’s accelerated expansion presents a pivotal challenge in astrophysics, driving … [+14562 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Saumya Nigam", "title": "NASA's Crew 7 aims returning to Earth on March 12: Details - India TV News", "description": "During their six months on the ISS, the Crew-7 conducted science experiments and technology demonstrations to benefit people on Earth and prepare humans for future space missions.", "url": "https://www.indiatvnews.com/science/nasa-s-crew-7-aims-returning-to-earth-on-march-12-details-2024-03-10-920773", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/03/pixabay-space-1710059133.jpg", "publishedAt": "2024-03-10T08:27:33Z", "content": "NASAs 7 astronauts crew which is onboard the International Space Station (ISS) are preparing to return to Earth, after a 6-month stay in the orbiting lab, the US space agency has said. \r\nIn an offici… [+1451 chars]"}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "Boeing's Starliner crewed mission to ISS delayed again, now set for THIS month - WION", "description": "Boeing's Starliner spacecraft programme, the highly anticipated first crewed mission to the International Space Station (ISS) has faced yet another delay. Originally slated for a mid-April launch, the Crew Flight Test (CFT) has now been rescheduled for early …", "url": "https://www.wionews.com/science/boeings-starliner-crewed-mission-to-iss-delayed-again-now-set-for-this-month-698552", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/03/10/417467-boeings-commercial-crew-and-cargo-processing-facility.png", "publishedAt": "2024-03-10T08:20:35Z", "content": "Boeing's Starliner spacecraft programme, the highly anticipated first crewed mission to the International Space Station (ISS) has faced yet another delay. Originally slated for a mid-April launch, th… [+2297 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "Watch this Space: Voyager 1 goes ‘senile’ and the interstellar object lie - The Indian Express", "description": "Voyager 1, the farthest human-made object in space, has been sending back nonsensical data since November, raising concerns about its functionality.  This potential loss is more sentimental than scientific, as Voyager 1 has already made groundbreaking discove…", "url": "https://indianexpress.com/article/technology/science/voyager-1-goes-senile-interstellar-object-lie-9205945/", "urlToImage": "https://images.indianexpress.com/2024/03/watch-this-space.jpg", "publishedAt": "2024-03-10T07:00:43Z", "content": "NASAs Voyager 1 has been travelling in space for nearly 50 years and in that time, it became the first spacecraft to go into interstellar space and continues to be the man-made object farthest from t… [+4222 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "New study reveals insight into which animals are most vulnerable to extinction due to climate change - India Education Diary", "description": "Past climate change (often caused by natural changes in greenhouse gases due to volcanic activity) has been responsible for countless species’ extinctions during the history of life on Earth. But, to date, it has not been clear what factors cause spe", "url": "https://indiaeducationdiary.in/new-study-reveals-insight-into-which-animals-are-most-vulnerable-to-extinction-due-to-climate-change-2/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2024-03-10T05:48:27Z", "content": "Past climate change (often caused by natural changes in greenhouse gases due to volcanic activity) has been responsible for countless species extinctions during the history of life on Earth. But, to … [+3726 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "The world’s most prolific CO2-fixing enzyme is slowly getting better - India Education Diary", "description": "New research led by the University of Oxford has found that rubisco – the enzyme that fuels all life on Earth – is not stuck in an evolutionary rut after all. The largest analysis of rubisco ever has found that it is improving all the time – just ver", "url": "https://indiaeducationdiary.in/the-worlds-most-prolific-co2-fixing-enzyme-is-slowly-getting-better/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2024-03-10T05:48:27Z", "content": "New research led by the University of Oxford has found that rubisco the enzyme that fuels all life on Earth is not stuck in an evolutionary rut after all. The largest analysis of rubisco ever has fou… [+3485 chars]"}, {"source": {"id": null, "name": "Everydayastronaut.com"}, "author": "Trevor Sesnic", "title": "Starlink Group 6-43 | Falcon 9 Block 5 - Everyday Astronaut", "description": "SpaceX is set to launch 23 Starlink v2 Mini satellites to low-Earth orbit on its Starlink Group 6-43 mission, launching from SLC-40.", "url": "https://everydayastronaut.com/starlink-group-6-43-falcon-9-block-5/", "urlToImage": "https://everydayastronaut.com/wp-content/uploads/2024/03/GHhMl4hWwAA_P1g.jpg", "publishedAt": "2024-03-10T05:40:43Z", "content": "<table><tr><th>Lift Off Time\r\n</th><td>March 10, 2024 – 23:05 UTC | 19:05 EDT</td></tr><tr><th>Mission Name\r\n</th><td>Starlink Group 6-43; a launch of v2 Mini Starlink satellites</td></tr><tr><th>Lau… [+18388 chars]"}, {"source": {"id": null, "name": "The Japan Times"}, "author": "Kento Iwamura", "title": "Japan team using James Webb telescope to unlock secrets of the cosmos - The Japan Times", "description": "Team has been pioneering research on supermassive black holes and the presence of heavy elements.", "url": "https://www.japantimes.co.jp/news/2024/03/10/japan/science-health/japan-team-james-webb-telescope/", "urlToImage": "https://www.japantimes.co.jp/japantimes/uploads/images/2024/03/04/284132.jpg", "publishedAt": "2024-03-10T04:00:00Z", "content": "A general theory states that several hundreds of millions of years after the Big Bang brought everything into existence some 13.8 billion years ago, the universe was composed mostly of hydrogen and h… [+560 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Itishree Sethy", "title": "World's Oldest Forest Dating Back 390 Million Years Discovered In UK - Pragativadi", "description": "London: Scientists have uncovered what they believe to be the world's oldest fossil forest dating back 390 million years in the high sandstone cliffs.The fossilised trees are palm-like in appearance but would have had thin trunks with hollow centres,", "url": "https://pragativadi.com/worlds-oldest-forest-dating-back-390-million-years-discovered-in-uk/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2024/03/th-6.jpg", "publishedAt": "2024-03-10T03:24:18Z", "content": "London: Scientists have uncovered what they believe to be the world’s oldest fossil forest dating back 390 million years in the high sandstone cliffs.\r\nThe fossilised trees are palm-like in appearanc… [+1207 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Singh Rahul Sunilkumar", "title": "NASA spacecraft to carry special message plate on Jupiter's moon. What's on it? - Hindustan Times", "description": "NASA's Europa Clipper mission scheduled for October launch will study whether there are places below the surface of Jupiter’s icy moon that could support life.", "url": "https://www.hindustantimes.com/technology/nasa-spacecraft-to-carry-special-message-plate-on-jupiters-moon-europa-whats-written-101710034454649.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/03/10/1600x900/nasa_1710034470016_1710034492662.jpeg", "publishedAt": "2024-03-10T02:58:40Z", "content": "When it launches in October, the National Aeronautics and Space Administration (NASA) Europa Clipper spacecraft will carry a triangular metal plate engraved with a special message for potential life … [+3216 chars]"}, {"source": {"id": null, "name": "Oup.com"}, "author": null, "title": "MIGHTEE-H i: H i galaxy properties in the large scale structure environment at z ∼ 0.37 from a stacking experiment - Oxford Academic", "description": "Abstract. We present the first measurement of HI mass of star-forming galaxies in different large scale structure environments from a blind survey at z ∼ 0.37.", "url": "https://academic.oup.com/mnras/advance-article/doi/10.1093/mnras/stae713/7625103", "urlToImage": "https://academic.oup.com/data/sitebuilderassetsoriginals/live/images/mnras/mnras_ogimage.png", "publishedAt": "2024-03-10T02:32:50Z", "content": null}, {"source": {"id": null, "name": "Oup.com"}, "author": null, "title": "An analytic description of substructure-induced gravitational perturbations in stellar systems - Oxford Academic", "description": "Abstract. Perturbations to stellar systems can reflect the gravitational influence of dark matter substructures. On scales much smaller than the size of a stell", "url": "https://academic.oup.com/mnras/advance-article/doi/10.1093/mnras/stae715/7625101", "urlToImage": "https://academic.oup.com/data/sitebuilderassetsoriginals/live/images/mnras/mnras_ogimage.png", "publishedAt": "2024-03-10T02:32:50Z", "content": "Perturbations to stellar systems can reflect the gravitational influence of dark matter substructures. On scales much smaller than the size of a stellar system, we point out analytic connections betw… [+749 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Akanksha Mishra", "title": "Planet outside Solar System, twice the size of Earth, may have ‘waterworld with a boiling ocean’ - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/planet-outside-solar-system-twice-the-size-of-earth-may-have-waterworld-with-a-boiling-ocean/1994621/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2024/03/Exoplanet.jpg", "publishedAt": "2024-03-10T01:30:16Z", "content": "Some Canadian scientists have in the past argued that the planet is too hot for liquid water and that it has a rocky surface and an atmosphere with hydrogen and water vapour. Read more\r\nAlso Read: A … [+3090 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Opposites Attract, Likes Repel? Scientists Overturn Fundamental Principle of Physics - SciTechDaily", "description": "\"Opposites charges attract; like charges repel\" is a fundamental principle of basic physics. However, a new study from Oxford University, recently published in the journal Nature Nanotechnology, has demonstrated that similarly charged particles in solution ca…", "url": "https://scitechdaily.com/opposites-attract-likes-repel-scientists-overturn-fundamental-principle-of-physics/", "urlToImage": "https://scitechdaily.com/images/Hexagonal-Cluster-Formation-scaled.jpg", "publishedAt": "2024-03-09T23:01:57Z", "content": "A new study has overturned a fundamental principle of physics by demonstrating that similarly charged particles can attract each other in a solution, with the effect varying between positive and nega… [+4247 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Researchers Uncover ‘Secrets’ of African Sand Dune - VOA Learning English", "description": "Researchers used radar and other technologies to study a large “star” sand dune in eastern Morocco. The oldest parts of the base of the dune are estimated to be about 13,000 years old.", "url": "https://learningenglish.voanews.com/a/researchers-uncover-secrets-of-african-sand-dune/7515043.html", "urlToImage": "https://gdb.voanews.com/01000000-c0a8-0242-b857-08dc3d6095ab_cx0_cy4_cw0_w1200_r1.jpg", "publishedAt": "2024-03-09T21:57:00Z", "content": "Researchers have used radar and other technologies to study a large star sand dune in eastern Morocco. The team said it was able to capture detailed data on how these dunes form and develop.\r\nA star … [+2963 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Martijn Luinstra", "title": "Juno measures oxygen production on Europa - NASASpaceFlight.com - NASASpaceflight.com", "description": "Using NASA’s Juno spacecraft, scientists have calculated the rate of oxygen production on Jupiter’s moon…", "url": "https://www.nasaspaceflight.com/2024/03/juno-europa/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/03/juno_europa.jpg", "publishedAt": "2024-03-09T20:21:59Z", "content": "1Using NASAs Juno spacecraft, scientists have calculated the rate of oxygen production on Jupiters moon Europa — the first time any spacecraft had directly measured charged oxygen and hydrogen partic… [+5595 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "April's eclipse might showcase other planets and stars, too - BGR", "description": "April's eclipse is shaping up to be quite the event, and some astronomers say we might even get more of a spectacle than just the eclipse.", "url": "https://bgr.com/science/other-planets-and-stars-might-be-visible-during-aprils-eclipse/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/04/AdobeStock_1976456.jpeg?quality=82&strip=all", "publishedAt": "2024-03-09T20:10:00Z", "content": null}, {"source": {"id": null, "name": "Dailymotion.com"}, "author": null, "title": "Black Hole Potentially 6000 Light-Years Away - Evidence From Hubble Space Telescope - video Dailymotion - Dailymotion", "description": "The Hubble Space Telescope's evidence of an \"intermediate-sized\" black hole about 6000 light-years away in the closest globular star cluster to our home planet.   Credit: NASA's Goddard Space Flight Center, Paul Morris: Lead Producer.  Music Credit: Tesseract…", "url": "https://www.dailymotion.com/video/x8u4zqs", "urlToImage": "https://s2.dmcdn.net/v/VsOlq1bxBgyvLL9-_/x720", "publishedAt": "2024-03-09T17:56:49Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "sahas, Buzz Staff", "title": "Do You Know Once It Rained For 2 Millions Years Straight On Earth? - News18", "description": "Geologists were able to determine that there was an exceptionally wet period at the start of the dinosaur era.", "url": "https://www.news18.com/viral/do-you-know-once-it-rained-for-2-millions-years-straight-on-earth-8809078.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/03/image-2024-03-09t124704.790-2024-03-c102cc4f8be2c02975eb954c4f651a98-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-03-09T17:53:12Z", "content": "Our planet, Earth, is full of mysteries. The deeper we go into its formation and composition, the more we are left surprised and spellbound. One such shocking story in the history of Earth is of the … [+2158 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Study Shines Light on Arctic's Concealed Primary Production Powerhouses - India Education Diary", "description": "New research into the Arctic Ocean’s ecosystem has highlighted the crucial role of tiny microalgae, seaweeds and seagrasses, known as benthic primary producers, in sustaining life in Arctic waters.But the study has also revealed the loss of sea ice i", "url": "https://indiaeducationdiary.in/study-shines-light-on-arctics-concealed-primary-production-powerhouses/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2024/03/Artic-seaweed-CARD.jpg", "publishedAt": "2024-03-09T16:51:43Z", "content": "New research into the Arctic Oceans ecosystem has highlighted the crucial role of tiny microalgae, seaweeds and seagrasses, known as benthic primary producers, in sustaining life in Arctic waters.\r\nB… [+2178 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Why Do Humans Not Have Tails Like Monkeys? The Answer Lies In A Gene, Study Says - ABP Live", "description": "At a certain point in the evolutionary history of humans, their ancestors underwent a genetic change, which is one of the reasons why Homo sapiens do not have a tail.", "url": "https://news.abplive.com/science/humans-do-not-have-tails-like-monkeys-genetic-cause-study-abpp-1670711", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2024/03/09/4ca2b7f867879deaba7cb2761d888f621709996557281324_original.jpg?impolicy=abp_cdn&imwidth=1200", "publishedAt": "2024-03-09T16:42:13Z", "content": "Have you ever wondered why humans do not have tails, unlike most monkeys, and their primate ancestors? The answer lies in a gene, a new study, published in the journal Nature, has found. At a certain… [+6499 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Mark Johnson", "title": "'Monumental' experiment suggests how life on Earth may have started - The Washington Post", "description": "Scientists at the Salk Institute have taken a small but essential step in showing how RNA might have kick-started life on our planet.", "url": "https://www.washingtonpost.com/science/2024/03/09/origin-of-life-rna-world/", "urlToImage": "https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png", "publishedAt": "2024-03-09T16:00:00Z", "content": "A much-debated theory holds that 4 billion years ago, give or take, long before the appearance of dinosaurs or even bacteria, the primordial soup contained only the possibility of life. Then a molecu… [+6422 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Roger Penrose on quantum mechanics and consciousness | Full interview - The Institute of Art and Ideas", "description": "Roger Penrose full interview on quantum physics, consciousness, his career, and his idols. Could quantum consciousness be the answer? Watch Roger Penrose deb...", "url": "https://www.youtube.com/watch?v=YnXUuyfPK2A", "urlToImage": "https://i.ytimg.com/vi/YnXUuyfPK2A/maxresdefault.jpg", "publishedAt": "2024-03-09T15:00:26Z", "content": null}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "Sindujaa D N", "title": "Space Station Batteries - RE Entry To Earth.? - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "breaking : Nine batteries, weighing a total of 3000 kg, are descending from space to Earth. These batteries were detached from the International Space", "url": "https://www.indiaherald.com/Breaking/Read/994686508/Space-Station-Batteries-RE-Entry-To-Earth", "urlToImage": "https://www.indiaherald.com/imagestore/images/breaking/134/space-station-batteries-re-entry-to-earth9a376a88-f250-40ef-8e63-f10475301d7f-415x250-IndiaHerald.jpg", "publishedAt": "2024-03-09T14:02:01Z", "content": "Nine batteries, weighing a total of 3000 kg, are descending from space to Earth. These batteries were detached from the international Space Station (ISS) in 2021, prompting questions about their fate… [+1160 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Aparna Venkatesan, John Barentine", "title": "The next chapter of lunar exploration could forever change the moon — and our relationship to it (op-ed) - Space.com", "description": "Where will humanity, and the moon, be by the next lunar standstill in the early 2040s?", "url": "https://www.space.com/moon-occupation-nearest-neighbor", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dbXcFfXqn4d68danptipjF-1200-80.jpg", "publishedAt": "2024-03-09T14:00:15Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "International Environmental Technology"}, "author": "International Environmental Technology", "title": "How is the El Niño-Southern Oscillation (ENSO) monitored? - International Environmental Technology", "description": "In the intricate ballet of Earth's climate system, the El Niño-Southern Oscillation (ENSO) plays a leading role, choreographing weather patterns across the globe. Its influence, spanning continent...", "url": "https://www.envirotech-online.com/news/weather-monitoring/159/international-environmental-technology/how-is-the-el-nintildeo-southern-oscillation-enso-monitored/62210", "urlToImage": "https://www.envirotech-online.com/assets/file_store/pr_files/62210/thumbnails/images/600w_Title-image.jpg", "publishedAt": "2024-03-09T13:24:35Z", "content": "In the intricate ballet of Earth's climate system, the El Niño-Southern Oscillation (ENSO) plays a leading role, choreographing weather patterns across the globe. Its influence, spanning continents a… [+5006 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Surprised to Realize Red Dots in James Webb Images Are Black Holes - Futurism", "description": "Scientists have found that \"little red dots\" in James Webb Space Telescope images are \"baby\" supermassive black holes.", "url": "https://futurism.com/scientists-surprised-red-dots-james-webb-images-black-holes", "urlToImage": "https://wp-assets.futurism.com/2024/03/scientists-surprised-red-dots-james-webb-images-black-holes.jpg", "publishedAt": "2024-03-09T13:00:47Z", "content": "NASA's James Webb Space Telescope has made one of its \"most unexpected\" discoveries to date: tiny red dots in some of the oldest corners of the universe, which turned out to be \"baby\" life stages of … [+3598 chars]"}, {"source": {"id": null, "name": "Almayadeen.net"}, "author": "Al Mayadeen English", "title": "New gravity theory: Dark matter might not exist, only a mirage - Al Mayadeen English", "description": "Physician Jonathan Oppenheim claims in a new paper that the expansion of the universe and galactic rotation can be explained without dark matter or dark energy.", "url": "https://english.almayadeen.net/news/technology/new-gravity-theory--dark-matter-might-not-exist--only-a-mira", "urlToImage": "https://alpha-en-media.almayadeen.net/archive/image/2024/3/9/ffb81071-6d82-47fa-ab4c-5f9e093cff6b.jpg?width=1000", "publishedAt": "2024-03-09T12:51:26Z", "content": "Physician Jonathan Oppenheim claims in a new paper that the expansion of the universe and galactic rotation can be explained without dark matter or dark energy.According to conventional scientific un… [+4710 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Neha Yadav", "title": "10 stunning images of stellar explosion shared by NASA - Hindustan Times", "description": "10 stunning images of supernovas shared by NASA", "url": "https://www.hindustantimes.com/web-stories/in-focus/10-stunning-images-of-stellar-explosion-shared-by-nasa-101709974631742.html", "urlToImage": null, "publishedAt": "2024-03-09T12:30:13Z", "content": "By Neha YadavPublished Mar 09, 2024\r\nHindustan TimesIn FocusPhoto Credits: NASA"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "EMMANUAL", "title": "Russian astronauts used to carry a gun with them, what is its use in space? - News Track English", "description": "In the realm of space exploration, there exists a peculiar relic from the past that often sparks intrigue and curiosity: the Russian astronauts' gun. While the idea of firearms in space may seem counterintuitive or even alarming to some, delving into the hist…", "url": "https://english.newstracklive.com/news/russian-astronauts-used-to-carry-a-gun-with-them-what-is-its-use-in-space-sc71-nu371-ta371-1312632-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Mar/09/big_thumb/dfdf_65ec206737503.jpg", "publishedAt": "2024-03-09T12:12:30Z", "content": "In the realm of space exploration, there exists a peculiar relic from the past that often sparks intrigue and curiosity: the Russian astronauts' gun. While the idea of firearms in space may seem coun… [+3973 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Pentagon UFO office developing 'Gremlin' sensors to help identify anomalies in orbit - Space.com", "description": "\"We're really starting to understand what's in orbit around our planet and how we can eliminate those as anomalous objects.\"", "url": "https://www.space.com/pentagon-ufo-uap-office-aaro-sensors-anomalies-orbit", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VZTSkoVhfZ2tMjy4rmx7gC-1200-80.jpg", "publishedAt": "2024-03-09T11:00:30Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael O'Boyle", "title": "What heat can tell us about battery chemistry: Using the Peltier effect to study lithium-ion cells - Phys.org", "description": "Batteries are usually studied via electrical properties like voltage and current, but new research suggests that observing how heat flows in conjunction with electricity can give important insights into battery chemistry.", "url": "https://phys.org/news/2024-03-battery-chemistry-peltier-effect-lithium.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/what-heat-can-tell-us.jpg", "publishedAt": "2024-03-09T09:30:16Z", "content": "Batteries are usually studied via electrical properties like voltage and current, but new research suggests that observing how heat flows in conjunction with electricity can give important insights i… [+4092 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UCF Scientists Utilize James Webb Space Telescope to Uncover Insights Into Neptune’s Evolution - India Education Diary", "description": "Aring of icy rocks orbiting our sun just beyond Neptune may give us a glimpse of how Neptune — and other objects in the outskirts of our solar system — were formed.Mors-Somnus, a binary duo comprised of a pair of icy asteroids bound by gravity, was r", "url": "https://indiaeducationdiary.in/ucf-scientists-utilize-james-webb-space-telescope-to-uncover-insights-into-neptunes-evolution/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2024-03-09T08:51:35Z", "content": "Aring of icy rocks orbiting our sun just beyond Neptune may give us a glimpse of how Neptune and other objects in the outskirts of our solar system were formed.\r\nMors-Somnus, a binary duo comprised o… [+5435 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Indian researchers develop new method to harness, convert CO2 to ethylene - The Hans India", "description": "New Delhi: A team of Indian researchers has synthesised a novel and highly efficient photocatalyst that can convert carbon dioxide (CO2) to high-value products ethene and ethylene - used as fuel...", "url": "https://www.thehansindia.com/hans/young-hans/indian-researchers-develop-new-method-to-harness-convert-co2-to-ethylene-863668", "urlToImage": "https://assets.thehansindia.com/h-upload/2024/03/09/1428855-young-hans.jpg", "publishedAt": "2024-03-09T08:40:04Z", "content": "New Delhi: A team of Indian researchers has synthesised a novel and highly efficient photocatalyst that can convert carbon dioxide (CO2) to high-value products ethene and ethylene - used as fuel gase… [+1714 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IT News Desk", "title": "De-Extinction Of Woolly Mammoth Gets One Step Closer, Through Elephants - Indiatimes.com", "description": "The woolly mammoth, an elephant species that became extinct millions of years ago and is known to modern humans only through fossils may make a comeback!As far-fetched as it may sound, US-based de-extinction company Colossal has claimed that they are one step…", "url": "https://www.indiatimes.com/news/world/de-extinction-of-woolly-mammoth-gets-one-step-closer-through-elephants-629455.html", "urlToImage": "https://im.indiatimes.in/content/2024/Mar/woolly_mammoth-rbc_65ec17d340ba9.jpg", "publishedAt": "2024-03-09T08:01:13Z", "content": "The woolly mammoth, an elephant species that became extinct millions of years ago and is known to modern humans only through fossils may make a comeback!\r\nAs far-fetched as it may sound, US-based de-… [+1980 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UMass Amherst Researchers Discover Exception to 200-Year-Old Scientific Law Governing Heat Transfer - India Education Diary", "description": "A team of researchers led by the University of Massachusetts Amherst has recently found an exception to the 200-year-old law, known as Fourier’s Law, that governs how heat diffuses through solid materials. Though scientists have shown previously that", "url": "https://indiaeducationdiary.in/umass-amherst-researchers-discover-exception-to-200-year-old-scientific-law-governing-heat-transfer/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/08/University-of-Massachusetts-Amherst.jpeg", "publishedAt": "2024-03-09T07:31:20Z", "content": "A team of researchers led by the University of Massachusetts Amherst has recently found an exception to the 200-year-old law, known as Fouriers Law, that governs how heat diffuses through solid mater… [+2987 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "sahas, Buzz Staff", "title": "Palaeontologists Discover Unique Underwater Hunting Style Of Sail-back Dinosaurs - News18", "description": "The authors of the study conducted a fresh analysis, re-evaluating the bone density of Spinosaurus to determine its aquatic habits.", "url": "https://www.news18.com/viral/palaeontologists-discover-unique-underwater-hunting-style-of-sail-back-dinosaurs-8809030.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/03/image-2024-03-09t113741.257-2024-03-42f13004e26bd64cc50f58de17e74d19-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-03-09T06:31:57Z", "content": "The massive sail-back dinosaur, Spinosaurus, might have hunted in shallow waters similar to a heron, rather than in deep waters as previously believed. Spinosaurus aegyptiacus was among the largest p… [+2920 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "‘Interstellar signal’ linked to 2014 meteor turns out to be from a truck: Study - The Indian Express", "description": "Those who detected \"sound signals of a meteor and \"material of interstellar origin\" were going off signals from a truck on a highway, finds new study.", "url": "https://indianexpress.com/article/technology/science/interstellar-signal-lnked-to-2014-meteor-9204336/", "urlToImage": "https://images.indianexpress.com/2024/03/Meteor-featured-20240309.jpg", "publishedAt": "2024-03-09T05:52:40Z", "content": "Sound signals initially believed to be from a 2014 meteor fireball were actually vibrations from a truck driving through a nearby road, reveals a new study.The signal changed directions over time, ex… [+1720 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "M  Ramesh", "title": "Universe is the limit for NASA-ISRO collaboration, says Swati Mohan - BusinessLine", "description": "Dr. Swati Mohan's groundbreaking work on NASA-ISRO collaboration for NISAR mission and Mars sample return program.", "url": "https://www.thehindubusinessline.com/news/science/universe-is-the-limit-for-nasa-isro-collaboration-says-swati-mohan/article67931410.ece", "urlToImage": "https://bl-i.thgim.com/public/incoming/mf99vd/article67931417.ece/alternates/LANDSCAPE_1200/swatimohan1_8.jpg", "publishedAt": "2024-03-09T04:35:33Z", "content": "The NASA-ISRO Synthetic Aperture Radar (NISAR) mission, the first of its kind in terms of the depth of collaboration between the space agencies of the US and India, will open the door for future miss… [+3606 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Quincy Jon", "title": "Inclusivity Soars: International Women's Day Spotlights Women in NASA's Space Exploration - Tech Times", "description": "NASA celebrates International Women's Day 2024 by recognizing the significant contributions of women in space exploration through the years.", "url": "https://www.techtimes.com/articles/302423/20240308/inclusivity-soars-international-womens-day-spotlights-women-nasas-space-exploration.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/444531/us-space-shuttle-atlantis-iss.jpg", "publishedAt": "2024-03-09T02:10:12Z", "content": "To honor International Women's Day 2024, NASA underscores the invaluable contributions of women to the progress of space exploration.\r\nAs of February 29, 2024, a total of 75 women have actively parti… [+5146 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Ritik Raj", "title": "10 stunning photos captured by NASA's James Webb space telescope - DNA India", "description": "stunning photos captured by NASA's James Webb space telescope", "url": "https://www.dnaindia.com/web-stories/viral/10-stunning-photos-captured-by-nasas-james-webb-space-telescope-1709947850567", "urlToImage": null, "publishedAt": "2024-03-09T01:44:23Z", "content": "Mar 9, 2024, 07:14 AM IST"}, {"source": {"id": null, "name": "Aviation Week"}, "author": null, "title": "Biomedical Studies Among Payloads On Next Space Station Cargo Mission - Aviation Week", "description": "Launch of the SpaceX Cargo Dragon with a more than 6,000-lb. payload from the Cape Canaveral Space Force Station is planned for no earlier than mid-March.", "url": "https://aviationweek.com/defense-space/space/biomedical-studies-among-payloads-next-space-station-cargo-mission", "urlToImage": "https://aviationweek.com/sites/default/files/uploads/2017/12/issspacestationnasajsc.jpg", "publishedAt": "2024-03-08T23:03:23Z", "content": "Biomedical Studies Among Payloads On Next Space Station Cargo Mission is published in Aerospace Daily &amp; Defense Report, an Aviation Week Intelligence Network (AWIN) Market Briefing and is include… [+332 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Kennedy Space Center Visitor Complex working on new attraction - WESH 2 News", "description": "Kennedy Space Center Visitor Complex working on new attractionSubscribe to WESH on YouTube now for more: http://bit.ly/1dqr14jGet more Orlando news: http://w...", "url": "https://www.youtube.com/watch?v=TqMcmPkcPNg", "urlToImage": "https://i.ytimg.com/vi/TqMcmPkcPNg/maxresdefault.jpg", "publishedAt": "2024-03-08T22:31:57Z", "content": null}, {"source": {"id": null, "name": "Dailymotion.com"}, "author": null, "title": "Bus-Size Asteroid Flew Closer Than The Moon - Watch The Orbit Animation - video Dailymotion - Dailymotion", "description": "Asteroid 2024 DW flew about 139,000 miles (224,000 km) away from Earth. The space rock was estimated to be about 43 feet wide (13 m).   Credit: Space.com | animation: NASA/JPL-Caltech | edited by Steve Spaleta Music: Black Bullet by Deskant / courtesy of Epid…", "url": "https://www.dailymotion.com/video/x8u3px4", "urlToImage": "https://s2.dmcdn.net/v/VsAFu1bww2HlQ348p/x720", "publishedAt": "2024-03-08T22:03:22Z", "content": null}, {"source": {"id": null, "name": "Pc-tablet.com"}, "author": null, "title": "NASA's First Mobile Robotic Mission on the Moon: A Quest for Ice - PC-Tablet", "description": "Join NASA's VIPER as it embarks on a groundbreaking mission to map and analyze water ice at the Moon's South Pole, marking a pivotal step for sustainable lunar exploration.", "url": "https://pc-tablet.com/nasas-first-mobile-robotic-mission-on-the-moon-a-quest-for-ice/", "urlToImage": "https://pc-tablet.com/wp-content/uploads/2024/03/NASAs-First-Mobile-Robotic-Mission-on-the-Moon.jpg", "publishedAt": "2024-03-08T19:08:12Z", "content": "In an unprecedented effort to explore the Moon’s resources, NASA’s Artemis program introduces the Volatiles Investigating Polar Exploration Rover (VIPER), aiming to scout the lunar South Pole for wat… [+3834 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Expedition 70 Astronaut Loral O’Hara Answers San Antonio Student Questions March 8, 2024 - NASA Video", "description": "Aboard the International Space Station, NASA Expedition 70 Flight Engineer Loral O’Hara discussed living and working in space during an in-flight event March...", "url": "https://www.youtube.com/watch?v=nGmIh2jrWFA", "urlToImage": "https://i.ytimg.com/vi/nGmIh2jrWFA/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgZShlMA8=&rs=AOn4CLD8WVGkHdg5klCR8C77SLjEJcG2eA", "publishedAt": "2024-03-08T18:47:22Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Not-so-killer asteroid: Astronomers rule out Earth impact of Apophis - Devdiscourse", "description": "Read more about Not-so-killer asteroid: Astronomers rule out Earth impact of Apophis\r\n on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2853223-not-so-killer-asteroid-astronomers-rule-out-earth-impact-of-apophis", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_11_2021_08_35_27_4992751.jpg?width=920&format=jpeg", "publishedAt": "2024-03-08T18:11:41Z", "content": "Since its discovery in 2004, asteroid Apophis, a near-Earth object (NEO) - has captivated both scientists and the public with its potential close encounters with Earth in 2029 and 2036. While scienti… [+1502 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Dheeraj Bengrut", "title": "UVIT onboard Astro Sat captures escaping ionising photons from galaxies - Hindustan Times", "description": "Detecting ionising UV radiation from such galaxies is extremely challenging, and was possible only because of the unique capabilities and high sensitivity of the UVIT, says author", "url": "https://www.hindustantimes.com/cities/pune-news/uvit-onboard-astro-sat-captures-escaping-ionising-photons-from-galaxies-101709919487741.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/03/08/1600x900/Image-of-the-ten-LyC-leaking-galaxies-discovered--_1709919484895.jpg", "publishedAt": "2024-03-08T17:38:07Z", "content": "An international team of astronomers has been successful in detecting ionising photons from rare type of galaxies known as Lyman Continuum Leakers using the Ultraviolet Imaging Telescope (UVIT) onboa… [+3101 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Exploring the evolutionary source of genomic imprinting - Tech Explorist", "description": "RNA-mediated parent-of-origin effects driven by selfish conflict.", "url": "https://www.techexplorist.com/exploring-evolutionary-source-genomic-imprinting/81845/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2024/03/DNA.jpg", "publishedAt": "2024-03-08T15:30:46Z", "content": "Genomic imprinting is the process by which some genes are turned on or off based on whether our parents inherited them. Researchers at the Burga Lab found a new way genes are controlled, linked to si… [+3689 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Superconductivity scandal: the inside story of deception in a rising star's physics lab - Nature.com", "description": "Ranga Dias claimed to have discovered the first room-temperature superconductors, but the work was later retracted. An investigation by Nature’s news team reveals new details about what happened — and how institutions missed red flags.", "url": "https://www.nature.com/articles/d41586-024-00716-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-024-00716-2/d41586-024-00716-2_26825358.jpg", "publishedAt": "2024-03-08T14:38:21Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Nicioli", "title": "70 million-year-old giant dinosaur skeleton found connected from skull to tail - CNN", "description": "A nearly complete and intact dinosaur skeleton has been excavated in France. The specimen is a Titanosaur, one of the largest dinosaurs of its time.", "url": "https://www.cnn.com/2024/03/07/europe/dinosaur-connected-fossil-discovery-france-titanosaur-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/img-3807.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-03-07T20:28:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nA chance discovery made in southern France has reveale… [+4834 chars]"}]}