{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "New research on self-locking light sources presents opportunities for quantum technologies - Nanowerk", "description": "Scientists demonstrate that light emitters with different resonance frequencies can asynchronously self-lock their relative energies by exchanging mechanical energy. This finding paves the way for increased control of light sources and GHz-to-THz interconvers…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=63196.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id63196.jpg", "publishedAt": "2023-06-19T12:20:15Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing the Hidden Power of Defects: Pioneering Energy Efficiency in Thermal Insulators - SciTechDaily", "description": "Scientists at the NOMAD Laboratory at the Fritz Haber Institute of the Max Planck Society have shed light on the microscopic mechanisms that determine thermal conduction in heat insulators. Through their computational research, they have demonstrated that eve…", "url": "https://scitechdaily.com/harnessing-the-hidden-power-of-defects-pioneering-energy-efficiency-in-thermal-insulators/", "urlToImage": "https://scitechdaily.com/images/Abstract-Energy-Material-Concept.gif", "publishedAt": "2023-06-19T11:45:44Z", "content": "ByFritz Haber Institute of the Max Planck SocietyJune 19, 2023\r\nResearchers have discovered that microscopically localized defects significantly impact thermal conduction in insulators. This finding,… [+2721 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Gravitational Influence on Quantum Spins - AZoQuantum", "description": "A collaborative research group led by Prof. Dong Sheng and Prof. Zhengtian Lu from the Chinese Academy of Sciences (CAS) investigated the coupling effect between neutron spin and gravitational force using a high-precision xenon isotope magnetometer.", "url": "https://www.azoquantum.com/News.aspx?newsID=9625", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/SocialSharingImage_9625_16871742001014722.jpg", "publishedAt": "2023-06-19T11:30:00Z", "content": "A collaborative research group led by Prof. Dong Sheng and Prof. Zhengtian Lu from the Chinese Academy of Sciences (CAS) investigated the coupling effect between neutron spin and gravitational force … [+2574 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "New evidence supports possibility of life on Saturn's moon - The Week", "description": "Enceladus is the tiny moon of Saturn that seems to have it all. Its icy surface is intricately carved by ongoing geological processes. Its icy shell overlies an internal, liquid ocean. There, chemically charged warm water seeps out of the rocky core onto the …", "url": "https://www.theweek.in/news/sci-tech/2023/06/19/new-evidence-supports-possibility-of-life-on-saturn-s-moon.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/images/2018/5/1/saturn-cassini-mosaic-saturn.jpg", "publishedAt": "2023-06-19T11:25:51Z", "content": "Enceladus is the tiny moon of Saturn that seems to have it all. Its icy surface is intricately carved by ongoing geological processes. Its icy shell overlies an internal, liquid ocean. There, chemica… [+5194 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Texas A&M Expert, Collaborators Spot Universe’s Most Distant Organic Molecules - India Education Diary", "description": "An international team of astronomers has detected complex organic molecules in the most distant galaxy to date using NASA’s James Webb Space Telescope.The discovery of the molecules, which are familiar on Earth in smoke, soot and smog, demonstrates t", "url": "https://indiaeducationdiary.in/texas-am-expert-collaborators-spot-universes-most-distant-organic-molecules/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/spilker-justin-jwst-nature-002-2048x1152-1-1024x576.jpg", "publishedAt": "2023-06-19T11:19:09Z", "content": "An international team of astronomers has detected complex organic molecules in the most distant galaxy to date using NASAs James Webb Space Telescope.\r\nThe discovery of the molecules, which are famil… [+5552 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Astronomers observed the longest tails of gas yet escaping a planet - Tech Explorist", "description": "The planet losing its atmosphere.", "url": "https://www.techexplorist.com/longest-tails-gas-yet-escaping-planet/62456/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/HAT-P-32b.jpg", "publishedAt": "2023-06-19T11:16:06Z", "content": "Using observations from Hobby-Eberly Telescope (HET), astronomers at the University of Texas at Austins McDonald Observatory have discovered some of the longest tails of Helium escaping a Jupiter-lik… [+1909 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Parker Solar Probe images the launch of the solar wind - Ars Technica", "description": "This discovery is literally the hottest thing in a while.", "url": "https://arstechnica.com/science/2023/06/parker-solar-probe-images-the-launch-of-the-solar-wind/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/image-3-760x380.jpeg", "publishedAt": "2023-06-19T11:15:25Z", "content": "Enlarge/ An artist's depiction of the Parker Solar Probe, along with its subject.\r\n11 with \r\nThe solar wind swarms with charged particles that can light up auroras, cause satellites to glitch, and da… [+4426 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Designing a Less Toxic Method for MXene Synthesis - AZoNano", "description": "AZoNano speaks with researchers from the Talapin Lab, University of Chicago, about a new method to synthesize MXenes that is less toxic than conventional approaches.", "url": "https://www.azonano.com/article.aspx?ArticleID=6465", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6465_16869066888364405.jpg", "publishedAt": "2023-06-19T10:07:00Z", "content": "AZoNano speaks with researchers from the Talapin Lab, University of Chicago, about a new method to synthesize MXenes. We discuss how this approach compares to existing solutions, such as a lack of to… [+13033 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Europe's BepiColombo spacecraft to zoom within 150 miles of Mercury in close flyby today - Space.com", "description": "The flyby will help the BepiColombo spacecraft reduce its speed so that it can enter Mercury's orbit in two and a half years.", "url": "https://www.space.com/mercury-flyby-bepicolombo-spacecraft-june-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/i4R2VPgzZrVh2JYZ35dKje-1200-80.jpg", "publishedAt": "2023-06-19T10:00:41Z", "content": "Europe's Mercury probe BepiColombo will take a close look at its target planet on Monday (June 19), and we can expect some exciting new images to reach Earth soon after that. \r\nThe flyby will be Bepi… [+4389 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Study reveals the existence of the swallowtail catastrophe in non-Hermitian systems - Phys.org", "description": "Researchers from the Hong Kong University of Science and Technology, Xiangtan University and Southern University of Science and Technology recently unveiled a possible connection between catastrophe theory, an area of mathematics that focuses on modeling sudd…", "url": "https://phys.org/news/2023-06-reveals-swallowtail-catastrophe-non-hermitian.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/study-reveals-the-exis.jpg", "publishedAt": "2023-06-19T10:00:01Z", "content": "Researchers from the Hong Kong University of Science and Technology, Xiangtan University and Southern University of Science and Technology recently unveiled a possible connection between catastrophe … [+7940 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "A space object revolving around a star is hotter than the Sun - WION", "description": "A space object revolving around a star is hotter than the Sun", "url": "https://www.wionews.com/science/a-space-object-revolving-around-a-star-is-hotter-than-the-sun-606060", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/19/360581-brown-dwarf.jpg", "publishedAt": "2023-06-19T09:50:23Z", "content": "So what does our default understanding of the Universe say? If a space object is revolving around a star, it will be a planet and relatively a cool body, right? This logic is in keeping with things i… [+2005 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists developed a new method to manipulate the shape and tight packing of DNA - Tech Explorist", "description": "Folding the code of life.", "url": "https://www.techexplorist.com/new-method-manipulate-shape-tight-packing-dna/62432/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/packaging-of-DNA.jpg", "publishedAt": "2023-06-19T09:47:18Z", "content": "The compaction and organization of genomic DNA is a central mechanism in eukaryotic cells, but engineered architectural control over double-stranded DNA (dsDNA) is notably challenging. Aarhus Univers… [+2603 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "When Carbon Sinks Sink: New Research Uncovers a Climate Change Time Bomb - SciTechDaily", "description": "A new study reveals that rising global temperatures could convert widespread microbial communities worldwide from carbon sinks to carbon emitters, potentially triggering climate change tipping points. These findings were recently published in the British Ecol…", "url": "https://scitechdaily.com/when-carbon-sinks-sink-new-research-uncovers-a-climate-change-time-bomb/", "urlToImage": "https://scitechdaily.com/images/Paramecium-bursaria-scaled.jpg", "publishedAt": "2023-06-19T09:43:21Z", "content": "ByBritish Ecological SocietyJune 19, 2023\r\nFound in lakes and rivers worldwide, single-celled creatures like these Paramecium bursaria can both eat and photosynthesize. Microbes like this play a doub… [+5145 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 19 June 2023: Spooky Lagoon Nebula! - HT Tech", "description": "NASA Astronomy Picture of the Day for June 19, 2023, features a breathtaking view of the center of Lagoon Nebula. What is it? NASA explains.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-19-june-2023-spooky-lagoon-nebula-71687167595762.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/19/1600x900/LagoonCenter_HubblePobes_960_1687167694119_1687167702514.jpg", "publishedAt": "2023-06-19T09:42:27Z", "content": "Nebulae are vast cosmic formations consisting of dust and gas -- which originate from various sources, such as the ejected material of a dying star, like a supernova explosion. Moreover, certain nebu… [+2143 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "NASA Timelapse Video Captures Earth in All Its Glory at Night from Space - Times Now", "description": "NASA has shared a stunning timelapse video of the Earth at night, recorded from the International Space Station (ISS). The footage provides a captivating glimpse of atmospheric phenomena, including the dance of the northern lights and thunderstorms, from the …", "url": "https://www.timesnownews.com/viral/nasa-timelapse-video-captures-earth-in-all-its-glory-at-night-from-space-article-101103092", "urlToImage": "https://static.tnn.in/thumb/msid-101103092,updatedat-1687167426476,width-1280,height-720,resizemode-75/101103092.jpg", "publishedAt": "2023-06-19T09:34:12Z", "content": "A dancing aurora illuminates Earth's night sky, as seen from the International Space Station | Screenshot from NASA APOD video"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Parasites As Fountain Of Youth? Study Finds Infected Ants Live Much Longer - NDTV", "description": "The parasite that affects these ants is a tapeworm called Anomotaenia brevis that is found in several types of woodpecker.", "url": "https://www.ndtv.com/science/parasites-as-fountain-of-youth-study-finds-infected-ants-live-much-longer-4133526", "urlToImage": "https://c.ndtvimg.com/2022-09/u9l1dag8_ant-generic-unsplash_625x300_26_September_22.jpg", "publishedAt": "2023-06-19T09:23:32Z", "content": "The parasite also gives these ants a strangely idyllic lifestyle. (Representational Pic)\r\nParasitic infections are usually harmful to their hosts, but there can be some exceptions. Scientists recentl… [+1795 chars]"}, {"source": {"id": null, "name": "EIN News"}, "author": "Joanna Speed", "title": "Laurans 'Larry' A. Mendelson To Receive The 44th Annual Howard Hughes Memorial Award - EIN News", "description": "The Aero Club of Southern California is proud to announce Mr. Laurans 'Larry' A. Mendelson will be honored with the prestigious 44th annual Howard Hughes", "url": "https://www.einnews.com/pr_news/638445556/laurans-larry-a-mendelson-to-receive-the-44th-annual-howard-hughes-memorial-award", "urlToImage": "https://img.einnews.com/ampsize/486663/larry-mendelson.jpeg", "publishedAt": "2023-06-19T09:00:00Z", "content": "LOS ANGELES, CA, USA, June 19, 2023/EINPresswire.com/ -- The Aero Club of Southern California is proud to announce Mr. Laurans 'Larry' A. Mendelson will be honored with the prestigious 44th annual Ho… [+1470 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kiley Price", "title": "Do fish get thirsty? - Livescience.com", "description": "How much water a fish drinks depends on the saltiness of its surroundings.", "url": "https://www.livescience.com/animals/fish/do-fish-get-thirsty", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EwKrexAfPR3Bgn9h5uPCdB-1200-80.jpg", "publishedAt": "2023-06-19T09:00:00Z", "content": "Fish are constantly surrounded by water, but do they get thirsty? And how would they even drink?\r\nTo answer these question, it's crucial to understand how water — a solvent — interacts with other sub… [+4026 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "What is Suit? The unique telescope delivered to Isro to launch with Aditya L-1 mission - India Today", "description": "The Solar Ultraviolet Imaging Telescope (Suit), designed by scientists at IUCAA, will study the Sun's ultraviolet (UV) emissions.", "url": "https://www.indiatoday.in/science/story/aditya-l-1-mission-launch-suit-isro-solar-telescope-iucaa-2394893-2023-06-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/aditya_l-1-sixteen_nine.jpg?VersionId=eRYO.TaY8y6g3a_24pawYac4HlMRXwzL", "publishedAt": "2023-06-19T08:54:47Z", "content": "By India Today Science Desk: Pune’s Inter-University Center for Astronomy and Astrophysics (IUCAA) has delivered the Solar Ultraviolet Imaging Telescope (Suit) to the Indian Space Research Organisati… [+3329 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Restoring Anatomical Features in Primary Total Knee Arthroplasty - Cureus", "description": "Today, the number of people affected by gonarthrosis symptoms is increasing proportionally. Total knee arthroplasty (TKA) is a successful intervention that aims to reduce pain and restore knee function. However, studies have shown that active young patients s…", "url": "https://www.cureus.com/articles/160638-restoring-anatomical-features-in-primary-total-knee-arthroplasty?score_article=true", "urlToImage": "https://assets.cureus.com/uploads/figure/file/653191/article_river_833c7e40043d11eea7a6a9584c0d9833-fig-1_1024x636.png", "publishedAt": "2023-06-19T08:44:53Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Invisible Architects: New Link Discovered Between Dark Matter and Clumpiness of the Universe - SciTechDaily", "description": "Researchers propose in a new study that the universe's lack of clumpiness suggests dark matter is composed of hypothetical, ultra-light particles called axions. If confirmed, this could have broad implications for our understanding of the universe and could e…", "url": "https://scitechdaily.com/invisible-architects-new-link-discovered-between-dark-matter-and-clumpiness-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Universe-With-and-Without-Axions.jpg", "publishedAt": "2023-06-19T08:32:42Z", "content": "A computer simulation of a section of the universe with and without axions showing how the dark matter cosmic web structure is less clumpy if containing axions. For scale, the Milky Way galaxy would … [+4158 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study finds how a probiotic help mitigate mercury absorption in gut - ThePrint", "description": "Houston [US], June 19 (ANI): According to a recent study, the microorganisms in the human stomach may be used to prevent the body from absorbing harmful metals like mercury while assisting it in absorbing beneficial ones for nourishment, like iron. The study …", "url": "https://theprint.in/science/study-finds-how-a-probiotic-help-mitigate-mercury-absorption-in-gut/1632345/", "urlToImage": null, "publishedAt": "2023-06-19T08:14:23Z", "content": "Houston [US], June 19 (ANI): According to a recent study, the microorganisms in the human stomach may be used to prevent the body from absorbing harmful metals like mercury while assisting it in abso… [+2368 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Groundwater Extraction Alters Earth's Tilt: Implications For Climate Change Revealed - Indiatimes.com", "description": "The Earth is undergoing multiple changes due to human activity. Besides depletion of natural resources, the Earth is experiencing climate changes due to exploitation, as evident in natural disasters that are now becoming more common. Now, a new study reveals …", "url": "https://www.indiatimes.com/technology/science-and-future/groundwater-extraction-alters-earths-tilt-606395.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jun/FBImage---2023-06-19T135819861_649011ac24dc9.jpg", "publishedAt": "2023-06-19T08:03:39Z", "content": "The Earth is undergoing multiple changes due to human activity. Besides depletion of natural resources, the Earth is experiencing climate changes due to exploitation, as evident in natural disasters … [+2508 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "China's Yanliao Biota offers a new window into mammal evolution since the Triassic - Phys.org", "description": "China's Yanliao Biota, an assembly of fossils preserved in northeastern China dating from the Middle to Late Jurassic (174 to 145 million years ago), offers an important window into the evolution of vertebrates. With exceptional preservation of insects, feath…", "url": "https://phys.org/news/2023-06-china-yanliao-biota-window-mammal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/chinas-yanliao-biota-o.jpg", "publishedAt": "2023-06-19T08:00:01Z", "content": "China's Yanliao Biota, an assembly of fossils preserved in northeastern China dating from the Middle to Late Jurassic (174 to 145 million years ago), offers an important window into the evolution of … [+4704 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Research Finds Planted Vegetation Speeds Up Dune Erosion During Extreme Storms - India Education Diary", "description": "Newly planted vegetation on coastal sand dunes can accelerate erosion from extreme waves, a study involving researchers from the Oregon State University College of Engineering suggests.The authors note the findings run counter to the widely accepted", "url": "https://indiaeducationdiary.in/research-finds-planted-vegetation-speeds-up-dune-erosion-during-extreme-storms/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/header_138-1024x481.jpg", "publishedAt": "2023-06-19T07:57:59Z", "content": "Newly planted vegetation on coastal sand dunes can accelerate erosion from extreme waves, a study involving researchers from the Oregon State University College of Engineering suggests.\r\nThe authors … [+2961 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble telescope captures stunning image of globular cluster NGC 6544 - Devdiscourse", "description": "Read more about Hubble telescope captures stunning image of globular cluster NGC 6544 on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2493259-hubble-telescope-captures-stunning-image-of-globular-cluster-ngc-6544", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/19_06_2023_12_55_44_7285592.jpg?width=920&format=jpeg", "publishedAt": "2023-06-19T07:42:45Z", "content": "The NASA/ESA Hubble Space Telescope has captured a breathtaking image showcasing the radiant stars of NGC 6544 - a globular cluster that lies more than 8000 light-years away from Earth, in the conste… [+2411 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Water on Earth did not form on its own. It was sucked from space - India Today", "description": "The recent study challenges conventional ideas and introduces a mechanism where the Earth rapidly formed through the accumulation of small pebbles.", "url": "https://www.indiatoday.in/science/story/water-on-earth-did-not-form-on-its-own-it-was-sucked-from-space-2394839-2023-06-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/ocean-sixteen_nine.jpg?VersionId=QK9NfDqtF9B1kdpJoYhGHUz8F8Svc.v5", "publishedAt": "2023-06-19T07:25:13Z", "content": "By India Today Science Desk: Scientists have made a surprising discovery that suggests the Earth might have formed more quickly than previously believed. \r\nIt appears that tiny millimeter-sized pebbl… [+3071 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Only Scientist To Walk On The Moon Discovered He Was Allergic To Lunar Dust - Indiatimes.com", "description": "Imagine landing on the Moon only to realise that you're allergic to Moon dust. That's exactly what happened with Apollo 17 astronaut Harrison H. Schmitt, who realised that the dust on Moon was triggering his allergies.Schmitt is now 87-years-old and is among …", "url": "https://www.indiatimes.com/technology/science-and-future/scientist-walk-on-the-moon-allergic-to-lunar-dust-606381.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jun/FBImage---2023-06-19T125949241_649003f8ac0c8.jpg", "publishedAt": "2023-06-19T07:02:26Z", "content": "Imagine landing on the Moon only to realise that you're allergic to Moon dust. That's exactly what happened with Apollo 17 astronaut Harrison H. Schmitt, who realised that the dust on Moon was trigge… [+2930 chars]"}, {"source": {"id": null, "name": "Marketscreener.com"}, "author": "Reuters", "title": "Indonesia, SpaceX launch satellite to boost internet connectivity - Marketscreener.com", "description": "JAKARTA (Reuters) -     Indonesia and Elon Musk's rocket company SpaceX on Monday launched the country's largest telecommunication satellite from the United States, in a $540 million project intended to link up remote corners of the archipelago to the interne…", "url": "https://www.marketscreener.com/news/latest/Indonesia-SpaceX-launch-satellite-to-boost-internet-connectivity--44138878/", "urlToImage": "https://img.zonebourse.com/reuters/2023-06/2023-06-19T070051Z_1_LYNXMPEJ5I04N_RTROPTP_3_SPACEX-MUSK.JPG", "publishedAt": "2023-06-19T06:44:53Z", "content": "JAKARTA (Reuters) - Indonesia and Elon Musk's rocket company SpaceX on Monday launched the country's largest telecommunication satellite from the United States, in a $540 million project intended to … [+1148 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Surreal 'Einstein Cross' Spotted in Space After Distant Supernova - ScienceAlert", "description": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it – collectively referred to as the cosmic distance ladder.", "url": "https://www.sciencealert.com/surreal-einstein-cross-spotted-in-space-after-distant-supernova", "urlToImage": "https://www.sciencealert.com/images/2023/06/GravitationalLensEinsteinCross_UT.jpg", "publishedAt": "2023-06-19T06:30:07Z", "content": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it collectively referred to as the cosmic distance ladder.\r\nOne particularly crucial tool is type I… [+4141 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Saumya joshi", "title": "NASA’s Juno mission captures 'lightning' on Jupiter - Republic World", "description": "The Juno spacecraft of NASA saw the glow just like a bolt of lightning near Jupiter's north pole.", "url": "https://www.republicworld.com/science/space/nasas-juno-mission-captures-lightning-on-jupiter-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/cof0hdcfvfsgkrgj_1687153107.jpeg", "publishedAt": "2023-06-19T06:21:00Z", "content": "Juno spacecraft of NASA has witnessed the glow just like a bolt of lightning near Jupiter's north pole. The space agency shared the image from the Jupter-orbiting mission on its official account on I… [+1828 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Astronomers discover pair of Hot Neptune exoplanets using TESS observations - News9 LIVE", "description": "Both TOI 3353b and TOI 3353c are in close orbits around the host star, which is at a distance of 257 lightyears from the Earth.", "url": "https://www.news9live.com/science/astronomers-discover-pair-of-hot-neptune-exoplanets-using-tess-observations-2183219", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/935086e2-4692-4233-bbd5-47ac13e0762f-Cropped.jpg", "publishedAt": "2023-06-19T06:12:52Z", "content": "Both TOI 3353 b and TOI 3353 c are in close orbits around the host star, which is at a distance of 257 lightyears from the Earth. The two worlds have been discovered in orbit around a young Sun-like … [+1883 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Decode How 3.2 Million-Year-Old Ancient Human Ancestor Walked - NDTV", "description": "The ancestor named 'Lucy' was shorter than modern-day humans - about 3.3 feet in height - and had an ape-like face.", "url": "https://www.ndtv.com/science/scientists-decode-how-3-2-million-year-old-ancient-human-ancestor-walked-4133003", "urlToImage": "https://c.ndtvimg.com/f4jpkrlk_fossil-generic_625x300_13_July_18.jpg", "publishedAt": "2023-06-19T06:00:11Z", "content": "The fossil was analysed using 3D muscle modelling. (Representational Pic)\r\nResearchers have always been fascinated by understanding how our ancestors spent their time - by walking over flat ground or… [+1697 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Scientists detect gaseous urea in atmosphere of Earth for first time - News9 LIVE", "description": "Reduced nitrogen which is an important nutrient to support life, can be redistributed across the planet by the atmosphere.", "url": "https://www.news9live.com/science/scientists-detect-gaseous-urea-in-atmosphere-of-earth-for-first-time-2183084", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/hugh-whyte-AK0GpTNwDlA-unsplash-Cropped.jpg", "publishedAt": "2023-06-19T05:50:57Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Fareha Naaz", "title": "Blue Whale-sized asteroid to pass Earth today: Report - Mint", "description": "On June 19, 2023 asteroid 2016 LK49 will make a close approach to Earth, coming within 364,150km, closer than the distance between Earth and the Moon, said a News Nine report.", "url": "https://www.livemint.com/news/world/blue-whale-sized-asteroid-to-pass-earth-today-how-big-is-the-threat-11687148943426.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/06/19/600x338/aste_1687149341510_1687149356747.jpg", "publishedAt": "2023-06-19T05:20:14Z", "content": "An asteroid, known as 2016 LK49 will be making a close approach to Earth, coming within a distance of 3,64,150 kilometres. This is closer than the distance between the Earth and the Moon. The asteroi… [+2298 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New method can create plant-based meat substitutes with better texture - News-Medical.Net", "description": "Sales of plant-based meat products have levelled off in recent years, at least in part because current offerings lack the texture or mouthfeel of a nice T-bone steak or chicken breast.", "url": "https://www.news-medical.net/news/20230618/New-method-can-create-plant-based-meat-substitutes-with-better-texture.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_751310_16871470562662561.jpg", "publishedAt": "2023-06-19T03:59:00Z", "content": "Sales of plant-based meat products have levelled off in recent years, at least in part because current offerings lack the texture or mouthfeel of a nice T-bone steak or chicken breast.\r\nImage Credit:… [+2824 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Links: June 18, 2023 | Hackaday - Hackaday", "description": "Will it or won’t it? That’s the question much on the minds of astronomers, astrophysicists, and the astro-adjacent this week as Betelgeuse continued its pattern of mysterious behavior t…", "url": "https://hackaday.com/2023/06/18/hackaday-links-june-18-2023/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2023-06-18T23:00:00Z", "content": "Will it or won’t it? That’s the question much on the minds of astronomers, astrophysicists, and the astro-adjacent this week as Betelgeuse continued its pattern of mysterious behavior that might port… [+4246 chars]"}, {"source": {"id": null, "name": "SpacePolicyOnline.com"}, "author": null, "title": "What's Happening in Space Policy June 18-24, 2023 – SpacePolicyOnline.com - SpacePolicyOnline.com", "description": "Posted: June 18, 2023 6:03 pm ET | Last Updated: June 18, 2023 6:20 pm ET | Get SpacePolicyOnline.com's list of space policy events for the week of June 18-24, 2023 including congressional committee markups of the FY2024 Defense Appropriations bill and the Na…", "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-june-18-24-2023/", "urlToImage": null, "publishedAt": "2023-06-18T22:03:00Z", "content": "Here is SpacePolicyOnline.com’s list of space policy events for the week of June 18-24, 2023 and any insight we can offer about them. The House and Senate are in session this week.\r\nDuring the Week\r\n… [+9800 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Why Peanuts ‘Dance’ When Dropped in Beer - VOA Learning English", "description": "When peanuts are dropped into a glass of beer, they sink to the bottom before floating up and \"dancing\" in the glass. The scientists say the research helps them understand mineral extraction or bubbling magma in the layer of Earth called the crust.", "url": "https://learningenglish.voanews.com/a/why-peanuts-dance-when-dropped-in-beer/7137354.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-6157-08db6ca9bfd9_w1200_r1.jpg", "publishedAt": "2023-06-18T21:57:08Z", "content": "When peanuts are dropped into a glass of beer, they sink to the bottom before floating up and \"dancing\" in the glass.\r\nScientists investigated this process in a study involving the alcoholic drink be… [+3169 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Black Hole Emits Jets of X-rays 60,000 Times Hotter than Sun–the Brightest Quasar Ever Observed - Good News Network", "description": "Jets of light 60,000 times hotter than the sun have been captured by astronomers observing a quasar—the most powerful object in the universe.", "url": "https://www.goodnewsnetwork.org/black-hole-emits-jets-of-x-rays-60000x-hotter-than-sun/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/06/Artist-impression-of-quasar-Credit-NOIRLabNSFAURAJ.-da-Silva-CC-license-SWNS.jpg", "publishedAt": "2023-06-18T21:18:41Z", "content": "Artists impression of a quasar Credit NOIRLab / NSF / AURA / J. da Silva, CC license SWNS\r\nJets of light 100,000 billion times brighter than the sun have been captured by astronomers observing a quas… [+2997 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "NASA's Perseverance Rover Captures View of Mars' Belva Crater - Pragativadi", "description": "The six-wheeled scientist encountered the crater during its latest science campaign in search of rock samples that could be brought to Earth for deeper investigation.The Mastcam-Z instrument aboard NASA’s Perseverance Mars rover recently collected 15", "url": "https://pragativadi.com/nasas-perseverance-rover-captures-view-of-mars-belva-crater/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2023/06/Mars-Belva-Crater.png", "publishedAt": "2023-06-18T20:24:59Z", "content": "The six-wheeled scientist encountered the crater during its latest science campaign in search of rock samples that could be brought to Earth for deeper investigation.\r\nThe Mastcam-Z instrument aboard… [+3524 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Fungus farming ants work hard to maintain healthy gardens - Earth.com", "description": "Fungus farming ants work hard to maintain healthy gardens • Earth.com", "url": "https://www.earth.com/news/fungus-farming-ants-work-hard-to-maintain-healthy-gardens/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/18135535/ants_agaricus_fungus-farming_1medium-1000x750.jpg", "publishedAt": "2023-06-18T19:59:27Z", "content": "The secret to a flourishing, healthy garden is to ‘weed early and often.’ Surprisingly, we share this gardening principle with certain ant species. They are master gardeners who have been perfecting … [+7091 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Live Fast, Die Young: How Long Did Dinosaurs Really Live? - The Times Hub", "description": "Spread the love It didn't take long for many dinosaurs to reach enormous size. Dinosaurs, at least many of them, were the largest animals, once inhabited the earth. Paleontologists continue to find more and more remains of these creatures, thanks to which new…", "url": "https://thetimeshub.in/live-fast-die-young-how-long-did-dinosaurs-really-live/", "urlToImage": null, "publishedAt": "2023-06-18T18:11:14Z", "content": "It didn't take long for many dinosaurs to reach enormous size. \r\nDinosaurs, at least many of them, were the largest animals, once inhabited the earth. Paleontologists continue to find more and more r… [+366 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": null, "title": "20 inventions that changed the world - msnNOW", "description": "Our lives would not be the same without these inventions.", "url": "https://www.livescience.com/33749-top-10-inventions-changed-world.html", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1cI0jF.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-06-18T17:52:43Z", "content": "Humans are naturally curious and creative, two traits that have led our species to many scientific and technological breakthroughs. Since our earliest ancestors bashed a rock on the ground to make th… [+554 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "New Ankylosaur Species Found In UK's 'Dinosaur Island'. All About The Armoured Creature - ABP Live", "description": "The species is an ankylosaur, a kind of armoured dinosaur. An analysis by the researchers showed Vectipelta was found to be most closely related to some Chinese ankylosaurs.", "url": "https://news.abplive.com/science/ankylosaur-species-found-in-united-kingdom-dinosaur-island-all-about-the-armoured-creature-1609929", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/06/18/643cc8facfde1b02e639e500b4b13d1a1687099330348324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-06-18T14:43:33Z", "content": null}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Mysteries of universe to be revealed by Euclid telescope, say scientists - WION", "description": "Mysteries of universe to be revealed by Euclid telescope, say scientists", "url": "https://www.wionews.com/science/mysteries-of-universe-to-be-revealed-by-euclid-telescope-say-scientists-605804", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/18/360410-untitled-design-2023-06-18t194516187.png", "publishedAt": "2023-06-18T14:11:19Z", "content": "The scientists have expressed their hope of finding more truth about the dark side of the cosmos after a European probe is blasted into space in a few weeks.\r\nThe two most mind-baffling components of… [+2492 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Fives planets will star in Junes planetary alignment show - The News International", "description": "The alignment of planets in space has previously only been depicted in films, cartoons, or animations, but this month we will be able to see it with our own eyes. A rare astronomical alignment of...", "url": "https://www.thenews.com.pk/latest/1081940-fives-planets-will-star-in-junes-planetary-alignment", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-06-18/1081940_070259_updates.jpg", "publishedAt": "2023-06-18T13:43:58Z", "content": "The alignment of planets in space has previously only been depicted in films, cartoons, or animations, but this month we will be able to see it with our own eyes. A rare astronomical alignment of fiv… [+2464 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "James Webb uncovers the surprising source of the evolution of the early universe - BGR", "description": "James Webb has helped uncover even more information about one of the main sources of the early universe's evolution.", "url": "https://bgr.com/science/james-webb-uncovers-the-surprising-source-of-the-evolution-of-the-early-universe/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/08/AdobeStock_480632621.jpeg?quality=82&strip=all", "publishedAt": "2023-06-18T13:02:00Z", "content": "NASA’s James Webb Space Telescope has given astronomers almost unmatched access to the secrets of our universe. Most notably, it has helped us better understand the early universe, how it has changed… [+2464 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Space Research Breakthroughs Propelling Medical Advancements — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: California-based start-up Varda Space Industries has embarked on a groundbreaking mission that could revolutionize the field of medicine. In a historic launch on June 12, the company successfully sent a 200-pound (90-kilogram) capsule into Eart…", "url": "https://www.transcontinentaltimes.com/space-research-breakthroughs/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/earth-3.jpg", "publishedAt": "2023-06-18T12:39:17Z", "content": "UNITED STATES: California-based start-up Varda Space Industries has embarked on a groundbreaking mission that could revolutionize the field of medicine. In a historic launch on June 12, the company s… [+3646 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "NASA plans to land a probe on an asteroid that is more expensive than the entire global economy - The Times Hub", "description": "Spread the love NASA is actively preparing to restore the Earth's mineral resources, looking for them in space. Scientists have planned a space mission to the asteroid Psyche, which costs 10 quadrillion dollars. According to scientists, the asteroid is very r…", "url": "https://thetimeshub.in/nasa-plans-to-land-a-probe-on-an-asteroid-that-is-more-expensive-than-the-entire-global-economy/", "urlToImage": null, "publishedAt": "2023-06-18T12:07:44Z", "content": "NASA is actively preparing to restore the Earth's mineral resources, looking for them in space. Scientists have planned a space mission to the asteroid Psyche, which costs 10 quadrillion dollars. Acc… [+347 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists reveal the secrets of the coldest region of the Sun - The Times Hub", "description": "Spread the love Scientists have made a major breakthrough in understanding the mystery behind the Sun's hot upper atmosphere, known as the corona. For almost a century, physicists have been puzzled as to why the temperature in the corona is hundreds of times …", "url": "https://thetimeshub.in/scientists-reveal-the-secrets-of-the-coldest-region-of-the-sun/", "urlToImage": null, "publishedAt": "2023-06-18T12:07:38Z", "content": "Scientists have made a major breakthrough in understanding the mystery behind the Sun's hot upper atmosphere, known as the corona. For almost a century, physicists have been puzzled as to why the tem… [+485 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "NASA is sending a probe to Europa – and you can send your name with it - The Jerusalem Post", "description": "This is thanks to NASA's new Message in a Bottle initiative, the public can have their name engraved on a microchip in its Europa Clipper spacecraft as it heads to Jupiter's moon.", "url": "https://www.jpost.com/science/article-746690", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/540530", "publishedAt": "2023-06-18T09:12:00Z", "content": "NASA is sending a probe to Europa, Jupiter's moon that could support life. But while you can't physically ride along, you can at least send your name along with it.\r\nThis is thanks to NASA's new Mess… [+3156 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Donavyn Coffey", "title": "Could Earth be inside a black hole? - Livescience.com", "description": "And for that matter, could our universe be inside a black hole?", "url": "https://www.livescience.com/space/could-earth-be-inside-a-black-hole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mqVtu5vszMqBHwRw7SqWaG-1200-80.jpg", "publishedAt": "2023-06-18T09:00:00Z", "content": "To Earthlings gazing into space, our solar system appears to be surrounded by billions of stars in the Milky Way. But if we look even further out, would it be possible to find evidence that we were i… [+3563 chars]"}, {"source": {"id": null, "name": "Lake County News"}, "author": "Desiree Apodaca", "title": "Space News: Scientists shed light on the unusual origin of a familiar meteor shower - Lake County News", "description": "Each winter, the Geminid meteors light up the sky as they race past Earth, producing one of the most intense meteor showers in the night sky. Now, NASA’s Parker Solar Probe mission is providing new evidence that a violent, catastrophic event created the Gemin…", "url": "https://www.lakeconews.com/news/75961-space-news-scientists-shed-light-on-the-unusual-origin-of-a-familiar-meteor-shower", "urlToImage": "https://lakeconews.com/images/stories/2017/ads/OpenGraphImage5.png", "publishedAt": "2023-06-18T08:12:32Z", "content": "Each winter, the Geminid meteors light up the sky as they race past Earth, producing one of the most intense meteor showers in the night sky. Now, NASAs Parker Solar Probe mission is providing new ev… [+3100 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "ASU study: Jupiter's moon Europa may have had a slow evolution - Space Daily", "description": "Tempe AZ (SPX) Jun 18, 2023 - \r\nJupiter's moon, Europa, is slightly smaller than Earth's moon and is one of the most promising places to search for alien life. \r\n\r\nAmid the Jovian system, Europa is of particular interest to scie", "url": "https://www.spacedaily.com/reports/ASU_study_Jupiters_moon_Europa_may_have_had_a_slow_evolution_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/internal-evolution-europa-jupiter-kevin-trinh-asu-hg.jpg", "publishedAt": "2023-06-18T05:15:41Z", "content": "ADVERTISEMENT\r\nASU study: Jupiter's moon Europa may have had a slow evolutionby Staff WritersTempe AZ (SPX) Jun 18, 2023\r\nJupiter's moon, Europa, is slightly smaller than Earth's moon and is one of t… [+4658 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Experimental X-Plane, ISS Power Upgrade, Mars Postcard, Laser Communications System - SciTechDaily", "description": "Equipping the space station to produce more power … NASA’s newest experimental X-plane … And preparing to test a new laser communications system … A few of the stories to tell you about – This Week at NASA! https://youtu.be/DmSYhBLAR7g Equipping the Space Sta…", "url": "https://scitechdaily.com/this-week-nasa-experimental-x-plane-iss-power-upgrade-mars-postcard-laser-communications-system/", "urlToImage": "https://scitechdaily.com/images/NASA-Artemis-II-Laser-Communications-scaled.jpg", "publishedAt": "2023-06-17T23:06:00Z", "content": "ByNASAJune 17, 2023\r\nThe Orion Artemis II Optical Communications System (O2O), a laser communications system for NASAs Artemis II mission, has been delivered to NASAs Kennedy Space Center in Florida … [+4982 chars]"}, {"source": {"id": null, "name": "Talker.news"}, "author": "Talker News", "title": "Scientists searching center of Milky Way galaxy for advanced alien life - Niagara Gazette", "description": "The area is dense with stars and possible habitable exoplanets so they believe that is the best place to be looking.", "url": "https://talker.news/2023/06/12/scientists-searching-center-of-milky-way-galaxy-for-advanced-alien-life/", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/niagara-gazette.com/content/tncms/assets/v3/editorial/b/d3/bd32c907-92e2-53ec-a5ce-261bd193b815/64889d430e6b8.image.jpg?crop=1762%2C928%2C0%2C123&resize=1200%2C632&order=crop%2Cresize", "publishedAt": "2023-06-17T23:00:00Z", "content": "Astronomers are looking for alien life in the center of the Milky Way galaxy in a ground-breaking new project.\r\nResearchers at Cornell University and the Search for Extraterrestrial Intelligence (SET… [+2544 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "Can “terraforming” turn Mars or the moon into Earth 2.0? - Freethink", "description": "Terraforming — the hypothetical process of making another place “Earth-like” — offers the hope of turning Mars or the moon into Earth 2.0.", "url": "https://www.freethink.com/futurology/terraforming", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/06/terraforming-thumb.png?resize=1200,630", "publishedAt": "2023-06-17T22:00:00Z", "content": null}, {"source": {"id": null, "name": "ZME Science"}, "author": "Fermin Koop", "title": "Early Andean societies turned violent because of climate change - ZME Science", "description": "Study points to potential competition for limited resources", "url": "https://www.zmescience.com/ecology/early-andean-societies-turned-violent-because-of-climate-change/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/06/Andes_mountains_from_35000_feet_24495877342.jpg", "publishedAt": "2023-06-17T21:29:50Z", "content": "Imagine living thousands of years ago in the Andean region in South America, one of the most environmentally variable landscapes in the world. Suddenly, the temperature started to change and droughts… [+3604 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Trapping Light in 3D: Physicists Unlock the Longstanding Mystery of Trapped Waves - SciTechDaily", "description": "A team of researchers has harnessed a remarkable increase in computing capability to solve a decades-long mystery regarding the potential for optical waves to be trapped in three-dimensional structures of randomly packed micro- or nanoparticles. This groundbr…", "url": "https://scitechdaily.com/trapping-light-in-3d-physicists-unlock-the-longstanding-mystery-of-trapped-waves/", "urlToImage": "https://scitechdaily.com/images/Trapping-Optical-Waves.jpg", "publishedAt": "2023-06-17T20:36:29Z", "content": "ByYale UniversityJune 17, 2023\r\nAdvanced computing has helped researchers solve a decades-old mystery about light localization in 3D structures. The study found that light can be trapped or localized… [+5737 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Georgina Torbet", "title": "How To Virtually Explore The Landscapes Of Mars In 3D - SlashGear", "description": "The U.S. Geological Survey (USGS) has released a huge trove of digital renderings of the red planet.", "url": "https://www.slashgear.com/1316737/how-to-explore-mars-3d/", "urlToImage": "https://www.slashgear.com/img/gallery/how-to-virtually-explore-the-landscapes-of-mars-in-3d/l-intro-1687023976.jpg", "publishedAt": "2023-06-17T18:51:00Z", "content": "If you've ever wanted to skim the surface of Mars, now you can. The U.S. Geological Survey (USGS) has released a huge trove of digital renderings of the red planet, showing its topography in three di… [+1290 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Casting Light on Dark Mysteries: LHAASO's Analysis of Tera-Electronvolt Gamma-Ray Burst Afterglow - SciTechDaily", "description": "Researchers at the Large High Altitude Air Shower Observatory have detailed the complete light curve of high-energy photons from a gamma-ray burst (GRB) for the first time, challenging current theoretical models. Their observation of the exceptionally rare an…", "url": "https://scitechdaily.com/casting-light-on-dark-mysteries-lhaasos-analysis-of-tera-electronvolt-gamma-ray-burst-afterglow/", "urlToImage": "https://scitechdaily.com/images/Supernova-Art-Concept.jpg", "publishedAt": "2023-06-17T18:41:05Z", "content": "ByChinese Academy of SciencesJune 17, 2023\r\nScientists from the Large High Altitude Air Shower Observatory (LHAASO) have published a groundbreaking study on the gamma-ray burst (GRB) GRB 221009A, an … [+13576 chars]"}, {"source": {"id": null, "name": "Gearrice.com"}, "author": "Advay Hora", "title": "fungi are to blame - Gearrice", "description": "join the conversation", "url": "https://www.gearrice.com/update/fungi-are-to-blame/", "urlToImage": "https://www.mundodeportivo.com/urbantecno/hero/2023/06/imagen-de-archivo-de-un-campo-repleto-de-hongos.jpg", "publishedAt": "2023-06-17T18:23:17Z", "content": "Stock image of a field full of mushrooms.\r\nFor decades, human beings have been in a constant struggle to reverse the greenhouse effect and climate change. Although we have been the builders of a sick… [+2143 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "New Phase of Matter Revealed in Physics Breakthrough By Scientists Who Engineered a “Frustration Machine” - The Debrief", "description": "A new phase of matter has been discovered by a team of physicists who succeeded in engineering what they call a “frustration machine.”", "url": "https://thedebrief.org/new-phase-of-matter-revealed-in-physics-breakthrough-by-scientists-who-engineered-a-frustration-machine/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2023/06/new-phase-of-matter.jpg", "publishedAt": "2023-06-17T18:20:12Z", "content": "The discovery of a new phase of matter has been announced by a team of physicists, who made the breakthrough following the creation of a novel device they characterize as a frustration machine.\r\nIn o… [+4736 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mashable", "title": "Scientists discover a planet straight out of Star Wars - AOL", "description": "Any Star Wars fan has an image burned into their minds of a young windswept Mark Hamill wearing a gi, gazing longingly at two sunsets. Back in the 1970s when...", "url": "https://mashable.com/article/star-wars-exoplanet-with-two-stars", "urlToImage": "https://media.zenfs.com/en/aol_mashable_370/969b3722e64a5273d1c4618751c6b635", "publishedAt": "2023-06-17T15:40:50Z", "content": "An exoplanet orbiting binary stars\r\nAny Star Wars fan has an image burned into their minds of a young windswept Mark Hamill wearing a gi, gazing longingly at two sunsets.\r\nBack in the 1970s when the … [+4087 chars]"}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "Sanjeev Nayak", "title": "Scientists Develop New Radio System, Crucial During Natural Disasters - Oneindia", "description": "A new model for radio wave propagation through the ionosphere, developed by scientists of Indian Institute of Geomagnetism (IIG), can help estimate the impact of space weather and facilitate the planning and operation of high-frequency (HF) radio communicatio…", "url": "https://www.oneindia.com/india/scientists-develop-new-radio-system-crucial-during-natural-disasters-3573754.html", "urlToImage": "https://www.oneindia.com/img/1200x60x675/2023/06/iig-1687004205.jpg", "publishedAt": "2023-06-17T12:19:33Z", "content": "A new model for radio wave propagation through the ionosphere, developed by scientists of Indian Institute of Geomagnetism (IIG), can help estimate the impact of space weather and facilitate the plan… [+2584 chars]"}]}