{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "Wordlift.io"}, "author": "Snehil Manohar Singh", "title": "NASA's EMIT Mission to Map Dust - Geospatial World", "description": "At most, dust is seen as a nuisance for most people. However, its impact on the ecology of planet Earth has not yet been scientifically examined barring a few studies.", "url": "http://data.wordlift.io/wl01287/post/up42-announces-copernicus-masters-challenge-for-sustainable-urban-planning-236037", "urlToImage": "https://www.geospatialworld.net/wp-content/uploads/2022/06/1-emit_africa_dust.jpeg", "publishedAt": "2022-06-02T13:57:31Z", "content": "EMIT is a state-of-the-art imaging spectrometer that will be aboard the International Space Station (ISS) to map the worlds mineral-dust sources, gather information about particle color and compositi… [+841 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Black Holes Aided Quenching Star Formation in the Early Universe - AZoQuantum", "description": "While some galaxies continue to create stars, others die out and live a more passive existence. What caused these galaxies to stop creating stars at such a young age is unknown, not the least since they are so far away and dim that they go unnoticed.", "url": "https://www.azoquantum.com/News.aspx?newsID=9036", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_9036_16541641177156500.png", "publishedAt": "2022-06-02T12:29:00Z", "content": "While some galaxies continue to create stars, others die out and live a more passive existence. What caused these galaxies to stop creating stars at such a young age is unknown, not the least since t… [+4010 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Explainers", "title": "Why so blue?: Differences between Neptune and Uranus' colours decoded - Firstpost", "description": "Research suggests a layer of concentrated haze that exists on both planets is thicker on Uranus than a similar layer on Neptune. The layer ‘whitens’ Uranus' appearance more than Neptune’s. If there were no haze in the atmospheres of Neptune and Uranus, both w…", "url": "https://www.firstpost.com/world/explained-why-so-blue-differences-between-neptune-and-uranus-colours-decoded-10749621.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/06/NASA.jpg", "publishedAt": "2022-06-02T11:36:14Z", "content": "Research suggests a layer of concentrated haze that exists on both planets is thicker on Uranus than a similar layer on Neptune. The layer whitens Uranus' appearance more than Neptunes. If there were… [+3092 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Fish used a peculiarity in their genetics to evolve electric organs - News9 LIVE", "description": "The study investigated how weakly electric and strongly electric fish evolved", "url": "https://www.news9live.com/science/fish-used-a-peculiarity-in-their-genetics-to-evolve-electric-organs-173999", "urlToImage": "https://media.news9live.com/h-upload/2022/06/02/413096-image2022-06-02154936075.jpg", "publishedAt": "2022-06-02T11:11:04Z", "content": "A new study investigates how small changes in the genes allowed fish to evolve electric organs. All fish have duplicate versions of the same genes that produce tiny muscle motors made up of proteins,… [+3754 chars]"}, {"source": {"id": null, "name": "Science News for Students"}, "author": null, "title": "A new clock shows how gravity warps time — even over tiny distances - Science News for Students", "description": "This clock measured how gravity changes the passage of time in different places — even spots just one millimeter apart.", "url": "https://www.sciencenewsforstudents.org/article/a-new-clock-shows-how-gravity-warps-time-even-over-tiny-distances", "urlToImage": "https://www.sciencenewsforstudents.org/wp-content/uploads/2022/05/AtomicClock_NIST-1-scaled.jpg", "publishedAt": "2022-06-02T10:30:00Z", "content": "array: A broad and organized group of objects. Sometimes they are instruments placed in a systematic fashion to collect information in a coordinated way. Other times, an array can refer to things tha… [+7173 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Mission CAPSTONE: NASA's quest to examine the Moon's orbit delayed till June 13 - Republic World", "description": "The CAPSTONE mission, developed by NASA and its partners, will be launched to the Moon no earlier than June 13, informed launch provider Rocket Lab.", "url": "https://www.republicworld.com/science/space/mission-capstone-nasas-quest-to-examine-the-moons-orbit-delayed-till-june-13-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ti7pfbu9xkxvro2o_1654164561.jpeg", "publishedAt": "2022-06-02T10:24:00Z", "content": "NASA's CAPSTONE mission, which would examine a never-studied-before orbit of the Moon, has suffered its first delay. In the latest update, Rocket Lab, which is providing the launch vehicle for CAPSTO… [+2426 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Liquid-liquid phase separation reduces radiative absorption by aged black carbon aerosols | Communications Earth & Environment - Nature.com", "description": "Redistribution of black carbon from the inorganic core to the organic coating of aged aerosols due to liquid-liquid phase separation can reduce radiative absorption by up to 34%, according to field observations and laboratory experiments.", "url": "https://www.nature.com/articles/s43247-022-00462-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs43247-022-00462-1/MediaObjects/43247_2022_462_Fig1_HTML.png", "publishedAt": "2022-06-02T09:58:41Z", "content": "<li>Bond, T. C. et al. Bounding the role of black carbon in the climate system: A scientific assessment. J. Geophys. Res. Atmos.118, 53805552 (2013).\r\nCAS \r\n Article \r\nGoogle Scholar \r\n</li><li>Seinf… [+10960 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Dynamic Soaring Isn't Just for Albatrosses: Research - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A new study shows that aerial acrobatics are not limited to albatrosses when it comes to dynamic soaring on the open ocean. The study discovered that elegant seabirds known as Manx shearwaters execute th…", "url": "https://www.latestly.com/agency-news/science-news-dynamic-soaring-isnt-just-for-albatrosses-research-3778293.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/06/flight0206202220220602094726_120220602095055-588x441.jpg", "publishedAt": "2022-06-02T09:58:25Z", "content": "England, [UK] June 2 (ANI): A new study shows that aerial acrobatics are not limited to albatrosses when it comes to dynamic soaring on the open ocean. The study discovered that elegant seabirds know… [+3564 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Perseverance rover will one day save astronauts from storms on Mars; NASA explains how - Republic World", "description": "Perseverance rover’s contribution will now see new heights as it will help future robotic and human explorers survive the wrath of winds on Mars. Know how.", "url": "https://www.republicworld.com/science/space/perseverance-rover-will-one-day-save-astronauts-from-storms-on-mars-nasa-explains-how-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/rnkxyjz2mc0zbwyr_1654162039.jpeg", "publishedAt": "2022-06-02T09:34:00Z", "content": "Having spent 456 sols or Mars days (469 Earth days) on the Red Planet, the Perseverance rover has already contributed to numerous studies that have expanded the human understanding of the barren worl… [+2171 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Watch planetary breakup, a large star cluster and more celestial events in June 2022 - Devdiscourse", "description": "Read more about Watch planetary breakup, a large star cluster and more celestial events in June 2022 on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2058695-watch-planetary-breakup-a-large-star-cluster-and-more-celestial-events-in-june-2022", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_06_2020_18_08_17_5963519.jpg?width=920&format=jpeg", "publishedAt": "2022-06-02T08:30:41Z", "content": "NASA has shared skywatching highlights for the month of June, which includes a planetary breakup, and a well-known star cluster, among others.\r\nFor the past few months, skywatchers have been enjoying… [+1651 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA grows plants on Moon soil! Know what it means and what experts say - HT Tech", "description": "Scientists have successfully cracked the difficult code! We can grow plants on the Moon's soil! But what does it do for Moon missions? Know what NASA said.", "url": "https://tech.hindustantimes.com/tech/news/nasa-grows-plants-on-moon-soil-know-what-it-means-and-what-experts-say-71654154807231.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/02/1600x900/NASA_grows_plant_1654154891554_1654154902512.jpg", "publishedAt": "2022-06-02T07:28:50Z", "content": "Plants can grow in Lunar soil! That NASA-funded study surely has made a breakthrough discovery. A first step towards the hope that one day growing plants for food and oxygen on the moon or during spa… [+2184 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Planet killer asteroids threatening to strike the Earth? THOR is here to rescue humanity - HT Tech", "description": "Gigantic asteroids that can strike and destroy Earth in seconds are all around us. But this new cloud-based Astrodynamics platform called THOR could be our savior. Check this new defense strategy that can save humanity from extinction.", "url": "https://tech.hindustantimes.com/tech/news/planet-killer-asteroids-threatening-to-strike-the-earth-thor-is-here-to-rescue-humanity-71654154197181.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/02/1600x900/asteroid-g5603adab3_1920_1647078503425_1654154244225.jpg", "publishedAt": "2022-06-02T07:20:19Z", "content": "The threat of asteroids can never be taken lightly. We all know how a mere ten kilometer wide asteroid once destroyed the entire dinosaur species and put the planet under an ice age 66 million years … [+2559 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Rosario Tejeda", "title": "A new physics theory suggests that black holes are key to the universe's expansion and contraction cycles - Balkan Travellers", "description": "The universe is expanding. No one with any experience in astronomy or physics disagrees with this fact.Likewise, no one really disagrees that at some", "url": "https://www.balkantravellers.com/a-new-physics-theory-suggests-that-black-holes-are-key-to-the-universes-expansion-and-contraction-cycles/", "urlToImage": null, "publishedAt": "2022-06-02T07:14:15Z", "content": "The universe is expanding. No one with any experience in astronomy or physics disagrees with this fact.\r\nLikewise, no one really disagrees that at some point billions of years into the future, the un… [+8357 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Save the date! First picture taken by James Webb Telescope comes out on...... - India Today", "description": "The James Webb Telescope is all set to conduct its first scientific observation as it looks into the past, as back as the birth of the universe.", "url": "https://www.indiatoday.in/science/story/save-the-date-first-picture-taken-by-james-webb-telescope-comes-out-on-1957330-2022-06-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/jwst_34-647x363.jpeg?lkV7exKaEX5eBpQJtr_309BfXGKSssIw", "publishedAt": "2022-06-02T05:12:33Z", "content": "Nearly six months after it was launched on a cloudy day from French Guiana, the James Webb Telescope is all set to send back its first full colour image from 15,00,000 kilometers away. The flying obs… [+2805 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "COVID: three drugs could reduce mortality - OI Canadian", "description": "MONTREAL — By studying the differences between patients hospitalized in intensive care who have died of COVID-19 or who have recovered, researchers in Montreal have succeeded in identifying three cand", "url": "https://oicanadian.com/covid-three-drugs-could-reduce-mortality/", "urlToImage": "https://www.lechodelatuque.com/wp-content/uploads/sites/26/2022/06/2022060114060-6297a933e2c6bdebe1b718acjpeg.jpg", "publishedAt": "2022-06-02T04:49:59Z", "content": "MONTREAL By studying the differences between patients hospitalized in intensive care who have died of COVID-19 or who have recovered, researchers in Montreal have succeeded in identifying three candi… [+1309 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Race Against Time: Quick Engineering Saves NASA’s MAVEN Spacecraft - SciTechDaily", "description": "NASA’s MAVEN Spacecraft Resumes Science & Operations, Exits Safe Mode After three months in safe mode, NASA’s MAVEN spacecraft has finally returned to normal science and relay operations. The problem started back on February 22, 2022, when contact with the sp…", "url": "https://scitechdaily.com/a-race-against-time-quick-engineering-saves-nasas-maven-spacecraft/", "urlToImage": "https://scitechdaily.com/images/MAVEN-Mission-Identifies-Links-to-Atmospheric-Loss.jpg", "publishedAt": "2022-06-02T03:17:48Z", "content": "ByWillow Reed, University of Colorado BoulderJune 1, 2022\r\nNASAs Mars Atmosphere and Volatile Evolution (MAVEN) spacecraft is the first Mars orbiter specifically designed to study the planets upper a… [+8600 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA to secure additional crewed flights to ISS from SpaceX - Devdiscourse", "description": "Read more about NASA to secure additional crewed flights to ISS from SpaceX on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2058471-nasa-to-secure-additional-crewed-flights-to-iss-from-spacex", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/26_03_2022_13_17_33_690102.jpg?width=920&format=jpeg", "publishedAt": "2022-06-02T03:04:01Z", "content": "As part of the Commercial Crew Transportation Capabilities (CCtCap) contract, NASA intends to issue a sole source modification to California-based SpaceX to acquire five additional crewed flights to … [+1586 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "What the Voyager space probes can teach humanity - EastMojo", "description": "Voyager 1 is the farthest human-made object from Earth. After sweeping by Jupiter, Saturn, Uranus and Neptune, it is now almost 15 billion miles (24", "url": "http://www.eastmojo.com/world/2022/06/02/what-the-voyager-space-probes-can-teach-humanity/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/05/Untitled-design-76.jpg?fit=1920%2C1080&ssl=1", "publishedAt": "2022-06-02T01:00:00Z", "content": "Voyager 1 is the farthest human-made object from Earth. After sweeping by Jupiter, Saturn, Uranus and Neptune, it is now almost 15 billion miles (24 billion kilometers) from Earth in interstellar spa… [+6471 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "A future without clouds? How climate change will affect clouds? - WION", "description": "Clouds are a crucial part of the atmosphere, they can affect climate. First, they are an essential part of the water cycle", "url": "https://www.wionews.com/science/a-future-without-clouds-how-climate-change-will-affect-clouds-484282", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/02/267182-clouds.jpg", "publishedAt": "2022-06-02T00:26:16Z", "content": "Numerous studies and research have revealed various impacts of climate change on humans and animals. But how will the warming temperatures impact clouds? Michael Pritchard, who is a professor of Eart… [+1648 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "VoxLens: Adding one line of code can make some interactive visualizations accessible to screen-reader users - EurekAlert", "description": "University of Washington researchers worked with screen-reader users to design VoxLens, a plugin that allows people to interact with digital visualizations made with JavaScript.", "url": "https://www.eurekalert.org/news-releases/954588", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/9209bcee-7bea-4ffc-9791-0737adc96094/Rendition/thumbnail/Content/Public", "publishedAt": "2022-06-01T23:00:43Z", "content": "image: University of Washington researchers worked with screen-reader users to design VoxLens, a JavaScript plugin that with one additional line of code allows people to interact with visualizations.… [+6382 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Time-reversal asymmetry surpasses conversion efficiency limit for solar cells - Phys.org", "description": "Solar energy is a popular candidate for a sustainable alternative to fossil fuels. A solar cell, or photovoltaic (PV) cell, converts sunlight directly into electricity. However, the conversion efficiency has not been enough to enable widespread applications o…", "url": "https://phys.org/news/2022-06-time-reversal-asymmetry-surpasses-conversion-efficiency.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/time-reversal-asymmetr.jpg", "publishedAt": "2022-06-01T19:49:58Z", "content": "Solar energy is a popular candidate for a sustainable alternative to fossil fuels. A solar cell, or photovoltaic (PV) cell, converts sunlight directly into electricity. However, the conversion effici… [+4884 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's new spacesuits for Moon and microgravity - How they differ? - VideoFromSpace", "description": "Axiom Space and Collins Aerospace have been chosen by NASA to create next-generation spacesuits for use in orbit and on the Moon. Credit: NASA", "url": "https://www.youtube.com/watch?v=62qsig36_u0", "urlToImage": "https://i.ytimg.com/vi/62qsig36_u0/hqdefault.jpg", "publishedAt": "2022-06-01T19:42:53Z", "content": null}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Scientists Successfully Blast Ultra-Cold Gas Bubbles on the Space Station During Test to Reveal New Quantum Physics - Galaxy Reporters", "description": "At NASA’s Cold Atom Lab at the ISS, scientists have successfully blasted small, spherical gas bubbles chilled to just a millionth of a degree above absolute zero. The worst temperature theoretically possible is a few degrees colder than that space. The inspec…", "url": "https://galaxyreporters.com/scientists-successfully-blast-ultra-cold-gas-bubbles-on-the-space-station-during-test-to-reveal-new-quantum-physics/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/03/shutterstock_551379514-scaled.jpg", "publishedAt": "2022-06-01T18:36:00Z", "content": "At NASA’s Cold Atom Lab at the ISS, scientists have successfully blasted small, spherical gas bubbles chilled to just a millionth of a degree above absolute zero. The worst temperature theoretically … [+1291 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Combines or Dinosaurs: Which is Historically Worse For Soil? - Galaxy Reporters", "description": "“The similarity in mass and contact area between modern farm vehicles and sauropods raises the question: What was the mechanical impact of these prehistoric animals on land productivity?” The article by Thomas Keller and Dani puts forward what may be a signif…", "url": "https://galaxyreporters.com/combines-or-dinosaurs-which-is-historically-worse-for-soil/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_1135590158-scaled.jpg", "publishedAt": "2022-06-01T18:35:14Z", "content": "“The similarity in mass and contact area between modern farm vehicles and sauropods raises the question: What was the mechanical impact of these prehistoric animals on land productivity?” The article… [+1242 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "A Mysterious Supernatural Entity Known As The 'Dipole Repeller' Is Nudging the Milky Way - Galaxy Reporters", "description": "Some supernatural entities, beyond the barriers of our galaxy, are nudging against us with tremendous force. We don’t know precisely what it is, and we don’t know how long it’s been there. However, we do know it’s known as the dipole repeller. The phrase may …", "url": "https://galaxyreporters.com/a-mysterious-supernatural-entity-known-as-the-dipole-repeller-is-nudging-the-milky-way/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_1919833964-scaled.jpg", "publishedAt": "2022-06-01T18:32:19Z", "content": "Some supernatural entities, beyond the barriers of our galaxy, are nudging against us with tremendous force. We don’t know precisely what it is, and we don’t know how long it’s been there. However, w… [+1429 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "Video captures NASA Ingenuity Mars helicopter’s record-breaking flight - BGR", "description": "The Ingenuity Mars helicopter has broken yet another flight record, staying in the air for almost three minutes during its 25th flight.", "url": "https://bgr.com/science/video-captures-nasa-ingenuity-mars-helicopters-record-breaking-flight/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/08/Untitled-2-copy-1.jpg?quality=82&strip=all", "publishedAt": "2022-06-01T18:21:00Z", "content": "NASA’s Ingenuity Mars helicopter has had a record-breaking trek across the Martian surface. The tiny exploration drone took its first flight on April 19, 2021. Since then, it has made a number of fli… [+2632 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Ancient Plants Provide Clues About Life on Earth in a Warmer Climate - AZoCleantech", "description": "Paleobotanist David Greenwood has gathered fossil plants from Australia for many years. In this, some are so well preserved and it is difficult to believe they are millions of years old.", "url": "https://www.azocleantech.com/news.aspx?newsID=31792", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31792_16540886135059164.jpg", "publishedAt": "2022-06-01T17:25:00Z", "content": "Jun 1 2022Reviewed by Alex Smith\r\nPaleobotanist David Greenwood has been gathering fossil plants from Australia for many years, and some of these are so well preserved that it is difficult to believe… [+6089 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Antichiral Gyromagnetic Photonic Crystal Used to Split Configurable Topological Beam - AZoOptics", "description": "A recent publication from Opto-Electronic Science illustrates customizable topological beam splitting through antichiral gyromagnetic photonic crystal.", "url": "https://www.azooptics.com/News.aspx?newsID=27642", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_27642_16540781863986696.png", "publishedAt": "2022-06-01T17:13:00Z", "content": "A recent publication from Opto-Electronic Science illustrates customizable topological beam splitting through antichiral gyromagnetic photonic crystal.\r\nConstruction of antichiral gyromagnetic photon… [+2942 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Topography of mountain belts controlled by rheology and surface processes - Nature.com", "description": "Using the new Beaumont number presented, it is concluded that the topographic evolution of collisional mountain belts is determined by the combination of plate velocity, crustal rheology and surface process efficiency.", "url": "https://www.nature.com/articles/s41586-022-04700-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-04700-6/MediaObjects/41586_2022_4700_Fig1_HTML.png", "publishedAt": "2022-06-01T16:00:32Z", "content": "<li>Beaumont, C., Fullsack, P. &amp; Hamilton, J. in Thrust Tectonics (ed. McClay, K. R.) 118 (Springer, 1992).\r\n</li><li>Willett, S. D. Orogeny and orography: the effects of erosion on the structure… [+12979 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Forecasting ocean microbiome shifts - Nature.com", "description": "Modelling using metagenomic data has revealed partitioning of the ocean into discrete microbial genomic provinces, but climate change might restructure their global organization.", "url": "https://www.nature.com/articles/s41564-022-01140-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41564-022-01140-w/MediaObjects/41564_2022_1140_Fig1_HTML.png", "publishedAt": "2022-06-01T15:59:27Z", "content": "<li>Falkowski, P. Nature483, S17S20 (2012).\r\nCAS \r\n Article \r\nGoogle Scholar \r\n</li><li>Moran, M. A. et al. Nat. Microbiol.7, 508523 (2022).\r\nCAS \r\n Article \r\nGoogle Scholar \r\n</li><li>Frémont, P. et… [+1195 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Manchester: Strange neutron star spinning every 76 seconds discovered in stellar graveyard - India Education Diary", "description": "An international team of scientists have discovered a strange radio emitting neutron star, which rotates extremely slowly, completing one rotation every 76 seconds.The team, led by members of the ERC-funded MeerTRAP (More Transients and Pulsars) grou", "url": "https://indiaeducationdiary.in/university-of-manchester-strange-neutron-star-spinning-every-76-seconds-discovered-in-stellar-graveyard/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/01/﻿The-University-of-Manchester.jpg", "publishedAt": "2022-06-01T15:00:00Z", "content": "An international team of scientists have discovered a strange radio emitting neutron star, which rotates extremely slowly, completing one rotation every 76 seconds.\r\nThe team, led by members of the E… [+4592 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientist Proposes Using Entire Planet as Spaceship to Different Star System - Futurism", "description": "Advanced civilizations could have entire planets act as one massive starship to migrate to other systems, leaving their old and collapsing host star behind.", "url": "https://futurism.com/scientist-entire-planet-spaceship-star-system", "urlToImage": "https://wp-assets.futurism.com/2022/06/scientist-entire-planet-spaceship-star-system.jpg", "publishedAt": "2022-06-01T14:52:15Z", "content": "Even at the speed of light, it would take over four years to get to the nearest star system.\r\nNeedless to say, escaping a solar system is much easier said than done. But according to a new paper publ… [+3039 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "NewsMo", "title": "Scientists Reveal How to Get Rid of Rats and Mice With Bananas - India Today", "description": "Have you noticed a mouse lurking in your house? It’s so tempting to catch them, but these are evasive creatures. Scientists recently made a strange discovery — the smell of bananas terrified male mice. Yes, you heard that right. Watch to know why bananas terr…", "url": "https://www.indiatoday.in/newsmo/video/scientists-reveal-how-to-get-rid-of-rats-and-mice-with-bananas-1957163-2022-06-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202206/YT___FB_HORIZONTAL_copy__18_-647x363.png?9xiV2R.uM2u6_LWdDENt7oHV1eE9Kx3v", "publishedAt": "2022-06-01T14:15:30Z", "content": "Have you noticed a mouse lurking in your house? Its so tempting to catch them, but these are evasive creatures. Scientists recently made a strange discovery the smell of bananas terrified male mice. … [+65 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tom Metcalfe", "title": "New, extremely reactive chemical discovered in the atmosphere - Livescience.com", "description": "Millions of tons of the chemical type can form in the atmosphere each year.", "url": "https://www.livescience.com/reactive-chemical-hydrotrioxides-atmospher", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WbFJAui4m44LpdP7w9zHZb-1200-80.jpg", "publishedAt": "2022-06-01T13:46:26Z", "content": "Millions of tons of a class of extremely reactive chemicals called hydrotrioxides can linger in the atmosphere for several hours, a new study suggests  — which could have implications for human healt… [+5611 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA's Parker Solar Probe heads to 'touch the sun' again during next flyby on June 2 - Republic World", "description": "NASA's Parker Solar Probe is heading for its next flyby which will occur on June 2 at 4:20 am (IST), according to Johns Hopkins University.", "url": "https://www.republicworld.com/science/space/nasas-parker-solar-probe-heads-to-touch-the-sun-again-during-next-flyby-on-june-2-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/php9scyupqedfd43_1654089581.jpeg", "publishedAt": "2022-06-01T13:33:00Z", "content": "The Parker Solar Probe, which became the first man-made object to make the closest approach to the sun in December, is heading for its next flyby. According to the Johns Hopkins University Applied Ph… [+1734 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tatyana Woodall", "title": "Astronomers identify 116,000 new variable stars - Phys.org", "description": "Ohio State University astronomers have identified about 116,000 new variable stars, according to a new paper.", "url": "https://phys.org/news/2022-06-astronomers-variable-stars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/astronomers-identify-1.jpg", "publishedAt": "2022-06-01T13:11:23Z", "content": "Ohio State University astronomers have identified about 116,000 new variable stars, according to a new paper.\r\nThese heavenly bodies were found by The All-Sky Automated Survey for Supernovae (ASAS-SN… [+4100 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Giant Galaxy With 'Cosmic Shells' Captured By Hubble: What Created These Shells? - Indiatimes.com", "description": "The iconic Hubble telescope has now captured a giant elliptical galaxy with shells, about 2.5 times bigger than our own galaxy, the Milky Way. Situated 100 million light-years away from Earth, the gigantic elliptical galaxy \"NGC 474\" is situated 100 million l…", "url": "https://www.indiatimes.com/technology/science-and-future/giant-galaxy-with-cosmic-shells-captured-by-hubble-what-created-these-shells-571095.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/8_62975531796d3.jpg", "publishedAt": "2022-06-01T12:00:44Z", "content": "The iconic Hubble telescope has now captured a giant elliptical galaxy with shells, about 2.5 times bigger than our own galaxy, the Milky Way. Situated 100 million light-years away from Earth, the gi… [+1913 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "A mysterious radio signal was discovered 60 million lightyears from Earth - Interesting Engineering", "description": "And supernova remnants and pulsars were ruled out as possibilities.", "url": "https://interestingengineering.com/radio-signal-60-million-lightyears-from-earth", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/PrO3K5e8Oq/sizes/askap_md.jpeg", "publishedAt": "2022-06-01T11:29:01Z", "content": "File this one under \"likely not aliens, but you never know.\"\r\nA team of Australian astronomers discovered a mysterious radio signal of unknown origin, saying it requires further investigation to dete… [+2339 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "📰 The Sun is turning round again - OI Canadian", "description": "Nothing was going anymore in the Sun! In the early 2000s, the abundances of the chemical elements on its surface were revised downwards, preventing astrophysicists from reconciling the values ​​predic", "url": "https://oicanadian.com/%f0%9f%93%b0-the-sun-is-turning-round-again/", "urlToImage": "https://www.techno-science.net/illustration/Source/Universite-de-Geneve/2022/soleil-fig1-UNIGE.png", "publishedAt": "2022-06-01T11:21:30Z", "content": "Nothing was going anymore in the Sun! In the early 2000s, the abundances of the chemical elements on its surface were revised downwards, preventing astrophysicists from reconciling the values predict… [+8527 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Stevens Institute of Technology: Malinovskaya Receives ONR Award of $376,029 for Quantum-Enabled Approach to Detect Vibrational Frequencies - India Education Diary", "description": "Svetlana Malinovskaya, principal investigator and professor in the Department of Physics at Stevens Institute of Technology, recently received an Office of Naval Research award of $376,029 for her project \"Broad Frequency Range Chemical and Biochemic", "url": "https://indiaeducationdiary.in/stevens-institute-of-technology-malinovskaya-receives-onr-award-of-376029-for-quantum-enabled-approach-to-detect-vibrational-frequencies/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/Stevens-Institute-of-Technology.jpg", "publishedAt": "2022-06-01T11:08:42Z", "content": "Svetlana Malinovskaya, principal investigator and professor in the Department of Physics at Stevens Institute of Technology, recently received an Office of Naval Research award of $376,029 for her pr… [+1121 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA starts development of its Plato mission to hunt exoplanets around sun-like stars - Republic World", "description": "ESA revealed that its Plato mission has entered the development stage and recently underwent testing at Europe’s largest thermal vacuum chamber.", "url": "https://www.republicworld.com/science/space/esa-starts-development-of-its-plato-mission-to-hunt-exoplanets-around-sun-like-stars-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ogvp482g5sdf6ljt_1654081090.jpeg", "publishedAt": "2022-06-01T11:08:00Z", "content": "The European Space Agency (ESA) on Wednesday, June 1, revealed that its Plato mission has entered the development stage and recently underwent testing at Europes largest thermal vacuum chamber. Accor… [+2383 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Lancaster University: Physicists develop new type of camera to image quantum vortices for the first time - India Education Diary", "description": "Lancaster researchers have developed a camera-like device able to image mini whirlpools in quantum liquids for the first time ever.Vortices form in stirred fluids, when water drains into a plughole and can also be seen in tornadoes and cyclones.These", "url": "https://indiaeducationdiary.in/lancaster-university-physicists-develop-new-type-of-camera-to-image-quantum-vortices-for-the-first-time/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/Lancaster-University-1024x576.jpg", "publishedAt": "2022-06-01T10:50:48Z", "content": "Lancaster researchers have developed a camera-like device able to image mini whirlpools in quantum liquids for the first time ever.\r\nVortices form in stirred fluids, when water drains into a plughole… [+1936 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "New laser mode sensor to probe the interiors of neutron stars - Tech Explorist", "description": "New laser breakthrough to help to understand gravitational waves.", "url": "https://www.techexplorist.com/new-laser-mode-sensor-probe-interiors-neutron-stars/47751/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/schematic-of-the-apparatus.jpg", "publishedAt": "2022-06-01T10:22:50Z", "content": "LIGO, Virgo, and KAGRA gravitational-wave detectors store vast amounts of optical power, and multiple pairs of mirrors are employed to maximize the quantity of laser light stored along the detector’s… [+1932 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Lunar Research Station: Russia, China Almost Ready To Ink Pact On ‘Moon Base’ That Will Rival Artemis Accords – Rogozin - EurAsian Times", "description": "Russian space chief Dmitry Rogozin recently said that Moscow and Beijing were very close to signing the agreement on creating the joint Lunar Station. Chinese Taikonaut ‘Apes’ ISS Astronaut At Space Station; Makes Strikingly Similar Video On Life In Space — W…", "url": "https://eurasiantimes.com/russia-china-almost-ready-to-ink-pact-on-moon-base/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2021/02/IRLS-e1613840302657.jpg", "publishedAt": "2022-06-01T10:20:25Z", "content": "Russian space chief Dmitry Rogozin recently said that Moscow and Beijing were very close to signing the agreement on creating the joint Lunar Station.\r\n“We are now almost ready to sign an intergovern… [+6657 chars]"}, {"source": {"id": null, "name": "Hardwoodparoxysm.com"}, "author": "Shannon Bailey", "title": "The future that awaits us between science and science fiction - Hardwood Paroxysm", "description": "In Padova, June 3-5, the appointment returns with Science.120 meet-and-greets and many international guests “With a world changing faster and faster, much", "url": "https://hardwoodparoxysm.com/the-future-that-awaits-us-between-science-and-science-fiction/", "urlToImage": "https://www.metropolitano.it/wp-content/uploads/2022/06/web-Piero-Angela-e-i-volontari-del-Cicap-Fest.jpg", "publishedAt": "2022-06-01T10:18:13Z", "content": "With a world changing faster and faster, much of our knowledge may become very outdated very soon, therefore, we ask ourselves How can science With his ability to interpret reality, Help us keep pace… [+5999 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "The gym ball at the office: advantages VS disadvantages - OI Canadian", "description": "We know: sitting on a chair in front of a computer accentuates lower back pain. That's why more and more people are choosing to work out on a gym ball at home as well as in the office. Nevertheless, t", "url": "https://oicanadian.com/the-gym-ball-at-the-office-advantages-vs-disadvantages/", "urlToImage": "https://wp-medias-solutions.lesechos.fr/2022/01/87cf352e-gettyimages-672150373-scaled.jpg", "publishedAt": "2022-06-01T10:14:28Z", "content": "We know: sitting on a chair in front of a computer accentuates lower back pain. That’s why more and more people are choosing to work out on a gym ball at home as well as in the office. Nevertheless, … [+2530 chars]"}, {"source": {"id": null, "name": "Newsnetnebraska.org"}, "author": "Karen Hines", "title": "The conjunction of Mars and Jupiter, when and how to see them - Chronicle - News Net Nebraska", "description": "Bologna, May 31, 2022 – the beautiful picture of the conjunctions of the planets Mars...", "url": "https://www.newsnetnebraska.org/the-conjunction-of-mars-and-jupiter-when-and-how-to-see-them-chronicle/", "urlToImage": null, "publishedAt": "2022-06-01T07:08:55Z", "content": "Bologna, May 31, 2022 – the beautiful picture of the conjunctions of the planets Mars And the Jupiter. These days from early June, in the morning from about 3 until dawn SunSo at dawn, our sky to the… [+1924 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Dazzling tau Herculid meteor shower lights up sky. Check out these amazing photos - WION", "description": "A brand new shooting star lit up the sky in a dazzling display overnight Monday and Tuesday, even if it wasn't a \"meteor storm\" as some stargazers hoped for. \r\n\r\nThe tau Herculids meteor shower peaked at the midnight with 10 to 25 meteors an hour spotted fall…", "url": "https://www.wionews.com/photos/dazzling-tau-herculid-meteor-shower-lights-up-sky-check-out-the-amazing-photos-484033", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/photo_page/public/2022/06/01/266916-metoer-6.jpg", "publishedAt": "2022-06-01T07:05:08Z", "content": "A brand new shooting star lit up the sky in a dazzling display overnight Monday and Tuesday, even if it wasn't a \"meteor storm\" as some stargazers hoped for. \r\nThe tau Herculids meteor shower peaked … [+351 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Are we ready for an asteroid attack? Astronomers conduct global exercise to test key ability - India Today", "description": "It was an asteroid that wiped out dinosaurs from Earth. Scientists from across the world are working together to ensure that does not happen again.", "url": "https://www.indiatoday.in/science/story/asteroid-impact-apophis-nasa-near-earth-object-tracking-earth-hit-1956899-2022-06-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/asteroid_7-647x363.jpeg?NzB5TxxAP4bm7R9vLlTGbr8mXxl9dPL7", "publishedAt": "2022-06-01T06:33:05Z", "content": "Asteroids, rocky remnants left over from the early formation of our solar system, have long been held as a deadly force capable of wiping out planets in their wakes, and they have done it before. Rem… [+3937 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Humans could land on an asteroid between 2071 and 2087: Research - The Indian Express", "description": "The researchers propose that a spacefaring nation or a group of spacefaring nations will send a mission to the asteroid belt beyond Mars between 2071 and 2087.", "url": "https://indianexpress.com/article/technology/science/humans-could-land-on-an-asteroid-within-your-lifetime-7946738/", "urlToImage": "https://images.indianexpress.com/2022/06/Humans-land-onAsteroid-mission-within-lifetime.jpg", "publishedAt": "2022-06-01T05:11:10Z", "content": "It is possible that you may witness human astronauts landing on the moon within your lifetime, according to a recently authored research article. The researchers analysed how NASAs budget has changed… [+2005 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "New light-powered catalysts could aid in manufacturing - Chemie.de", "description": "Chemical reactions that are driven by light offer a powerful tool for chemists who are designing new ways to manufacture pharmaceuticals and other useful compounds. Harnessing this light energy re ...", "url": "https://www.chemeurope.com/en/news/1176330/new-light-powered-catalysts-could-aid-in-manufacturing.html", "urlToImage": "https://rs1.chemie.de/images//172154-75.jpg", "publishedAt": "2022-06-01T05:03:37Z", "content": "Chemical reactions that are driven by light offer a powerful tool for chemists who are designing new ways to manufacture pharmaceuticals and other useful compounds. Harnessing this light energy requi… [+5425 chars]"}, {"source": {"id": null, "name": "WPTZ"}, "author": null, "title": "Hubble spies the heart of a grand design spiral galaxy - WPTZ", "description": "The Hubble Space Telescope captured a head-on view of a grand design spiral galaxy.", "url": "https://www.mynbc5.com/article/hubble-spies-the-heart-grand-design-spiral-galaxy/40154130", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/hypatia-h-8daec026806a14e8e6d77b85a855a958-h-a3638549ff5cd2a4c7aa211e2e2a389b-1654054134.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2022-06-01T03:40:00Z", "content": "The Hubble Space Telescope has looked straight into the heart of a stunning galaxy.\r\nThe observatory captured this head-on view of a grand design spiral galaxy, called NGC 3631, located about 53 mill… [+1164 chars]"}, {"source": {"id": null, "name": "Akihabaranews.com"}, "author": null, "title": "Putting Japanese on the Moon - AkihabaraNews", "description": "During US President Joe Biden’s recent visit to Japan, one of the most important areas of bilateral collaboration highlighted was the Artemis Program, which will see the Japan Aerospace Exploration Agency (JAXA) and the National Aeronautical and Space Adminis…", "url": "https://akihabaranews.com/putting-japanese-on-the-moon/", "urlToImage": "https://akihabaranews.com/wp-content/uploads/2022/06/Artemis-Logo-Red.jpeg", "publishedAt": "2022-06-01T01:33:15Z", "content": "Akihabara News (Tokyo) — During US President Joe Bidens recent visit to Japan, one of the most important areas of bilateral collaboration highlighted was the Artemis Program, which will see the Japan… [+2461 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A black hole created by an asymmetric merger may have gone rogue - BollyInside - BollyInside", "description": "Astronomers have discovered the first strong evidence that black hole merger events can generate a “kick” large enough to spin a black hole out of its", "url": "https://www.bollyinside.com/news/a-black-hole-created-by-an-asymmetric-merger-may-have-gone-rogue", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/A-black-hole-created-by-an-asymmetric-merger-may-have.jpeg", "publishedAt": "2022-05-31T22:37:29Z", "content": "Astronomers have discovered the first strong evidence that black hole merger events can generate a kick large enough to spin a black hole out of its galaxy.\r\nThe team, which included Vijay Varma, a s… [+5210 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Lower Earth Orbit - BollyInside", "description": "In the most basic sense, low Earth orbit (LEO) is precisely what it sounds like: an orbit around the Earth with an altitude near the bottom of the", "url": "https://www.bollyinside.com/news/lower-earth-orbit", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/Lower-Earth-Orbit.jpeg", "publishedAt": "2022-05-31T22:13:32Z", "content": "In the most basic sense, low Earth orbit (LEO) is precisely what it sounds like: an orbit around the Earth with an altitude near the bottom of the spectrum of conceivable orbits. This equates to appr… [+3780 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Everything we know about Trojan exoplanets - BollyInside", "description": "Co-orbiting worlds, often known as Trojans, have yet to be discovered outside of our solar system. That’s odd, according to a new study, given that we see", "url": "https://www.bollyinside.com/news/everything-we-know-about-trojan-exoplanets", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/Everything-we-know-about-Trojan-exoplanets.jpeg", "publishedAt": "2022-05-31T21:49:54Z", "content": "Co-orbiting worlds, often known as Trojans, have yet to be discovered outside of our solar system. Thats odd, according to a new study, given that we see them all the time closer to home.\r\nTrojans ab… [+2498 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "An astronaut reveals the highlights of a recent space mission - BollyInside", "description": "Matthias Maurer, a German astronaut who spent six months on the International Space Station (ISS), has been reflecting on what it was like to live and", "url": "https://www.bollyinside.com/news/technology/an-astronaut-reveals-the-highlights-of-a-recent-space-mission-2", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/1654031411_626_An-astronaut-reveals-the-highlights-of-a-recent-space-mission.jpeg", "publishedAt": "2022-05-31T21:10:11Z", "content": "Matthias Maurer, a German astronaut who spent six months on the International Space Station (ISS), has been reflecting on what it was like to live and work in space.\r\nIn November 2021, the European S… [+2140 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers develop new method for the technological use of 2D nanomaterials - Phys.org", "description": "Nanosheets are finely structured two-dimensional materials and have great potential for innovation. They are fixed on top of each other in layered crystals, and must first be separated from each other so that they can be used, for example, to filter gas mixtu…", "url": "https://phys.org/news/2022-05-method-technological-2d-nanomaterials.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-develop-ne-9.jpg", "publishedAt": "2022-05-31T20:46:13Z", "content": "Nanosheets are finely structured two-dimensional materials and have great potential for innovation. They are fixed on top of each other in layered crystals, and must first be separated from each othe… [+3764 chars]"}, {"source": {"id": null, "name": "World Atlas"}, "author": "Aidan Remple", "title": "Asteroids - Worldatlas.com", "description": "Most asteroids are minor and far, so observing them without equipment is impossible. Only one asteroid, called 4 Vesta, is sometimes visible to the naked eye.", "url": "https://www.worldatlas.com/space/asteroids.html", "urlToImage": "https://www.worldatlas.com/r/w1200-q80/upload/ca/b7/17/shutterstock-1006616230.jpg", "publishedAt": "2022-05-31T20:34:17Z", "content": "After the formation of the sun, there was a tremendous amount of debris in its orbit. Most of this debris coalesced to form the planets and their moons. Some of this debris never became part of the p… [+6166 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "How You Can Know the Weather Before It Happens? We Brought in Scientists to Explain. In ... - Latest - LatestLY", "description": "The latest Tweet by NASA states, 'How you can know the weather before it happens? We brought in scientists to explain. In an episode of our Curious Universe podcast, we break down how data from @NOAA satellites come together to create weather forecasts you se…", "url": "https://www.latestly.com/socially/technology/science/how-you-can-know-the-weather-before-it-happenswe-brought-in-scientists-to-explain-in-latest-tweet-by-nasa-3772185.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/04/nasa-784x441.jpg", "publishedAt": "2022-05-31T19:31:44Z", "content": "How you can know the weather before it happens?\r\nWe brought in scientists to explain.\r\nIn an episode of our Curious Universe podcast, we break down how data from @NOAA satellites come together to cre… [+631 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "SOFIA, NASA's flying telescope, has discovered an eclipse of an unusual binary star - BollyInside", "description": "Astronomers may examine how two stars exchange stardust by using NASA’s SOFIA airborne telescope, which has been following a dance between two stars", "url": "https://www.bollyinside.com/news/sofia-nasas-flying-telescope-has-discovered-an-eclipse-of-an-unusual-binary-star", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/SOFIA-NASAs-flying-telescope-has-discovered-an-eclipse-of-an.jpeg", "publishedAt": "2022-05-31T19:25:33Z", "content": "Astronomers may examine how two stars exchange stardust by using NASAs SOFIA airborne telescope, which has been following a dance between two stars orbiting each other as they approach the moment of … [+3191 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Misrepresentation and misinformation in the media is a threat to Space News and NASA - BollyInside", "description": "“In recent years, social media has aided in the dissemination of unprecedented amounts of misinformation in various domains, including astronomy and", "url": "https://www.bollyinside.com/news/misrepresentation-and-misinformation-in-the-media-is-a-threat-to-space-news-and-nasa", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/Misrepresentation-and-misinformation-in-the-media-is-a-threat-to.jpeg", "publishedAt": "2022-05-31T19:13:33Z", "content": "In recent years, social media has aided in the dissemination of unprecedented amounts of misinformation in various domains, including astronomy and space, claimed Mespar, a fact-checking website.\r\nAs… [+5646 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Direct sound printing is a potential game-changer in 3D printing: The new platform technology uses ultrasound waves to create complex and precise objects - Science Daily", "description": "Researchers describe a new platform technology called direct sound printing (DSP), which uses soundwaves to produce new objects. The paper explains show how focused ultrasound waves can be used to create sonochemical reactions in minuscule cavitation regions.…", "url": "https://www.sciencedaily.com/releases/2022/05/220531140131.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-31T18:41:55Z", "content": "Most 3D printing methods currently in use rely either on photo (light)- or thermo (heat)-activated reactions to achieve precise manipulation of polymers. The development of a new platform technology … [+3725 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA NEO surveyor: All about the mission set up to prevent mass extinction on Earth - Republic World", "description": "NASA' NEO surveyor mission will see the launch of a space telescope to monitor asteroids bigger than 140 metres (460 feet) in size.", "url": "https://www.republicworld.com/science/space/nasa-neo-surveyor-all-about-the-mission-set-up-to-prevent-mass-extinction-on-earth-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ic3dnurfsoalxrmy_1654018536.jpeg", "publishedAt": "2022-05-31T17:55:00Z", "content": "Theoretically, about 66 million years ago, a 10-kilometre-wide asteroid struck Earth, which resulted in the extinction of dinosaurs and almost every other species roaming our planet. While there are … [+2474 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Researchers Develop Coating Material from TiO2 Nanocrystals to Produce Light-sensitive, Rewritable System - AZoM", "description": "Researchers have succeeded in developing a coating material that can be written on with UV light and then removed with oxygen. Modifications on rewritable paper might help cut down on paper waste in a number of settings.", "url": "https://www.azom.com/news.aspx?newsID=59216", "urlToImage": "https://www.azom.com/images/news/ImageForNews_59216_16540003759525263.gif", "publishedAt": "2022-05-31T15:53:00Z", "content": "Researchers have succeeded in developing a coating material that can be written on with UV light and then removed with oxygen. Modifications on rewritable paper might help cut down on paper waste in … [+2892 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How moonlight fine-tunes animal reproduction - Phys.org", "description": "Animals possess circadian clocks, or 24-hour oscillators, to regulate daily behavior. These typically take their cues from the periodic change of sunlight and darkness. However, many animals are also exposed to moonlight, which reoccurs with ~25h periodicity.", "url": "https://phys.org/news/2022-05-moonlight-fine-tunes-animal-reproduction.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/moonlight.jpg", "publishedAt": "2022-05-31T14:32:04Z", "content": "Animals possess circadian clocks, or 24-hour oscillators, to regulate daily behavior. These typically take their cues from the periodic change of sunlight and darkness. However, many animals are also… [+3680 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "A new kind of solar sail could let us explore difficult places to reach in the solar system - Phys.org", "description": "Solar sailing technology has been a dream of many for decades. The simple elegance of sailing on the light waves of the sun does have a dreamy aspect to it that has captured the imagination of engineers as well as writers. However, the practicalities of the a…", "url": "https://phys.org/news/2022-05-kind-solar-explore-difficult.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-new-kind-of-solar-sa.jpg", "publishedAt": "2022-05-31T13:17:19Z", "content": "Solar sailing technology has been a dream of many for decades. The simple elegance of sailing on the light waves of the sun does have a dreamy aspect to it that has captured the imagination of engine… [+3444 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "4 big Milky Way mysteries the next Gaia mission data dump may solve - Space.com", "description": "\"You really get to know the stars.\"", "url": "https://www.space.com/milky-way-mysteries-for-gaia-to-solve", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hrFu9KMHZ4mtGkN7wJnAne-1200-80.jpg", "publishedAt": "2022-05-31T10:13:37Z", "content": "A treasure trove of data is set to answer some big questions about our galaxy. \r\nThe data, compiled by the European Space Agency's Gaia mission, contains an unprecedented amount of information about … [+10933 chars]"}]}