{"status": "ok", "totalResults": 47, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Anjali Marar", "title": "How this half-century-old telescope helped discover Saturn and Uranus rings, captured photo-electric images of stars - The Indian Express", "description": "The list of accomplishments of this 104-cm or one-metre-class optical telescope in Uttarakhand—built and the oldest to be operational in independent India—is long, as it marks its golden jubilee year in 2022.", "url": "https://indianexpress.com/article/cities/pune/half-century-old-telescope-helped-discover-saturn-and-uranus-rings-8213125/", "urlToImage": "https://images.indianexpress.com/2022/10/cover-15.jpg", "publishedAt": "2022-10-17T04:24:09Z", "content": "In the 1980s, the Sampurnanand telescope had contributed to the discovery of two rings around Saturn, one of which was newly identified then. It had also helped in the detection of rings around Uranu… [+4841 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA's asteroid-hunter Lucy makes exceptionally close flyby of Earth - Devdiscourse", "description": "Read more about NASA's asteroid-hunter Lucy makes exceptionally close flyby of Earth on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2216381-nasas-asteroid-hunter-lucy-makes-exceptionally-close-flyby-of-earth", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_04_2022_10_21_04_854034.jpg?width=920&format=jpeg", "publishedAt": "2022-10-17T03:44:21Z", "content": "NASA's Lucy, the first mission to the Jupiter Trojan asteroids, successfully completed its first Earth gravity assist on October 16, passing just 220 miles/350 km above our planet's surface.\r\nThe Oct… [+1918 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "Neanderthals, humans co-existed in Europe for over 2,000 years: study - The Jakarta Post - The Jakarta Post", "description": "While the study, published in the journal Scientific Reports, did not provide evidence that humans directly interacted with Neanderthals around 42,000 years ago, previous genetic research has shown that they must have at some point.", "url": "http://www.thejakartapost.com/culture/2022/10/17/neanderthals-humans-co-existed-in-europe-for-over-2000-years-study.html", "urlToImage": "https://img.jakpost.net/c/2018/02/23/2018_02_23_41154_1519364352._large.jpg", "publishedAt": "2022-10-17T02:59:29Z", "content": "Neanderthals and humans lived alongside each other in France and northern Spain for up to 2,900 years, modelling research suggested Thursday, giving them plenty of time to potentially learn from or e… [+3067 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "Astronomers Have Found More Than 30000 Near-Earth Asteroids... so far - Universe Today", "description": "Asteroid hunters have become increasingly good at their job. The discipline, which took a back seat in the early days of astronomy, has really come into its own as of late. Once the general public, probably spurred on by popular 1990s movies like Deep Impact …", "url": "https://www.universetoday.com/158121/astronomers-have-found-more-than-30000-near-earth-asteroids-so-far/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/10/7847.jpg", "publishedAt": "2022-10-17T01:38:43Z", "content": "Asteroid hunters have become increasingly good at their job. The discipline, which took a back seat in the early days of astronomy, has really come into its own as of late. Once the general public, p… [+3660 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Use Model to Predict Conditions for Life on Ancient Mars - VOA Learning English", "description": "A new study has found that ancient Mars may have been able to support a large population of microscopic organisms. The study suggests the microorganisms might have been growing just beneath the Mars surface about 4 billion years ago.", "url": "https://learningenglish.voanews.com/a/scientists-use-model-to-predict-conditions-for-life-on-ancient-mars/6788469.html", "urlToImage": "https://gdb.voanews.com/013b0000-0aff-0242-5df8-08daad3a7f49_cx0_cy1_cw0_w1200_r1.jpg", "publishedAt": "2022-10-16T22:03:40Z", "content": "A new study suggests that ancient Mars might have been able to support a large population of microscopic organisms.\r\nFrench scientists used computer models to predict climate and land conditions unde… [+4123 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Here’s how NASA will drop off a sample of an asteroid - Digital Trends", "description": "NASA has shared details on how exactly the OSIRIS-REx spacecraft will deliver its sample of asteroid Bennu to Earth.", "url": "https://www.digitaltrends.com/space/nasa-osiris-rex-sample-delivery/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/10/Screenshot-2022-10-16-203440.jpg?p=1", "publishedAt": "2022-10-16T22:00:11Z", "content": "NASA’s OSIRIS-REx spacecraft scooped up a sample from asteroid Bennu in October 2020, and in May 2021 the spacecraft headed back to Earth to drop that sample off. This week. the spacecraft performed … [+2132 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: SpaceX capsule splashes down, returning 4 astronauts from Space Station - Devdiscourse", "description": "Read more about Science News Roundup: SpaceX capsule splashes down, returning 4 astronauts from Space Station on Devdiscourse", "url": "https://www.devdiscourse.com/article/technology/2216269-science-news-roundup-spacex-capsule-splashes-down-returning-4-astronauts-from-space-station", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/26_03_2022_13_17_33_690102.jpg?width=920&format=jpeg", "publishedAt": "2022-10-16T20:59:56Z", "content": "Following is a summary of current science news briefs.\r\nSpaceX capsule splashes down, returning 4 astronauts from Space Station\r\nThe fourth long-duration astronaut team launched by SpaceX to the Inte… [+439 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Milky Way’s Graveyard of Dead Stars Found – First Map of the “Galactic Underworld” - SciTechDaily", "description": "A new study creates the first map of our galaxy’s ancient dead stars. In the first map of the 'galactic underworld', a study from the University of Sydney has revealed a vast graveyard that stretches three times the height of the Milky Way. It has also indica…", "url": "https://scitechdaily.com/milky-ways-graveyard-of-dead-stars-found-first-map-of-the-galactic-underworld/", "urlToImage": "https://scitechdaily.com/images/Visible-Milky-Way-Galaxy-Versus-Its-Galactic-Underworld.jpg", "publishedAt": "2022-10-16T20:13:57Z", "content": "ByUniversity of SydneyOctober 16, 2022\r\nSplit view of the visible Milky Way galaxy versus its galactic underworld. Credit: University of Sydney\r\nA new study creates the first map of our galaxys ancie… [+8380 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Jimmy Pezzone", "title": "Minecraft player recreates the entire known universe - TechSpot", "description": "Minecraft players have been creating enormous, complex creations for years, but Christopher Slayton's latest project may have just earned him the crown as the new king of...", "url": "https://www.techspot.com/news/96334-minecraft-player-recreates-entire-known-universe.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/10/2022-10-16-image-16.jpg", "publishedAt": "2022-10-16T18:35:00Z", "content": "The big picture: Minecraft players have built everything from well-known architectural designs to functioning supercomputers. But Minecraft aficionado Christopher Slayton decided it was time to go bi… [+2606 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Tanushree Shenwai, Tanushree Shenwai", "title": "DeepMind Introduces the Perception Test, a New Multimodal Benchmark Using Real-World Videos to Help Evaluate the Perception Capabilities of a Machine Learning Model - MarkTechPost", "description": "Benchmarks have influenced artificial intelligence (AI) in defining research goals and enabling researchers to track progress toward those goals. An important component of intelligence is perception, the process of experiencing the world through the senses. I…", "url": "https://www.marktechpost.com/2022/10/16/deepmind-introduces-the-perception-test-a-new-multimodal-benchmark-using-real-world-videos-to-help-evaluate-the-perception-capabilities-of-a-machine-learning-model/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2022/10/Screen-Shot-2022-10-16-at-10.57.00-AM.png", "publishedAt": "2022-10-16T18:03:22Z", "content": "Benchmarks have influenced artificial intelligence (AI) in defining research goals and enabling researchers to track progress toward those goals.\r\nAn important component of intelligence is perception… [+4504 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "China detects world’s most powerful gamma ray bursts, breaking multiple records - Global Times", "description": "Chinese astronomers have detected record-breaking, most powerful gamma ray bursts (GRBs) in the world, boosting the highest-energy GRBs record by almost 20 times and marking the first detection of a GRB with energies above 10 TeV.", "url": "https://www.globaltimes.cn/page/202210/1277277.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2017/2017-12-05/f5ed2be9-c7cb-451e-b270-4e0338401e79_s.jpeg", "publishedAt": "2022-10-16T17:37:00Z", "content": "Chinese astronomers have detected record-breaking, most powerful gamma ray bursts (GRBs) in the world, boosting the highest-energy GRBs record by almost 20 times and marking the first detection of a … [+3549 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals how an unusually large number of insects are destroying plants - ThePrint", "description": "Washington [US], October 16 (ANI): Despite the decrease in the population of bugs, researchers at the University of Wyoming discovered that insects are nevertheless causing tremendous damage to plants. The first-of-its-kind study compares insect herbivore dam…", "url": "https://theprint.in/science/study-reveals-how-an-unusually-large-number-of-insects-are-destroying-plants/1170602/", "urlToImage": null, "publishedAt": "2022-10-16T15:13:56Z", "content": "Washington [US], October 16 (ANI): Despite the decrease in the population of bugs, researchers at the University of Wyoming discovered that insects are nevertheless causing tremendous damage to plant… [+2692 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Ural Federal University: Miniature Permanent Magnets Can Be Printed on a 3D Printer - India Education Diary", "description": "Scientists from the Ural Federal University and the Ural Branch of the Russian Academy of Sciences are determining the optimal conditions for 3D printing of permanent magnets from hard magnetic compounds based on rare-earth metals. This will make it", "url": "https://indiaeducationdiary.in/ural-federal-university-miniature-permanent-magnets-can-be-printed-on-a-3d-printer/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/Ural_Federal_University_eng-3.jpg?fit=893%2C503&ssl=1", "publishedAt": "2022-10-16T14:17:09Z", "content": "Scientists from the Ural Federal University and the Ural Branch of the Russian Academy of Sciences are determining the optimal conditions for 3D printing of permanent magnets from hard magnetic compo… [+3979 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "'Sentient' brain cells in dish learn to play video game: study - Medical Xpress", "description": "Brain cells living in a dish can learn to play the classic video game Pong, thus demonstrating \"intelligent and sentient behavior,\" Australian neuroscientists argue in a new paper.", "url": "https://medicalxpress.com/news/2022-10-sentient-brain-cells-dish-video.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/human-brain-cells-in-a-2.jpg", "publishedAt": "2022-10-16T14:14:21Z", "content": "Brain cells living in a dish can learn to play the classic video game Pong, thus demonstrating \"intelligent and sentient behavior,\" Australian neuroscientists argue in a new paper.\r\nBrett Kagan, who … [+4032 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "Astronomers discovered something strange about 'potentially hazardous' asteroid Phaethon - Space.com", "description": "Phaethon is just the 11th known asteroid to demonstrate a changing rotational period.", "url": "https://www.space.com/phaethon-asteroid-spin-speeding-up", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oaaVrndscWyZABBDW65ftn-1200-80.jpg", "publishedAt": "2022-10-16T14:00:44Z", "content": "The Japan Aerospace Exploration Agency intends to launch its DESTINY+ mission to the near-Earth asteroid Phaethon in 2024, with the aim of flying by the space rock in 2028, so this \"potentially hazar… [+2723 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Shields up! Radiation coating experiment will spend six months outside space station - Space.com", "description": "The International Space Station experiment is a small step towards testing this tech for lunar exploration for the Artemis program, proponents say.", "url": "https://www.space.com/international-space-station-shield-radiation-experiment", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CNLReU9kS8KV8teRdQm2nU-1200-80.jpg", "publishedAt": "2022-10-16T14:00:04Z", "content": "A new spacecraft shield is flying to orbit.\r\nThe coating aims to hold off space\r\n radiation that can blast away at spacecraft surfaces, and cause problems with electrical shorting or overall erosion.… [+2635 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Peter Tuthill, The Conversation", "title": "An astrophysicist explains the ‘cosmic thumbprint’ photo taken by the James Webb telescope - Scroll.in", "description": "The distant star system surrounded by surreal concentric geometric rungs had lit up the internet with theories and speculation.", "url": "https://scroll.in/article/1035003/an-astrophysicist-explains-the-cosmic-thumbprint-photo-taken-by-the-james-webb-telescope", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/181271-pzdiuiiqqu-1665737546.jpeg", "publishedAt": "2022-10-16T14:00:00Z", "content": "In July, a puzzling new image of a distant extreme star system surrounded by surreal concentric geometric rungs had even astronomers scratching their heads. The picture, which looks like a kind of co… [+5787 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Discovery Indicates an Alternative Gravity Theory - SciTechDaily", "description": "Disturbances in the dwarf galaxies of one of Earth's closest galaxy clusters point to a different gravity theory. Dwarf galaxies are small, faint galaxies that are often found in or close to bigger galaxies or galaxy clusters. As a result, they could be impac…", "url": "https://scitechdaily.com/new-discovery-indicates-an-alternative-gravity-theory/", "urlToImage": "https://scitechdaily.com/images/Dwarf-Galaxy-NGC1427A.jpg", "publishedAt": "2022-10-16T13:35:56Z", "content": "The dwarf galaxy NGC1427A flies through the Fornax galaxy cluster and undergoes disturbances that would not be possible if this galaxy were surrounded by a heavy and extended dark matter halo, as req… [+4478 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Mars’ moon eclipses Jupiter in breathtaking new video - BGR", "description": "A new video shared by the ESA shows Mars' moon eclipse the gas giant Jupiter and its satellites in breathtaking detail.", "url": "https://bgr.com/science/mars-moon-eclipses-jupiter-in-breathtaking-new-video/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/10/AdobeStock_421863893.jpeg?quality=82&strip=all", "publishedAt": "2022-10-16T13:02:00Z", "content": "The European Space Agency’s (ESA) Mars Express has captured a spectacular event on camera. The rare occurrence happened in February of 2022 when the Mars Express captured footage of Mars’ moon as it … [+2085 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Fatima Shakeel", "title": "This Video Of A SpaceX Rocket Launching In Front Of The Full Moon Looks Absolutely Amazing - Wonderful Engineering", "description": "Advertisement This new video of the SpaceX Falcon 9 rocket launching from the Florida Space Coast is quite a sight to behold. The footage of this crowning departure has been shared by ABC News, in which we can see that the Falcon 9 rocket is prepared to make …", "url": "https://wonderfulengineering.com/this-video-of-a-spacex-rocket-launching-in-front-of-the-full-moon-looks-absolutely-amazing/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/10/ezgif-1-e86a5ee845.jpg", "publishedAt": "2022-10-16T12:32:35Z", "content": "This new video of the SpaceX Falcon 9 rocket launching from the Florida Space Coast is quite a sight to behold. The footage of this crowning departure has been shared by ABC News, in which we can see… [+1892 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Fatima Shakeel", "title": "Watch NASA Test A Balloon Meant To Explore Venus - Wonderful Engineering", "description": "Advertisement NASA has finally managed to achieve the milestone of conducting successful flight tests of its newly developed aerial robotic balloon known as “aerobot”, which has been designed to explore the atmospheric conditions on the Earth’s sister planet,…", "url": "https://wonderfulengineering.com/watch-nasa-test-a-balloon-meant-to-explore-venus/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/10/ezgif-2-8d16f4fc31.jpg", "publishedAt": "2022-10-16T12:31:53Z", "content": "NASA has finally managed to achieve the milestone of conducting successful flight tests of its newly developed aerial robotic balloon known as “aerobot”, which has been designed to explore the atmosp… [+2521 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Mysteries of the Universe: Event Horizon Telescope Spots Hot Gas Bubble near Black Hole — Transcontinental Times - Transcontinental Times", "description": "CHILE: A burst of X-ray flare emitted from the middle of the Milky Way Galaxy caught by NASA’s Chandra Space Telescope became the centre of investigation amongst astronomers. The images developed with the help of the Atacama Large Millimetre/submillimetre Arr…", "url": "https://www.transcontinentaltimes.com/mysteries-of-the-universe-telescope/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/10/Event-Horizon-Telescope.jpg", "publishedAt": "2022-10-16T12:00:12Z", "content": "CHILE: A burst of X-ray flare emitted from the middle of the Milky Way Galaxy caught by NASAs Chandra Space Telescope became the centre of investigation amongst astronomers.\r\nThe images developed wit… [+1880 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Ultra-speedy jet spotted blasting from two neutron star collision - Tech Explorist", "description": "The jet is plowing through space at speeds greater than 99.97% the speed of light.", "url": "https://www.techexplorist.com/ultra-speedy-jet-spotted-blasting-two-neutron-star-collision/54307/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/10/Ultra-Speedy-Jet.jpg", "publishedAt": "2022-10-16T11:46:30Z", "content": "Using NASA’s Hubble Space Telescope, astronomers spotted a jet-propelled by the titanic collision between two neutron stars. The measurements suggest that the jet was traveling through space at speed… [+2601 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "New walking robot design could revolutionize how we build things in space - Space Daily", "description": "Washington DC (SPX) Oct 17, 2022 - \r\nResearchers have designed a state-of-the-art walking robot that could revolutionize large construction projects in space. They tested the feasibility of the robot for the in-space assembly of a 25m", "url": "https://www.spacedaily.com/reports/New_walking_robot_design_could_revolutionize_how_we_build_things_in_space_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/large-aperture-space-telescope-walking-robotic-manipulator-for-in-space-assembly-mission-hg.jpg", "publishedAt": "2022-10-16T11:39:44Z", "content": "Researchers have designed a state-of-the-art walking robot that could revolutionize large construction projects in space. They tested the feasibility of the robot for the in-space assembly of a 25m L… [+5740 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Quantum Entanglement Has Now Been Directly Observed at The Macroscopic Scale - ScienceAlert", "description": "Quantum entanglement is the binding together of two particles or objects, even though they may be far apart – their respective properties are linked in a way that's not possible under the rules of classical physics.", "url": "https://www.sciencealert.com/quantum-entanglement-has-now-been-directly-observed-at-the-macroscopic-scale", "urlToImage": "https://www.sciencealert.com/images/2022/10/entanglement_Quantum_representation.jpeg", "publishedAt": "2022-10-16T10:26:37Z", "content": "Quantum entanglement is the binding together of two particles or objects, even though they may be far apart their respective properties are linked in a way that's not possible under the rules of clas… [+4124 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "At the edge of interstellar space, researchers have discovered strange shapes - BollyInside", "description": "Strange ripples and oblique structures have been found at the edge of our solar system, and new research explains the vast interstellar space beyond.", "url": "https://www.bollyinside.com/news/at-the-edge-of-interstellar-space-researchers-have-discovered-strange-shapes", "urlToImage": "//cdnimage.bollyinside.com/wp-content/uploads/2022/10/Web-capture_16-10-2022_15293_www.bing_.com_.jpeg", "publishedAt": "2022-10-16T10:20:34Z", "content": "Strange ripples and oblique structures have been found at the edge of our solar system, and new research explains the vast interstellar space beyond.\r\nAccording to VICE, scientists are “interesting a… [+3202 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Chris Skeldon", "title": "Uranus' axis of rotation is on its side, is it because of the satellite? - brytfmonline.com", "description": "An interesting study found that the extreme tilt of Uranus is the result of satellites...", "url": "https://www.brytfmonline.com/uranus-axis-of-rotation-is-on-its-side-is-it-because-of-the-satellite/", "urlToImage": "https://www.brytfmonline.com/wp-content/uploads/2022/10/Uranus-axis-of-rotation-is-on-its-side-is-it.jpg", "publishedAt": "2022-10-16T06:00:13Z", "content": "An interesting study found that the extreme tilt of Uranus is the result of satellites such as the rings of Saturn.\r\nAn international research team including the Sorbonne University in France and the… [+3107 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Indian Scientists Find What Happens To Our Sun When It's Asleep - Indiatimes.com", "description": "Ever wondered what happens when the Sun is asleep? Researchers from India seem to have cracked the Sun's code.Just in the last 10 days, the Sun has produced three solar flares, at least 18 coronal mass ejections, and 1 geomagnetic storm. This is happening bec…", "url": "https://www.indiatimes.com/technology/science-and-future/indian-scientists-find-what-happens-to-our-sun-when-its-asleep-581412.html", "urlToImage": "https://im.indiatimes.in/content/2022/Oct/FBImage-2_633ebc7f08d73.jpg", "publishedAt": "2022-10-16T05:54:56Z", "content": "Ever wondered what happens when the Sun is asleep? Researchers from India seem to have cracked the Sun's code.\r\nJust in the last 10 days, the Sun has produced three solar flares, at least 18 coronal … [+2045 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Even Low Doses of Alcohol Cause Changes in Brain Circuitry - SciTechDaily", "description": "How many drinks is too much? According to a recent rodent study, even tiny amounts of alcohol may cause epigenomic and transcriptomic changes in brain circuitry in a region that is essential for the development of addiction. The pathways that are involved in …", "url": "https://scitechdaily.com/even-low-doses-of-alcohol-cause-changes-in-brain-circuitry/", "urlToImage": "https://scitechdaily.com/images/Brain-Connections-Technology.jpg", "publishedAt": "2022-10-16T03:42:08Z", "content": "ByUniversity of Illinois ChicagoOctober 15, 2022\r\nThe study found that even low doses of alcohol prepared the brain for addiction.\r\nHow many drinks is too much?\r\nAccording to a recent rodent study, e… [+3697 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI", "title": "Astronomers discover heaviest element in an exoplanet atmosphere barium - Business Standard", "description": "Astronomers have discovered the heaviest element ever found in an exoplanet atmosphere barium", "url": "https://www.business-standard.com/article/current-affairs/astronomers-discover-heaviest-element-in-an-exoplanet-atmosphere-barium-122101501009_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-11/26/full/1637909767-8552.jpg", "publishedAt": "2022-10-16T02:28:00Z", "content": "Astronomers have discovered the heaviest element ever found in an exoplanet atmosphere barium. They were surprised to discover barium at high altitudes in the atmospheres of the ultra-hot gas giants … [+3341 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Mohana Basu", "title": "Huge Tonga volcanic eruption this year led to bloom of microscopic marine life, find scientists - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/huge-tonga-volcanic-eruption-this-year-led-to-bloom-of-microscopic-marine-life-find-scientists/1169335/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/10/phyto.jpg", "publishedAt": "2022-10-16T02:00:44Z", "content": "New Delhi: The Tonga volcanic eruption the largest submarine volcanic eruption of this century led to a dramatic phytoplankton bloom north of the island of Tongatapu, in the Kingdom of Tonga.\r\nA team… [+6619 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Felicity Nelson", "title": "Finally, Scientists Have Figured Out A Key Molecular Mechanism Behind Human Hearing - ScienceAlert", "description": "Scientists have finally unraveled the structure of a mysterious protein complex inside the inner ear that enables hearing in humans.", "url": "https://www.sciencealert.com/finally-scientists-have-figured-out-a-key-molecular-mechanism-behind-human-hearing", "urlToImage": "https://www.sciencealert.com/images/2022/10/hair-cells-inner-ear-cropped.jpg", "publishedAt": "2022-10-15T23:00:35Z", "content": "Scientists have finally unraveled the structure of a mysterious protein complex inside the inner ear that enables hearing in humans.\r\nTo solve this decades-old puzzle, researchers needed to grow 60 m… [+2413 chars]"}, {"source": {"id": null, "name": "EcoWatch"}, "author": "Olivia Rosane", "title": "East Antarctic Glacier Melting at 70+ Billion Tons a Year - EcoWatch", "description": "Now, a study published in Geophysical Research Letters in September found that warm water is making its way into a dip beneath East Antarctica’s Denman Glacier, melting 70.8 billion tons of ice each year.", "url": "https://www.ecowatch.com/east-antarctica-denman-glacier-melting.html", "urlToImage": "https://www.ecowatch.com/wp-content/uploads/2022/10/Denman_Glacier.jpg", "publishedAt": "2022-10-15T18:40:38Z", "content": "In recent years, scientists have begun to raise the alarm that East Antarctica isnt as safe from the ravages of the climate crisis as previously believed. \r\nNow, a study published in Geophysical Rese… [+2862 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Wow! NASA finds water on Jupiter's Europa moon; life possible? - HT Tech", "description": "The latest study suggests that the presence of water on Jupiter’s Moon Europa makes it habitable.", "url": "https://tech.hindustantimes.com/tech/news/wow-nasa-finds-water-on-jupiter-s-europa-moon-life-possible-71665847962981.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/15/1600x900/NASA-Europa-Flyby-1_1664792328347_1664792328347_1665848048655_1665848048655.jpg", "publishedAt": "2022-10-15T15:34:26Z", "content": "Jupiter has four Galilean moons - Io, Europa, Ganymede, and Callisto. And in a surprising development, NASA's scientists have found water on the surface of one of the smallest of the four Galilean mo… [+1768 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "3D printing plant cells shows promise for studying cell function - Nanowerk", "description": "A new study shows a reproducible way of studying cellular communication among varied types of plant cells by 'bioprinting' these cells via a 3D printer.", "url": "https://www.nanowerk.com/news2/gadget/newsid=61648.php", "urlToImage": "https://www.nanowerk.com/news2/gadget/id61648.jpg", "publishedAt": "2022-10-15T14:49:13Z", "content": "Nanowerk Newsletter\r\nGet our 3D-printing News updates to your inbox!"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "SpaceX Conducts Another Successful Launch: Puts Telecom Satellite in Orbit — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: SpaceX added to its long list of successful lift-offs and autonomous landings as the Falcon 9 launched a communications satellite into orbit before successfully landing back on a ship at sea. The rocket carrying Eutelsat’s Hotbird 13F satellite…", "url": "https://www.transcontinentaltimes.com/spacex-launch-telecom-satellite/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/10/SpaceX.jpg", "publishedAt": "2022-10-15T14:47:00Z", "content": "UNITED STATES: SpaceX added to its long list of successful lift-offs and autonomous landings as the Falcon 9 launched a communications satellite into orbit before successfully landing back on a ship … [+1832 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists can now observe supernova explosions • Earth.com - Earth.com", "description": "Scientists can now observe supernova explosions • Earth.com", "url": "https://www.earth.com/news/scientists-can-now-observe-supernova-explosions/", "urlToImage": "https://cff2.earth.com/uploads/2022/10/15071918/Low-Res_unnamed.jpg.png", "publishedAt": "2022-10-15T13:33:01Z", "content": "A team of astrophysicists from the Liverpool John Moores University (LJMU) in the UK and the University of Montpellier in France has devised an early warning system to sound the alert when a massive … [+1894 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Vinothini S", "title": "Is Alberti Popaj Gay? Age, Height, Net Worth - News - News", "description": "Is Alberti Popaj Gay? Fans of Alberti Popaj can check this article to know whether Alberti Popaj is Gay or not. Alberti Popaj is a Actor. Here we have provided Alberti Popaj's Age, Height, and Alberti Popaj Girlfriend's name, so read the article and know all …", "url": "https://latestnews.fresherslive.com/articles/is-alberti-popaj-gay-girlfriend-salary-age-height-1080236", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/10/15/is-alberti-popaj-gay-girlfriend-salary-age-height-634aaf8220f1e-1665838978.jpg", "publishedAt": "2022-10-15T13:14:58Z", "content": "Is Alberti Popaj Gay?\r\nWant to know if Alberti Popaj is Gay or not? Then head into this article. As per popularnetworth, Alberti Popaj is gay. \r\nAlberti Popaj Age\r\nThe Actor was born on January 26, 1… [+777 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "3D printed laboratory equipment to measure bulk materials in extreme conditions | Scientific Reports - Nature.com", "description": "Scientific Reports - 3D printed laboratory equipment to measure bulk materials in extreme conditions", "url": "https://www.nature.com/articles/s41598-022-22114-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-22114-2/MediaObjects/41598_2022_22114_Fig1_HTML.jpg", "publishedAt": "2022-10-15T13:14:14Z", "content": "The materials and methods concern two areas. The first area is the materials and methods related to the printed measuring instruments made via Fused Filament Fabrication. The second area of interest … [+19303 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The role of the Aspergillus nidulans high mobility group B protein HmbA, the orthologue of Saccharomyces cerevisiae Nhp6p | Scientific Reports - Nature.com", "description": "Scientific Reports - The role of the Aspergillus nidulans high mobility group B protein HmbA, the orthologue of Saccharomyces cerevisiae Nhp6p", "url": "https://www.nature.com/articles/s41598-022-22202-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-22202-3/MediaObjects/41598_2022_22202_Fig1_HTML.png", "publishedAt": "2022-10-15T13:14:14Z", "content": "HmbA is structurally similar to Nhp6Ap\r\nWe first investigated the structural similarities of HmbA and Nhp6Ap. An NMR-based model structure of the Nhp6Ap-DNA complex is available6, however, for compar… [+31643 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "Landing on Mars: Keep straight and fly right for Martian touchdown success - Space.com", "description": "Getting down, dirty and securely on Mars remains a delicate balance of technical skill, mixed in with hard-earned luck.", "url": "https://www.space.com/landing-on-mars-challenges-entry-descent", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LM2cdLZauUjiQ8iLDuTjBE-1200-80.jpg", "publishedAt": "2022-10-15T13:00:01Z", "content": "Touching safely down on Mars is a true, nail biting event. Those terror gripping, heart-stopping moments of entry, descent, and landing (EDL) after months of cruising to the Red Planet are indeed fri… [+8541 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "NASA's rover gets hit with curve ball while taking a sample from Mars - TweakTown", "description": "NASA's Perseverance rover has encountered an unforeseen problem while collecting its now 14th sample from the surface of the Red Planet.", "url": "https://www.tweaktown.com/news/88922/nasas-rover-gets-hit-with-curve-ball-while-taking-sample-from-mars/index.html", "urlToImage": "https://static.tweaktown.com/news/8/8/88922_01_nasas-mars-rover-encounters-unforeseen-problem-on_full.jpg", "publishedAt": "2022-10-15T11:51:00Z", "content": "NASA's Perseverance rover is currently exploring the surface of Mars, collecting samples that will eventually be sent back to Earth.\r\nPerseverance, accompanied by its scout helicopter named Ingenuity… [+2007 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Online Desk", "title": "NASA: Moon may have formed within hours, not centuries - The New Indian Express", "description": "Scientists have revealed that a giant impact could have formed the Moon more rapidly within hours, opening up a whole new range of possible starting places for the Moon's evolution. The Moon is thought to have formed following a collision 4.5 billion years ag…", "url": "https://www.newindianexpress.com/videos/videos-world/2022/oct/15/nasa-moon-may-have-formed-within-hours-not-centuries-110947.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/10/15/w600X390/sss.jpg", "publishedAt": "2022-10-15T11:26:00Z", "content": "Disclaimer : We respect your thoughts and views! But we need to be judicious while moderating your comments. All the comments will be moderated by the newindianexpress.com editorial. Abstain from pos… [+631 chars]"}, {"source": {"id": null, "name": "Robohub.org"}, "author": "MIT News", "title": "Tiny particles work together to do big things - Robohub", "description": "", "url": "https://robohub.org/tiny-particles-work-together-to-do-big-things/", "urlToImage": "https://robohub.org/wp-content/uploads/2022/10/MIT-OscillatingParticles-01-press_0-425x283.jpg", "publishedAt": "2022-10-15T11:03:45Z", "content": "MIT chemical engineers have shown that specialized particles can oscillate together, demonstrating a phenomenon known as emergent behavior. Image: Courtesy of the researchers\r\nBy Anne Trafton | MIT N… [+6857 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists count electric charges in a single platinum nanoparticle down to the electron - Tech Explorist", "description": "If you often find yourself off by one when counting your socks after doing the laundry, you might want to sit down for this.", "url": "https://www.techexplorist.com/scientists-count-electric-charges-single-platinum-nanoparticle-down-electron/54291/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/10/Low-Res_nanoparticle-electron-holography-measurement.jpg", "publishedAt": "2022-10-15T10:46:50Z", "content": "A goal in the characterization of supported metal catalysts is to achieve particle-by-particle analysis of the charge state strongly correlated with the catalytic activity.\r\nScientists from Japan hav… [+3463 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Anwesha Majumdar", "title": "Residents of US and Canada experienced dazzling fireball flashed through night sky | Watch - Republic World", "description": "A dazzling fireball that flashed through the night sky on October 12 astonished locals on the southwest coast of Canada and the northwest coast of the US", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/residents-of-us-and-canada-experienced-dazzling-fireball-flashed-through-night-sky-watch-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/qxwruzt1gbihoxq2_1665826505.jpeg", "publishedAt": "2022-10-15T10:25:00Z", "content": "A dazzling fireball that flashed through the night sky on October 12 astonished locals on the southwest coast of Canada and the northwest coast of the United States.\r\nAs of Friday, the American Meteo… [+2635 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Antarctic aldehyde dehydrogenase from Flavobacterium PL002 as a potent catalyst for acetaldehyde determination in wine | Scientific Reports - Nature.com", "description": "Scientific Reports - Antarctic aldehyde dehydrogenase from Flavobacterium PL002 as a potent catalyst for acetaldehyde determination in wine", "url": "https://www.nature.com/articles/s41598-022-22289-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-22289-8/MediaObjects/41598_2022_22289_Fig1_HTML.png", "publishedAt": "2022-10-15T09:09:18Z", "content": "Sequence analysis of S2-ALDH\r\nBLAST screening of the Flavobacterium PL002 genome sequence42 led to identification of a coding region homologous to aldehyde dehydrogenase gene (1365 bp) coding for the… [+25655 chars]"}]}