{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Due to Unfavorable Weather, Now Targeting a New T-0 of 12:42 A.m. ET for Our Upcoming ... - Latest Tweet by - LatestLY", "description": "The latest Tweet by SpaceX states, 'Due to unfavorable weather, now targeting a new T-0 of 12:42 a.m. ET for our upcoming Falcon 9 launch of Starlink satellites → ...'", "url": "https://www.latestly.com/socially/technology/science/due-to-unfavorable-weather-now-targeting-a-new-t-0-of-1242-a-m-et-for-our-upcoming-latest-tweet-by-spacex-3489002.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/SpaceX_KYZfcD7-588x441.jpg", "publishedAt": "2022-03-19T02:10:42Z", "content": "Due to unfavorable weather, now targeting a new T-0 of 12:42 a.m. ET for our upcoming Falcon 9 launch of Starlink satellites https://t.co/bJFjLCzWdK— SpaceX (@SpaceX) March 19, 2022\r\n(SocialLY brings… [+492 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Ukraine crisis: Cosmonauts wear Ukrainian colors on space station - Times of India", "description": "Three Russian cosmonauts have arrived at the International Space Station wearing flight suits in yellow and blue colors that match the Ukrainian flag. The men were the first new arrivals on the space station since the start of the Russian war in Ukraine last …", "url": "https://timesofindia.indiatimes.com/videos/international/ukraine-crisis-cosmonauts-wear-ukrainian-colors-on-space-station/videoshow/90315206.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90315206,imgsize-43440.cms", "publishedAt": "2022-03-19T01:57:10Z", "content": "Mar 19, 2022, 07:27AM ISTSource: APThree Russian cosmonauts have arrived at the International Space Station wearing flight suits in yellow and blue colors that match the Ukrainian flag. The men were … [+460 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Russia to work on solo Mars mission after Europe freezes joint project - Interfax - Devdiscourse", "description": "Interfax quoted him as saying he did not think a rover would necessarily be needed since Russia's existing landing module, which is designed to transport the rover, would be able to carry out the required scientific work.  Rogozin said there were \"big doubts\"…", "url": "https://www.devdiscourse.com/article/technology/1967989-russia-to-work-on-solo-mars-mission-after-europe-freezes-joint-project---interfax", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/29_02_2020_17_00_46_5151186.jpg?width=920&format=jpeg", "publishedAt": "2022-03-18T21:31:09Z", "content": "Russia will start work on its own Mars mission given that the European Space Agency (ESA) has suspended a joint project in the wake of the Ukraine invasion, Interfax news agency quoted a top official… [+1105 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Perseverance rover hightails it to Martian delta - Phys.org", "description": "NASA's Perseverance Mars rover is trying to cover more distance in a single month than any rover before it—and it's doing so using artificial intelligence. On the path ahead are sandpits, craters, and fields of sharp rocks that the rover will have to navigate…", "url": "https://phys.org/news/2022-03-perseverance-rover-hightails-martian-delta.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/perseverance-rover-hig.jpg", "publishedAt": "2022-03-18T19:22:04Z", "content": "NASA's Perseverance Mars rover is trying to cover more distance in a single month than any rover before itand it's doing so using artificial intelligence. On the path ahead are sandpits, craters, and… [+5874 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Preparing the Space Station for Solar Array Upgrades on This Week @NASA – March 18, 2022 - NASA", "description": "Preparing the space station for solar array upgrades, rolling out the spacecraft for our Artemis I mission, and the Webb Space Telescope team reaches another...", "url": "https://www.youtube.com/watch?v=NDmFz_Qe5A0", "urlToImage": "https://i.ytimg.com/vi/NDmFz_Qe5A0/hqdefault.jpg", "publishedAt": "2022-03-18T18:33:49Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists may have solved Stephen Hawking's black hole paradox - Phys.org", "description": "Researchers may have solved Professor Stephen Hawking's famous black hole paradox—a mystery that has puzzled scientists for almost half a century.", "url": "https://phys.org/news/2022-03-scientists-stephen-hawking-black-hole.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/6-blackhole.jpg", "publishedAt": "2022-03-18T17:21:17Z", "content": "Researchers may have solved Professor Stephen Hawking's famous black hole paradoxa mystery that has puzzled scientists for almost half a century.\r\nAccording to two new studies, something called \"quan… [+3453 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "NASA’s Artemis 1 mega SLS moon rocket makes public debut - The Siasat Daily", "description": "NASA's Artemis 1 mega moon rocket has been rolled out for the first time on Friday and it continues its journey to the launch pad", "url": "https://www.siasat.com/nasas-artemis-1-mega-sls-moon-rocket-makes-public-debut-2292826/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/Artimis-1.jpg", "publishedAt": "2022-03-18T17:10:20Z", "content": "Washington: NASA’s Artemis 1 mega moon rocket has been rolled out for the first time on Friday and it continues its journey to the launch pad, the US space agency officials said.\r\nThe rocket and spac… [+2631 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Shivali Best", "title": "Even elephants hate being lonely! Solitary animals show more signs of STRESS than those in a group - Daily Mail", "description": "Researchers from the University of Turku studied Asian elephants in Myanmar to assess whether sociality is linked to stress in the animals.", "url": "https://www.dailymail.co.uk/sciencetech/article-10627897/Even-elephants-hate-lonely-Solitary-animals-signs-STRESS-group.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/18/15/55520523-0-image-a-183_1647617151941.jpg", "publishedAt": "2022-03-18T15:36:08Z", "content": "From anxiety to depression, loneliness is known to have a range of unpleasant symptoms in humans.\r\nAnd now a new study has shown that loneliness is just as problematic for elephants, who show more si… [+4885 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Electron powers a weak but significant bond for building complex structures: Chemists use elementary particle to catalyze molecular recognition - Science Daily", "description": "How do you bring together two molecules that positively repel each other? A research team has developed a simple and versatile solution: Introduce an electron with a jolt of electricity, and resistance between the two is reduced and a bond formed. This fundam…", "url": "https://www.sciencedaily.com/releases/2022/03/220318092136.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-18T15:01:34Z", "content": "How do you bring together two molecules that positively repel each other? A Northwestern University-led research team has developed a simple and versatile solution: Introduce an electron with a jolt … [+4346 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Spots Giant Debris Cloud Created by Clashing Celestial Bodies - NASA", "description": "Major smashups between rocky bodies shaped our solar system. Observations of a similar crash give clues about how frequent these events are around other stars.", "url": "https://www.nasa.gov/feature/jpl/nasa-spots-giant-debris-cloud-created-by-clashing-celestial-bodies/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/pia25161_-_spitzer_collision_cloud.jpg", "publishedAt": "2022-03-18T15:00:12Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "Krishna Kakani", "title": "Scientists have created a fabric that can literally 'hear' your heartbeat - Times Now", "description": "“This fabric can imperceptibly interface with the human skin, enabling wearers to monitor their heart and respiratory condition in a comfortable, continuous, real-time, and long-term manner,” lead author of the study, MIT’s Wei Yan said in a statement,  Bette…", "url": "https://www.timesnownews.com/viral/scientists-create-fabric-that-can-literally-hear-your-heartbeat-article-90310539", "urlToImage": "https://static.tnn.in/thumb/msid-90310539,imgsize-100,width-1280,height-720,resizemode-75/90310539.jpg", "publishedAt": "2022-03-18T14:04:00Z", "content": "Woven into a fabric, the specialised fibre creates electric signals when bent | Image courtesy: Fink Lab/MIT, Elizabeth Meiklejohn/RISD, Greg Hren"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Simran Srivastav", "title": "What is Worm Moon and why it is called the last Full Moon of Winter 2022? All you need to know - Jagran English", "description": "The last full moon of the winter  Worm Moon  will appear brighter from Wednesday evening  March 16  to Saturday morning  March 19   It will mark the beginning of the spring", "url": "https://english.jagran.com/trending/what-is-worm-moon-and-why-it-is-called-the-last-full-moon-of-winter-2022-all-you-need-to-know-10040875", "urlToImage": "https://imgeng.jagran.com/images/2022/mar/Wormmoon1647609511070.jpg", "publishedAt": "2022-03-18T13:05:26Z", "content": "New Delhi | Jagran Trending Desk: Marchs full moon will reach its peak on Friday. It will be the last full moon of the winter, and it will also mark the beginning of spring. The moon of March, also k… [+1856 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Hubble Sees the Eye of a Colorful Galaxy - NASA", "description": "This finely detailed Hubble image shows the heart of NGC 1097, a barred spiral galaxy that lies about 48 million light-years from Earth in the constellation Fornax.", "url": "https://www.nasa.gov/image-feature/goddard/2002/hubble-sees-the-eye-of-a-colorful-galaxy/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/hubble_ngc1079_potw2211a.jpg", "publishedAt": "2022-03-18T12:17:06Z", "content": null}, {"source": {"id": null, "name": "Republic World"}, "author": "Purnima Mishra", "title": "Orbital sunrise captured by International Space Station mesmerizes netizens; See pics - Republic World", "description": "Orbital Sunrise from the Pacific Ocean captured by ISS leaves netizens in amusement, pics go viral on Instagram in hours after being posted.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/orbital-sunrise-captured-by-international-space-station-mesmerizes-netizens-see-pics-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/uhadphup7a3knuuw_1647602958.jpeg", "publishedAt": "2022-03-18T11:45:00Z", "content": "The International Space Station is known for sharing outstanding photography featuring the outer space that leaves space enthusiasts pondering over the undiscovered layers of the universe, Earth incl… [+1670 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "As Artemis Rocket Rolls Out To Launchpad, NASA Offers Unique Opportunity - NDTV", "description": "NASA is giving people the opportunity to add their names to Artemis I, which will be included on a flash drive that will fly aboard the spacecraft.", "url": "https://www.ndtv.com/world-news/as-artemis-rocket-rolls-out-to-launchpad-nasa-offers-unique-opportunity-2830094", "urlToImage": "https://c.ndtvimg.com/2022-03/2gegsi2o_artemis-i_625x300_18_March_22.jpg", "publishedAt": "2022-03-18T10:31:31Z", "content": "NASA is giving people the opportunity to add their names to Artemis I\r\nNASA is giving people the opportunity to add their names to Artemis I, an unmanned flight test of an SLS rocket upon which the O… [+1578 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Himani Jha", "title": "Asteroid spotted JUST 2 hours before it HIT Earth; was speeding at a shocking 18 kmph - HT Tech", "description": "10ft wide Asteroid struck the Earth above Iceland last Friday on March 11. People reported heard a boom and saw a flash of light.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-spotted-just-2-hours-before-it-hit-earth-was-speeding-at-a-shocking-18-kmph-71647577687040.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/18/1600x900/ap10-22-2015-000010b_7593e088-797d-11e5-9d61-41ab8e878edd_1647578299082.jpg", "publishedAt": "2022-03-18T04:41:08Z", "content": "A small asteroid, half the size of a Giraffe, was spotted just two hours before it struck the Earth above Iceland last Friday on March 11. The space rock, dubbed as Asteroid 2022 EB5, was believed to… [+1887 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jayme Deloss", "title": "Atmospheric scientist explains complex climate research through animations - Phys.org", "description": "Climate scientist Elizabeth Barnes uses neural networks and explainable artificial intelligence to answer pressing questions about Earth's climate. These cutting-edge, machine-learning methods help unravel the complexity of the Earth system, but they can be d…", "url": "https://phys.org/news/2022-03-atmospheric-scientist-complex-climate-animations.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/3-climate.jpg", "publishedAt": "2022-03-17T15:10:08Z", "content": "Climate scientist Elizabeth Barnes uses neural networks and explainable artificial intelligence to answer pressing questions about Earth's climate. These cutting-edge, machine-learning methods help u… [+1925 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "New Technique Results in Cheaper, More Efficient Carbon Capture - AZoM", "description": "Scientists at the University of Colorado Boulder have discovered a new device that could contribute to more efficient and cheaper methods of extracting heat-trapping gases from the environment and transforming them to useful substances such as fuel or constru…", "url": "https://www.azom.com/news.aspx?newsID=58561", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_58561_16475179088232848.jpg", "publishedAt": "2022-03-17T14:15:00Z", "content": "Scientists at the University of Colorado Boulder have discovered a new device that could contribute to more efficient and cheaper methods of extracting heat-trapping gases from the environment and tr… [+4711 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Ancient ice reveals scores of gigantic volcanic eruptions: Study - The Siasat Daily", "description": "Copenhagen: New research led by the University of Copenhagen, Antarctica and Greenland has revealed gigantic volcanic eruptions during the last ice age. Sixty-nine of these were larger than any eruption in modern history. According to the physicists behind th…", "url": "https://www.siasat.com/ancient-ice-reveals-scores-of-gigantic-volcanic-eruptions-study-2292237/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/volcanic-_ANI.jpg", "publishedAt": "2022-03-17T13:52:00Z", "content": "Copenhagen: New research led by the University of Copenhagen, Antarctica and Greenland has revealed gigantic volcanic eruptions during the last ice age. Sixty-nine of these were larger than any erupt… [+4741 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "ESA's lunar caves exploration mission could launch in 2033: All you need to know - Devdiscourse", "description": "The mission is targeted to launch on an Ariane 6 in 2033 at the earliest and would use the European Large Logistic Lander (EL3) to reach the Moon's surface. The Marius Hills pit will be the mission's primary target.", "url": "https://www.devdiscourse.com/article/science-environment/1966216-esas-lunar-caves-exploration-mission-could-launch-in-2033-all-you-need-to-know", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/06_03_2019_15_29_08_3813668.jpg?width=920&format=jpeg", "publishedAt": "2022-03-17T12:43:40Z", "content": "The European Space Agency (ESA) recently gathered experts from many different areas of science and engineering to design a mission to explore and map lunar caves - one of the most fascinating frontie… [+1703 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Dodo genome is sequenced for the first time - raising hopes it could be brought back from extinction - Daily Mail", "description": "Professor Beth Shapiro, of the University of California, Santa Cruz, said her team would soon publish the complete DNA of the dodo specimen in the Natural History Museum of Copenhagen.", "url": "https://www.dailymail.co.uk/sciencetech/article-10622925/Dodo-genome-sequenced-time-raising-hopes-brought-extinction.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/17/11/55469781-0-image-a-14_1647514894460.jpg", "publishedAt": "2022-03-17T10:59:27Z", "content": "Hopes have been raised that the dodo could be brought back from extinction after scientists sequenced the bird's entire genome for the first time.\r\nThey spent years struggling to find well enough pre… [+9966 chars]"}, {"source": {"id": null, "name": "Southwestreviewnews.com"}, "author": "Izer", "title": "NASA's Mars Helicopter will continue to fly on the Red Planet - South West Review", "description": "NASA's innovative Mars helicopter will continue to fly at least through September. The small helicopter made a trip to Mars aboard the Perseverance Rover", "url": "https://www.southwestreviewnews.com/nasas-mars-helicopter-will-continue-to-fly-on-the-red-planet/", "urlToImage": null, "publishedAt": "2022-03-17T10:55:44Z", "content": "NASA’s innovative Mars helicopter will continue to fly at least through September. \r\nThe small helicopter made a trip to Mars aboard the Perseverance Rover in the summer of 2020 and landed on the cra… [+2018 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Rohitha Naraharisetty", "title": "Plants Can 'Warn' Their Neighbors of a Herbivore Attack - The Swaddle", "description": "\"The effective use of plants' natural survival strategies in production systems will bring us closer to the realization of a sustainable society.\"", "url": "https://theswaddle.com/plants-can-warn-their-neighbors-of-a-herbivore-attack/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/03/Plants_Editorial.jpg", "publishedAt": "2022-03-17T07:36:43Z", "content": "We’ve known and observed for a while how animals warn one another of imminent danger from predators. Researchers from the University of Tokyo have now found that plants, too, do a similar thing throu… [+2187 chars]"}, {"source": {"id": null, "name": "Americanbazaaronline.com"}, "author": "Arun Kumar", "title": "Indian-American astronaut Raja Chari takes first... - The American Bazaar", "description": "Chari is on a six-month science mission at ISS to demonstrate new technologies for NASA’s future Moon and Mars missions", "url": "https://www.americanbazaaronline.com/2022/03/17/indian-american-astronaut-raja-chari-takes-first-spacewalk-448956/", "urlToImage": "https://www.americanbazaaronline.com/wp-content/uploads/2017/06/Raja-Chari.jpg", "publishedAt": "2022-03-17T06:30:08Z", "content": "Raja Chari (Courtesy of twitter)\r\nChari is on a six-month science mission at ISS to demonstrate new technologies for NASAs future Moon and Mars missions\r\nIndian American astronaut Raja Chari took a 6… [+2480 chars]"}]}