{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Business Insider India"}, "author": "Morgan McFall-Johnsen", "title": "Telescope video shows part of the sun breaking off and forming a vortex, making scientists scratch their heads - Business Insider India", "description": "Video from a NASA telescope shows part of the sun breaking off and swirling around its north pole.A solar physicist called the polar vortex a scientific curiosity", "url": "https://www.businessinsider.in/science/news/telescope-video-shows-part-of-the-sun-breaking-off-and-forming-a-vortex-making-scientists-scratch-their-heads/articleshow/97811466.cms", "urlToImage": "https://www.businessinsider.in/photo/97811466/telescope-video-shows-part-of-the-sun-breaking-off-and-forming-a-vortex-making-scientists-scratch-their-heads.jpg?imgsize=47814", "publishedAt": "2023-02-10T22:05:00Z", "content": "A giant filament of plasma appears to have broken away from the sun and swirled around its north pole in a tornado-like vortex.\r\nNASA's Solar Dynamics Observatory captured the mysterious event on Feb… [+2107 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Washington University in St. Louis", "title": "Computer model IDs roles of individual genes in early embryonic development - Newswise", "description": "Computer software developed at Washington University School of Medicine in St. Louis can predict what happens to complex gene networks when individual genes are", "url": "https://www.newswise.com/articles/computer-model-ids-roles-of-individual-genes-in-early-embryonic-development", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-02-10T21:35:00Z", "content": "BYLINE: Julia Evangelou Strait \r\nNewswise — Computer software developed at Washington University School of Medicine in St. Louis can predict what happens to complex gene networks when individual gene… [+6428 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Opening day of 2023 has come and gone! | #SepangTest - MotoGP", "description": "Day 1 of 2023 is underway as the #MotoGP stars get their hands on their new machines! 🙌It was a full morning and afternoon of action so check out how the ri...", "url": "https://www.youtube.com/watch?v=lUueIUSD4t0", "urlToImage": "https://i.ytimg.com/vi/lUueIUSD4t0/maxresdefault.jpg", "publishedAt": "2023-02-10T20:00:13Z", "content": null}, {"source": {"id": null, "name": "TechSpot"}, "author": "Priya Walia", "title": "A new potentially habitable planet is discovered by scientists, but half of it is in perpetual darkness - TechSpot", "description": "When we analyzed the data of the star Wolf 1069, we discovered a clear, low-amplitude signal of what appears to be a planet of roughly Earth mass,...", "url": "https://www.techspot.com/news/97568-new-potentially-habitable-planet-discovered-scientists-but-half.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/02/2023-02-10-image-11.jpg", "publishedAt": "2023-02-10T19:22:00Z", "content": "Why it matters: A team of international astronomers announced the discovery of an exoplanet that is both eerily similar and close to Earth on a galactic scale. The newly discovered planet Wolf 1069b … [+2158 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Evidence that deep-sea black carbon comes from hydrothermal vents - Phys.org", "description": "Hydrothermal vents have been identified as a previously undiscovered source of dissolved black carbon in the oceans, furthering our understanding of the role of oceans as a carbon sink.", "url": "https://phys.org/news/2023-02-evidence-deep-sea-black-carbon-hydrothermal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/deep-sea-black-carbon-1.jpg", "publishedAt": "2023-02-10T19:00:03Z", "content": "Hydrothermal vents have been identified as a previously undiscovered source of dissolved black carbon in the oceans, furthering our understanding of the role of oceans as a carbon sink.\r\nThe ocean is… [+2835 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A sulfide-sensor and a sulfane sulfur-sensor collectively regulate sulfur-oxidation for feather degradation by Bacillus licheniformis | Communications Biology - Nature.com", "description": "The feather-degrading bacterium Bacillus licheniformis MW3 contains a sulfur-metabolizing gene cluster, in which one sulfide-sensor and one sulfane sulfur-sensor synergistically control gene expression, enabling the bacterium to grow on bird feathers.", "url": "https://www.nature.com/articles/s42003-023-04538-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs42003-023-04538-2/MediaObjects/42003_2023_4538_Fig1_HTML.png", "publishedAt": "2023-02-10T18:29:09Z", "content": "Bacterial strains, plasmids, culture media, and chemicals\r\nThe bacterial strains and plasmids used in this study are listed in Supplementary Data 2. The used oligonucleotides and their usages are lis… [+17167 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Nicola Davis", "title": "Goffin’s cockatoos able to use toolset to complete tasks - The Guardian", "description": "Parrot can figure out how to use a tool, pick the most suitable one and even transport a set together", "url": "https://www.theguardian.com/science/2023/feb/10/goffins-cockatoos-use-toolset-complete-tasks", "urlToImage": "https://i.guim.co.uk/img/media/bd789a4de80008ae60fb6777fae3c181d341a530/0_106_2216_1331/master/2216.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=72c9640b516fa11e21855df07543c1bd", "publishedAt": "2023-02-10T18:06:00Z", "content": "They might not have a toolbox or even a fancy belt, but it appears Goffins cockatoos are the Handy Andy of the bird world. Researchers have revealed the parrots are able to figure out how to use sets… [+3999 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Spotting faint dwarf galaxy Donatiello II - Phys.org", "description": "Right in the middle of this image, nestled among a smattering of distant stars and even more distant galaxies, lies the newly discovered dwarf galaxy known as Donatiello II. If you cannot quite distinguish the clump of faint stars that is all we can see of Do…", "url": "https://phys.org/news/2023-02-faint-dwarf-galaxy-donatiello-ii.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/esacan-you-spot-it.jpg", "publishedAt": "2023-02-10T17:46:02Z", "content": "Right in the middle of this image, nestled among a smattering of distant stars and even more distant galaxies, lies the newly discovered dwarf galaxy known as Donatiello II. If you cannot quite disti… [+2382 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Tracing the origin of life: A new discovery provides insights into the origin of life - Science Daily", "description": "A team of scientists has discovered a new abiotic pathway for the formation of peptide chains from amino acids -- a key chemical step in the origin of life. The current study provides strong evidence that this crucial step for the emergence of life can indeed…", "url": "https://www.sciencedaily.com/releases/2023/02/230210115508.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-02-10T17:41:50Z", "content": "The origin of life is one of the great questions of humankind. One of the prerequisites for the emergence of life is the abiotic -- not by living beings caused chemical -- production and polymerizati… [+1899 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Advantages of a New Preparation of Parthenolide | IJN - Dove Medical Press", "description": "Intestinal barrier dysfunction is an important complication of sepsis, while the treatment is limited.", "url": "https://www.dovepress.com/nano-parthenolide-improves-intestinal-barrier-function-of-sepsis-by-in-peer-reviewed-fulltext-article-IJN", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-02-10T17:33:26Z", "content": "Introduction\r\nSepsis refers to life-threatening organ dysfunction caused by the imbalance of the body’s response to infection. It is a typical critical illness in Intensive Care Unit (ICU) with high … [+52262 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "How fingerprints get their unique whorls - Phys.org", "description": "An international team of scientists with a myriad of backgrounds has revealed the process by which unique fingerprints develop. In their research, published open access in the journal Cell, the group studied the development of fingerprints in mice and humans.", "url": "https://phys.org/news/2023-02-fingerprints-unique-whorls.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/how-fingerprints-get-t.jpg", "publishedAt": "2023-02-10T17:30:01Z", "content": "An international team of scientists with a myriad of backgrounds has revealed the process by which unique fingerprints develop. In their research, published open access in the journal Cell, the group… [+2517 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "James Webb telescope finds Milky Way's long-lost twin 9 billion years in the past - Livescience.com", "description": "The light from the distant Sparkler galaxy was spotted in Webb's First Deep Field and could teach us how our own Milky Way devoured other galaxies to grow.", "url": "https://www.livescience.com/james-webb-finds-milky-ways-long-lost-twin-9-billion-years-in-the-past", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Py3Gj8YHGjPH9PmMCidarR-1200-80.jpeg", "publishedAt": "2023-02-10T17:20:04Z", "content": "A sparkling cannibal galaxy discovered by the James Webb Space Telescope appears to be a \"very early\" mirror image of the Milky Way, and it could help astronomers understand how our galaxy took shape… [+3513 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA needs your help to find asteroids with comet-like tails - Devdiscourse", "description": "Read more about NASA needs your help to find asteroids with comet-like tails on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2351051-nasa-needs-your-help-to-find-asteroids-with-comet-like-tails", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_02_2023_22_41_31_9309512.jfif?width=920&format=jpeg", "publishedAt": "2023-02-10T17:13:26Z", "content": "NASA is inviting members of the public to help it find active asteroids - asteroids with comet-like activity such as tails or dust clouds. These enigmatic objects are still not well understood becaus… [+1711 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "Inflatable Space Habitats Use Sensors Embedded in Webbing for Structural Health Monitoring - AZoSensors", "description": "Future human space exploration requires a safe living environment for astronauts. That is why a robust structural health monitoring (SHM) process is imperative to ensure equipment safety, particularly for the inflatable habitat structures that are the most co…", "url": "https://www.azosensors.com/news.aspx?newsID=15359", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/news/ImageForNews_15359_16760469684568283.jpg", "publishedAt": "2023-02-10T16:37:00Z", "content": "Future human space exploration requires a safe living environment for astronauts. That is why a robust structural health monitoring (SHM) process is imperative to ensure equipment safety, particularl… [+9831 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Thermal Imaging Lets Researchers See Beyond the Surface of Butterfly Wings - AZoOptics", "description": "It turns out that butterflies are just as striking in thermal as they are in the visible light spectrum. According to a study published in Nature by researchers from Columbia Engineering and Harvard University, it's possible to examine the thermodynamic prope…", "url": "https://www.azooptics.com/News.aspx?newsID=28196", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_28196_16760465491081489.jpg", "publishedAt": "2023-02-10T16:32:00Z", "content": "It turns out that butterflies are just as striking in thermal as they are in the visible light spectrum. According to a study published in Nature by researchers from Columbia Engineering and Harvard … [+6616 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Colorimetry characteristics and color contribution of fluorescence in natural Cr-containing spinel | Scientific Reports - Nature.com", "description": "Scientific Reports - Colorimetry characteristics and color contribution of fluorescence in natural Cr-containing spinel", "url": "https://www.nature.com/articles/s41598-023-29675-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-29675-w/MediaObjects/41598_2023_29675_Fig1_HTML.png", "publishedAt": "2023-02-10T16:01:54Z", "content": "Chemical analysis\r\nSpinel has a large group of varieties according to its composition. The chemical compositions of the spinel samples were measured using both EMP and LA-ICP-MS methods. The results … [+12168 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Laurence Tognetti", "title": "'PneumoPlanet' inflatable moon habitat could house 32 astronauts - Space.com", "description": "Humanity is going back to the moon to stay — and we might have a way to live there long-term.", "url": "https://www.space.com/pneumoplanet-inflatable-moon-habitat-concept", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8b2CaAKocFh9YAPyUjHx7f-1200-80.png", "publishedAt": "2023-02-10T16:00:12Z", "content": "Recently, NASA established potential landing sites near the south pole of the moon for upcoming crewed missions of its Artemis program. But how will astronauts survive and thrive in the harsh lunar e… [+4711 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Distinguishing Between NCS-Sensitized and Molecular-Sensitized TTA-UC - AZoNano", "description": "Due to their easy bandgap tunability and low inter-system crossing loss, semiconductor nanocrystals (NCs) offer tremendous potential as sensitizers for triplet-triplet annihilation up-conversion (TTA-UC).", "url": "https://www.azonano.com/news.aspx?newsID=40051", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_40051_16760414064607620.jpg", "publishedAt": "2023-02-10T15:20:00Z", "content": "Due to their easy bandgap tunability and low inter-system crossing loss, semiconductor nanocrystals (NCs) offer tremendous potential as sensitizers for triplet-triplet annihilation up-conversion (TTA… [+2535 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Invites Public to Virtually Share in Excitement of Crew Launch - NASA", "description": "The public is invited to take part in virtual activities and events ahead of the launch of NASA’s SpaceX Crew-6 mission to the International Space Station. Liftoff is targeted for 2:07 a.m. EST Sunday, Feb. 26, from Launch Complex 39A at NASA’s Kennedy Space …", "url": "https://www.nasa.gov/feature/nasa-invites-public-to-virtually-share-in-excitement-of-crew-launch/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/52408625787_b1a01ac35f_k.jpg", "publishedAt": "2023-02-10T14:42:55Z", "content": null}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "New Inteleos Study Explores How Data Science Can Help Virtual Reality Enhance Medical Imaging Education and Assessment - IT News Online", "description": "New Inteleos Study Explores How Data Science Can Help Virtual Reality Enhance Medical Imaging Education and Assessment", "url": "http://www.itnewsonline.com/PRNewswire/New-Inteleos-Study-Explores-How-Data-Science-Can-Help-Virtual-Reality-Enhance-Medical-Imaging-Education-and-Assessment/903276", "urlToImage": null, "publishedAt": "2023-02-10T14:32:30Z", "content": "<table><tr><td>New Inteleos Study Explores How Data Science Can Help Virtual Reality Enhance Medical Imaging Education and AssessmentCopyright 2022 PR Newswire. All Rights Reserved2023-02-10</td></tr… [+4545 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Kimberly M. S. Cartier", "title": "Starry Nights Are Disappearing - Eos", "description": "Stars dim as the sky gets brighter, a result of expanding cities and bright LEDs. Simple low-tech changes can help preserve dark night skies.", "url": "http://eos.org/articles/starry-nights-are-disappearing", "urlToImage": "https://eos.org/wp-content/uploads/2023/02/skyglow-rural-suburbs-cities-globe-at-night.png", "publishedAt": "2023-02-10T13:59:22Z", "content": "The Sun goes down. The stars come out. And so do the artificial lights. Thats a huge problem for scientists and ecosystems and stargazers that depend on a dark nighttime sky.\r\nA new study evaluated h… [+6511 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Scientists detect molten rock layer hidden under Earth’s tectonic plates - Times of India", "description": "Scientists have discovered a new layer of partly molten rock under the Earth's crust that might help settle a long-standing debate about how tectonic plates move. Researchers had previously identified patches of melt at a similar depth. But a new stu>", "url": "https://timesofindia.indiatimes.com/videos/news/scientists-detect-molten-rock-layer-hidden-under-earths-tectonic-plates/videoshow/97804624.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-97804624,imgsize-3378899.cms", "publishedAt": "2023-02-10T13:26:51Z", "content": "Feb 10, 2023, 06:56PM ISTSource: ANIScientists have discovered a new layer of partly molten rock under the Earth's crust that might help settle a long-standing debate about how tectonic plates move. … [+582 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Zhejiang University Research Make Label-free Super-resolution Approach To Imaging Living Cells - India Education Diary", "description": "It is human nature to seek higher resolution to zoom in on a photo that interests us. However, this magnification is far from infinite, and our curiosity may be demotivated by a blurred pixel point that cannot be resolved more clearly. Unfortunately,", "url": "https://indiaeducationdiary.in/zhejiang-university-research-make-label-free-super-resolution-approach-to-imaging-living-cells/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/12/1200px-Zhejiang_University_Logo.svg_.png?fit=1024%2C1024&ssl=1", "publishedAt": "2023-02-10T13:17:15Z", "content": "It is human nature to seek higher resolution to zoom in on a photo that interests us. However, this magnification is far from infinite, and our curiosity may be demotivated by a blurred pixel point t… [+5166 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "NASA astronauts could hibernate on deep space missions thanks to arctic squirrels - Space.com", "description": "The state of hibernation is much more than just sleep.", "url": "https://www.space.com/squirrel-hibernation-research-may-help-future-astronauts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pENbCjMRce9SebteGdbFuN-1200-80.jpg", "publishedAt": "2023-02-10T13:00:00Z", "content": "Researchers are studying hibernating Arctic ground squirrels with the goal of harnessing the benefits of this odd natural state to protect astronauts' health on long-duration space missions.\r\nHiberna… [+2774 chars]"}, {"source": {"id": null, "name": "Www.epw.in"}, "author": null, "title": "COvid-19 and Female Unpaid Labour | Economic and Political Weekly - Economic and Political Weekly", "description": "The Covid-19 pandemic and the associated lockdowns have added to the unpaid household labour for women. However, to what extent is this event unique in doing so? In this article, we try to place the impact of the pandemic in the broader dynamics of household …", "url": "https://www.epw.in/journal/2023/6/commentary/covid-19-and-female-unpaid-labour.html", "urlToImage": "http://www.epw.in/sites/default/files/epw-logo.png", "publishedAt": "2023-02-10T12:21:29Z", "content": "Consider the case of a young couple in their 30s, both engineering graduates and working in the software industry. Following are some excerpts from an interaction with the wife, one of the many worki… [+418 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Jannat Un Nisa", "title": "Astronomers Have Pinpointed The Mysterious ‘Engine’ Of A Super-Powerful Intergalactic Light - Wonderful Engineering", "description": "Advertisement Astronomers have pinpointed the precise position of a massive energy source hundreds of millions of light years away, behind a bright me", "url": "https://wonderfulengineering.com/astronomers-have-pinpointed-the-mysterious-engine-of-a-super-powerful-intergalactic-light/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2023/02/image-78.png", "publishedAt": "2023-02-10T11:02:07Z", "content": "Astronomers have pinpointed the precise position of a massive energy source hundreds of millions of light years away, behind a bright merging galaxy.\r\nAccording to astronomers from Hiroshima Universi… [+2430 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Dressed jeff-1/2 objects in mixed-valence lacunar spinel molybdates | Scientific Reports - Nature.com", "description": "Scientific Reports - Dressed jeff-1/2 objects in mixed-valence lacunar spinel molybdates", "url": "https://www.nature.com/articles/s41598-023-28656-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-28656-3/MediaObjects/41598_2023_28656_Fig1_HTML.png", "publishedAt": "2023-02-10T10:51:18Z", "content": "High-temperature electronic structure, dressed jeff=1/2 states\r\nSpinels are generically described by the chemical formula AM2X4. The M sites define a pyrochlore lattice, each of those ions being enca… [+14578 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Reply to: Available data do not rule out Ctenophora as the sister group to all other Metazoa - Nature.com", "description": "Nature Communications - Reply to: Available data do not rule out Ctenophora as the sister group to all other Metazoa", "url": "https://www.nature.com/articles/s41467-023-36152-5", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-023-36152-5/MediaObjects/41467_2023_36152_Fig1_HTML.png", "publishedAt": "2023-02-10T10:17:04Z", "content": "replying to N. V. Whelan &amp; K. M. Halanych Nature Communicationshttps://doi.org/10.1038/s41467-023-36151-6 (2023)\r\nIn Redmond and McLysaght1 (R&amp;M) we integrated precomputed site-heterogeneous … [+13533 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Astronomers detected a strange molecular bubble-outflow structure in space - Tech Explorist", "description": "They identified a new molecular bubble in the carbon monoxide signal from both telescopes.", "url": "https://www.techexplorist.com/strange-molecular-bubble-outflow-structure-space/56846/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/molecular-bubble.jpg", "publishedAt": "2023-02-10T10:11:29Z", "content": "As a result of stellar feedback, star formation can result in bubbles and outflows. Outflows and bubbles affect the molecular cloud’s overall energy balance by infusing momentum and energy into the i… [+1960 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top NASA Astronomy Pictures of the week: Nebulae to Comet ZTF, check them all - HT Tech", "description": "NASA publishes its Astronomy Picture of the Day on a daily basis where pictures of stars, galaxies, planets, black holes and other celestial objects are shared. This week's pictures included Nebulae, Nacreous Clouds, Comet ZTF and more. So, check out the Top …", "url": "https://tech.hindustantimes.com/photos/top-nasa-astronomy-pictures-of-the-week-nebulae-to-comet-ztf-check-them-all-71676021105222.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/10/1600x900/nebula_1676021428819_1676021452107_1676021452107.jpg", "publishedAt": "2023-02-10T09:29:28Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 10 February 2023: Awesome! Comet ZTF meets Comet ATLAS - HT Tech", "description": "NASA’s Astronomy Picture of the Day is a breathtaking picture of Comet ZTF as it passes Comet ATLAS near the constellation Auriga.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-10-february-2023-awesome-comet-ztf-meets-comet-atlas-71676020956797.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/10/1600x900/comet_1676021020137_1676021027174_1676021027174.jpg", "publishedAt": "2023-02-10T09:24:19Z", "content": "The Green Comet ZTF passed Earth at its closest distance on February 1 and it was seen by astronomers and sky-watchers alike all over the world. Comets are of interest to scientists because they are … [+2192 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Tianwen-1 mission marks second full year in Mars’ orbit, with more notable finds expected - Global Times", "description": "Friday marks the second anniversary since China's independent Tianwen-1 orbiter and rover entered Mars orbit, kicking off an amazing treasure-hunt journey focused on the Red Planet. Over the past two years, Tianwen-1 has obtained first-hand detection data and…", "url": "https://www.globaltimes.cn/page/202302/1285211.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2020/2020-09-18/df7e8014-84a4-4be4-83d6-277b48ad7ac3_s.jpeg", "publishedAt": "2023-02-10T09:24:00Z", "content": "Tianwen Mars Rover Photo:VCG\r\nFriday marks the second anniversary since China's independent Tianwen-1 orbiter and rover entered Mars orbit, kicking off an amazing treasure-hunt journey focused on the… [+2723 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Earth from Space: Swedish landscape - European Space Agency", "description": "Agricultural fields that surround the cities of Lund and Malmö in Sweden are pictured in this image, captured by the Copernicus Sentinel-2 mission.", "url": "https://www.esa.int/ESA_Multimedia/Images/2023/02/Earth_from_Space_Swedish_landscape", "urlToImage": null, "publishedAt": "2023-02-10T09:06:10Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Giant Asteroid to hit Earth's Atmosphere; Find out when will It happen - Economic Times", "description": "The asteroid, 199145 (2005 YY128), has a diameter of about a kilometre and is classified as a near-Earth object.", "url": "https://economictimes.indiatimes.com/news/new-updates/giant-asteroid-to-hit-earths-atmosphere-find-out-when-will-it-happen/articleshow/97797292.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97797309,width-1070,height-580,imgsize-14896,overlay-economictimes/photo.jpg", "publishedAt": "2023-02-10T09:03:00Z", "content": "NASA scientists are tracking a massive asteroid that is just days away from entering Earth's orbit. The asteroid, 199145 (2005 YY128), has a diameter of about a kilometre and is classified as a near-… [+2381 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Ring system around dwarf planet on the edge of Solar System discovered - The Week", "description": "Ring systems are relatively rare in the Solar System", "url": "https://www.theweek.in/news/sci-tech/2023/02/10/ring-system-around-dwarf-planet-on-the-edge-of-solar-system-disc.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2022/images/2022/12/21/Illustration-Quaoar-its-newly-discovered-ring-moon-Weywot.jpg", "publishedAt": "2023-02-10T09:02:41Z", "content": "Scientists have discovered a new ring system around a dwarf planet on the edge of the Solar System, according to a new study.\r\nAccording to the study, the ring system is around a dwarf planet, named … [+2660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Portugal, Egypt And Abu Dhabi: Pictures of Earth Captured From ISS Go Viral - NDTV", "description": "Views of Earth are captured from the unique vantage point of the International Space Station as it orbited about 254 miles (409 km) above.", "url": "https://www.ndtv.com/feature/portugal-egypt-and-abu-dhabi-pictures-of-earth-captured-from-iss-go-viral-3770335", "urlToImage": "https://c.ndtvimg.com/2023-02/i263jf88_amazing-earth-photos-by-japanese-astronaut-koichi-wakata_625x300_10_February_23.jpg", "publishedAt": "2023-02-10T08:33:00Z", "content": "Amazing Earth Photos by Japanese Astronaut Koichi Wakata\r\nThe idea of viewing Earth from space intrigues ordinary people. With his photography from the International Space Station, Flight Engineer Ko… [+1522 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Luke Hurst", "title": "Making heads spin: Scientists say Earth’s inner core has changed its rotation - Euronews", "description": "The Earth’s core lies thousands of kilometres below us, and much about it still remains a mystery.", "url": "https://www.euronews.com/next/2023/02/10/making-heads-spin-scientists-say-earths-inner-core-has-changed-its-rotation", "urlToImage": "https://static.euronews.com/articles/stories/07/33/31/32/1000x563_cmsv2_ae0ad8d0-55fd-52c1-be2e-8f632f819562-7333132.jpg", "publishedAt": "2023-02-10T07:48:49Z", "content": "The Earths core may have stopped spinning, or may even now be spinning backwards, according to a new study.\r\nThe core of our planet is made up of an outer layer of liquid metal, and an inner core of … [+3196 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Earthquakes' 'Long-Term Memory' Helps Devise Method to Predict Major Quakes | Weather.com - The Weather Channel", "description": "Sometimes, large earthquakes occur over relatively short time frames, and then we have long periods when nothing happens. The traditional prediction models can't handle this behaviour.", "url": "https://weather.com/en-IN/india/science/news/2023-02-10-earthquakes-long-term-memory-helps-devise-method-to-predict-major", "urlToImage": "https://s.w-x.co/in-Earthquake_Turkey_0.jpg", "publishedAt": "2023-02-10T07:41:15Z", "content": "There is something poetically ironic and betrayal-like about the fact that our homes feel like the safest havens to return to after stressful days where you can experience such solemn warmth and unde… [+3015 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Compelling evidence of mass migration of stars into our neigbouring galaxy - Devdiscourse", "description": "Read more about Compelling evidence of mass migration of stars into our neigbouring galaxy on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2350101-compelling-evidence-of-mass-migration-of-stars-into-our-neigbouring-galaxy", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_06_2022_15_58_59_5055785.jpg?width=920&format=jpeg", "publishedAt": "2023-02-10T07:39:25Z", "content": "An international team of astronomers have found compelling evidence of a mass migration of stars into the Andromeda galaxy - our nearest intergalactic neighbour.\r\nLed by astronomers at NSF's NOIRLab,… [+1716 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists made a groundbreaking discovery in the field of thermal radiation - Tech Explorist", "description": "A new method for generating spinning thermal radiation in a controlled and efficient manner.", "url": "https://www.techexplorist.com/scientists-groundbreaking-discovery-field-thermal-radiation/56835/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/Thermal-Image-of-Wabash-River.jpg", "publishedAt": "2023-02-10T07:30:26Z", "content": "Thermal radiation is typically regarded as an incoherent signal since it results from the random fluctuations of materials. Circular polarization in the heat released by most typical thermal emitters… [+2404 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Hubble picks up mysterious spokes on Saturn in spectacular new images - India Today", "description": "Scientists are yet to fully understand the cause of the spokes and their season variability. The features can appear dark or light.", "url": "https://www.indiatoday.in/science/story/hubble-picks-up-mysterious-spokes-on-saturn-in-spectacular-new-images-2333007-2023-02-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202302/saturns-sixteen_nine.jpg?VersionId=nGTIjs13_wE2zrakX7MtABdGKC9UpAQ9", "publishedAt": "2023-02-10T07:16:40Z", "content": "By India Today Web Desk: The Hubble space telescope has beamed back new images from the depth of our Solar System revealing a new spoke season on Saturn. The ringed planet is in the midst of the star… [+2290 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm WARNING for Earth today; High chances of solar flare eruption, says NOAA - HT Tech", "description": "NOAA has issued a warning for high chances of solar flare eruption. A powerful solar storm can hit the Earth today. Check details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-warning-for-earth-today-high-chances-of-solar-flare-eruption-says-noaa-71676012245952.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/10/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1676012290707_1676012290707.jpg", "publishedAt": "2023-02-10T07:06:06Z", "content": "On Thursday, a concerning development was seen on the Sun where two different sunspots, both unstable, appeared on the Earth-facing side of the Sun. Now, the National Oceanic and Atmospheric Administ… [+2569 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "ESA Shares Painting-Like Satellite Image of Kolkata | Weather.com - The Weather Channel", "description": "We can see the Hooghly River cutting through the city, and different shades of brown and blue in the water are likely due to the high concentration of sediments.", "url": "https://weather.com/en-IN/india/space/news/2023-02-10-esa-shares-painting-like-satellite-image-of-kolkata", "urlToImage": "https://s.w-x.co/in-kolkata_esa.jpg", "publishedAt": "2023-02-10T07:04:55Z", "content": "Kolkata, or the City of Joy, brims with art and artists, and its architecture really appeals to our sense of aesthetic. And while it is easy to appreciate these things as one takes a walk through the… [+1654 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mars' Watery Past: NASA's Curiosity Rover Makes A Stunning New Discovery - NDTV", "description": "After more than ten years on Mars, the Curiosity rover is still operating normally and discovering facts that contradict earlier theories.", "url": "https://www.ndtv.com/feature/mars-watery-past-nasas-curiosity-rover-makes-a-stunning-new-discovery-3770144", "urlToImage": "https://c.ndtvimg.com/2023-02/moqsg23o_nasa-curiosity-rover_625x300_10_February_23.jpg", "publishedAt": "2023-02-10T07:04:29Z", "content": "NASA Curiosity rover discovered unexpected hints about Mars' watery past.\r\nNASA's Curiosity rover, which has been exploring the Martian surface, has discovered evidence that lakes once existed in an … [+1625 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious Dark Galaxy Emits No Visible Light, Scientists Say - ScienceAlert", "description": "Galaxies come in many different shapes and sizes, but the basic ingredients seem fairly consistent.", "url": "https://www.sciencealert.com/mysterious-dark-galaxy-emits-no-visible-light-scientists-say", "urlToImage": "https://www.sciencealert.com/images/2023/02/inverted_NGC4414.jpg", "publishedAt": "2023-02-10T05:21:14Z", "content": "Galaxies come in many different shapes and sizes, but the basic ingredients seem fairly consistent. There's usually a big black hole at the center, a bunch of stars and gas, and a generous serving of… [+5248 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Making molecules faster: Discovery dramatically reduces time it takes to build molecules - Chemie.de", "description": "With a big assist from artificial intelligence and a heavy dose of human touch, Tim Cernak's lab at the University of Michigan made a discovery that dramatically speeds up the time-consuming chemi ...", "url": "https://www.chemeurope.com/en/news/1179488/making-molecules-faster-discovery-dramatically-reduces-time-it-takes-to-build-molecules.html", "urlToImage": "https://img.chemie.de/Portal/News/63e4a89fc0fef_i5icHdoG6.png?tr=w-1024,h-768,cm-extract,x-0,y-194:n-xzoom", "publishedAt": "2023-02-10T04:58:58Z", "content": "With a big assist from artificial intelligence and a heavy dose of human touch, Tim Cernak's lab at the University of Michigan made a discovery that dramatically speeds up the time-consuming chemical… [+2132 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Astronomers find out why black holes twinkle - EastMojo", "description": "Black holes are bizarre things, even by the standards of astronomers. Their mass is so great, it bends space around them so tightly that nothing can", "url": "http://www.eastmojo.com/science-tech/2023/02/10/astronomers-find-out-why-black-holes-twinkle/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/11/NASA.jpg?fit=1571%2C1173&ssl=1", "publishedAt": "2023-02-10T03:50:00Z", "content": "Black holes are bizarre things, even by the standards of astronomers. Their mass is so great, it bends space around them so tightly that nothing can escape, even light itself.\r\nAnd yet, despite their… [+5717 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Space to Ground: Multifaceted Module: Feb. 10, 2023 - NASA Johnson", "description": "NASA's Space to Ground is your weekly update on what's happening aboard the International Space Station. Got a question or comment? Use #AskNASA to talk to u...", "url": "https://www.youtube.com/watch?v=UeD7TW7vC5c", "urlToImage": "https://i.ytimg.com/vi/UeD7TW7vC5c/maxresdefault.jpg", "publishedAt": "2023-02-10T02:48:31Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "HETDEX reveals galaxy gold mine in first large survey - EurekAlert", "description": "The Hobby-Eberly Telescope Dark Energy Experiment (HETDEX) announced their first publicly released catalog of astronomical objects. Over 200,000 astronomical objects including distant stars and galaxies have been mapped in 3D for the first time. Astronomers w…", "url": "https://www.eurekalert.org/news-releases/979167", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/5506d6ac-71c0-49fd-a0cd-c0d6a05cdd17/Rendition/thumbnail/Content/Public", "publishedAt": "2023-02-10T02:00:07Z", "content": "image: The Hobby-Eberly Telescope Dark Energy Experiment (HETDEX) announced their first publicly released catalog mapping over 200,000 astronomical objects, which include distant stars and galaxies b… [+7421 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Fossil discovery reveals complex ecosystems existed on Earth much earlier than previously thought - Phys.org", "description": "About 250 million years ago, the Permian-Triassic mass extinction killed over 80% of the planet's species. In the aftermath, scientists believe that life on Earth was dominated by simple species for up to 10 million years before more complex ecosystems could …", "url": "https://phys.org/news/2023-02-fossil-discovery-reveals-complex-ecosystems.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/fossil-discovery-revea.jpg", "publishedAt": "2023-02-09T21:30:03Z", "content": "About 250 million years ago, the Permian-Triassic mass extinction killed over 80% of the planet's species. In the aftermath, scientists believe that life on Earth was dominated by simple species for … [+2599 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Here's what living on Mars would do to the human body - Daily Mail", "description": "NASA aims to send humans to Mars next decade, but SpaceX could do it even earlier. Here's what the first astronauts there will have to contend with.", "url": "https://www.dailymail.co.uk/sciencetech/article-11732099/Heres-living-Mars-human-body.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/09/16/65251177-0-image-a-3_1675958685159.jpg", "publishedAt": "2023-02-09T18:39:14Z", "content": "A new era of spaceflight has dawned with NASA's Artemis programme, which aims to establish a base camp on the moon and lay groundwork for a future trip to Mars.\r\nThe US space agency will send humans … [+13310 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "SKA Observatory (SKAO): A guide to the soon-to-be largest radio telescopes in the world - Space.com", "description": "The world's largest radio telescopes are being built in South Africa and Australia.", "url": "https://www.space.com/square-kilometre-array-observatory-skao", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SS69w5KaqtWjuYpoUEV8hg-1200-80.jpg", "publishedAt": "2023-02-09T18:00:31Z", "content": "The Square Kilometre Array Observatory (SKAO) will deliver the next generation of radio telescopes — vast arrays of radio dishes and antennas spanning two continents. \r\nOnce constructed, the SKA tele… [+15218 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Shipman", "title": "Make them thin enough, and antiferroelectric materials become ferroelectric - Phys.org", "description": "Antiferroelectric materials have electrical properties that make them advantageous for use in high-density energy storage applications. Researchers have now discovered a size threshold beyond which antiferroelectrics lose those properties, becoming ferroelect…", "url": "https://phys.org/news/2023-02-thin-antiferroelectric-materials-ferroelectric.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/make-them-thin-enough.jpg", "publishedAt": "2023-02-09T17:00:45Z", "content": "Antiferroelectric materials have electrical properties that make them advantageous for use in high-density energy storage applications. Researchers have now discovered a size threshold beyond which a… [+5733 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Non-invasive estimation of hemoglobin, bilirubin and oxygen saturation of neonates simultaneously using whole optical spectrum analysis at point of care | Scientific Reports - Nature.com", "description": "Scientific Reports - Non-invasive estimation of hemoglobin, bilirubin and oxygen saturation of neonates simultaneously using whole optical spectrum analysis at point of care", "url": "https://www.nature.com/articles/s41598-023-29041-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-29041-w/MediaObjects/41598_2023_29041_Fig1_HTML.png", "publishedAt": "2023-02-09T16:35:20Z", "content": "Hardware\r\nThe instrumental set up as shown in Fig. 1a has been designed based on the principle of diffused reflectance spectroscopy. The diffused reflectance spectroscopy (DRS) technique is based on … [+25524 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Gene regulation meets Bayesian non-parametrics - Nature.com", "description": "Inferring gene networks from discrete RNA counts across cells remains a complex problem. Following Bayesian non-parametrics, a computational framework is proposed to perform non-biased inference of transcription kinetics from single-cell RNA counting experime…", "url": "https://www.nature.com/articles/s43588-023-00405-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs43588-023-00405-6/MediaObjects/43588_2023_405_Fig1_HTML.png", "publishedAt": "2023-02-09T16:21:42Z", "content": "Inferring gene networks from discrete RNA counts across cells remains a complex problem. Following Bayesian non-parametrics, a computational framework is proposed to perform non-biased inference of t… [+2815 chars]"}, {"source": {"id": null, "name": "News.cn"}, "author": "", "title": "Russia launches cargo ship to int'l space station - Xinhua", "description": "", "url": "https://english.news.cn/20230209/997ed5d85dcc476599426b3daab51e2f/c.html", "urlToImage": null, "publishedAt": "2023-02-09T13:47:03Z", "content": "MOSCOW, Feb. 9 (Xinhua) -- Russia successfully launched the Progress MS-22 cargo spacecraft to the International Space Station (ISS) on Thursday, Russia's state space corporation Roscosmos said.\r\n Th… [+510 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "Amit Malewar", "title": "NASA will use a nuclear-powered flashlight to look for water on the moon - Inceptive Mind", "description": "A flashlight can be used to see in the dark regions of the moon.", "url": "https://www.inceptivemind.com/nasa-will-use-embercore-nuclear-powered-flashlight-look-water-moon/29564/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2023/02/embercore-flashlight.jpg", "publishedAt": "2023-02-09T13:11:38Z", "content": "There are many interesting places on the moon that scientists would like to explore in as much detail as possible. Unfortunately, it is often difficult to reach them – as the surrounding surface is t… [+2919 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "NASA Reveals Tiny Devices to Help Determine Solar Energy's Effect on Earth | Weather.com - The Weather Channel", "description": "Together, the two CubeSats represent a significant advancement in our understanding of the Earth Radiation Budget (ERB).", "url": "https://weather.com/en-IN/india/space/news/2023-02-09-tiny-devices-to-determine-solar-energys-effect-on-earth", "urlToImage": "https://s.w-x.co/in-SUN.jpg", "publishedAt": "2023-02-09T12:55:34Z", "content": "NASA has revealed two small instruments that will play a crucial role in powering significant scientific insights by measuring and studying the Earth's directed energy from the Sun.\r\nThe space agency… [+1816 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Exact magma locations could help with predicting volcanic eruptions - Tech Explorist", "description": "A way to better assess the risk of volcanic eruptions.", "url": "https://www.techexplorist.com/exact-magma-locations-help-predicting-volcanic-eruptions/56810/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/pexels-photo-9421297.jpeg", "publishedAt": "2023-02-09T12:22:47Z", "content": "One of the most important challenges in modern volcanology studies is constraining the depth of magmatic reservoirs that supply and sustain eruptions. However, commonly used methods such as mineral-m… [+2193 chars]"}, {"source": {"id": null, "name": "Advanced Science News"}, "author": "Andrey Feldman", "title": "How does classical physics arise from quantum mechanics? - Advanced Science News", "description": "Emergence of classicality states that a quantum description must be the same as its classical description, but this isn't always so...", "url": "https://www.advancedsciencenews.com/how-does-classical-physics-arise-from-quantum-mechanics/", "urlToImage": "https://www.advancedsciencenews.com/wp-content/uploads/2023/02/dynamic-wang-ERdTJQTtsbE-unsplash1.jpg", "publishedAt": "2023-02-09T11:33:36Z", "content": "Quantum physics is used to describe the properties of elementary particles and is generally considered a fundamental theory in nature. However, when we leave the subatomic world, objects are better d… [+5054 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "King's College London researchers develop new method for specialising and purifying human stem cells into interneurons - India Education Diary", "description": "Injury to the spinal cord often leads life changing disability, with decreased or complete loss of sensation and movement below the site of injury. From drugs to transplantation, there are many scientific advances aiming to restore function following", "url": "https://indiaeducationdiary.in/kings-college-london-researchers-develop-new-method-for-specialising-and-purifying-human-stem-cells-into-interneurons/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/06/1599206690133.jpg?fit=926%2C488&ssl=1", "publishedAt": "2023-02-09T09:33:45Z", "content": "Injury to the spinal cord often leads life changing disability, with decreased or complete loss of sensation and movement below the site of injury. From drugs to transplantation, there are many scien… [+2493 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "The Neanderthal hunting strategies in France were unaffected by changing climate - Tech Explorist", "description": "Evaluating the climatic impact on Neanderthal hunting techniques and strategies.", "url": "https://www.techexplorist.com/neanderthal-hunting-strategies-france-unaffected-by-changing-climate/56727/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/dental-molds.jpg", "publishedAt": "2023-02-09T08:05:32Z", "content": "Neanderthal is an extinct human species. The causes of its extinction are still debated today. Exploring the place of Homo neanderthalensis within their ecosystem allows us to understand their evolut… [+5208 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Fighting climate change: Ruthenium complexes for carbon dioxide reduction to valuable chemicals: A novel technology facilitates hydride transfer to carbon dioxide, converting it into formic acid at a high turnover number - Science Daily", "description": "Excessive use of fossil fuels leads to undesired carbon dioxide (CO2) generation, accelerating climate change. One way to tackle this is by converting CO2 into value-added chemicals. On this front, researchers have recently utilized a novel redox couple, for …", "url": "https://www.sciencedaily.com/releases/2023/02/230209094129.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-02-09T08:00:00Z", "content": "Climate change is a global environmental concern. A major contribution to climate change comes from excessive burning of fossil fuels. They produce carbon dioxide (CO2), a greenhouse gas responsible … [+3331 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Earliest formation of the galaxies revealed by James Webb Telescope - HT Tech", "description": "A recent study has revealed the earliest formation of galaxies in the universe, thanks to a stunning discovery by the James Webb Space Telescope.", "url": "https://tech.hindustantimes.com/tech/news/earliest-formation-of-the-galaxies-revealed-by-james-webb-telescope-71675927159754.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/09/1600x900/nasa_1675927229211_1675927235899_1675927235899.webp", "publishedAt": "2023-02-09T07:21:49Z", "content": "NASA's $10 billion space telescope, the James Webb Space Telescope (JWST), has been capturing breathtaking images of far-off galaxies, star clusters, black holes and more. The space telescope was lau… [+1984 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Photobombing Asteroid Unleashes Webb Telescope's True Potential! | Weather.com - The Weather Channel", "description": "When a research team tried to focus on an asteroid from the main belt between Mars and Jupiter for the calibration experiment, they discovered something was horribly off.", "url": "https://weather.com/en-IN/india/space/news/2023-02-09-photobombing-asteroid-unleashes-webb-telescopes-true-potential", "urlToImage": "https://s.w-x.co/in-asteroid_eros.jpg", "publishedAt": "2023-02-09T04:46:11Z", "content": "There are few things more annoying than returning home after a tiring trip, eagerly looking back at all the moments you captured on your camera, finding your 'that's her' picture only to find that ra… [+2356 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Srikanta Tripathy", "title": "‘Earliest organism’ fossil in MP turns out to be beehive - Times of India", "description": "Jaipur: About two years ago, a team of geologists led by a US Prof Gregory Ratllack discovered about 550-million-year-old fossil ‘Dickinsonia’ from th.", "url": "https://timesofindia.indiatimes.com/city/jaipur/earliest-organism-fossil-in-mp-turns-out-to-be-beehive/articleshow/97752856.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97752855,width-1070,height-580,imgsize-1243809,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-02-09T02:50:00Z", "content": ""}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Lyndon Nicholas", "title": "Scientists Find Hell Zone Under The Earth, Here's How Unbelievably Hot It Gets - Giant Freakin Robot", "description": "Scientists and theologians alike have debated what \"Hell on Earth\" might be, but this might be the closest thing yet.", "url": "https://www.giantfreakinrobot.com/sci/hell-zone-under-earth-unbelievably.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2023/02/tim-curry-legend-devil-demon-hell.jpg", "publishedAt": "2023-02-08T21:07:39Z", "content": "Scientists have found a new, incredibly hot \"Hell Zone\" layer of the Earth.\r\nBy Lyndon Nicholas\r\n| Updated 2 days ago\r\nPeople may have different definitions of Hell on Earth. Some might say its their… [+3606 chars]"}]}