{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Studying Underwater Snow on Earth Could Help Understand the Ice Shell of Jupiter's Moon, Europa: Researchers - The Weather Channel", "description": "Below Europa's thick icy crust is a massive, global ocean where the snow floats upwards onto inverted ice peaks and submerged ravines. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-08-16-underwater-snow-on-earth-gives-clues-about-europas-icy-shell", "urlToImage": "https://s.w-x.co/in-europa_1.jpg", "publishedAt": "2022-08-16T12:58:36Z", "content": "Studying bizarre underwater snow below ice shelves on Earth can help understand the ice shell of Jupiter's moon Europa, according to researchers.\r\nEuropa is a rocky world about the size of the Earth'… [+2719 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA's Artemis I mission will send yeast to deep space with BioSentinel - The Indian Express", "description": "NASA's BioSentinel will carry microorganisms to deep space to help scientists better understand the effects of deep space radiation on biological lifeforms.", "url": "https://indianexpress.com/article/technology/science/nasa-artemis-i-biosentinal-microscopic-lifeform-space-yeast-8093888/", "urlToImage": "https://images.indianexpress.com/2022/08/NASA-BioSentinel-Yeast-16082022.jpg", "publishedAt": "2022-08-16T12:55:00Z", "content": "While NASAs Artemis I mission is an uncrewed mission, there will be some living passengers on board. BioSentinel, a shoebox-sized CubeSat, will carry microorganismsin the form of yeastinto deep space… [+2219 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Tech Explorist", "title": "ESO’s telescope captured a spectacular cosmic dance - Tech Explorist", "description": "ESO’s Very Large Telescope (VLT) has imaged the result of a spectacular cosmic collision — the galaxy NGC 7727. This giant was born from the merger of two", "url": "https://www.techexplorist.com/eso-telescope-captured-spectacular-cosmic-dance/53109/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/NGC-7727s-spectacular-galactic-dance.jpg", "publishedAt": "2022-08-16T12:40:36Z", "content": "ESOs Very Large Telescope (VLT) has imaged the result of a spectacular cosmic collision the galaxy NGC 7727. This giant was born from the merger of two galaxies, an event that started around a billio… [+3418 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Louise Lerner", "title": "Black hole collisions could help us measure how fast the universe is expanding - Phys.org", "description": "A black hole is usually where information goes to disappear—but scientists may have found a trick to use its last moments to tell us about the history of the universe.", "url": "https://phys.org/news/2022-08-black-hole-collisions-fast-universe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/black-hole-collisions.jpg", "publishedAt": "2022-08-16T12:38:06Z", "content": "A black hole is usually where information goes to disappearbut scientists may have found a trick to use its last moments to tell us about the history of the universe.\r\nIn a new study published in Phy… [+5549 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "The Sun Will Die, Says European Space Agency Data, This is When it Will Happen - News18", "description": "Currently going through its middle age, the Sun is estimated to be 4.57 billion years, according to data from the European Space Agency’s Gaia spacecraft.", "url": "https://www.news18.com/news/buzz/the-sun-will-die-says-european-space-agency-data-this-is-when-it-will-happen-5761435.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/sun-166064854716x9.png", "publishedAt": "2022-08-16T12:00:08Z", "content": "Nothing in the world lasts forever and neither will our life and light-giving star Sun. Currently going through its middle age, the Sun is estimated to be 4.57 billion years, according to data from t… [+2391 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "NASA tracks asteroids flying by Earth today: Possibilities of clash? | Mint - Mint", "description": "According to the Centre for Near-Earth Object Studies (CNEOS) at NASA’s Jet Propulsion Laboratory, this asteroid is likely to pass by at 7.74 km/second (26,892 km/hour) which is roughly equal to 22 times the speed of sound.", "url": "https://www.livemint.com/technology/tech-news/nasa-track-asteroids-flying-by-earth-today-possibilities-of-clash-11660643369596.html", "urlToImage": "https://images.livemint.com/img/2022/08/16/600x338/asteroid_1645527972384_1660650360541_1660650360541.JPG", "publishedAt": "2022-08-16T11:47:10Z", "content": "According to NASAs asteroid tracker, an asteroid over twice the size of a dinosaur will have a close flyby on August 16, 2022. This asteroid which is designated 2022 PW is currently heading in the di… [+2176 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Mars InSight Lander Unexpectedly Finds Little to No Ice - ExtremeTech", "description": "Defying expectations, there is little to no ice in the top 300 meters under InSight.", "url": "https://www.extremetech.com/extreme/338840-mars-insight-lander-unexpectedly-finds-little-to-no-ice-below", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2020/03/Mars-Insight-Lander-640x360.jpg", "publishedAt": "2022-08-16T11:14:00Z", "content": "NASA didn’t get everything it wanted from the InSight Mars lander, but the mission still pioneered new types of science on the red planet. The mission is now in the rearview mirror, but planetary sci… [+2441 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "A new frontier in quantum science and technology - Tech Explorist", "description": "First work showing optical initialization and coherent control of nuclear spins in 2D materials.", "url": "https://www.techexplorist.com/new-frontier-quantum-science-technology/53102/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/atomic-scale-sensing.jpg", "publishedAt": "2022-08-16T11:02:01Z", "content": "Quantum technology depends on the qubit, built with an atom, subatomic particle, or photon. In an electron or nuclear spin qubit, the familiar binary “0” or “1” state of a classical computer bit is r… [+3062 chars]"}, {"source": {"id": null, "name": "World Economic Forum"}, "author": "Chris  Stokes, Guy  Paxman", "title": "How vulnerable are the world's ice sheets to climate change? - World Economic Forum", "description": "The eastern two-thirds of Antarctica is covered by an ice sheet with research showing the risks facing the sheet as a result of climate change.", "url": "https://www.weforum.org/agenda/2022/08/ice-sheet-antarctica-vulnerable-global-warming/", "urlToImage": "https://assets.weforum.org/editor/97yAHQ9MdgfWb9zopI416-283Y1dxq5QOR-KmWxGAbo.png", "publishedAt": "2022-08-16T11:00:00Z", "content": "License and Republishing\r\nWorld Economic Forum articles may be republished in accordance with the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License, and in acc… [+130 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Darth Vader of the Seas: Scientists Dig Out a New ‘Creepy Crawly’ Isopod Species from 2000 Feet Below the Gulf of Mexico - The Weather Channel", "description": "Scientists found a new species of an isopod belonging to the genus Bathonymus — commonly referred to as \"Darth Vader of the Seas\" due to the uncanny resemblance with the Star Wars character's helmet. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/biodiversity/news/2022-08-16-scientists-dig-out-a-new-isopod-species-from-2000-feet-below-the", "urlToImage": "https://s.w-x.co/in-isopod.jpg", "publishedAt": "2022-08-16T10:49:11Z", "content": "The world has always eyed the Gulf of Mexico for its bountiful reservoirs of natural gas, oil and even fossils of famous prehistoric dinosaurs like Ankylosaurus and T-rex. However, a treasure trove o… [+2305 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Japan's Hayabusa2 finds asteroids may have brought water to Earth - Times Now", "description": "Water and organic matter was brought to Earth by asteroids, finds Japan's Hayabusa2 space probe.", "url": "https://www.timesnownews.com/technology-science/japans-hayabusa2-finds-asteroids-may-have-brought-water-to-earth-article-93591227", "urlToImage": "https://static.tnn.in/thumb/msid-93591227,imgsize-100,width-1280,height-720,resizemode-75/93591227.jpg", "publishedAt": "2022-08-16T10:10:52Z", "content": "An emergency drought barrier that protects against saltwater intrusion, built by the California Department of Water Resources, stretches across the West False River in the Sacramento-San Joaquin Rive… [+242 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Using Bragg Edge Neutron Imaging for Mechanical Surface Treatments - AZoOptics", "description": "In a pre-proof article posted in Acta Materialia, researchers have proposed a novel method for applying Bragg edge neutron imaging to evaluate mechanical surface treatment by deducing lattice spacing distributions with the help of energy-resolved radiography.", "url": "https://www.azooptics.com/News.aspx?newsID=27788", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_27788_16606433074947816.jpg", "publishedAt": "2022-08-16T10:00:00Z", "content": "In a pre-proof article posted in Acta Materialia, researchers have proposed a novel method for applying Bragg edge neutron imaging to evaluate mechanical surface treatment by deducing lattice spacing… [+8029 chars]"}, {"source": {"id": null, "name": "Azosensors.com"}, "author": null, "title": "The Infrared Sensors Defining the James Webb Space Telescope - AZoSensors", "description": "Infrared sensors are critical instruments in the James Webb Space Telescope, enabling astronomers to view the universe like never before. Learn more about the infrared sensors defining the James Webb.", "url": "https://www.azosensors.com/article.aspx?ArticleID=2640", "urlToImage": "https://d10lvax23vl53t.cloudfront.net/images/Article_Images/SocialSharingImage_2640_16596047371861986.png", "publishedAt": "2022-08-16T09:35:00Z", "content": "The James Webb Space Telescope (JWST) was – after some delay – finally able to transmit images of deep space back to Earth in July, 2022. These pictures show the universe in unprecedented levels of d… [+6669 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Planets can be stripped to their rocky cores by brightest stars in the sky - News9 LIVE", "description": "Very few exoplanets have been discovered around short-lived blue A-type stars", "url": "https://www.news9live.com/science/planets-can-be-stripped-to-their-rocky-cores-by-brightest-stars-in-the-sky-189750", "urlToImage": "https://media.news9live.com/h-upload/2022/08/16/526416-hd56414b750pxcropped.jpg", "publishedAt": "2022-08-16T09:29:23Z", "content": "Researchers have reported the discovery of a Neptune-sized planet, designated as HD 56414 b, in orbit around an A-type star. The discovery provides hints on why so few exoplanets have been discovered… [+3214 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "A Guide to Scanning Transmission Electron Microscopy (STEM) - AZoNano", "description": "In this article, a guide to Scanning Transmission Electron Microscopy (STEM) is provided along with its applications in nanotechnology.", "url": "https://www.azonano.com/article.aspx?ArticleID=6232", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6232_16595391098972051.jpg", "publishedAt": "2022-08-16T09:25:00Z", "content": "High resolution images of microscopic samples can be obtained experimentally using Scanning Electron Transmission Microscopy (STEM). It is an effective method for examining the intricate structure of… [+7168 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Never seen before: Red giant star Betelgeuse blows off its top. scientists confused - DNAIndiaNews", "description": "NASA has recently released some phenomenal images of stars which were never seen before. A star named Betelgeuse blew its top off and ejected a gigantic port...", "url": "https://www.youtube.com/watch?v=8Rx_eZQqs28", "urlToImage": "https://i.ytimg.com/vi/8Rx_eZQqs28/maxresdefault.jpg", "publishedAt": "2022-08-16T08:37:12Z", "content": null}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Dwaipayan Roy", "title": "Beware! Earth might get hit by consecutive solar storms - NewsBytes", "description": "The Sun has hurled a CME which should hit Earth tomorrow ie", "url": "https://www.newsbytesapp.com/news/science/earth-to-be-hit-by-consecutive-solar-storms/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l39620220816120746.jpeg", "publishedAt": "2022-08-16T08:30:17Z", "content": "Beware! Earth might get hit by consecutive solar storms\r\nAug 16, 2022, 02:00 pm2 min read\r\nThe Earth seems to have incurred the Sun's wrath. The star has hurled a coronal mass ejection (CME) which sh… [+1726 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Felicity Nelson", "title": "Scientists Achieved Self-Sustaining Nuclear Fusion… But Now They Can't Replicate It - ScienceAlert", "description": "Scientists have confirmed that last year, for the first time in the lab, they achieved a fusion reaction that self-perpetuates (instead of fizzling out) – bringing us closer to replicating the chemical reaction that powers the Sun.", "url": "https://www.sciencealert.com/scientists-achieved-self-sustaining-nuclear-fusion-but-now-they-cant-replicate-it", "urlToImage": "https://www.sciencealert.com/images/2022/08/reactions-on-the-surface-of-the-sun.jpg", "publishedAt": "2022-08-16T07:40:06Z", "content": "Scientists have confirmed that last year, for the first time in the lab, they achieved a fusion reaction that self-perpetuates (instead of fizzling out) bringing us closer to replicating the chemical… [+3535 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Small armoured dinosaur from Cretaceous discovered in South America - News9 LIVE", "description": "The findings indicate that thyreophorans had a much wider range than previously believed", "url": "https://www.news9live.com/science/small-armoured-dinosaur-from-cretaceous-discovered-in-south-america-189695", "urlToImage": "https://media.news9live.com/h-upload/2022/08/16/526249-dinosaur-smol.jpg", "publishedAt": "2022-08-16T07:17:51Z", "content": "Palaeontologists have have described a new species of small, armoured dinosaur, Jakapil kaniukura, based on fossil remains found in South America. The creature lived between 97 and 94 million years a… [+1741 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Preparing for the Doomsday: NASA to deflect asteroid on Sep. 26 to save Earth - Times Now", "description": "NASA is about to launch a spacecraft right into the heart of an asteroid to deflect it from its original path.", "url": "https://www.timesnownews.com/technology-science/preparing-for-the-doomsday-nasa-to-deflect-asteroid-on-sep-26-to-save-earth-article-93586529", "urlToImage": "https://static.tnn.in/thumb/msid-93586529,imgsize-100,width-1280,height-720,resizemode-75/93586529.jpg", "publishedAt": "2022-08-16T07:15:22Z", "content": "Independence Day 2022: Quotes, wishes, messages, WhatsApp statuses, greetings and images to celebrate freedom on August 15"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Using Magnetism, Scientists Develop a Potentially Better Way to Make Oxygen for Astronauts in Space - The Weather Channel", "description": "NASA currently uses centrifuges to force the gases out, but those machines are large and require significant mass, power, and maintenance. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-08-16-better-way-to-make-oxygen-for-astronauts-in-space-using-magnetism", "urlToImage": "https://s.w-x.co/in-astronaut_iss.jpg", "publishedAt": "2022-08-16T06:46:23Z", "content": "Keeping astronauts breathing aboard the International Space Station (ISS) and other space vehicles is a complicated and costly process. An international team of scientists has proposed a potentially … [+2341 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tracey Peake", "title": "Statistical tool finds 'gaps' in DNA data sets shouldn't be ignored - Phys.org", "description": "A simple statistical test shows that contrary to current practice, the \"gaps\" within DNA protein and sequence alignments commonly used in evolutionary biology can provide important information about nucleotide and amino acid substitutions over time. The findi…", "url": "https://phys.org/news/2022-08-statistical-tool-gaps-dna-shouldnt.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/6-dna.jpg", "publishedAt": "2022-08-16T05:59:10Z", "content": "A simple statistical test shows that contrary to current practice, the \"gaps\" within DNA protein and sequence alignments commonly used in evolutionary biology can provide important information about … [+4196 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "This intriguing spiral galaxy has numerous sets of double features: Check out this pic by ESO's VLT - Devdiscourse", "description": "Read more about This intriguing spiral galaxy has numerous sets of double features: Check out this pic by ESO's VLT on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2145156-this-intriguing-spiral-galaxy-has-numerous-sets-of-double-features-check-out-this-pic-by-esos-vlt", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/16_08_2022_10_48_31_0910799.jpg?width=920&format=jpeg", "publishedAt": "2022-08-16T05:18:57Z", "content": "This throwback image captured by European Southern Observatory's Very Large Telescope (VLT) at Paranal Observatory shows NGC 7098 - an intriguing spiral galaxy with numerous sets of double features.\r… [+1814 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Stunning! Supercomputer delivers minutely detailed image of exploding star - India Today", "description": "An Australian supercomputer, in its maiden attempt, has produced a detailed image of an exploding star.", "url": "https://www.indiatoday.in/science/story/stunning-supercomputer-delivers-minutely-detailed-image-of-exploding-star-1988432-2022-08-16", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/Star_supernova-647x363.jpeg?uTp8lCOw8Ym0sbK3xWaS6T8IapMsrmBN", "publishedAt": "2022-08-16T04:57:09Z", "content": "What happens in the minutes before a star explodes? An Australian Supercomputer has delivered a stunning image that shows the details as the star reaches the end of its life. Located 10,000-15,000 li… [+2579 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Ice shelves holding Antarctica’s glaciers from adding to sea levels are crumbling - EastMojo", "description": "As Antarctica’s slow rivers of ice hit the sea, they float, forming ice shelves. These shelves extend the glaciers into the ocean until they calve into", "url": "http://www.eastmojo.com/world/2022/08/16/ice-shelves-holding-antarcticas-glaciers-from-adding-to-sea-levels-are-crumbling/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/antarctica.jpg?fit=1920%2C1080&ssl=1", "publishedAt": "2022-08-16T04:30:00Z", "content": "As Antarcticas slow rivers of ice hit the sea, they float, forming ice shelves. These shelves extend the glaciers into the ocean until they calve into icebergs.\r\nBut they also play a crucial role in … [+6009 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Life-cycle of an Asteroid discovered! NASA reveals how exciting discovery was made - HT Tech", "description": "The discovery was made by a team of scientists at NASA’s Ames Research Center.", "url": "https://tech.hindustantimes.com/tech/news/lifecycle-of-an-asteroid-discovered-nasa-reveals-how-exciting-discovery-was-made-71660621667032.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/16/1600x900/asteroid-6054186_1920_1659586399339_1660621765172_1660621765172.jpg", "publishedAt": "2022-08-16T03:50:09Z", "content": "A team of scientists at the SETI Institute in Mountain View, California, have achieved what seemingly was impossible to discover the origin and the conclusion of a space rock. The team of scientists … [+1714 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Vinothini S", "title": "Is Dr Ranj Singh Gay? Age, Height, Net Worth - News - News", "description": "Is Dr Ranj Singh Gay, Fans of Dr Ranj Singh can check this article to know whether is Dr Ranj Singh Gay or not. Dr Ranj Singh is a Television Presenter, Clinician. Here we have provided Dr Ranj Singh Age, Height, Dr Ranj Singh Girlfriend name, so read the art…", "url": "https://latestnews.fresherslive.com/articles/is-dr-ranj-singh-gay-girlfriend-salary-age-height-1033338", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/08/16/is-dr-ranj-singh-gay-girlfriend-salary-age-height-62fb0ffd49619-1660620797.jpg", "publishedAt": "2022-08-16T03:49:55Z", "content": "Is Dr Ranj Singh Gay?\r\nWant to know is Dr Ranj Singh Gay or not? then head into this article to know about Dr Ranj Singh. As per wikibiography, Dr Ranj Singh is a gay. \r\nDr Ranj Singh Age\r\nThe Televi… [+891 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Webb Telescope Uses Ripple In Spacetime To Image ‘Earendel,’ The Most Distant Star Ever Seen 28 Billion Light-Years Distant - Forbes", "description": "Scientists using the James Webb Space Telescope (JWST) have imaged the most distant star ever observed.", "url": "https://www.forbes.com/sites/jamiecartereurope/2022/08/15/webb-telescope-drops-stunning-image-of-earendel-the-most-distant-star-thanks-to-a-ripple-in-spacetime/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62f5fec29b800eeac8fe6376/0x0.jpg?format=jpg&crop=3378,1900,x0,y622,safe&width=1200", "publishedAt": "2022-08-16T00:00:00Z", "content": "The first JWST image of Earendel, the most distant star known in our universe, lensed and magnified ... [+] by a massive galaxy cluster. It was observed last weekend by JWST program 2282.\r\nNASA, ESA,… [+3713 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Live Now: NASA and Industry Experts Discuss the CubeSats and Space Biology Experiments ... - Latest Tweet - LatestLY", "description": "The latest Tweet by NASA states, 'Live Now: NASA and industry experts discuss the CubeSats and space biology experiments that will travel with the #Artemis I flight test to the Moon, set for Aug. 29: ...'", "url": "https://www.latestly.com/socially/technology/science/live-now-nasa-and-industry-experts-discuss-the-cubesats-and-space-biology-experiments-latest-tweet-by-nasa-4085924.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/04/nasa-784x441.jpg", "publishedAt": "2022-08-15T21:07:11Z", "content": "Live Now: NASA and industry experts discuss the CubeSats and space biology experiments that will travel with the #Artemis I flight test to the Moon, set for Aug. 29: https://t.co/cyLsdNvnx9— NASA (@N… [+530 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Kevin Hurler", "title": "You Have to Zoom in for a Full Minute to See the Galaxy in This Webb Telescope Video - Gizmodo", "description": "The video, made from Webb Space Telescope observations, will make you feel really small.", "url": "https://gizmodo.com/webb-space-telescope-cartwheel-galaxy-video-zoom-in-1849412668", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/751ff2e18f36ff3f1b901ed906bd59b9.gif", "publishedAt": "2022-08-15T20:10:00Z", "content": "Space is big and scary, and a new video created from Webb Space Telescope data goes to show the massive distances separating us from the objects were trying to observe. In this case, its the Cartwhee… [+1555 chars]"}, {"source": {"id": null, "name": "Upjobsnews.com"}, "author": null, "title": "Weird and wonderful world of fungi shaped by evolutionary bursts, study finds — ScienceDaily & More Latest News Here - upjobsnews", "description": "", "url": "https://upjobsnews.com/weird-and-wonderful-world-of-fungi-shaped-by-evolutionary-bursts-study-finds-sciencedaily-more-latest-news-here/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-08-15T20:09:05Z", "content": "Scientists at the University of Bristol have discovered that the vast anatomical variety of fungi stems from evolutionary increases in multicellular complexity.\r\nMost people recognise that fungi come… [+4605 chars]"}, {"source": {"id": null, "name": "Wisc.edu"}, "author": null, "title": "Supernova remnant is source of extreme cosmic particles - University of Wisconsin-Madison", "description": "Astronomers have long sought the launch sites for some of the highest energy protons in our galaxy. Now, a study using 12 years of data from NASA’s Fermi Gamma-ray Space Telescope confirms that a remnant of a supernova, or star explosion, is just such a place…", "url": "https://news.wisc.edu/supernova-remnant-is-source-of-extreme-cosmic-particles/", "urlToImage": "https://news.wisc.edu/content/uploads/2022/08/pevatron-1024x789.jpg", "publishedAt": "2022-08-15T19:44:49Z", "content": "Astronomers have long sought the launch sites for some of the highest energy protons in our galaxy. Now, a study using 12 years of data from NASAs Fermi Gamma-ray Space Telescope confirms that a remn… [+5020 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Rich Co", "title": "Dinosaurs: Secret to Carrying Massive Bodies Uncovered by Scientists - Nature World News", "description": "Scientists have recently uncovered the secret of how dinosaurs carried their massive bodies from day to day.", "url": "https://www.natureworldnews.com/articles/52554/20220815/dinosaurs-secret-carrying-massive-bodies-uncovered-scientists.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/61112/dinosaurs-secret-to-carrying-massive-bodies-uncovered-by-scientists.jpg", "publishedAt": "2022-08-15T19:29:24Z", "content": "The long-standing mystery of how sauropod dinosaurs, such as the Brontosaurus and Diplodocus, supported their enormous bodies on land has been solved by science.\r\nA team led by the Universities of Qu… [+3509 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How do rootstocks mediate scion salinity tolerance under salt stress? - Phys.org", "description": "Grafting in tomato has been investigated mainly in small-scale experiments, demonstrating morphological, physiological, and metabolic changes in the scion mediated by the rootstock. By grafting a scion onto different rootstocks, scion salt tolerance can be al…", "url": "https://phys.org/news/2022-08-rootstocks-scion-salinity-tolerance-salt.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/how-do-rootstocks-medi.jpg", "publishedAt": "2022-08-15T18:40:02Z", "content": "Grafting in tomato has been investigated mainly in small-scale experiments, demonstrating morphological, physiological, and metabolic changes in the scion mediated by the rootstock. By grafting a sci… [+2767 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "NASA's Europa Clipper Spacecraft Kicks Assembly Into High Gear - NASA Jet Propulsion Laboratory", "description": "The spacecraft will occupy the main production facility of NASA’s Jet Propulsion Laboratory as it prepares for its 2024 launch to Jupiter’s moon Europa.", "url": "https://www.jpl.nasa.gov/news/nasas-europa-clipper-spacecraft-kicks-assembly-into-high-gear", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1-MAIN-Europa_Clipper_Module.jpg", "publishedAt": "2022-08-15T18:04:05Z", "content": "Inside the core are Europa Clippers two propulsion tanks. The fuel and oxidizer theyll hold will flow to an array of 24 engines, where they will create a controlled chemical reaction to produce thrus… [+1491 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Competition launched to name the 20 exoplanets that the James Webb Space Telescope is set to study - Daily Mail", "description": "The international naming competition, hosted by the International Astronomical Union, is being held to mark the 10th anniversary of its Office for Astronomy Outreach.", "url": "https://www.dailymail.co.uk/sciencetech/article-11113793/Competition-launched-20-exoplanets-James-Webb-Space-Telescope-set-study.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/15/18/61405943-0-image-a-41_1660585642437.jpg", "publishedAt": "2022-08-15T17:58:22Z", "content": "Forget Boaty McBoatface, your chance to name an alien world has finally arrived!\r\nAn international competition has been launched to name 20 exoplanets that will be studied by the James Webb Space Tel… [+7437 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Earth's mantle, origin of Moon linked? See exciting giant impact find - HT Tech", "description": "The latest study has discovered strong proof that the origin of the Moon is connected with the Earth's mantle.", "url": "https://tech.hindustantimes.com/tech/news/earths-mantle-origin-of-moon-linked-see-exciting-giant-impact-find-71660583784295.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/15/1600x900/earth-moon_1660555969648_1660583891840_1660583891840.png", "publishedAt": "2022-08-15T17:18:38Z", "content": "How was the Moon formed? This question has always kept scientists hooked and numerous heavily debated theories about how the moon was formed have been rolled out over the decades. In the latest effor… [+1974 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA reveals origin of Spaghetti-like tangled object spotted by Mars Perseverance rover - Republic World", "description": "NASA's Mars Perseverance rover came across a mysterious object on the red planet earlier this year and the US space agency has answers about its origin.", "url": "https://www.republicworld.com/science/space/nasa-reveals-origin-of-spaghetti-like-tangled-object-spotted-by-mars-perseverance-rover-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/hmyfrm4etju4bfmi_1660580148.jpeg", "publishedAt": "2022-08-15T16:50:00Z", "content": "The Perseverance rover which is exploring the surface of Mars for signs of ancient microbial life spotted a strange spaghetti-like object which triggered a lot of speculations. A few weeks later afte… [+2156 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Hubble Space Telescope: NASA shares stunning view of Orion Nebula's colourful celestial cloudscape - DNA India", "description": "The Orion Nebula has never been seen so clearly as in this stunning Hubble photograph.", "url": "https://www.dnaindia.com/science/report-hubble-space-telescope-nasa-shares-stunning-view-of-orion-nebula-s-colourful-celestial-cloudscape-2976871", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/15/2530425-nasa-orion-nebula-cluster-orion-nebula-hubble-space-telescope-hubble-telescope-space-telescope-space-galaxy-nasa-telescopenasa-hubble-telescopeorion-nebulaearthhubble-captures-orion-nebulaclosest-larg.jpg", "publishedAt": "2022-08-15T16:47:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Aug 15, 2022, 10:27 PM ISTM42, also known as the Orion Nebula, is a luminous region of space in the constellation Orion that has … [+1850 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Scientists publish guide for memristor hardware design - Nanowerk", "description": "Numerous groups around the world are working on the use of corresponding neuromorphic circuits - but often with a lack of understanding of how they work and with faulty models. Researchers have now summarized the physical principles and models in a comprehens…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=61281.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id61281.jpg", "publishedAt": "2022-08-15T16:40:55Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Rocket Debris Could Have Disastrous Consequences – However, There Is a Solution - SciTechDaily", "description": "If governments don't act, space rocket junk might have deadly consequences. According to a recent University of British Columbia research, there is a six to ten percent chance that re-entering rocket stages that have been abandoned during space flights will s…", "url": "https://scitechdaily.com/space-rocket-debris-could-have-disastrous-consequences-however-there-is-a-solution/", "urlToImage": "https://scitechdaily.com/images/Space-Junk.gif", "publishedAt": "2022-08-15T16:15:55Z", "content": "Dangerous space junk illustration.\r\nIf governments dont act, space rocket junk might have deadly consequences.\r\nAccording to a recent University of British Columbia research, there is a six to ten pe… [+4648 chars]"}, {"source": {"id": null, "name": "Caltech.edu"}, "author": null, "title": "New Wearable Sensor Detects Even More Compounds in Human Sweat - Caltech", "description": "Technological advances allow sweat sensors developed in the lab of Wei Gao to detect a greater variety of biological compounds in smaller amounts of sweat, opening the door to better monitoring of health conditions.", "url": "https://www.caltech.edu/about/news/new-wearable-sensor-detects-even-more-compounds-in-human-sweat", "urlToImage": "https://caltech-prod.s3.amazonaws.com/main/images/Nature_BME_cover_page-1.width-600.jpg", "publishedAt": "2022-08-15T16:09:25Z", "content": "If you have ever had your blood drawn, whether to check your cholesterol, kidney function, hormone levels, blood sugar, or as part of a general checkup, you might have wondered why there is not an ea… [+5639 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists develop gel made from spider silk proteins for biomedical applications - Science Daily", "description": "Researchers have discovered that spider silk proteins can be fused to biologically active proteins and be converted into a gel at body temperature. One of the goals is to develop an injectable protein solution that forms a gel inside the body, which could be …", "url": "https://www.sciencedaily.com/releases/2022/08/220815105610.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-08-15T16:02:55Z", "content": "Researchers at Karolinska Institutet in Sweden and the Swedish University of Agricultural Sciences have discovered that spider silk proteins can be fused to biologically active proteins and be conver… [+3481 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Unexpected quantum effects in natural double-layer graphene - Science Daily", "description": "An international research team has detected novel quantum effects in high-precision studies of natural double-layer graphene. This research provides new insights into the interaction of the charge carriers and the different phases, and contributes to the unde…", "url": "https://www.sciencedaily.com/releases/2022/08/220815105554.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-08-15T16:02:54Z", "content": "An international research team led by the University of Göttingen has detected novel quantum effects in high-precision studies of natural double-layer graphene and has interpreted them together with … [+2727 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Monisha Ravisetti", "title": "New Webb Space Telescope Target: Possibly the Youngest Exoplanet on Record - CNET", "description": "If this foreign world truly exists, it would challenge established theories of planet formation. NASA's JWST is on the case.", "url": "https://www.cnet.com/science/space/new-webb-space-telescope-target-possibly-the-youngest-exoplanet-on-record/", "urlToImage": "https://www.cnet.com/a/img/resize/38e372de507824b3fcc7090e11bb325b8bb1dcc7/2022/08/10/030a1505-7995-4409-a803-3f7d2b8157ca/as-209-a-sierra-cropped.png?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-08-15T16:01:06Z", "content": "Astronomers said last week that the world's largest radio telescope, the Atacama Large Millimeter/submillimeter Array in Chile, might've picked up a signal from the youngest exoplanet discovered to d… [+4768 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Accessibility in astronomy for the visually impaired - Nature.com", "description": "Four researchers — Nicolas Bonne, Cheryl Fogle-Hatch, Garry Foran and Enrique Perez Montero — discuss the accessibility challenges in astronomy research, education and outreach for persons who are blind or visually impaired. Solutions to these challenges crea…", "url": "https://www.nature.com/articles/s41550-022-01691-2", "urlToImage": null, "publishedAt": "2022-08-15T15:38:52Z", "content": "Four researchers Nicolas Bonne, Cheryl Fogle-Hatch, Garry Foran and Enrique Perez Montero discuss the accessibility challenges in astronomy research, education and outreach for persons who are blind … [+505 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "This stunning image shows a \"golden swirl\" of newly born stars in a distant galaxy - Interesting Engineering", "description": "A new Very Large Telescope image of the galaxy NGC 4303 (Messier 61) shows a golden swirling cloud of baby stars.", "url": "https://interestingengineering.com/science/golden-swirl-newly-born-stars", "urlToImage": "https://inteng-storage.s3.amazonaws.com/2022/08/15/image/jpeg/Bv8MnhLNsguEzBEJm8NOgtJWJMxfCZxrGQ6uxVhQ.jpg", "publishedAt": "2022-08-15T15:13:21Z", "content": "\"It has an unusually high amount of stars being born and has been used by astronomers as a laboratory to better understand the fascinating phenomena of star formation,\" the ESO explains.\r\nAn example … [+756 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Using a Fiber-Tip Microforce Sensor for Interfacial Adhesion Forces Measurement - AZoOptics", "description": "A newly developed Fiber-Tip Microforce Sensor (FTMS) displays unseen levels of micronewton sensitivity to measure adhesion forces.", "url": "https://www.azooptics.com/News.aspx?newsID=27785", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_27785_16605751813897317.jpg", "publishedAt": "2022-08-15T15:02:00Z", "content": "High resolution, high sensitivity measurements of adhesion forces can potentially transform many applications. A newly developed Fiber-Tip Microforce Sensor (FTMS) by Professor Yiping Wang and collea… [+5583 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Study Uses Raman Spectroscopy to Characterize Two-Photon-Polymerization Lithography Structures - AZoOptics", "description": "An article published in the Journal of Optical Microsystems investigates parameter sweeps of cuboid structures fabricated using two-photon polymerization (TPP) lithography across the laser power and scan speed parameters to find dependent mechanical material …", "url": "https://www.azooptics.com/News.aspx?newsID=27784", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_27784_1660574088586534.jpg", "publishedAt": "2022-08-15T14:37:00Z", "content": "The use of the additive manufacturing technique known as two-photon polymerization lithography is expanding across a variety of industries. Two-photon polymerization lithography utilizes liquid precu… [+6072 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "What is NASA's Dragonfly mission? Read all about the life-hunting venture to Titan - Republic World", "description": "NASA's Dragonfly mission is targeted for launch in 2027 wherein the agency will deliver an 8-bladed rotorcraft on the surface of Titan, Saturn's largest Moon.", "url": "https://www.republicworld.com/science/space/what-is-nasas-dragonfly-mission-read-all-about-the-life-hunting-venture-to-titan-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/zsuowfqeevflzyiq_1660572248.jpeg", "publishedAt": "2022-08-15T14:33:00Z", "content": "With the search for signs of life already in progress on Mars, NASA is now expanding its reach to the outer solar system. For that, the agency has planned a new mission named Dragonfly which would ex… [+2045 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Scientists clarify how best known superconductor works - Phys.org", "description": "In a series of experiments on lanthanum superhydride with impurities, researchers from Skoltech, Lebedev Physical Institute of RAS and their colleagues from the United States, Germany and Japan, have established the mechanism behind the highest-temperature su…", "url": "https://phys.org/news/2022-08-scientists-superconductor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/scientists-clarify-how.jpg", "publishedAt": "2022-08-15T14:17:03Z", "content": "In a series of experiments on lanthanum superhydride with impurities, researchers from Skoltech, Lebedev Physical Institute of RAS and their colleagues from the United States, Germany and Japan, have… [+5095 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Nancy Atkinson, Universe Today", "title": "South Korea just launched a rocket to orbit the Moon, a first for the country - Inverse", "description": "If it successfully goes into orbit at the Moon, South Korea will become the seventh nation to undertake  lunar exploration.", "url": "https://www.inverse.com/science/south-korea-moon-mission", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2020/8/27/34ff100b-e37b-4f97-b22e-4a03039a6bd3-shutterstock-1545000899.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-08-15T11:00:25Z", "content": "South Korea launched\r\n its first robotic mission to the Moon last week, as a SpaceX Falcon 9 successfully launched the Danuri Lunar Pathfinder mission on August 4, 2022, from Floridas Cape Canaveral … [+2320 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Confinement-induced accumulation and de-mixing of microscopic active-passive mixtures - Nature.com", "description": "Understanding how order emerges in active matter may facilitate macroscopic control of microscopic objects. Here, Williams et al. show how to control the transport of passive microscopic particles in presence of motile algae in conjunction with boundary-induc…", "url": "https://www.nature.com/articles/s41467-022-32520-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-022-32520-9/MediaObjects/41467_2022_32520_Fig1_HTML.png", "publishedAt": "2022-08-15T10:49:59Z", "content": "<li>Civelekoglu-Scholey, G. &amp; Scholey, J. M. Mitotic force generators and chromosome segregation. Cell. Mol. Life Sci67, 2231 (2010).\r\nCAS \r\n PubMed \r\n PubMed Central \r\nGoogle Scholar \r\n</li><li>… [+14181 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "How well do you know Earth's Moon? How did it form, rotation, its orbit? Get up close and familiar- 5 points - HT Tech", "description": "Does the Moon fascinate you? Earth has only one Moon- a rocky, cratered place, roughly a quarter the size of our planet and an average of 2,38,855 miles away. Here are some of the interesting facts you need to know about the Moon.", "url": "https://tech.hindustantimes.com/photos/how-well-do-you-know-earth-s-moon-how-did-it-form-rotation-its-orbit-get-up-close-and-familiar-5-points-71660556102574.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/15/1600x900/earth-moon_1660555969648_1660556198020_1660556198020.png", "publishedAt": "2022-08-15T09:45:44Z", "content": "Top SectionsExplore Tech\r\n Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "Sparkchronicles.com"}, "author": null, "title": "The length of the days is getting longer: the reasons are mysterious - Spark Chronicles", "description": "It is not yet perceptible to the eye, but the length of days on Earth is getting longer. According t", "url": "https://sparkchronicles.com/the-length-of-the-days-is-getting-longer-the-reasons-are-mysterious/", "urlToImage": "https://www.money.it/local/cache-gd2/cd/a82ed4ee18f5543591299837712f3f.png?1660484767", "publishedAt": "2022-08-15T08:45:41Z", "content": "It is not yet perceptible to the eye, but the length of days on Earth is getting longer. According to astronomical clocks, very different from those of our mobile phones, the days are slowly getting … [+3202 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers discover use of sound, bubbles to make bandages stickier, long lasting - ETHealthWorld", "description": "The innovation could pave the way for further breakthroughs in medical adhesives, particularly in situations where adhesives are difficult to apply, such as on moist skin.", "url": "https://health.economictimes.indiatimes.com/news/medical-devices/researchers-discover-use-of-sound-bubbles-to-make-bandages-stickier-long-lasting/93570511", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93570511,imgsize-12086,width-1200,height-628,overlay-ethealthworld/researchers-discover-use-of-sound-bubbles-to-make-bandages-stickier-long-lasting.jpg", "publishedAt": "2022-08-15T07:46:00Z", "content": "Montreal [Canada]: Researchers found out that utilising ultrasonic waves and bubbles, they can adjust the stickiness of adhesive bandages. This innovation could pave the way for further breakthroughs… [+2132 chars]"}, {"source": {"id": null, "name": "Naturaldiamonds.com"}, "author": "Dr. Evan M. Smith", "title": "How are Natural Diamonds Formed? - Only Natural Diamonds", "description": "Do you ever wonder how natural diamonds are formed and how we are lucky enough to find them? Learn more now.", "url": "https://www.naturaldiamonds.com/diamond-guide/how-are-natural-diamonds-formed/", "urlToImage": "https://www.naturaldiamonds.com/wp-content/uploads/2022/08/D01_FAC_Diamond-Formation2_IMG_4x5.jpg", "publishedAt": "2022-08-15T06:32:00Z", "content": "In addition to their revered status, diamonds have an extraordinary geological backstory unlike any other material found on earth. A pervasive myth about how natural diamonds are formed is that they … [+3982 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": "More from this author", "title": "Can Animals Trick The Process Of Aging? - Science ABC", "description": "Aging or senescence is a biological process that involves continually deterioration of a living animal's body or its functions. Animals with long lifespans have special cellular structures that either slow down ageing or reverse the process entirely.", "url": "https://www.scienceabc.com/nature/animals/can-animals-trick-the-process-of-aging.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2022/07/Old-man-resting-in-garden-and-cute-dog-climb-on-his-chest-and-kissing-him.-Pet-love-concept.jpg", "publishedAt": "2022-08-15T05:49:05Z", "content": "When you compare the lifespans of different animals, you’ll see a whole spectrum, ranging from ‘Speed dating’ mayflies that live (and love) for a mere 10 minutes, which is just long enough for them t… [+7041 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "How to watch SpaceX’s Cargo Dragon depart ISS this week - Digital Trends", "description": "Fans of slow TV can enjoy watching SpaceX's Cargo Dragon spacecraft depart from the International Space Station on Thursday at the start of its journey home.", "url": "https://www.digitaltrends.com/space/how-to-watch-spacexs-cargo-dragon-depart-iss/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/08/cargo-dragon-spacex.jpeg?p=1", "publishedAt": "2022-08-15T05:15:03Z", "content": "A SpaceX Cargo Dragon spacecraft will undock from the International Space Station (ISS) on Thursday, August 18, and NASA will livestream the entire process.\r\nThe Dragon will carry back to Earth more … [+2904 chars]"}, {"source": {"id": null, "name": "Guided.news"}, "author": "Sascha Asendorf", "title": "ARK: Direwolf - How to Tame, Feed and Breed! - Guided.news EN", "description": "In our guide, we will tell you how to tame a Direwolf in ARK: Survival Evolved, what to feed it, and how breeding works.", "url": "https://guided.news/en/guides/ark-direwolf-how-to-tame-feed-and-breed/", "urlToImage": "https://guided.news/wp-content/uploads/2022/08/ARK-Direwolf-Guide.jpg", "publishedAt": "2022-08-15T01:27:14Z", "content": "DeutschEnglish\r\nFind out everything you need to know about the Direwolf in our ARK: Survival Evolved guide. But also how to catch him, tame him, feed him, and breed offspring too.\r\nThe Direwolf is pr… [+4482 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study Reveals Quick Method for Sculpting Matter into Complex Shapes - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. Researchers at the University of Strathclyde have revealed a novel technique for moulding materials into complicated patterns by using &quot;twisted&quot; light.", "url": "https://www.latestly.com/agency-news/science-news-study-reveals-quick-method-for-sculpting-matter-into-complex-shapes-4082272.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/08/kljkjjj20220814225345-588x441.jpg", "publishedAt": "2022-08-15T00:50:25Z", "content": "Glasgow [Scotland], August 15 (ANI): Researchers at the University of Strathclyde have revealed a new technique for moulding materials into complicated patterns by using \"twisted\" light. \r\nThe findin… [+2115 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Scientists Identify What Humans Can Speak Better Than Other Primates - Nation World News", "description": "The lack of these elements results in a stable vocal source in humans which is important for the development of speech. This simplification of the larynx gave", "url": "https://nationworldnews.com/scientists-identify-what-humans-can-speak-better-than-other-primates/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/Scientists-identify-what-humans-can-speak-better-than-other-primates-533x300.jpg", "publishedAt": "2022-08-14T19:08:41Z", "content": "The lack of these elements results in a stable vocal source in humans which is important for the development of speech. This simplification of the larynx gave humans excellent pitch control with stab… [+1489 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Six tiny satellites will form a huge virtual telescope to study space weather - Digital Trends", "description": "NASA has plans to study hazardous space weather events in more detail than ever before, using a group of six small satellites in a project called SunRISE.", "url": "https://www.digitaltrends.com/space/nasa-sunrise-space-weather/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/08/1_sunrise-smallsat-cleanroom.width-13201.jpg?p=1", "publishedAt": "2022-08-14T18:30:39Z", "content": "As we send more and more satellites into orbit and want to send both human and robotic explorers further out into the solar system, one problem we’re still figuring out is how to deal with space weat… [+2270 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Research: Dinosaurs take control in cold climates - ThePrint", "description": "Washington [US], August 14 (ANI): A new study of ancient mass extinction suggests that ancient high latitudes, to which early dinosaurs were largely relegated, regularly froze over, and that the creatures adapted an apparent key to their later dominance. We k…", "url": "https://theprint.in/science/research-dinosaurs-take-control-in-cold-climates/1082961/", "urlToImage": null, "publishedAt": "2022-08-14T18:16:17Z", "content": "Washington [US], August 14 (ANI): A new study of ancient mass extinction suggests that ancient high latitudes, to which early dinosaurs were largely relegated, regularly froze over, and that the crea… [+7901 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Experiment With A Particle Accelerator That Could Rewrite The History Of The Printing Press - Nation World News", "description": "I'm a little confused. In my right hand is a priceless piece of human history. This is no exaggeration. It is a weathered black box with gold text on the", "url": "https://nationworldnews.com/experiment-with-a-particle-accelerator-that-could-rewrite-the-history-of-the-printing-press/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/Experiment-with-a-particle-accelerator-that-could-rewrite-the-history.jpg", "publishedAt": "2022-08-14T16:38:31Z", "content": "I’m a little confused. In my right hand is a priceless piece of human history. This is no exaggeration. It is a weathered black box with gold text on the front. In the Gothic text it reads “Paper fro… [+4268 chars]"}, {"source": {"id": null, "name": "Mmnews.tv"}, "author": "Zaka Khan", "title": "How high can you jump on other planets? - MM News", "description": "You have probably jumped hundreds of time during the course of your life but have you ever wondere...", "url": "https://mmnews.tv/how-high-can-you-jump-on-other-planets/", "urlToImage": "https://mmnews.tv/wp-content/uploads/2022/08/jump.jpg", "publishedAt": "2022-08-14T14:56:03Z", "content": "You have probably jumped hundreds of time during the course of your life but have you ever wondered how high can you leap on other planets? Probably not.\r\nLet me tell you anyway. You can easily calcu… [+4386 chars]"}]}