{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "UAE to launch first lunar rover in November - The Tribune India", "description": "dubai: The United Arab Emirates will launch its first lunar rover in November. The &ldquo;Rashid&rdquo; rover, named for Dubai's ruling family, would be launched from the Kennedy Space Centre in Florida. The rover is to be launched aboard a Falcon 9 SpaceX ro…", "url": "https://www.tribuneindia.com/news/world/uae-to-launch-first-lunar-rover-in-november-433477", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_2096240167.jpg", "publishedAt": "2022-09-20T01:38:00Z", "content": "The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and i… [+505 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's InSight Lander Detects Space Rocks As They Slam Into Mars - NDTV", "description": "Mars, by virtue of its tenuous atmosphere and proximity to our solar system's asteroid belt, is far more vulnerable than Earth to being struck by space rocks - one of the many differences between the two planetary neighbors.", "url": "https://www.ndtv.com/world-news/nasas-insight-lander-detects-space-rocks-as-they-slam-into-mars-3359577", "urlToImage": "https://c.ndtvimg.com/2022-09/42q65umo_nasa_625x300_20_September_22.jpg", "publishedAt": "2022-09-20T01:01:00Z", "content": "These seismic measurements give us a completely new tool for investigating Mars, NASA Scientists said.\r\nWashington:  Mars, by virtue of its tenuous atmosphere and proximity to our solar system's aste… [+3958 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sounak Mukhopadhyay", "title": "This is how Mars looks: NASA James Webb Space Telescope images are here | Mint - Mint", "description": "NASA's James Webb Space Telescope was launched in December 2021. It has recently captured its first images of Mars.", "url": "https://www.livemint.com/news/world/this-is-how-mars-looks-nasa-james-webb-space-telescope-images-are-here-11663631385397.html", "urlToImage": "https://images.livemint.com/img/2022/09/20/600x338/SPACE-EXPLORATION-MARS-2_1663634420162_1663634420162_1663634435656_1663634435656.JPG", "publishedAt": "2022-09-20T00:50:06Z", "content": "The James Webb Space Telescope, which NASA successfully launched in December 2021, has taken its first pictures of Mars. The telescope, a product of an international partnership involving the Europea… [+2435 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Study says there are at least 20 quadrillion ants on Earth - WION", "description": "Highlighting even that staggering figure likely underestimates the total population of the insects, the study states that it is important for measuring the consequences of changes to their habitat.", "url": "https://www.wionews.com/science/study-says-there-are-at-least-20-quadrillion-ants-on-earth-517896", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/09/20/297215-untitled-design-33.png", "publishedAt": "2022-09-20T00:43:16Z", "content": "A new study published in the journal Proceedings of the National Academy of Sciences (PNAS) has shown that there are at least 20 quadrillion ants on Earth.\r\nHighlighting even that staggering figure l… [+1279 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New software platform advances understanding of the surface finish of manufactured components - Science Daily", "description": "The contact.engineering platform enables users to create a digital twin of a surface and thus to help predict, for example, how quickly it wears out, how well it conducts heat, or how well it adheres to other materials.", "url": "https://www.sciencedaily.com/releases/2022/09/220919155035.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-19T20:35:12Z", "content": "Scientists from the University of Freiburg, Germany, and the University of Pittsburgh have developed a software platform that facilitates and standardizes the analysis of surfaces. The contact.engine… [+3379 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lauren Quinn", "title": "Amino acid supplement is a key to reproductive health in dairy cows - Phys.org", "description": "Lysine is an essential amino acid for dairy cows, helping boost milk production when added to the diet at adequate levels. But could lysine benefit cows in other ways? A new University of Illinois study shows rumen-protected lysine can improve uterine health …", "url": "https://phys.org/news/2022-09-amino-acid-supplement-key-reproductive.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/amino-acid-supplement.jpg", "publishedAt": "2022-09-19T20:12:03Z", "content": "Lysine is an essential amino acid for dairy cows, helping boost milk production when added to the diet at adequate levels. But could lysine benefit cows in other ways? A new University of Illinois st… [+5045 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researcher helps identify new evidence for habitability in ocean of Saturn's moon Enceladus - Phys.org", "description": "The search for extraterrestrial life has just become more interesting as a team of scientists, including Southwest Research Institute's Dr. Christopher Glein, has discovered new evidence for a key building block for life in the subsurface ocean of Saturn's mo…", "url": "https://phys.org/news/2022-09-evidence-habitability-ocean-saturn-moon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/swri-scientist-helps-i.jpg", "publishedAt": "2022-09-19T19:43:06Z", "content": "The search for extraterrestrial life has just become more interesting as a team of scientists, including Southwest Research Institute's Dr. Christopher Glein, has discovered new evidence for a key bu… [+3948 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Khyati Mishra", "title": "\"Water From Beyond Earth\" Was Found In A Meteor That Fell In The UK Last Year. - Asiana Times", "description": "The scientist also claimed that the composition of the meteorite's extraterrestrial water was \"very, very similar\" to that of water on Earth. In February 2021, a meteorite crashed into a driveway in a town in Gloucestershire, United Kingdom. The most recent r…", "url": "https://asianatimes.com/water-from-beyond-earth-was-found-in-a-meteor-that-fell-in-the-uk-last-year/", "urlToImage": "https://i0.wp.com/asianatimes.com/wp-content/uploads/2022/09/Water-from-beyond-Earth-was-found-in-a-meteor-that-fell-in-the-UK-last-year..png", "publishedAt": "2022-09-19T19:28:04Z", "content": "The scientist also claimed that the composition of the meteorite’s extraterrestrial water was “very, very similar” to that of water on Earth.\r\nIn February 2021, a meteorite crashed into a driveway in… [+2035 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "This Reusable Space Freighter Would 'Open the Door' to European Space Exploration - Gizmodo", "description": "Called SUSIE, the reusable spacecraft would be capable of delivering crews and cargo to space, and perform vertical landings when returning home.", "url": "https://gizmodo.com/arianegroup-concept-reusable-upper-state-spacecraft-1849553008", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/77b2f37787e1d85cfffb52d261563b77.jpg", "publishedAt": "2022-09-19T19:10:00Z", "content": "French aerospace company ArianeGroup has revealed a concept for a reusable upper stage spacecraft that would be capable of delivering heavy payloads to space and carry out crewed missions before land… [+3504 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Deformation fingerprints will help researchers identify, design better metallic materials - Science Daily", "description": "Engineers can now capture and predict the strength of metallic materials subjected to cycling loading, or fatigue strength, in a matter of hours -- not the months or years it takes using current methods.", "url": "https://www.sciencedaily.com/releases/2022/09/220919122245.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-19T17:53:00Z", "content": "Engineers can now capture and predict the strength of metallic materials subjected to cycling loading, or fatigue strength, in a matter of hours -- not the months or years it takes using current meth… [+3170 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Geologist proposes the number of ancient Martian lakes might have been dramatically underestimated by scientists - Science Daily", "description": "Though Mars is a frozen desert today, scientists have shown that Mars contains evidence of ancient lakes that existed billions of years ago, which could contain evidence for ancient life and climate conditions on the red planet. Through a meta-analysis of yea…", "url": "https://www.sciencedaily.com/releases/2022/09/220919103154.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-19T17:46:12Z", "content": "Lakes are bodies of water fed by rainfall, snowmelt, rivers and groundwater, through which, Earth is teeming with life. Lakes also contain critical geologic records of past climates. Though Mars is a… [+3745 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A smartphone's camera and flash could help people measure blood oxygen levels at home - Science Daily", "description": "In a proof-of-principle study, researchers have shown that smartphones are capable of detecting blood oxygen saturation levels down to 70%. This is the lowest value that pulse oximeters should be able to measure, as recommended by the U.S. Food and Drug Admin…", "url": "https://www.sciencedaily.com/releases/2022/09/220919103143.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-19T16:21:21Z", "content": "First, pause and take a deep breath.When we breathe in, our lungs fill with oxygen, which is distributed to our red blood cells for transportation throughout our bodies. Our bodies need a lot of oxyg… [+6298 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Space Robots - Arizona Public Media", "description": "It has now been 50 years since NASA astronauts last set foot on the Moon, but a return mission might soon be in the offing. This time, though, human explorer...", "url": "https://www.youtube.com/watch?v=D61Aoqtn8m0", "urlToImage": "https://i.ytimg.com/vi/D61Aoqtn8m0/hqdefault.jpg", "publishedAt": "2022-09-19T16:05:09Z", "content": null}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Space archaeologists's offer first consultancy firm for orbital habitats - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-09-19T16:04:36Z", "content": ""}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Hubble captures a starry scene - Phys.org", "description": "A glittering multitude of stars in the globular cluster Terzan 4 fills this image from the NASA/ESA Hubble Space Telescope. Globular clusters are collections of stars bound together by their mutual gravitational attraction and can contain millions of individu…", "url": "https://phys.org/news/2022-09-hubble-captures-starry-scene.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/hubble-captures-a-star-1.jpg", "publishedAt": "2022-09-19T16:04:22Z", "content": "A glittering multitude of stars in the globular cluster Terzan 4 fills this image from the NASA/ESA Hubble Space Telescope. Globular clusters are collections of stars bound together by their mutual g… [+1914 chars]"}, {"source": {"id": null, "name": "Newsdeal.in"}, "author": "Rihan", "title": "Scientists Claim to Create Matter From Nothing, Prove Schwinger Effect Correct - NewsDeal", "description": "A team of scientists has announced a surprising discovery - that they were able to create matter out of nothing. The experiment was carried out in January 2022, in which strong electric fields were cr", "url": "https://newsdeal.in/scientists-claim-to-create-matter-from-nothing-prove-schwinger-effect-correct/", "urlToImage": "https://i2.wp.com/i.gadgets360cdn.com/large/matter_out_of_nothing_1200_1663578906700.jpg", "publishedAt": "2022-09-19T16:02:12Z", "content": "A team of scientists has announced a surprising discovery – that they were able to create matter out of nothing. The experiment was carried out in January 2022, in which strong electric fields were c… [+1518 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists suggest a stop-gap solution for `refreezing` melting ice; will cost whopping $11 billion yearly - WION", "description": "Scientists have proposed an ambitious and some might say downright bizarre plan to reverse the ice loss: they want to refreeze the north and south poles", "url": "https://www.wionews.com/science/scientists-suggest-a-stop-gap-solution-for-refreezing-melting-ice-will-cost-whopping-11-billion-yearly-517822", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/09/19/297139-new-wion-4.png", "publishedAt": "2022-09-19T15:56:11Z", "content": "At this point, everyone (except a few naysayers) acknowledge that climate change is a reality and we are all facing a very real danger. The Earth is warming up, the ice caps are melting, and despite … [+2564 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Astrophysics: Star-childhood shapes stellar evolution - Science Daily", "description": "In classical models of stellar evolution, so far little importance has been attached to the early evolution of stars. Scientists now show that the biography of stars is indeed shaped by their early stage.", "url": "https://www.sciencedaily.com/releases/2022/09/220919103129.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-19T15:52:34Z", "content": "In classical models of stellar evolution, so far little importance has been attached to the early evolution of stars. Scientists now show that the biography of stars is indeed shaped by their early s… [+3770 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Label-free intraoperative histology of bone tissue via deep-learning-assisted ultraviolet photoacoustic microscopy - Nature.com", "description": "Ultraviolet photoacoustic microscopy in reflection mode can be used to intraoperatively evaluate undecalcified and decalcified thick bone specimens without sectioning them.", "url": "https://www.nature.com/articles/s41551-022-00940-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41551-022-00940-z/MediaObjects/41551_2022_940_Fig1_HTML.png", "publishedAt": "2022-09-19T15:52:26Z", "content": "<li>Global Cancer Observatory (WHO, accessed 19 May 2021); http://gco.iarc.fr/today/home\r\n</li><li>Wyld, L., Audisio, R. A. &amp; Poston, G. J. The evolution of cancer surgery and future perspectives… [+9136 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA preparing for cryogenic test of Artemis 1 moon rocket! - HT Tech", "description": "NASA is planning to conduct a cryogenic demonstration test by loading cold liquid hydrogen and liquid oxygen into the Space Launch System (SLS) ahead of launch.", "url": "https://tech.hindustantimes.com/tech/news/nasa-preparing-for-cryogenic-test-of-artemis-1-moon-rocket-71663602373108.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/19/1600x900/FILES-US-SPACE-MOON-LAUNCH-0_1663602445671_1663602445671_1663602469341_1663602469341.jpg", "publishedAt": "2022-09-19T15:48:46Z", "content": "NASA is preparing to launch Artemis 1 on September 27. However, the US space agency will conduct a cryogenic test of Artemis 1 ahead of the launch to confirm that the fuel leak has been resolved. The… [+1569 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Mathematically probing membrane fluctuations - Nature.com", "description": "Nature Computational Science - Mathematically probing membrane fluctuations", "url": "https://www.nature.com/articles/s43588-022-00329-7", "urlToImage": null, "publishedAt": "2022-09-19T15:18:53Z", "content": "Fluctuation in plasma membranes is an important biophysical process that is of both biological and technical relevance. For example, the vibrating fluctuation allowed the first observation of red blo… [+1313 chars]"}, {"source": {"id": null, "name": "Advanced Science News"}, "author": "Andrey Feldman", "title": "Ultra cold atoms help test fundamental theory of solids - Advanced Science News", "description": "Cold ytterbium atoms were used to test a fundamental theory which describes the physics of solids, such as magnetism and superconductivity.", "url": "https://www.advancedsciencenews.com/ultra-cold-atoms-help-test-fundamental-theory-of-solids/", "urlToImage": "https://www.advancedsciencenews.com/wp-content/uploads/2022/09/Abstract-image-of-flowing-particles-on-a-black-background..jpg", "publishedAt": "2022-09-19T15:05:28Z", "content": "Many physical phenomena take place within solid materials, which are made up of billions of atoms and require complex physical theories to describe their collective behavior.\r\nIn a new study publishe… [+4328 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA lists out 5 hazardous asteroids that are heading for Earth this week - HT Tech", "description": "NASA has issued a warning for 5 upcoming hazardous asteroids that will make their closest approach to Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-lists-out-5-hazardous-asteroids-that-are-heading-for-earth-this-week-71663599359149.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/19/1600x900/space-g350d0a9c9_640_1663216186467_1663599541023_1663599541023.jpg", "publishedAt": "2022-09-19T14:59:11Z", "content": "This month is going to be exciting for stargazers as the largest planet in the solar system, Jupiter, is ready to make its closest approach to Earth in 71 years. While people on Earth will get a chan… [+2261 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mike Williams", "title": "Bird's enzyme points toward novel therapies - Phys.org", "description": "Thank the rare crested ibis for a clue that could someday help our bodies make better drugs.", "url": "https://phys.org/news/2022-09-bird-enzyme-therapies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/birds-enzyme-points-to.jpg", "publishedAt": "2022-09-19T14:38:58Z", "content": "Thank the rare crested ibis for a clue that could someday help our bodies make better drugs.\r\nThe species of bird is the only one known to naturally produce an enzyme able to generate a noncanonical … [+4380 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'sneaky' black hole discovered! Scientists say it is the most mysterious one - DNAIndiaNews", "description": "'sneaky' black hole discovered! Scientists say it is the most mysterious one#blackhole #scientist #shorts To watch more such videos, click:  https://www.dnai...", "url": "https://www.youtube.com/watch?v=Hzl75PQoIo8", "urlToImage": "https://i.ytimg.com/vi/Hzl75PQoIo8/hqdefault.jpg", "publishedAt": "2022-09-19T14:30:40Z", "content": null}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "Mount Ruapehu in New Zealand is seen in this stunning image of a space station astronaut. - BollyInside", "description": "Lakes at the top of volcanoes provide important clues as to what is happening below. While flying over New Zealand’s North Island, an astronaut aboard the", "url": "https://www.bollyinside.com/news/mount-ruapehu-in-new-zealand-is-seen-in-this-stunning-image-of-a-space-station-astronaut", "urlToImage": "//cdn.bollyinside.com/wp-content/uploads/2020/08/default-bollyinside.png", "publishedAt": "2022-09-19T14:21:23Z", "content": "Lakes at the top of volcanoes provide important clues as to what is happening below.\r\nWhile flying over New Zealand’s North Island, an astronaut aboard the International Space Station (ISS) took a ph… [+1878 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Kenna Hughes-Castleberry", "title": "Could MIT’s MOXIE Device Be the Future of Oxygen Production on Mars? - The Debrief", "description": "MOXIE, an experiment by MIT and NASA currently on board the Perseverance rover, aims to help find ways to produce oxygen in Mars' atmosphere.", "url": "https://thedebrief.org/could-mits-moxie-device-be-the-future-of-oxygen-production-on-mars/", "urlToImage": "https://thedebrief.org/wp-content/uploads/2022/09/Moxie.jpg", "publishedAt": "2022-09-19T14:15:03Z", "content": "At a distance of around 80 million miles from Earth, Earth’s planetary neighbor Mars has become the latest target for future space missions. While some like Elon Musk hope to terraform the planet and… [+4020 chars]"}, {"source": {"id": null, "name": "Techcircle.in"}, "author": null, "title": "Scientists use radio telescope to reliably see newly born planets - TechCircle", "description": "Peering into galaxies far, far away is a herculean task. Take the James Webb Space Telescope, for example — the contraption that today offers some of the most incredible views of the early years of the universe took nearly three decades of planning to become …", "url": "https://www.techcircle.in/2022/09/19/scientists-use-radio-telescope-to-reliably-see-newly-born-planets/", "urlToImage": "https://assets.techcircle.in/uploads/article-image/2022/09/images/30710-telescope.jpg", "publishedAt": "2022-09-19T14:02:08Z", "content": "Peering into galaxies far, far away is a herculean task. Take the James Webb Space Telescope, for example — the contraption that today offers some of the most incredible views of the early years of t… [+2746 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "The Standard Model of particle physics: Theory of the subatomic world - Livescience.com", "description": "The Standard Model is the modern physical understanding of three of the four forces of nature: electromagnetism, the strong nuclear force and the weak nuclear force.", "url": "https://www.livescience.com/the-standard-model", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YyfQpKb8nx8brkh9RKVvo8-1200-80.jpg", "publishedAt": "2022-09-19T13:30:05Z", "content": "The Standard Model is the most complete description of the subatomic world that has ever been created in modern physics. The model was built through the 20th century on the foundations of quantum mec… [+8514 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists created synthetic living cells with lifelike functionality - Tech Explorist", "description": "Pioneering research using bacteria brings scientists a step closer to creating artificial cells.", "url": "https://www.techexplorist.com/scientists-created-synthetic-living-cells-lifelike-functionality/53832/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/09/protocell.jpg", "publishedAt": "2022-09-19T13:14:52Z", "content": "At the nexus of living and non-living matter, improving the spontaneous bottom-up construction of artificial cells with high organizational complexity and diversified functions is still a problem. To… [+2814 chars]"}, {"source": {"id": null, "name": "Northropgrumman.com"}, "author": "Rick Robinson", "title": "An Explosion on the Sun - Now. Powered by Northrop Grumman.", "description": "An explosion on the sun helped to enliven the 2022 spring break season. What are solar flares, and what can we learn from them?", "url": "https://now.northropgrumman.com/an-explosion-on-the-sun/", "urlToImage": "https://now.northropgrumman.com/wp-content/uploads/sites/2/2022/09/08-gettyimages-1335793862_explosiononsun.jpg", "publishedAt": "2022-09-19T13:05:44Z", "content": "On Easter weekend, as people were heading out to soak up some rays as spring came into bloom, the sun blew up in a spectacular eruption. According to Interesting Engineering, the blast rated X1.1 on … [+4445 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Sequential interspecies interactions affect production of antimicrobial secondary metabolites in Pseudomonas protegens DTU9.1 | The ISME Journal - Nature.com", "description": "The ISME Journal - Sequential interspecies interactions affect production of antimicrobial secondary metabolites in Pseudomonas protegens DTU9.1", "url": "https://www.nature.com/articles/s41396-022-01322-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41396-022-01322-8/MediaObjects/41396_2022_1322_Fig1_HTML.png", "publishedAt": "2022-09-19T13:02:38Z", "content": "<li>Berendsen RL, Pieterse CMJ, Bakker PAHM. The rhizosphere microbiome and plant health. Trends Plant Sci. 2012;17:47886.\r\nCAS \r\n PubMed \r\n Article \r\nGoogle Scholar \r\n</li><li>Haas D, Défago G. Biol… [+12722 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "The Rhynchocephalians: Prehistoric reptile fossils discovered that are similar to modern day lizards! - Times Now", "description": "Rhynchocephalians are a unique group of creatures that evolved from lizards during the Triassic Period.", "url": "https://www.timesnownews.com/technology-science/the-rhynchocephalians-prehistoric-reptile-fossils-discovered-that-are-similar-to-modern-day-lizards-article-94306186", "urlToImage": "https://static.tnn.in/thumb/msid-94306186,imgsize-100,width-1280,height-720,resizemode-75/94306186.jpg", "publishedAt": "2022-09-19T12:56:09Z", "content": "Legends League Cricket 2022: Full schedule, squads, match timings, streaming details - all you need to know"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Exeter: Quest to uncover intricacies of exoplanet atmospheres reaches important milestone - India Education Diary", "description": "An international team, including astrophysicists from the University of Exeter, is taking lessons and techniques learned from Earth climate science to pave the way to robustly model atmospheres of planets orbiting distant stars, aiding in the search", "url": "https://indiaeducationdiary.in/university-of-exeter-quest-to-uncover-intricacies-of-exoplanet-atmospheres-reaches-important-milestone/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/download-3-2.png?fit=367%2C137&ssl=1", "publishedAt": "2022-09-19T12:45:09Z", "content": "An international team, including astrophysicists from the University of Exeter, is taking lessons and techniques learned from Earth climate science to pave the way to robustly model atmospheres of pl… [+5279 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Utrecht University: 45 million years of Antarctic temperature change- lessons for the future - India Education Diary", "description": "An international team of scientists used molecular fossils and machine learning to build the first charts of Antarctic Ocean temperatures over the past 45 million years, offering important insights into the mechanisms driving temperature changes and", "url": "https://indiaeducationdiary.in/utrecht-university-45-million-years-of-antarctic-temperature-change-lessons-for-the-future/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/12/1200px-Utrecht_University_logo.svg_.png?fit=1024%2C1024&ssl=1", "publishedAt": "2022-09-19T12:41:16Z", "content": "An international team of scientists used molecular fossils and machine learning to build the first charts of Antarctic Ocean temperatures over the past 45 million years, offering important insights i… [+3991 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Using Software to Compare Chemical Composition and 3D Topography in SEM - AZoNano", "description": "While most Scanning Electron Microscopes (SEMs) possess the capability for chemical composition analysis, Digital Surf's MountainsSpectral software is now allow users to combine and comparison this chemical composition analysis with 3D topography data.", "url": "https://www.azonano.com/article.aspx?ArticleID=6237", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/ImageForArticle_6237_16601394536109313.jpg", "publishedAt": "2022-09-19T12:39:00Z", "content": "The significant majority of SEMs (Scanning Electron Microscopes) are equipped with EDS (Energy Dispersive X-Ray Spectroscopy, also known as EDX), which facilitates the quantitative analysis of chemic… [+4697 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Hubble captures spiral arms of a galaxy filled with young suns - India Today", "description": "The Hubble telescope has observed the NGC 1961, a galaxy located 180 million light-years away from us.", "url": "https://www.indiatoday.in/science/story/hubble-captures-spiral-arms-of-a-galaxy-filled-with-young-suns-2002071-2022-09-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/NGC_1961_a-647x363.jpeg?JiEdy.pqbt5jPmeYj7GykKZok2VwnlvZ", "publishedAt": "2022-09-19T12:18:20Z", "content": "The Hubble space telescope, which has now been working in tandem with the James Webb Space Telescope (JWST) has once again beamed back stunning images from deep space. The flying observatory has now … [+1738 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "NiFe Foam as an Electrocatalyst After Harsh Anodization - AZoM", "description": "In an article recently published in the journal ACS Applied Energy Materials, researchers discussed the development of an efficient and stable electrode for oxygen-evolution reaction (OER) through the anodization of a NiFe foam.", "url": "https://www.azom.com/news.aspx?newsID=60028", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_60028_16635891195537527.jpg", "publishedAt": "2022-09-19T12:11:00Z", "content": "In an article recently published in the journal ACS Applied Energy Materials, researchers discussed the development of an efficient and stable electrode for oxygen-evolution reaction (OER) through th… [+5665 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Perseverance Rover Detects, Collects Strange Organic Matter In Wildcat Ridge On Mars - Indiatimes.com", "description": "NASA’s Perseverance rover has been roaming across the Martian terrain for over a year and a half now, and in this time it has managed to make considerable discoveries that have helped us better understand our neighbour.                         NASAAnd now, it…", "url": "https://www.indiatimes.com/technology/science-and-future/perseverance-rover-detects-collects-strange-organic-matter-in-wildcat-ridge-on-mars-580024.html", "urlToImage": "https://im.indiatimes.in/content/2022/Sep/Facebook-Image---2022-09-19T172311753_63285bfcd2b7c.jpg", "publishedAt": "2022-09-19T12:02:16Z", "content": "NASAs Perseverance rover has been roaming across the Martian terrain for over a year and a half now, and in this time it has managed to make considerable discoveries that have helped us better unders… [+1762 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Holographic Microscope to Observe the Brain's Neural Network - AZoOptics", "description": "A new kind of holographic microscope was developed by scientists to observe the neural network in the brain.", "url": "https://www.azooptics.com/News.aspx?newsID=27926", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/SocialSharingImage_27926_16635922985345018.jpg", "publishedAt": "2022-09-19T11:49:00Z", "content": "Sep 19 2022Reviewed by Mila Perera\r\nA new kind of holographic microscope has been developed by scientists headed by Associate Director Wonshik Choi of the Center for Molecular Spectroscopy and Dynami… [+5061 chars]"}, {"source": {"id": null, "name": "Analytics India Magazine"}, "author": "Bhuvana Kamath", "title": "Scientists Draw New Revolutionary Proteins with the Help of AI - Analytics India Magazine", "description": "Advancements ​​in the AI tools has led the researchers to come up with proteins that will lead to many new vaccines, sustainable biomaterials and treatments.", "url": "https://analyticsindiamag.com/scientists-draw-new-revolutionary-proteins-with-the-help-of-ai/", "urlToImage": "https://149695847.v2.pressablecdn.com/wp-content/uploads/2022/09/new-protein.png", "publishedAt": "2022-09-19T11:31:31Z", "content": null}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Jupiter set to make its closest approach to Earth: When and how to watch - CNBCTV18", "description": "Jupiter will be approximately 365 million miles in distance from Earth at its closest approach.", "url": "https://www.cnbctv18.com/science/jupiter-set-to-make-its-closest-approach-to-earth-when-and-how-to-watch-14754991.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/08/jupiter-nasa-twitter-image-1019x573.jpg", "publishedAt": "2022-09-19T11:31:00Z", "content": "Previous Article\r\nIn Pics | Rescue operations, repair work begins after devastating earthquake in Taiwan"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "2D Organic Copper Nanoclusters Reported with 30° Twisted Stacking - AZoNano", "description": "Deterministic molecular stacking of two-dimensional substances with regulated symmetry remains a major challenge. A recent study published in The Journal of Physical Chemistry Letters addresses this issue by reporting a 30° twisted stacking of two-dimensional…", "url": "https://www.azonano.com/news.aspx?newsID=39690", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39690_16635829814432826.jpg", "publishedAt": "2022-09-19T10:25:00Z", "content": "Deterministic molecular stacking of two-dimensional substances with regulated symmetry remains a major challenge. A recent study published in The Journal of Physical Chemistry Letters addresses this … [+5784 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "NASA's Image of Storms on Jupiter is Reminding Internet of Vincent Van Gogh - News18", "description": "The planet has no solid surface, due to which, it is predicted that the multiple hurricane-like storms can take years to subside. The storms are estimated to rise 30 miles (50 km in height).", "url": "https://www.news18.com/news/buzz/nasas-image-of-storms-on-jupiter-is-reminding-internet-of-vincent-van-gogh-5988805.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/jupiter-166357477216x9.png", "publishedAt": "2022-09-19T08:35:24Z", "content": "NASA revealed that it was captured by the Juno spacecraft when it completed its 43rd flyby of Jupiter.\r\nUS space agency NASA has shared a unique photo of hurricane-like storms that have dotted the at… [+2110 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Really Killed Dinosaurs and Other Life on Earth? Maybe NOT an Asteroid Strike - SciTechDaily", "description": "Dartmouth-led research fortifies link between mega volcanoes and mass extinctions. What killed the dinosaurs 66 million years ago at the end of the Cretaceous Period? It has long been the topic of scientific debate, and many researchers have set out to determ…", "url": "https://scitechdaily.com/what-really-killed-dinosaurs-and-other-life-on-earth-maybe-not-an-asteroid-strike/", "urlToImage": "https://scitechdaily.com/images/Dinosaur-Extinction-Asteroid.jpg", "publishedAt": "2022-09-19T08:31:43Z", "content": "ByDartmouth CollegeSeptember 19, 2022\r\nWhile some scientists think that asteroid and comet strikes are the cause of mass extinction events on Earth, new research from Dartmouth points to volcanic eru… [+8330 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Niranjani Jesentha Kumari P", "title": "Can You Find The Hidden Zebra Among The Elephants Within 12 Seconds? Explanation And Solution To the Optical Illusion - News - News", "description": "Can You Find The Hidden Zebra Among The Elephants Within 12 Seconds: The Internet seems to have an insatiable hunger for them, and new optical illusions attract children to adults every day and boost their eagerness to play it. Recently there was an Optical I…", "url": "https://latestnews.fresherslive.com/articles/can-you-find-the-hidden-zebra-among-the-elephants-within-12-seconds-explanation-and-solution-to-the-optical-illusion-1064514", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/09/19/can-you-find-the-hidden-zebra-among-the-elephants-within-12-seconds-explanation-and-solution-to-the-optical-illusion-63281d5f6984f-1663573343.jpg", "publishedAt": "2022-09-19T07:47:10Z", "content": "What Is Optical Illusion?\r\nWhen it comes to optical illusions, the online community can't seem to get enough of them. For some, it's always an enjoyable task, but for others, it's a puzzle. The Inter… [+2965 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "China unveils Mars mission results, rover travels 1.9 kms on Red Planet - India Today", "description": "China National Space Administration has released science results from Mars, which point to more water on the Red Planet.", "url": "https://www.indiatoday.in/science/story/china-unveils-mars-mission-results-rover-travels-1-9-kms-on-red-planet-2001956-2022-09-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/Zhurong_a-647x363.jpeg?wRyZW7xpT9NhKKzUD.bYQopY3QOOpxtn", "publishedAt": "2022-09-19T07:40:48Z", "content": "Over a year after it landed on Mars, China's Zhurong rover has covered 1,921 meters on the surface of the alien planet as it continues to explore the region. The details were released by the China Na… [+2423 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Found A Mysterious Diamond From Outer Space - NDTV", "description": "Researchers believe that the dwarf planet and a sizable asteroid collided approximately 4.5 billion years ago, resulting in the formation of the diamond.", "url": "https://www.ndtv.com/science/scientists-found-a-mysterious-diamond-from-outer-space-3357116", "urlToImage": "https://c.ndtvimg.com/2022-09/7a4vdqa8_lonsdaleite-is-a-rare-hexagonal-form-of-diamond_625x300_19_September_22.jpg", "publishedAt": "2022-09-19T07:38:23Z", "content": "Lonsdaleite is a rare hexagonal form of a diamond.\r\nResearchers from Australia and the United Kingdom have revealed in a recent study that a strange diamond from an ancient dwarf planet found its way… [+1589 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "S Kaviya", "title": "Who are Mykal Michelle Harriss Parents? Mykal Michelle Harris Biography, Parents Name and More - News - News", "description": "Who are Mykal Michelle Harris's Parents? Check this article to know who are Mykal Michelle Harris's Parents along with Mykal Michelle Harris biography. Mykal Michelle Harris is a Actress.", "url": "https://latestnews.fresherslive.com/articles/who-are-mykal-michelle-harris-parents-where-is-mykal-michelle-harris-parents-from-what-is-mykal-michelle-harris-parents-nationality-1064451", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/09/19/who-are-mykal-michelle-harris-parents-where-is-mykal-michelle-harris-parents-from-what-is-mykal-michelle-harris-parents-nationality-63280da79a631-1663569319.jpg", "publishedAt": "2022-09-19T06:46:50Z", "content": "Who are Mykal Michelle Harris's Parents?\r\nMykal Michelle Harris is an Actress born on March 6, 2012. Many people are eager to know their favorite personalities personal life, so Mykal Michelle Harris… [+1214 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Space Telescope: An Enigmatic Astronomical Explosion - SciTechDaily", "description": "A bright young star is surrounded by a shroud of thick gas and dust in this stunning image from the NASA/ESA Hubble Space Telescope. Hubble’s Wide Field Camera 3 (WFC3) inspected a young stellar object, over 9,000 light-years away in the constellation Taurus,…", "url": "https://scitechdaily.com/hubble-space-telescope-an-enigmatic-astronomical-explosion/", "urlToImage": "https://scitechdaily.com/images/IRAS-05506-2414.jpg", "publishedAt": "2022-09-19T06:32:58Z", "content": "ByESA/HubbleSeptember 18, 2022\r\nIRAS 05506+2414 imaged by the Hubble Space Telescope. Credit: ESA/Hubble &amp; NASA, R. Sahai\r\nA bright young star is surrounded by a shroud of thick gas and dust in t… [+2619 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Irene Dominioni", "title": "Meet Samantha Cristoforetti, The Italian Astronaut Soon To Become ISS Commander - Forbes", "description": "The astronaut and former military pilot, also known as AstroSamantha on social media, has become in recent years a beloved public figure in the country.", "url": "https://www.forbes.com/sites/irenedominioni/2022/09/19/meet-samantha-cristoforetti-the-italian-astronaut-soon-to-become-iss-commander/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/632783c85624036f0f515cc5/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-09-19T06:08:54Z", "content": "MILAN, ITALY - OCTOBER 08: Astronaut Samantha Cristoforetti of ESA space agency speaks during the ... [+] ESA (European Space Agency) Futura Mission press conference at the Central Station on October… [+3821 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Monisha Ravisetti", "title": "Einstein's Mind-Bending Theory of Relativity Passes Yet Another Huge Test - CNET", "description": "A satellite has conducted the \"most precise test\" on a cornerstone of the physicist's famous theory.", "url": "https://www.cnet.com/science/space/einsteins-mind-bending-theory-of-relativity-passes-yet-another-huge-test/", "urlToImage": "https://www.cnet.com/a/img/resize/ae9567f1e540e0dc4445a701fa01d0b5cacd96fb/hub/2022/09/14/7e518171-4aba-4187-9d86-8bac4631332c/credit-cnes-2015-satellite-p41480-hd.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-09-19T03:42:38Z", "content": "Scientists sent a satellite to space to test Einstein's weak-equivalence principle with extreme precision.\r\nThe weak-equivalence principle is integral to general relativity, so these test results off… [+5986 chars]"}, {"source": {"id": null, "name": "Gizbot"}, "author": "Vishal Kawadkar", "title": "This Might Be The Most Incredible Photo Captured Of A Dying Comet - Gizbot", "description": "Austrian astrophotographer Gerald Rhemann might have given us arguably the best-ever photo of a dying comet. The photo also shows the dazzling tail of the comet with the endless valley of stars in the backdrop. The image is so breathtaking, that some might ev…", "url": "https://www.gizbot.com/internet/news/this-might-be-the-most-incredible-photo-captured-of-a-dying-comet-082662.html", "urlToImage": "https://www.gizbot.com/img/2022/09/leonardcomet-1663555204.jpg", "publishedAt": "2022-09-19T03:30:00Z", "content": "Austrian astrophotographer Gerald Rhemann might have given us arguably the best-ever photo of a dying comet. The photo also shows the dazzling tail of the comet with the endless valley of stars in th… [+2373 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Oldest vertebrate fossil heart and a 380 mn-year-old story of how our bodies evolved - EastMojo", "description": "In the limestone ranges of Western Australia’s Kimberley region, near the town of Fitzroy Crossing, you’ll find one of the world’s best-preserved ancient", "url": "http://www.eastmojo.com/world/2022/09/19/oldest-vertebrate-fossil-heart-and-a-380-mn-year-old-story-of-how-our-bodies-evolved/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/09/Untitled-design-2022-09-17T155500.292.png?fit=1280%2C720&ssl=1", "publishedAt": "2022-09-19T02:30:00Z", "content": "In the limestone ranges of Western Australias Kimberley region, near the town of Fitzroy Crossing, youll find one of the worlds best-preserved ancient reef complexes.\r\nHere lie the remnants of myriad… [+6864 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "SpaceX launches 54 Starlink satellites to orbit after 5 weather delays - Space.com", "description": "The liftoff occurred Sunday (Sept. 18) at 8:18 p.m. ET.", "url": "https://www.space.com/spacex-starlink-group-4-34-launch-rocket-landing", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zFKvYoYnhDX9xgcyg6GA74-1200-80.jpeg", "publishedAt": "2022-09-19T01:23:44Z", "content": "Mother Nature finally cooperated with SpaceX's latest Starlink mission.\r\nSpaceX\r\n launched 54 Starlink\r\n broadband satellites\r\n from Cape Canaveral Space Force Station in Florida Sunday (Sept. 18) at… [+2944 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Microplastics climbing food chain through both plants and animals, says study - WION", "description": "Plastic particles less than one micrometre in size are primarily the result of bigger plastic pieces being weathered down by natural processes.", "url": "https://www.wionews.com/science/microplastics-climbing-food-chain-through-both-plants-and-animals-says-study-517503", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/09/19/296904-untitled-design-18.png", "publishedAt": "2022-09-18T23:30:51Z", "content": "A new study conducted by the University of Eastern Finland has shown that microplastics are easily climbing the food chain through both plants and animals.\r\nThe study says that plants suck synthetic … [+1796 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Saturn's rings may have formed from a shattered moon - Earth.com", "description": "Saturn’s rings may have formed from a shattered moon • Earth.com", "url": "https://www.earth.com/news/saturns-rings-may-have-formed-from-a-shattered-moon/", "urlToImage": "https://cff2.earth.com/uploads/2022/09/18142124/Saturn-scaled.jpg", "publishedAt": "2022-09-18T22:25:45Z", "content": "The rings of Saturn provide evidence that the planet is spinning at a tilt. Astronomers have long suspected that this tilt comes from gravitational interactions with Neptune, as Saturns tilt spins at… [+2198 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Eric Mack", "title": "No, That Mysterious Fireball That Lit up the Night Sky Wasn't Space Junk - CNET", "description": "It burned long and bright over Ireland and Scotland before going for a permanent swim.", "url": "https://www.cnet.com/science/space/no-that-mysterious-fireball-that-lit-up-the-night-sky-wasnt-space-junk/", "urlToImage": "https://www.cnet.com/a/img/resize/c1cd93f8997482763ce8bd7e46373dba5271b3f9/hub/2022/09/16/0a0474cc-5245-4003-a354-940c578f27be/ff-uk0050-20220914-205931-204-0183552.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-09-18T22:07:00Z", "content": "An unusually bright, long-lasting fireball blazed a path across the skies over Ireland and Scotland Wednesday night, prompting many to wonder if they were witnessing the demise of a SpaceX Starlink s… [+1633 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Can We Live Longer? Physicist’s Breakthrough Discovery in Genetic Protective Layer - SciTechDaily", "description": "Researchers have discovered a new structure of telomeric DNA with the aid of physics and a tiny magnet. Telomeres are seen by many scientists as the key to living longer. They protect genes from damage but get a bit shorter each time a cell divides. If they b…", "url": "https://scitechdaily.com/can-we-live-longer-physicists-breakthrough-discovery-in-genetic-protective-layer/", "urlToImage": "https://scitechdaily.com/images/Telomeres-DNA-Genetics-Illustration.jpg", "publishedAt": "2022-09-18T15:46:21Z", "content": "ByLeiden UniversitySeptember 18, 2022\r\nResearchers have discovered a new structure of telomeric DNA, which could be key to living longer.\r\nResearchers have discovered a new structure of telomeric DNA… [+4787 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Chris Skeldon", "title": "What gave modern humans an advantage over Neanderthals - brytfmonline.com", "description": "By studying fossilized skulls, scientists know that the size of the Neanderthal brain was the...", "url": "https://www.brytfmonline.com/what-gave-modern-humans-an-advantage-over-neanderthals/", "urlToImage": null, "publishedAt": "2022-09-18T12:36:47Z", "content": "By studying fossilized skulls, scientists know that the size of the Neanderthal brain was the same, if not slightly larger, than the size of the brain of modern humans. However, researchers know litt… [+3899 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Matt Williams, Universe Today", "title": "Why artificial gravity may be the best way to help astronauts withstand space - Inverse", "description": "Researchers have learned that artificial gravity could help astronauts reduce the health impacts of long space missions.", "url": "https://www.inverse.com/science/artificial-gravity-space-health", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/9/16/0f5ed427-7562-4d4b-b070-94840832d592-getty-1412889237.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-09-18T10:00:25Z", "content": "Space travel presents\r\n numerous challenges, not the least of which have to do with astronaut health and safety. And the farther these missions venture from Earth, the more significant they become. \r… [+6818 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "James Webb Telescope Captures Enchanting Scenery Of The Orion Nebula In More Detail - Nation World News", "description": "The characteristics of a damaged car thermostat can be seen from the presence of several problems. A faulty car thermostat can come from an engine that often", "url": "https://nationworldnews.com/james-webb-telescope-captures-enchanting-scenery-of-the-orion-nebula-in-more-detail/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/09/James-Webb-Telescope-Captures-Enchanting-Scenery-of-the-Orion-Nebula.jpg", "publishedAt": "2022-09-18T07:28:24Z", "content": "The characteristics of a damaged car thermostat can be seen from the presence of several problems. A faulty car thermostat can come from an engine that often overheats. As a car owner you should know… [+2928 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": null, "title": "Do Stars Form Only In Galaxies Or Outside Them Too? - Science ABC", "description": "Astronomers think that stars form primarily in galaxies. But, there are observations that show that stars could form outside galaxies too.", "url": "https://www.scienceabc.com/nature/universe/do-stars-form-only-in-galaxies-or-outside-them-too.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2019/07/Spiral-galaxy-illustration-of-Milky-Way-Illustration-Alex-MitS.jpg", "publishedAt": "2022-09-18T05:31:57Z", "content": "Astronomers think that stars form primarily in galaxies, but there have also been observations that show that stars could form outside galaxies too.\r\nIn the astronomical community, galaxies are consi… [+9627 chars]"}]}