{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Why do humans dominate northern climates? - EastMojo", "description": "Humans are a tropical species. We have lived in warm climates for most of our evolutionary history, which might explain why so many of us spend winter", "url": "http://www.eastmojo.com/world/2023/01/17/most-humans-havent-evolved-to-cope-with-the-cold-yet-we-dominate-northern-climates-heres-why/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2023/01/Untitled-design-89.png?fit=1280%2C720&ssl=1", "publishedAt": "2023-01-17T04:30:00Z", "content": "Humans are a tropical species. We have lived in warm climates for most of our evolutionary history, which might explain why so many of us spend winter huddled under a blanket, clutching a hot water b… [+7539 chars]"}, {"source": {"id": null, "name": "Solarpaces.org"}, "author": "Susan Kraemer", "title": "Published at ACS - Synthesis, Experimental, and Theoretical Study of Co3–xNixO4 Mixed Oxides: Potential Candidates for Hydrogen Production via Solar Redox Cycles - SolarPACES", "description": "Abstract: Recently, green hydrogen production via solar thermochemical water splitting (STWS) as a clean and sustainable method is becoming a subject of interest to many researchers. Great efforts are being made to develop materials for STWS with suitable ope…", "url": "https://www.solarpaces.org/published-at-acs-synthesis-experimental-and-theoretical-study-of-co3-xnixo4-mixed-oxides-potential-candidates-for-hydrogen-production-via-solar-redox-cycles/", "urlToImage": "https://www.solarpaces.org/wp-content/uploads/Candidates-for-Hydrogen-Production-via-Solar-Redox-Cycles.png", "publishedAt": "2023-01-17T02:45:06Z", "content": "Abstract:Recently, green hydrogen production via solar thermochemical water splitting (STWS) as a clean and sustainable method is becoming a subject of interest to many researchers. Great efforts are… [+1519 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": "Keith Cowing", "title": "Exploring The Solar Poles: The Last Great Frontier Of The Sun - Space Ref", "description": "Despite investments in multiple space and ground-based solar observatories by the global community, the Sun's polar regions remain unchartered territory - the last great frontier for solar observations.", "url": "https://spaceref.com/science-and-exploration/exploring-the-solar-poles-the-last-great-frontier-of-the-sun/", "urlToImage": "https://media2.spaceref.com/wp-content/uploads/2023/01/16210758/Screen-Shot-2023-01-16-at-9.05.52-PM.png", "publishedAt": "2023-01-17T02:10:33Z", "content": "Left: A snapshot of the surface distribution of magnetic fields from a solar surface magnetic field evolution model depicting a perspective close to the plane-of-theecliptic (solar obliquity ignored)… [+3228 chars]"}, {"source": {"id": null, "name": "ecns"}, "author": null, "title": "Nation's space industry hits new heights - ecns", "description": "China's space industry had a busy year in 2022, the highlight of which was completion of one of the world's largest and most sophisticated orbiting infrastructures, the Tiangong space station.", "url": "http://www.ecns.cn/business/2023-01-17/detail-ihcivkeu5244064.shtml", "urlToImage": "http://i2.chinanews.com.cn/simg/hpic/2023/01-17/pic1-40885251.jpeg", "publishedAt": "2023-01-17T00:27:46Z", "content": "(CHINA DAILY)\r\nCompletion of Tiangong orbital hub highlight of busy year\r\nChina's space industry had a busy year in 2022, the highlight of which was completion of one of the world's largest and most … [+4117 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Stunning Images Reveal The Most Detailed Look at The Milky Way in Radio Waves - ScienceAlert", "description": "Two major astronomy research programs, called EMU and PEGASUS, have joined forces to resolve one of the mysteries of our Milky Way: where are all the supernova remnants? A supernova remnant is an expanding cloud of gas and dust marking the last phase...", "url": "https://www.sciencealert.com/stunning-images-reveal-the-most-detailed-look-at-the-milky-way-in-radio-waves", "urlToImage": "https://www.sciencealert.com/images/2023/01/WithAndWithoutRadioImagingComparisonOfMilkyWay2.jpg", "publishedAt": "2023-01-16T23:51:18Z", "content": "Two major astronomy research programs, called EMU and PEGASUS, have joined forces to resolve one of the mysteries of our Milky Way: where are all the supernova remnants?\r\nA supernova remnant is an ex… [+4070 chars]"}, {"source": {"id": null, "name": "Allthatsinteresting.com"}, "author": "Austin Harvey", "title": "Scientists Discovered A New Extinct Tortoise Species In Madagascar - All That's Interesting", "description": "Astrochelys rogerbouri likely went extinct over 600 years ago, but it could help researchers save today's tortoises.", "url": "https://allthatsinteresting.com/astrochelys-rogerbouri", "urlToImage": "https://allthatsinteresting.com/wordpress/wp-content/uploads/2023/01/astrochelys-rogerbouri.jpg", "publishedAt": "2023-01-16T23:27:36Z", "content": "Artwork by Michal Roesser, photo by Massimo DelfinoIllustration depicting native tortoise species of the western Indian Ocean. Living species are those in color; extinct species are grayscale. The ne… [+5277 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Birth of a “Masquerading Monster” – Formation of Massive Star Caught in the Act - SciTechDaily", "description": "Formation of Massive Star Caught in the Act with Magnetic Field Mapping The stellar nursery where the action is taking place, called BYF 73, is not your typical star-forming cloud. It’s relatively small, but at its central core is a young star that holds the …", "url": "https://scitechdaily.com/?p=244433", "urlToImage": "https://scitechdaily.com/images/Magnetic-Field-Orientations-of-BYF-73-scaled.jpg", "publishedAt": "2023-01-16T23:15:22Z", "content": "ByAnashe Bandari, NASAJanuary 16, 2023\r\nThe magnetic field orientations of BYF 73, as derived from SOFIA data, are overlain on a composite image of the region taken by the Spitzer Space Telescope and… [+4619 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Artemis II | Moves To Fully Explore The Surface: New Details Of Man's Return To The Moon - Nation World News", "description": "Humans have begun the countdown to their return to the Moon after more than half a century. As 2025 approaches, the year set for the Artemis III mission, NASA", "url": "https://nationworldnews.com/artemis-ii-moves-to-fully-explore-the-surface-new-details-of-mans-return-to-the-moon-2/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/Artemis-II-Moves-to-fully-explore-the-surface-New.jpeg", "publishedAt": "2023-01-16T23:11:17Z", "content": "Humans have begun the countdown to their return to the Moon after more than half a century. As 2025 approaches, the year set for the Artemis III mission, NASA continues to lay out details about a Moo… [+6322 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "DHNS", "title": "Astronomers from Canada, IISc detect signal from distant galaxy - Deccan Herald", "description": "Astronomers from McGill University in Canada and the Indian Institute of Science (IISc) have used data from the Giant Metrewave Radio Telescope (GMRT), in Pune, to detect a radio signal originating from atomic hydrogen in an extremely distant galaxy.  The IIS…", "url": "https://www.deccanherald.com/state/astronomers-from-canada-iisc-detect-signal-from-distant-galaxy-1181734.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/01/17/galaxy-getty-1181734-1673910196.png", "publishedAt": "2023-01-16T23:03:16Z", "content": "Astronomers from McGill University in Canada and the Indian Institute of Science (IISc) have used data from the Giant Metrewave Radio Telescope (GMRT), in Pune, to detect a radio signal originating f… [+2533 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "A Hybrid Fission/Fusion Reactor Could be the Best way to get Through the ice on Europa - Universe Today", "description": "A new proposal for a hybrid nuclear reactor could power missions to Europa, and was selected by NASA for Phase I development", "url": "https://www.universetoday.com/159634/a-hybrid-fission-fusion-reactor-could-be-the-best-way-to-get-through-the-ice-on-europa/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/10/heic2111e.jpg", "publishedAt": "2023-01-16T22:58:33Z", "content": "In the coming years, NASA and the European Space Agency (ESA) will send two robotic missions to explore Jupiter’s icy moon Europa. These are none other than NASA’s Europa Clipper and the ESA’s Jupite… [+7463 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jim Shelton", "title": "A geochemical journey from the center of the Earth - Phys.org", "description": "Yale researchers have a new theory to explain some of the geochemistry of \"hotspots\"—magma plumes from deep in the Earth that erupt at the surface.", "url": "https://phys.org/news/2023-01-geochemical-journey-center-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/volcano-magma-1.jpg", "publishedAt": "2023-01-16T21:48:03Z", "content": "Yale researchers have a new theory to explain some of the geochemistry of \"hotspots\"magma plumes from deep in the Earth that erupt at the surface.\r\nHawaii and Iceland are tourist hotspotsand it turns… [+3836 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Scientists unearth megaraptors, feathered dinosaur fossils in Chile's Patagonia; Move over Ben Franklin: Laser lightning rod electrifies scientists - Devdiscourse", "description": "Fossils of megaraptors, a carnivorous dinosaur that inhabited parts of South America during the Cretaceous period some 70 million years ago, were found in sizes up to 10 meters long, according to the Journal of South American Earth Sciences.  Move over Ben Fr…", "url": "https://www.devdiscourse.com/article/science-environment/2321624-science-news-roundup-scientists-unearth-megaraptors-feathered-dinosaur-fossils-in-chiles-patagonia-move-over-ben-franklin", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_11_2020_13_59_37_83353.jpg?width=920&format=jpeg", "publishedAt": "2023-01-16T20:55:44Z", "content": "Following is a summary of current science news briefs.\r\nScientists unearth megaraptors, feathered dinosaur fossils in Chile's Patagonia\r\nScientists in Chile's Patagonia region are unearthing the sout… [+1103 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Ohio State University", "title": "How the last 12,000 years have shaped what humans are today - Newswise", "description": "While humans have been evolving for millions of years, the past 12,000 years have been among the most dynamic and impactful for the way we live today, according", "url": "https://www.newswise.com/articles/how-the-last-12-000-years-have-shaped-what-humans-are-today", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-01-16T20:30:00Z", "content": "Newswise — COLUMBUS, Ohio – While humans have been evolving for millions of years, the past 12,000 years have been among the most dynamic and impactful for the way we live today, according to an anth… [+5523 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "NASA Rover Spots Strange Rock On Mars - Forbes", "description": "In a photo taken by the rover Curiosity on its 3,709th day on Mars, a strange rock spotted in the upper right of the image has NASA experts puzzled.", "url": "https://www.forbes.com/sites/davidbressan/2023/01/16/nasa-rover-spots-strange-rock-on-mars/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63c5a5c43d1876be05e5b69a/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-01-16T20:27:34Z", "content": "A mysterious rock was spotted be the rover Curiosity on Mars.\r\nNASA/JPL-Caltech/MSSS\r\nIn a photo taken by the rover Curiosity on its 3,709th day on Mars, a strange rock spotted in the upper right of … [+1676 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Saumya Bohra", "title": "Perseverance Rover Shares Latest Images of Our Red Neighbouring Planet - The Tech Outlook", "description": "NASA’s Perseverance Rover has been exploring Mars since it successfully landed there on February 18. Since then, it has sent back some amazing pictures of our neighbouring planet. Among them is a collection of photographs that NASA unveiled last week", "url": "https://www.thetechoutlook.com/news/science/perseverance-rover-shares-latest-images-of-our-red-neighbouring-planet/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/01/4A69ADC7-D837-4E8E-A38F-9657A9CFD845.jpeg", "publishedAt": "2023-01-16T20:03:14Z", "content": "NASAs Perseverance Rover has been exploring Mars since it successfully landed there on February 18. Since then, it has sent back some amazing pictures of our neighbouring planet. Among them is a coll… [+1673 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Team of Indian astronomers make unique discovery on Mars; here's all you need to know - Republic World", "description": "A team of astronomers from the Indian Institute of Geomagnetism (IIG) have found the first evidence of the presence of solitary waves on Mars.", "url": "https://www.republicworld.com/science/space/team-of-indian-astronomers-make-unique-discovery-on-mars-heres-all-you-need-to-know-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/28uf0knlmxpoklqa_1673888858.jpeg", "publishedAt": "2023-01-16T19:13:00Z", "content": "A team of astronomers from the Indian Institute of Geomagnetism (IIG) have found the first evidence of the presence of solitary waves or distinct electric field fluctuations on Mars. Earth, as we kno… [+1820 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Astha Pasricha", "title": "What makes ice slippery? Here is the reason behind the slippery nature of ice! - Jagran Josh", "description": "Why do you think your ice skates are able to float on ice? What makes the ice slippery? The Complutense University of Madrid led a team of international researchers and solved an astonishing mystery. Let’s know more.", "url": "https://www.jagranjosh.com/general-knowledge/what-makes-ice-slippery-here-is-the-reason-behind-the-slippery-nature-of-ice-1673894903-1", "urlToImage": "https://img.jagranjosh.com/images/2023/January/1712023/LiveScience_11zon.jpg", "publishedAt": "2023-01-16T18:47:00Z", "content": "There are two types of people in the world. The first type loves winters like anything, and the others just hate the chilling weather. No matter which category one belongs to, everyone is in awe of t… [+1765 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Astonishing! Butterfly Nebula got WINGS! NASA reveals secret - HT Tech", "description": "The new study by NASA revealed the secret behind the Butterfly Nebula wings. Notably, most nebulae have circular shapes, but this one is different.", "url": "https://tech.hindustantimes.com/tech/news/astonishing-butterfly-nebula-got-wings-nasa-reveals-secret-71673894541643.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/Butterfly_nebula_1673894662255_1673894671768_1673894671768.PNG", "publishedAt": "2023-01-16T18:45:13Z", "content": "NASA has shocked and awed the public with astonishing images take of objects found in deep space. Whether these images were of stars, planets, Sun, galaxies, asteroids, comets and other celestial obj… [+2153 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Meike Drießen", "title": "Tens of thousands of potential catalysts in the diameter of a single hair - Phys.org", "description": "When searching for catalysts for the energy transition, materials consisting of at least five elements are considered highly promising. But there are theoretically millions of them—how do we identify the most powerful one?", "url": "https://phys.org/news/2023-01-tens-thousands-potential-catalysts-diameter.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/tens-of-thousands-of-f.jpg", "publishedAt": "2023-01-16T18:25:03Z", "content": "When searching for catalysts for the energy transition, materials consisting of at least five elements are considered highly promising. But there are theoretically millions of themhow do we identify … [+3190 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Novel Neurofeedback Technique Enhances Awareness of Mind-Wandering - Neuroscience News", "description": "Researchers have developed a novel neurofeedback technique based on Pavlovian conditioning that detects when a person's mind is wandering.", "url": "https://neurosciencenews.com/mind-wandering-neurofeedback-22265/", "urlToImage": "https://neurosciencenews.com/files/2023/01/neurofeedback-mind-wandering-neurosinces-public.jpg", "publishedAt": "2023-01-16T17:11:54Z", "content": "Summary: Researchers have developed a novel neurofeedback technique based on Pavlovian conditioning that detects when a person’s mind is wandering.\r\nSource: ATR Brain Information Communication Resear… [+7147 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Bradley", "title": "How soldier fly larvae could reduce food waste - Phys.org", "description": "They say an army marches on its stomach, but an army of soldier fly larvae mashes food waste into compost. New work in the International Journal of Environment and Waste Management could help in the fight to mitigate the growing problem of food waste from res…", "url": "https://phys.org/news/2023-01-soldier-fly-larvae-food.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/tiny-army-marches-on-c.jpg", "publishedAt": "2023-01-16T17:00:03Z", "content": "They say an army marches on its stomach, but an army of soldier fly larvae mashes food waste into compost. New work in the International Journal of Environment and Waste Management could help in the … [+2598 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andrew Nellis", "title": "To predict environmental changes, researchers create a new generation of wireless sensor networks - Phys.org", "description": "The \"internet of things,\" a growing web of interconnected devices—constituting everything from smart bulbs to warehouse robots—is posited as a central pillar of the \"fourth industrial revolution\" because of how drastically it improves connectivity and informa…", "url": "https://phys.org/news/2023-01-environmental-generation-wireless-sensor-networks.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/to-predict-environment.jpg", "publishedAt": "2023-01-16T16:56:04Z", "content": "The \"internet of things,\" a growing web of interconnected devicesconstituting everything from smart bulbs to warehouse robotsis posited as a central pillar of the \"fourth industrial revolution\" becau… [+6537 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Molecular fate-mapping of serum antibody responses to repeat immunization - Nature.com", "description": "Nature - Molecular fate-mapping of serum antibody responses to repeat immunization", "url": "https://www.nature.com/articles/s41586-023-05715-3", "urlToImage": null, "publishedAt": "2023-01-16T16:13:29Z", "content": "<li>Laboratory of Lymphocyte Dynamics, The Rockefeller University, New York, NY, USA\r\nAriën Schiepers, Marije F. L. van t Wout, Luka Mesin &amp; Gabriel D. Victora\r\n</li><li>Basic Sciences Division a… [+618 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Laser desorption mass spectrometry with an Orbitrap analyser for in situ astrobiology - Nature.com", "description": "A miniaturized instrument comprising a pulsed UV laser system and an Orbitrap analyser enables the characterization of the organic content and chemical composition of planetary materials, supporting the science objectives of future planetary missions.", "url": "https://www.nature.com/articles/s41550-022-01866-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41550-022-01866-x/MediaObjects/41550_2022_1866_Fig1_HTML.png", "publishedAt": "2023-01-16T16:02:18Z", "content": "<li>Johnson, S. S., Anslyn, E. V., Graham, H. V., Mahaffy, P. R. &amp; Ellington, A. D. Fingerprinting non-terran biosignatures. Astrobiology18, 915922 (2018).\r\nArticle \r\n ADS \r\nGoogle Scholar \r\n</li… [+10267 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "'Impossible' neutron stars could explain strange flashes - Space.com", "description": "Neutron-star mergers could create hypermassive neutron stars that are the fastest spinning stars in the universe.", "url": "https://www.space.com/hypermassive-neutron-stars-oscillating-gamma-ray-bursts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gqsSvCBZAZLoVJs3gyqZCP-1200-80.jpg", "publishedAt": "2023-01-16T16:00:51Z", "content": "The oscillating frequencies of two short gamma-ray bursts are the best evidence yet for the formation of 'impossible' hypermassive neutron stars that can briefly defy gravity before collapsing to for… [+5713 chars]"}, {"source": {"id": null, "name": "Bangkok Post"}, "author": "AFP", "title": "Runaway W. Antarctic ice sheet collapse not 'inevitable': study - Bangkok Post", "description": "PARIS - The runaway collapse of the West Antarctic Ice Sheet -- which would trigger catastrophic sea level rise -- is not \"inevitable\", scientists said Monday following research that tracked the region's recent response to climate change.", "url": "https://www.bangkokpost.com/world/2483945/runaway-w-antarctic-ice-sheet-collapse-not-inevitable-study", "urlToImage": "https://static.bangkokpost.com/media/content/20230116/c1_4605845_700.jpg", "publishedAt": "2023-01-16T15:45:00Z", "content": "PARIS - The runaway collapse of the West Antarctic Ice Sheet -- which would trigger catastrophic sea level rise -- is not \"inevitable\", scientists said Monday following research that tracked the regi… [+3794 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "How to watch the first spacewalk of two ISS astronauts on Friday? Here are the details - Economic Times", "description": "January 20, seal the date when, for the first time, two astronauts from the International Space Station (ISS) walk out to install new hardware to the stations exterior.", "url": "https://economictimes.indiatimes.com/news/international/us/how-to-watch-the-first-spacewalk-of-two-iss-astronauts-on-friday-here-are-the-details/articleshow/97036667.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97036796,width-1070,height-580,imgsize-56270,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-16T15:31:00Z", "content": "Two astronauts from the International Space Station (ISS) will walk out of the stations Quest airlock for the first time, to install new hardware on the exterior on Friday, January 20.NASA will live … [+1577 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers find a simple way to predict the properties of compounds of drugs with metals - News-Medical.Net", "description": "RUDN University chemists, biologists and physicians have found a simple way to predict the properties of compounds of drugs with metals.", "url": "https://www.news-medical.net/news/20230116/Researchers-find-a-simple-way-to-predict-the-properties-of-compounds-of-drugs-with-metals.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2020/3/shutterstock_1054148270_ebcc7adac18445889666f7e1f5dbad85-620x480.jpg", "publishedAt": "2023-01-16T15:09:00Z", "content": "RUDN University chemists, biologists and physicians have found a simple way to predict the properties of compounds of drugs with metals. This can be done using topological indices - numbers that desc… [+3326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "How Russia is planning a rescue mission to bring astronauts home - The Indian Express", "description": "The astronauts had been scheduled to return to Earth in March, but they will now remain in orbit for several more months.", "url": "https://indianexpress.com/article/explained/explained-sci-tech/russia-rescue-mission-astronauts-home-explained-8385603/", "urlToImage": "https://images.indianexpress.com/2023/01/russia-space-station.jpg", "publishedAt": "2023-01-16T15:07:04Z", "content": "This is the next Soyuz that was scheduled to fly in March, said Joel Montalbano, the space station program manager at NASA. Itll just fly a little earlier.\r\nThe need for a new Soyuz arose after the o… [+1833 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "An Analysis of an Active Galactic Nucleus - AZoQuantum", "description": "Active galactic nuclei are known to be the strongest compact steady sources of energy in the universe. This has been powered by supermassive black holes that tend to swallow matter in the galaxies’ center.", "url": "https://www.azoquantum.com/News.aspx?newsID=9379", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_9379_16738696003753545.png", "publishedAt": "2023-01-16T14:27:00Z", "content": "Active galactic nuclei are known to be the strongest compact steady sources of energy in the universe. \r\nAn artist’s impression of what the dust around an active galactic nucleus might look like seen… [+3835 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Sidharth MP", "title": "International Space Station evaded three collision risks in 2022 - WION", "description": "International Space Station evaded three collision risks in 2022", "url": "https://www.wionews.com/science/international-space-station-evaded-three-collision-risks-in-2022-553222", "urlToImage": "http://cdn.wionews.com/sites/default/files/2021/11/16/221906-untitled-design-2021-11-16t091411826.jpg", "publishedAt": "2023-01-16T14:05:21Z", "content": "The International Space Station (ISS) had to perform three collision avoidance manoeuvres (CAM) in the year 2022 alone, in contrast with the total of 33 manoeuvres it has had to do since 1999. \r\nThe … [+2408 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "SpaceX launches its Falcon Heavy rocket with a classified military payload for US Space Force - Firstpost", "description": "SpaceX launched two satellites for the US Space Force on their Falcon Heavy rocket. Later this week, they will also launch a Falcon 9 rocket, to launch 51 Starlink broadband satellites into low-Earth orbit.", "url": "https://www.firstpost.com/tech/news-analysis/spacex-launches-its-falcon-heavy-rocket-with-a-classified-military-payload-for-us-space-force-11996412.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/01/SpaceX-launches-its-Falcon-Heavy-rocket-with-a-classified-military-payload-for-US-Space-Force.jpg", "publishedAt": "2023-01-16T13:44:11Z", "content": "FP StaffJan 16, 2023 19:14:11 IST\r\nElon Musks SpaceX launched a triple-core Falcon Heavy rocket from the Kennedy Space Center to launch two classified satellites for the US Space Force. Reports sugge… [+2321 chars]"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Innovative nano-coating can help harvest energy in space - Innovation News Network", "description": "A research team has invented a nano-coating that can reduce the operating temperatures of space-qualified structures from 120°C to 60°C.", "url": "https://www.innovationnewsnetwork.com/innovative-nano-coating-can-help-harvest-energy-in-space/28890/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2023/01/shutterstockAlones_1916757824.jpg", "publishedAt": "2023-01-16T13:40:40Z", "content": "The nano-coating, named the Multifunctional Nanobarrier Structure (MFNS), can be used alongside a spacecraft’s sensors and advanced composite materials thanks to its custom-built, room temperature ap… [+2521 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop an artificial neuron closely mimicking the characteristics of a biological neuron - News-Medical.Net", "description": "Researchers reported a conductance-based organic electrochemical neuron that mimicked biological signaling in neurons, especially activation/inactivation of their sodium and potassium channels.", "url": "https://www.news-medical.net/news/20230116/Researchers-develop-an-artificial-neuron-closely-mimicking-the-characteristics-of-a-biological-neuron.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_735888_16738754953665231.jpg", "publishedAt": "2023-01-16T13:39:00Z", "content": "In a recent article published in Nature Materials, researchers reported a conductance-based organic electrochemical neuron (c-OECN) that mimicked biological signaling in neurons, especially activatio… [+4381 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Intelligent bacteria for IBD - Nature.com", "description": "A recent study reports the development of a biomarker-responsive engineered bacterium that can diagnose, record and treat inflammatory bowel disease in mice.", "url": "https://www.nature.com/articles/s41579-023-00854-w", "urlToImage": null, "publishedAt": "2023-01-16T13:37:00Z", "content": "Gut diseases such as inflammatory bowel disease (IBD) are becoming more common, but traditional methods for their diagnosis (for example, colonoscopy) are invasive and can be traumatic for patients. … [+452 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "This \"embrace\" Of Two Black Holes Allows Us To Study How Our Own Galaxy Might End - Nation World News", "description": "join the conversation", "url": "https://nationworldnews.com/this-embrace-of-two-black-holes-allows-us-to-study-how-our-own-galaxy-might-end/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/This-embrace-of-two-black-holes-allows-us-to-study.png", "publishedAt": "2023-01-16T13:25:33Z", "content": "Graphical representation of a binary black hole. Image: Wikipedia\r\nImposed rise at the center of great galaxies black holes, Understanding how they work has been one of the most important puzzles in … [+2282 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Early universe's galaxies surprisingly diverse, JWST finds - Space.com", "description": "Even early on, 'galaxies were already fairly evolved and had a wide range of structures.'", "url": "https://www.space.com/galaxies-early-universe-surprisingly-diverse-james-webb-space-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/a8vqR4pUukywRs5wiWpFTk-1200-80.png", "publishedAt": "2023-01-16T13:00:23Z", "content": "The James Webb Space Telescope is changing our understanding of the cosmos.\r\nGalaxies in the early days of the universe were much more varied and mature than previously thought, according to a new st… [+2065 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "NanoMEGAS Workshop: Precession Electron Diffraction - AZoNano", "description": "AZoNano was given the opportunity to join the interactive workshop on Precession Electron Diffraction hosted by NanoMEGAS and QuantumDesign.", "url": "https://www.azonano.com/article.aspx?ArticleID=6352", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6352_16733488471816524.jpg", "publishedAt": "2023-01-16T12:26:00Z", "content": "Last November, Quantum Design and NanoMEGAS invited industry and research professionals to learn more about the theoretical and practical applications of Precession Electron Diffraction (PED). Fittin… [+6433 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Developing Carbon-Based Molecules with Interlocking Rings - AZoNano", "description": "A novel nanomaterial has emerged. Chemists at the University of Oregon have discovered a method to create carbon-based molecules with a distinct structural feature: interlocking rings.", "url": "https://www.azonano.com/news.aspx?newsID=39993", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39993_16738705517914967.jpg", "publishedAt": "2023-01-16T12:04:00Z", "content": "A novel nanomaterial has emerged. Chemists at the University of Oregon have discovered a method to create carbon-based molecules with a distinct structural feature: interlocking rings.\r\nImage Credit:… [+3367 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Achieving Accurate Measurements of Microscopic Objects Using Quantum Computers - AZoQuantum", "description": "At the Australian National University (ANU), a new study headed by a research group has described an approach to achieve highly precise measurements of microscopic objects with the help of quantum computers.", "url": "https://www.azoquantum.com/News.aspx?newsID=9378", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/SocialSharingImage_9378_16738704351062759.jpg", "publishedAt": "2023-01-16T12:02:00Z", "content": "At the Australian National University (ANU), a new study headed by a research group has described an approach to achieve highly precise measurements of microscopic objects with the help of quantum co… [+4294 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Ural Federal University Scientists Specify Rare Astronomical Phenomena Of January - India Education Diary", "description": "In January, all the brightest celestial bodies in the sky can be seen simultaneously by residents of the Urals and Perm. They can be observed even with the naked eye. Vladilen Sanakoev, Engineer at the UrFU Training Astronomical Observatory, told URA", "url": "https://indiaeducationdiary.in/ural-federal-university-scientists-specify-rare-astronomical-phenomena-of-january/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png?fit=534%2C462&ssl=1", "publishedAt": "2023-01-16T11:38:14Z", "content": "In January, all the brightest celestial bodies in the sky can be seen simultaneously by residents of the Urals and Perm. They can be observed even with the naked eye. Vladilen Sanakoev, Engineer at t… [+1196 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA wants your help to discover and study alien planets - The Indian Express", "description": "NASA's Exoplanet Watch citizen science is now open to everyone and you can help scientists discover and study exoplanets even if you don't own a telescope.", "url": "https://indianexpress.com/article/technology/nasa-exoplanet-watch-8385124/", "urlToImage": "https://images.indianexpress.com/2023/01/NASA-exoplanet-watch-20230116.jpg", "publishedAt": "2023-01-16T10:40:59Z", "content": "Scientists have so far confirmed the existence of over 5,000 planets outside of our solar system. They display a wide variety of distinct characteristics, like clouds made of glass and twin suns. But… [+4475 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Researchers develop unified theory for formation of rocky planets - News9 LIVE", "description": "The new theory can explain several characteristics of rocky exoplanets", "url": "https://www.news9live.com/science/researchers-develop-unified-theory-for-formation-of-rocky-planets-au941-2026712", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/01/Batygin_Konstantin-Planet-Fa.2e16d0ba.jpg", "publishedAt": "2023-01-16T10:22:21Z", "content": "The new theory can explain several characteristics of rocky exoplanets\r\n<ul><li>The new theory can explain the formation of rocky super-Earths observed in other star systems. </li><li>The theory can … [+3064 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Watch: Why older fathers pass on more genetic mutations to their offspring - Times of India", "description": "The male reproductive system serves as a hotspot for the emergence of new genes. Perhaps that explains why more new mutations are inherited from fathers than from mothers. It doesn't, however, clarify why older fathers pass on more mutations than you>", "url": "https://timesofindia.indiatimes.com/videos/news/watch-why-older-fathers-pass-on-more-genetic-mutations-to-their-offspring/videoshow/97028045.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-97028045,imgsize-40360.cms", "publishedAt": "2023-01-16T10:03:22Z", "content": "Jan 16, 2023, 03:33PM ISTSource: ANIThe male reproductive system serves as a hotspot for the emergence of new genes. Perhaps that explains why more new mutations are inherited from fathers than from … [+587 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "A cosmic crowd! Incredible Hubble image reveals a suite of astronomical objects including an interloper - Devdiscourse", "description": "Read more about A cosmic crowd! Incredible Hubble image reveals a suite of astronomical objects including an interloper on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2320799-a-cosmic-crowd-incredible-hubble-image-reveals-a-suite-of-astronomical-objects-including-an-interloper", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/16_01_2023_14_47_58_8165766.jpg?width=920&format=jpeg", "publishedAt": "2023-01-16T09:18:29Z", "content": "This image from the NASA/ESA Hubble Space Telescope contains a multitude of astronomical objects. In the background, galaxies of various shapes and sizes - from stately spirals to fuzzy ellipticals -… [+1698 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "刘明", "title": "Chinese, European Mars probes help examine atmosphere near sun - China Daily", "description": "In an \"almost-out-of-service\" period in 2021, China's Tianwen-1 orbiter, along with Mars Express of the European Space Agency, helped solar scientists know more about what happens near the sun.", "url": "https://www.chinadaily.com.cn/a/202301/16/WS63c51379a31057c47eba9e50.html", "urlToImage": "http://img2.chinadaily.com.cn/images/202301/16/63c51379a31057c4b4b362f6.png", "publishedAt": "2023-01-16T09:05:00Z", "content": "[Photo/Shanghai Astronomical Observatory of the Chinese Academy of Sciences] \r\nSHANGHAI -- In an \"almost-out-of-service\" period in 2021, China's Tianwen-1 orbiter, along with Mars Express of the Euro… [+1414 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Diversity of skulls among early dinosaurs demonstrates innovation by evolution - News9 LIVE", "description": "The study shows that early herbivorous dinosaurs came up with a wide range of approaches to consume plants", "url": "https://www.news9live.com/science/diversity-of-skulls-among-early-dinosaurs-demonstrates-innovation-by-evolution-au941-2026676", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/01/Heterodontosaurus-tucki-reconstruction.jpg", "publishedAt": "2023-01-16T08:52:13Z", "content": "The study shows that early herbivorous dinosaurs came up with a wide range of approaches to consume plants\r\n<ul><li>Most dinosaurs were plant eaters, all descended from a carnivorous ancestor. </li><… [+2294 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "RARE Green Comet seen in Abu Dhabi; You can still watch it; it will come after 50000 years - HT Tech", "description": "The rare, once in 50000 years, green comet has reached its closest point to the Sun and it was just snapped in Abu Dhabi. You can catch a glimpse of it. Know when and how.", "url": "https://tech.hindustantimes.com/tech/news/rare-green-comet-seen-in-abu-dhabi-you-can-still-watch-it-it-will-come-after-50000-years-71673858916553.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/c2022E3_ZTF_Bartlett800_1673859041134_1673859064235_1673859064235.png", "publishedAt": "2023-01-16T08:51:53Z", "content": "An extremely rare green comet, which has made a once-in-50000-year appearance from space was spotted in Abu Dhabi on January 14. The International Astronomy Centre (IAC) tweeted this message while sh… [+1714 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Hubble Spots Black Hole Twisting A Star Into A Doughnut As It’s Slowly Devoured - Indiatimes.com", "description": "The Hubble Space Telescope has discovered a star being stretched like a doughnut as a black hole devours it, reveals a report by LiveScience.                         NASAThe black hole in question is located at the core of the galaxy ESO 583-G004, around 300 …", "url": "https://www.indiatimes.com/technology/science-and-future/hubble-spots-black-hole-twisting-a-star-into-a-doughnut-as-its-slowly-devoured-590371.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jan/Facebook-Image---2023-01-16T140157967_63c50e1c59848.jpg", "publishedAt": "2023-01-16T08:40:54Z", "content": "The Hubble Space Telescope has discovered a star being stretched like a doughnut as a black hole devours it, reveals a report by LiveScience. \r\nNASA\r\nThe black hole in question is located at the core… [+1496 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Surprise! NASA just found Opal gems on Mars - HT Tech", "description": "NASA's Curiosity Rover has found opal gems on Mars.", "url": "https://tech.hindustantimes.com/tech/news/surprise-nasa-just-found-opal-gems-on-mars-71673855989510.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/ghdj_1673856229236_1673856278078_1673856278078.jpg", "publishedAt": "2023-01-16T08:07:49Z", "content": "NASA rovers on Mars have been looking for clues to water or any other source of life. Now, in a big surprise, NASA's Curiosity Rover, which has been exploring the surface of Mars, has found water-ric… [+1826 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "James Webb Space Telescope snaps NGC 346 that is 'furiously forming stars' - HT Tech", "description": "The new findings from the James Webb Space Telescope is all about solving the mysteries of NGC346, one of the most dynamic star-forming regions in near our Milky Way Galaxy, says ESA.", "url": "https://tech.hindustantimes.com/tech/news/james-webb-space-telescope-snaps-ngc-346-that-is-furiously-forming-stars-71673853371624.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/Webb_inspects_NGC_346_pillars_1673853509990_1673853527581_1673853527581.jpg", "publishedAt": "2023-01-16T07:21:16Z", "content": "The universe is full of mysteries. Some are horrifying and some are awesome. To find out what is going on in outer space, NASA and ESA have deployed a number of telescopes and the newest one is the J… [+1958 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 16 January 2023: Moon-pockmarked by asteroid strikes - HT Tech", "description": "NASA’s Astronomy Picture of the Day is a stunning image of the Moon, showing all of its features in detail.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-16-january-2023-moon-pockmarked-by-asteroid-strikes-71673850905066.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/Untitled_desi_1673851041158_1673851053360_1673851053360.jpg", "publishedAt": "2023-01-16T06:38:43Z", "content": "The Moon has long been one of the central pieces of the studies related to Earth. Its presence influences various phenomena on the planet, such as tides. The Moon is believed to have formed about 4.5… [+1706 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Supermassive black hole found: 400 previously unknown black holes discovered by NASA's Chandra X-ray Observato - Times Now", "description": "Astronomers have made a groundbreaking discovery of more than 400 previously undiscovered black holes located in the centers of galaxies.", "url": "https://www.timesnownews.com/technology-science/supermassive-black-hole-found-400-previously-unknown-black-holes-discovered-by-nasas-chandra-x-ray-observatory-article-97021613", "urlToImage": "https://static.tnn.in/thumb/msid-97021613,imgsize-100,updatedat-1673850229977,width-1280,height-720,resizemode-75/97021613.jpg", "publishedAt": "2023-01-16T06:24:35Z", "content": "Budget 2023: Issue is not what a freebie is, it is whether you will be able to give that or not: FM Sitharaman"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Rameesha Sajwar", "title": "NASA Is Considering Surfing The Lakes Of Saturn’s Moon With An Autonomous Airplane - Wonderful Engineering", "description": "Advertisement NASA’s Innovative Advanced Concepts (NIAC) program has explored some very bold concepts over the years. Let it be giant radio tele", "url": "https://wonderfulengineering.com/nasa-is-considering-surfing-the-lakes-of-saturns-moon-with-an-autonomous-airplane/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2023/01/IMG003039.jpg", "publishedAt": "2023-01-16T05:36:58Z", "content": "NASA’s Innovative Advanced Concepts (NIAC) program has explored some very bold concepts over the years. Let it be giant radio telescopes on the far side of the Moon or interstellar object-chasing “or… [+1906 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Electron injection builds novel crystalline carbons - Chemie.de", "description": "Charge injection was widely utilized in tuning the energy level of electrons in semiconductors without altering their microscopic structures. Recently, a research team led by Professor ZHU Yanwu f ...", "url": "https://www.chemeurope.com/en/news/1179156/electron-injection-builds-novel-crystalline-carbons.html", "urlToImage": "https://img.chemie.de/Portal/News/63c11a349e8fb_mKslFGLCd.png?tr=n-xzoom", "publishedAt": "2023-01-16T05:17:38Z", "content": "Charge injection was widely utilized in tuning the energy level of electrons in semiconductors without altering their microscopic structures. Recently, a research team led by Professor ZHU Yanwu from… [+1930 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Earth facing danger from a skyscraper-sized asteroid! Close approach today - HT Tech", "description": "A monstrous 420-foot asteroid could make a close approach to Earth as soon as today, NASA has revealed.", "url": "https://tech.hindustantimes.com/tech/news/earth-facing-danger-from-a-skyscraper-sized-asteroid-close-approach-today-71673832916391.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/16/1600x900/asteroid-3113282_960_720_1672570457957_1673833027403_1673833027403.webp", "publishedAt": "2023-01-16T01:38:04Z", "content": "Astronomers have been keeping a close eye on asteroids that pass near Earth, as these space rocks have the potential to be dangerous to Earth. In recent years, there have been several close calls wit… [+1831 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "Ayyappan R", "title": "Are we safe from a sudden asteroid strike? No, says India's first meteor scientist - Onmanorama", "description": "For every potentially damaging asteroid spotted, there are millions falling towards the Earth unseen.", "url": "https://www.onmanorama.com/news/kerala/2023/01/16/is-earth-safe-asteroid-attack-indias-first-meteor-scientist-aswin-sekhar.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/kerala/top-news/images/2023/1/16/asteroid1.jpg", "publishedAt": "2023-01-16T00:56:01Z", "content": "The most devastating extinctions, when almost the entire life on earth was wiped out, had happened in prehistoric times. The most recent was 66 million years ago when dinosaurs were killed off.\r\nThou… [+6896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study Suggests Dark Matter May Be Made of Dark Photons - SciTechDaily", "description": "The hypothetical new particles could potentially account for the observations made by the Cosmic Origin Spectrograph on the Hubble Space Telescope. According to a new study published in Physical Review Letters, it is possible that dark matter is composed of u…", "url": "https://scitechdaily.com/?p=242819", "urlToImage": "https://scitechdaily.com/images/New-Hints-That-Dark-Matter-Could-Be-Made-Up-of-Dark-Photons-scaled.jpg", "publishedAt": "2023-01-16T00:18:22Z", "content": "ByInternational School for Advanced Studies (SISSA)January 15, 2023\r\n2D projection of the cosmic web as obtained from a supercomputer simulation. Credit: Dr. Ewald Puchwein and the Sherwood-Relics co… [+1956 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Can humanity's new giant leap into space succeed? - BBC", "description": "Humanity is set for its next big leap into space with nations and private companies racing to build outposts on other worlds", "url": "https://www.bbc.com/news/science-environment-64039146", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/100C/production/_128080140_mediumrocket.jpg", "publishedAt": "2023-01-16T00:05:13Z", "content": "There is a new order emerging in space - a race between America and China. But with the demands of space exploration, even these great superpowers won't be able to do it alone. \r\nHugely technically c… [+9152 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Links: January 15, 2023 | Hackaday - Hackaday", "description": "It looks like the Martian winter may have claimed another victim, with reports that Chinese ground controllers have lost contact with the Zhurong rover. The solar-powered rover was put into hiberna…", "url": "https://hackaday.com/2023/01/15/hackaday-links-january-15-2023/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2023-01-16T00:00:00Z", "content": "It looks like the Martian winter may have claimed another victim, with reports that Chinese ground controllers have lost contact with the Zhurong rover. The solar-powered rover was put into hibernati… [+4347 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Space Exploration Collaboration, Webb Reveals Galaxies From Dawn of the Universe - SciTechDaily", "description": "Continuing a collaboration in space exploration … Space station research heads back to Earth … And highlighting new science from NASA missions … A few of the stories to tell you about – This Week at NASA! https://youtu.be/kvskiBVlRiE US, Japan Sign Space Agre…", "url": "https://scitechdaily.com/?p=244300", "urlToImage": "https://scitechdaily.com/images/Orion-Approaching-Full-Gateway-Configuration.jpg", "publishedAt": "2023-01-15T19:25:07Z", "content": "ByNASAJanuary 15, 2023\r\nA view of the full Gateway configuration with Orion approaching Gateway. Credit: NASA/Alberto Bertolin\r\nContinuing a collaboration in space exploration \r\nSpace station researc… [+3080 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Orbit of Doom: The Surprising Connection Between Earth's Orbital Patterns and an Ancient Warming Event - SciTechDaily", "description": "An international team of scientists has suggested that changes in Earth's orbit that resulted in hotter conditions may have played a role in triggering a rapid global warming event that occurred 56 million years ago. This event, known as the Paleocene-Eocene …", "url": "https://scitechdaily.com/orbit-of-doom-the-surprising-connection-between-earths-orbital-patterns-and-an-ancient-warming-event/", "urlToImage": "https://scitechdaily.com/images/Future-Earth-Global-Warming.jpg", "publishedAt": "2023-01-15T17:33:28Z", "content": "ByPenn StateJanuary 15, 2023\r\nAn international team of scientists has found that changes in Earths orbit that favored hotter conditions may have helped trigger a rapid global warming event 56 million… [+5845 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Bizarre Creature From China Had a Dinosaur Head on Bird's Body – a Missing Link From 120 Million Years Ago - Good News Network", "description": "A new fossil of a 'bizarre' creature shines fresh light on an evolutionary mystery with its T-rex-like skull attached to the body of a bird.", "url": "https://www.goodnewsnetwork.org/bizarre-creature-from-china-had-a-dinosaur-head-on-birds-body-a-missing-link/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/01/dinosaur-bird-Cratonavis-zhui-Chinese-Academy-of-Sciences-via-SWNS.jpg", "publishedAt": "2023-01-15T16:56:01Z", "content": "Cratonavis zhui Chinese Academy of Sciences via SWNS\r\nThe evolution of dinosaurs into birds is a transition that encompasses such dramatic morphological changes that paleontologists are still scratch… [+3662 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "5 most exciting Space Missions in 2023: OSIRIS-REx, SpaceX, Psyche asteroid mission, more - HT Tech", "description": "Looking forward to some of the most exciting space missions in 2023? We definitely are! From Moon, Jupiter, and well beyond that, check out the 5 most exciting Space Missions slated for this year.", "url": "https://tech.hindustantimes.com/web-stories/5-most-exciting-space-missions-in-2023-osiris-rex-spacex-psyche-asteroid-mission-more-71673785299458.html", "urlToImage": null, "publishedAt": "2023-01-15T14:01:04Z", "content": "The missions plan explains that after a 7 to 8-year cruise to Jupiter, utilizing Earth and Venus gravity assists, JUICE will go into orbit around Jupiter in 2031 to examine its moons Ganymede, Europa… [+48 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Ethical ancient DNA research must involve descendant communities - ANI News", "description": "The analysis of ancient DNA allows scientists to trace human evolution and make important discoveries about modern populations. The data revealed by ancient DNA sampling can be valuable, but the human remains that carry this ancient DNA are often those of the…", "url": "https://www.aninews.in/news/science/ethical-ancient-dna-research-must-involve-descendant-communities20230115145744", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230115091326.jpg", "publishedAt": "2023-01-15T09:27:00Z", "content": "Washington [US], January 15 (ANI): The analysis of ancient DNA allows scientists to trace human evolution and make important discoveries about modern populations. The data revealed by ancient DNA sam… [+1807 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Reuters", "title": "Astronomers Discover Milky Way Galaxy's Most-Distant Stars - Voice of America - VOA News", "description": "Furthest of them is 1.08 million light years from Earth", "url": "https://www.voanews.com/a/astronomers-discover-milky-way-galaxy-s-most-distant-stars/6916997.html", "urlToImage": "https://gdb.voanews.com/022a0000-0aff-0242-3e2a-08daf5661dde_w1200_r1.jpg", "publishedAt": "2023-01-15T08:08:56Z", "content": "Astronomers have detected in the stellar halo that represents the Milky Way's outer limits a group of stars more distant from Earth than any known within our own galaxy - almost halfway to a neighbor… [+3241 chars]"}]}