{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Colossal asteroid rushing towards Earth today at great pace, NASA warns - HT Tech", "description": "NASA has warned about a gigantic asteroid heading towards Earth today! Is it potentially hazardous for Earth? Know what NASA revealed.", "url": "https://tech.hindustantimes.com/tech/news/colossal-asteroid-rushing-towards-earth-today-at-great-pace-nasa-warns-71687592176674.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/asteroid-field-7646062_1280_1682663234265_1687592276165.jpg", "publishedAt": "2023-06-24T07:39:26Z", "content": "The presence of asteroids has always raised concerns as they have the potential to collide with our planet, causing substantial damage. Notably, most of these asteroids reside in space between the or… [+1967 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Global warming could surge the CO2 emissions from soil microbes - Tech Explorist", "description": "Microbial CO2 emissions in the polar regions will increase twice as much as in the rest of the world.", "url": "https://www.techexplorist.com/global-warming-surge-co2-emissions-soil-microbes/62828/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/soil-microbes.jpg", "publishedAt": "2023-06-24T06:10:52Z", "content": "The greatest terrestrial carbon supplier to the atmosphere, carbon efflux from soils is nevertheless one of the Earth’s carbon budget’s least predictable fluxes. A dominant component of this flux is … [+4551 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Tsiolkovsky's Rocket Equation Paradox: The Balancing Act of Space Exploration - Transcontinental Times", "description": "Tsiolkovsky's Rocket Equation, formulated over a century ago, remains a fundamental principle. However, this equation also presents a paradox that poses a significant hurdle for space missions.", "url": "https://www.transcontinentaltimes.com/tsiolkovskys-rocket-equation-paradox/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/befunky_2023-5-6_11-14-24-1.jpg", "publishedAt": "2023-06-24T05:56:05Z", "content": "INDIA: Space exploration has captivated the human imagination for centuries, but it was Konstantin Tsiolkovsky, a Russian scientist and father of astronautics, who laid the foundation for understandi… [+3790 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Sun BLASTS another solar flare at Earth; Know the geomagnetic storm warning - HT Tech", "description": "Geomagnetic storm warnings are incoming after another solar flare erupted on the Sun. This time, it was an M 4.9-class solar flare.", "url": "https://tech.hindustantimes.com/tech/news/sun-blasts-another-solar-flare-at-earth-know-the-geomagnetic-storm-warning-71687585642127.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/g55452219aca037399358a816957cb701756ab19a372f2b0d8_1687585682449_1687585682569.png", "publishedAt": "2023-06-24T05:54:22Z", "content": "We are yet to receive an update on the incoming CME cloud that is supposed to deliver a glancing blow to the Earth today. But in the meantime, reports of another solar flare eruption have raised conc… [+2432 chars]"}, {"source": {"id": null, "name": "Udayavani.com"}, "author": "Udayavani", "title": "Y chromosome loss in men with age-linked with worse cancer outcomes - Udayavani English", "description": "New Delhi: Loss of Y chromosome in cells, which happens as men age, enables cancer cells evade their immune system, hampering their ability to fight cancer, new research...", "url": "https://www.udayavani.com/english-news/y-chromosome-loss-in-men-with-age-linked-with-worse-cancer-outcomes", "urlToImage": "https://www.udayavani.com/wp-content/uploads/2023/06/chromosome-620x413.jpg", "publishedAt": "2023-06-24T05:35:12Z", "content": "Udayavani is now on Telegram.Click hereto join our channel and stay updated with the latest news."}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "Everything about ESA's Euclid mission to launch on July 1 - NewsBytes", "description": "We are a week away from the launch of the European Space Agency's (ESA) Euclid mission, scheduled to take off on July 1", "url": "https://www.newsbytesapp.com/news/science/esa-s-euclid-mission-launch-scheduled-on-july-1-details-objectives/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l66720230623190954.jpeg", "publishedAt": "2023-06-24T04:11:04Z", "content": "TechnologyEverything about ESA's Euclid mission to launch on July 1\r\nThe mission will take off aboard a SpaceX Falcon 9 rocket (Photo credit: ESA)\r\nWe are a week away from the launch of European Spac… [+2771 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "‘Ancient flower fossils can have beautifully intact petals’ - Times of India", "description": "Andrew Leslie teaches earth and planetary sciences at Stanford University.", "url": "https://timesofindia.indiatimes.com/ancient-flower-fossils-can-have-beautifully-intact-petals/articleshow/101229947.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101230412,width-1070,height-580,imgsize-123730,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-24T02:16:00Z", "content": "Andrew Leslieteaches earth and planetary sciences at Stanford University. Speaking to Times Evoke, he traces the evolution of plants through deep time:As a palaeontologist and natural historian, I re… [+3871 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "TRAPPIST-1c Has Very Thin, Carbon Dioxide-Poor Atmosphere - Sci.News", "description": "Seven rocky planets orbit the nearby dwarf star TRAPPIST-1, providing a unique opportunity to search for atmospheres on small planets outside the Solar System.", "url": "https://www.sci.news/astronomy/trappist-1c-atmosphere-12033.html", "urlToImage": "https://cdn.sci.news/images/2023/06/image_12033-TRAPPIST-1c.jpg", "publishedAt": "2023-06-23T22:27:56Z", "content": "Seven rocky planets orbit the nearby dwarf star TRAPPIST-1, providing a unique opportunity to search for atmospheres on small planets outside the Solar System. Thanks to the recent launch of the NASA… [+4141 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "The Earth's Rotational Pole has Shifted from All the Groundwater We've Pumped Out - Universe Today", "description": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geological Survey. Glaciers and ice caps make up another 1.74%, but…", "url": "https://www.universetoday.com/162069/the-earths-rotational-pole-has-shifted-from-all-the-groundwater-weve-pumped-out/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/9837.jpg", "publishedAt": "2023-06-23T21:31:39Z", "content": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geologi… [+4136 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "NASA's Reveals Breathtaking Ultraviolet Views of Mars | Weather.com - The Weather Channel", "description": "To make these wavelengths visible to the human eye, the images were rendered in false colour, with the varying brightness levels of three ultraviolet wavelength ranges represented as red, green, and blue.", "url": "https://weather.com/en-IN/india/space/news/2023-06-23-nasas-reveals-breathtaking-ultraviolet-views-of-mars", "urlToImage": "https://s.w-x.co/in-uv-mars.jpg", "publishedAt": "2023-06-23T19:24:06Z", "content": "NASA's MAVEN (Mars Atmosphere and Volatile Evolution) mission has acquired stunning views of Mars in two ultraviolet images taken at different points along the Red Planet's orbit around the Sun.\r\nBy … [+2185 chars]"}, {"source": {"id": null, "name": "Samaaenglish.tv"}, "author": "Reuters", "title": "Study reveals how immune system of astronauts breaks down - SAMAA English", "description": "Study involving 14 astronauts who spent 4-1/2 to 6-1/2 months aboard  International Space Station", "url": "https://www.samaaenglish.tv", "urlToImage": "https://i.samaaenglish.tv/large/2023/06/23233518ad73293.jpg?r=233553", "publishedAt": "2023-06-23T18:35:53Z", "content": "Evidence is growing about the many ways that traveling in the microgravity environment of space tampers with the human body, with new research showing how it dials down the activity of genes in white… [+3714 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "NASA's Juno Mission Observes High-Altitude Hazes in Jupiter's Atmosphere - Pragativadi", "description": "On March 1, 2023, NASA's Juno mission completed its 49th close flyby of Jupiter. As the spacecraft flew low over the giant planet's cloud tops, its JunoCam instrument captured this look at bands of high-altitude haze forming above cyclones in an area", "url": "https://pragativadi.com/nasas-juno-mission-observes-high-altitude-hazes-in-jupiters-atmosphere/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2023/06/Untitled-design-63.png", "publishedAt": "2023-06-23T17:51:37Z", "content": "On March 1, 2023, NASA’s Juno mission completed its 49th close flyby of Jupiter. As the spacecraft flew low over the giant planet’s cloud tops, its JunoCam instrument captured this look at bands of h… [+331 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Hubble glimpses globular cluster NGC 6544 - Phys.org", "description": "The teeming stars of the globular cluster NGC 6544 glisten in this image from the NASA/ESA Hubble Space Telescope. This cluster of tightly bound stars lies more than 8,000 light-years away from Earth and is, like all globular clusters, a densely populated reg…", "url": "https://phys.org/news/2023-06-hubble-glimpses-globular-cluster-ngc.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/hubble-glimpses-a-glis.jpg", "publishedAt": "2023-06-23T17:50:02Z", "content": "The teeming stars of the globular cluster NGC 6544 glisten in this image from the NASA/ESA Hubble Space Telescope. This cluster of tightly bound stars lies more than 8,000 light-years away from Earth… [+1460 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers find new species of early-toothed whale - Devdiscourse", "description": "Researchers found a new species of early odontocete, or toothed whale, that swam along the North Pacific coastline around 28 million years ago.", "url": "https://www.devdiscourse.com/article/science-environment/2499269-researchers-find-new-species-of-early-toothed-whale", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/23_06_2023_17_33_10_2879946.jpg?width=920&format=jpeg", "publishedAt": "2023-06-23T17:33:13Z", "content": "Researchers found a new species of early odontocete, or toothed whale, that swam along the North Pacific coastline around 28 million years ago. The study was published in the journal, 'PeerJ.'\r\n\"Olym… [+1800 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of Texas At Austin Astronomers Discover Images Of ‘Jupiter’s Younger Sibling’ - India Education Diary", "description": "A team led by astronomers at The University of Texas at Austin has captured images of the lowest-mass extrasolar planet ever discovered that has both a direct mass measurement and an orbit similar to the giant planets in our own solar system. It’s al", "url": "https://indiaeducationdiary.in/university-of-texas-at-austin-astronomers-discover-images-of-jupiters-younger-sibling/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/aflep_subtracted_imgs_press_release_jup_sat_allbold2400x1350.png-1024x576.webp", "publishedAt": "2023-06-23T17:19:22Z", "content": "A team led by astronomers at The University of Texas at Austin has captured images of the lowest-mass extrasolar planet ever discovered that has both a direct mass measurement and an orbit similar to… [+4706 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of Texas At Austin Experts Find Clues About Origin Of Complex Life Trace Roots To Common Ancestor - India Education Diary", "description": "Thor, the legendary Norse god from the mythological city of Asgard, is not alone. According to groundbreaking research published in the journal Nature, we humans — along with eagles, starfish, daisies and every complex organism on Earth — are, in a s", "url": "https://indiaeducationdiary.in/university-of-texas-at-austin-experts-find-clues-about-origin-of-complex-life-trace-roots-to-common-ancestor/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/3-2-fan-eukarya-1200x800-c-default-1024x683.jpg", "publishedAt": "2023-06-23T17:18:55Z", "content": "Thor, the legendary Norse god from the mythological city of Asgard, is not alone. According to groundbreaking research published in the journal Nature, we humans along with eagles, starfish, daisies … [+4130 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Zurich researchers decipher DNA for Replication - India Education Diary", "description": "Proteins are the central building material of our bodies. As a fundamental component of the cell as well as of DNA and its genes, they make us who we are. Scientists who study the complex interactions of proteins often use high-performance computing", "url": "https://indiaeducationdiary.in/university-of-zurich-researchers-decipher-dna-for-replication/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/histone_1680-1024x576.jpg", "publishedAt": "2023-06-23T16:59:03Z", "content": "Proteins are the central building material of our bodies. As a fundamental component of the cell as well as of DNA and its genes, they make us who we are. Scientists who study the complex interaction… [+3750 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Bloomberg", "title": "Shocking discovery! Link found between earthquakes and cosmic rays - HT Tech", "description": "Commercial space travel shares plenty of similarities with deep sea tourism.", "url": "https://tech.hindustantimes.com/tech/news/shocking-discovery-link-found-between-earthquakes-and-cosmic-rays-71687535978513.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/23/1600x900/US-SPACE-VIRGIN-GALACTIC-0_1687544222389_1687544258506.jpg", "publishedAt": "2023-06-23T16:05:06Z", "content": "Commercial space travel shares plenty of similarities with deep sea tourism: wealthy customers, tight spaces, far-flung destinations and waivers that clearly warn people they're risking death by emba… [+5556 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Nearest supermassive black hole awakens from dormancy, becomes a million times brighter: Scientists - WION", "description": "Nearest supermassive black hole awakens from dormancy, becomes a million times brighter: Scientists", "url": "https://www.wionews.com/science/nearest-supermassive-black-hole-awakens-from-dormancy-becomes-a-million-times-brighter-scientists-607935", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/23/361766-the-battle-for-kyiv-8.png", "publishedAt": "2023-06-23T15:29:06Z", "content": "In a remarkable revelation, scientists have observed that our closest supermassive black hole, Sagittarius A*, has emerged from a prolonged state of dormancy and intensified its luminosity by a facto… [+3547 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "White dwarf's strong magnetic field fooled scientists into thinking it would pass close to our solar system, study shows - Phys.org", "description": "A trio of astronomers from Armagh Observatory & Planetarium and Centro de Astrobiología (CAB), CSIC-INTA has found that a white dwarf that was recently projected to make its way toward our solar system will not do so.", "url": "https://phys.org/news/2023-06-white-dwarf-strong-magnetic-field.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/white-dwarfs-strong-ma.jpg", "publishedAt": "2023-06-23T15:20:01Z", "content": "A trio of astronomers from Armagh Observatory &amp; Planetarium and Centro de Astrobiología (CAB), CSIC-INTA has found that a white dwarf that was recently projected to make its way toward our solar … [+2400 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David L. Chandler", "title": "Researchers develop a new source of quantum light - Phys.org", "description": "Using novel materials that have been widely studied as potential new solar photovoltaics, researchers at MIT have shown that nanoparticles of these materials can emit a stream of single, identical photons.", "url": "https://phys.org/news/2023-06-source-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-develop-a-9.jpg", "publishedAt": "2023-06-23T13:57:03Z", "content": "Using novel materials that have been widely studied as potential new solar photovoltaics, researchers at MIT have shown that nanoparticles of these materials can emit a stream of single, identical ph… [+5799 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "Earth's thermosphere reaches highest temperature in 20 years: Know impact - NewsBytes", "description": "Our planet's thermosphere-which is the second-highest layer of the atmosphere-has now recorded the highest temperature compared to the past two decades", "url": "https://www.newsbytesapp.com/news/science/earth-s-thermosphere-reaches-its-highest-temperature-in-2-decades/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l48220230623174550.jpeg", "publishedAt": "2023-06-23T12:50:16Z", "content": "TechnologyEarth's thermosphere reaches highest temperature in 20 years: Know impact\r\nThe reason for the temperature spike is the geomagnetic storms that struck Earth this year (Photo credit: NASA)\r\nO… [+3648 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Storing quantum information as sound waves - Tech Explorist", "description": "A new method for efficiently translating electrical quantum states into sound.", "url": "https://www.techexplorist.com/storing-quantum-information-sound-waves/62818/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Quantum-computing.jpg", "publishedAt": "2023-06-23T12:33:44Z", "content": "Quantum computing needs a way to store the information it uses and processes. As a new field, it still works out where and how to store quantum information.\r\nA new study shows a newly developed metho… [+2111 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Making uniform DNA-encapsulating microgels that simulate live cells: Study - ThePrint", "description": "Kyoto [Japan], June 23 (ANI): In a ‘self-organized’ environment, the live cell contains physiologically important components such as genetic material (DNA) and proteins. Understanding this process of self-assembly can explain the fundamental mechanism of livi…", "url": "https://theprint.in/health/making-uniform-dna-encapsulating-microgels-that-simulate-live-cells-study/1639544/", "urlToImage": null, "publishedAt": "2023-06-23T11:16:07Z", "content": "Kyoto [Japan], June 23 (ANI): In a ‘self-organized’ environment, the live cell contains physiologically important components such as genetic material (DNA) and proteins. Understanding this process of… [+3656 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "A new switch discovered for superconductivity - Tech Explorist", "description": "The scientists discover a new superconductivity switch.", "url": "https://www.techexplorist.com/nematic-switch-occurs-one-class-superconductors/62783/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/superconductivity.jpg", "publishedAt": "2023-06-23T10:23:52Z", "content": "The formation of nematicity in FeSe remains a major open question for understanding unconventional superconductivity in the presence of nematic order.\r\nThe term “nematicity” is derived from the Greek… [+5199 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "How to kill a star? Astronomers see a 'demolition derby' scenario - Devdiscourse", "description": "You might call it stellar death by demolition derby.  Researchers said the gamma-ray burst they observed may have been caused by the collision of two compact stars in the densely packed and chaotic environment near a supermassive black hole at the center of t…", "url": "https://www.devdiscourse.com/article/science-environment/2498782-how-to-kill-a-star-astronomers-see-a-demolition-derby-scenario", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_07_2021_01_19_19_067942.jpg?width=920&format=jpeg", "publishedAt": "2023-06-23T10:00:34Z", "content": "Astronomers have spotted an immensely energetic explosion emanating from an ancient galaxy, apparently triggered by a type of star destruction hypothesized for decades but never before observed. You … [+3725 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Mystery of how leaf-cutting ants measure leaf part size has been solved: Study - TheNewsMill", "description": "Leaf-cutting ants are insect superheroes, capable of transporting leaf fragments up to six times their body mass to develop fungus in their borrows. But how do the fascinating creatures judge the size of the fragments they carve with their mandibles? Do they …", "url": "https://thenewsmill.com/2023/06/mystery-of-how-leaf-cutting-ants-measure-leaf-part-size-has-been-solved-study/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=108015&object_id=108015&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F06%252Fmystery-of-how-leaf-cutting-ants-measure-leaf-part-size-has-been-solved-study.jpg", "publishedAt": "2023-06-23T09:35:44Z", "content": null}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "Govert Schilling", "title": "A history of 3D mapping the Universe - Sky at Night Magazine", "description": "A look at 3D cosmic cartography and historic attempts to produce a roadmap of space.", "url": "https://www.skyatnightmagazine.com/space-science/history-3d-mapping-universe/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/25/2023/06/sdss-map-universe-orangepie-ed825f6.jpg?resize=620,413", "publishedAt": "2023-06-23T07:35:49Z", "content": "The first three-dimensional map of the Universe, made with a 1.5-metre telescope at Mount Hopkins in Arizona, was published over 40 years ago, in 1982.\r\nIt took Marc Davis and his colleagues five yea… [+1367 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "How plants prevent cracking under the stresses and strains of growing - Tech Explorist", "description": "Nature's secret to holding things together is the glue.", "url": "https://www.techexplorist.com/natures-secret-holding-things-together-glue/62757/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Arabidopsis-stem-with-cracks.jpg", "publishedAt": "2023-06-23T07:35:27Z", "content": "The development of multicellular organisms depends on the coordination of cell growth between layers, which is made simpler by mechanical connectivity and molecular signaling. During development, cel… [+5135 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "Amit Malewar", "title": "Nanoparticles can be used as special sensors both on Earth and in space - Inceptive Mind", "description": "Space tech to shrink as the limits of quantum physics are tested on Earth and beyond.", "url": "https://www.inceptivemind.com/nanoparticles-used-special-sensors-both-earth-space/31564/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2023/06/nanoparticles-in-space.jpg", "publishedAt": "2023-06-23T07:18:49Z", "content": "Recent advances in the field of optomechanics – the motion of tiny particles held and measured in free space by laser light – have shown that nanoparticles can exhibit behaviors that are governed by … [+2072 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": null, "title": "NASA achieves crucial milestone on ISS - NewsBytes", "description": "NASA tests life support systems on ISS, able to recycle food and water. It has now achieved 98% recovery rate, a crucial milestone.", "url": "https://www.newsbytesapp.com/visualstories/science/nasa-achieves-crucial-milestone-on-iss", "urlToImage": "https://i.cdn.newsbytesapp.com/web/story168743446116190.jpg?tr=w-360", "publishedAt": "2023-06-23T06:33:35Z", "content": "NASA achievescrucial milestone on ISS"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA Awards Contract for Earth Radar Data Operations, Management - India Education Diary", "description": "NASA has awarded a contract to the University of Alaska at Fairbanks, Alaska, for the continued development and operation of the Synthetic Aperture Radar Distributed Active Archive Center for NASA’s Earth Observing System Data and Information System.", "url": "https://indiaeducationdiary.in/nasa-awards-contract-for-earth-radar-data-operations-management/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/nasa_meatball_1_2.jpeg", "publishedAt": "2023-06-23T06:13:37Z", "content": "NASA has awarded a contract to the University of Alaska at Fairbanks, Alaska, for the continued development and operation of the Synthetic Aperture Radar Distributed Active Archive Center for NASAs E… [+885 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "The Tonga Volcanic Eruption Unleashed 2,00,000 Lightning Strikes in 11 Hours! | Weather.com - The Weather Channel", "description": "The lightning storm occurred at dizzying altitudes of 20 to 30 kilometres, higher than any lightning has been seen before.", "url": "https://weather.com/en-IN/india/news/news/2023-06-23-tonga-volcano-unleashed-2-lakh-lightning-strikes-in-11-hours", "urlToImage": "https://s.w-x.co/in-tonga_lightning.jpg", "publishedAt": "2023-06-23T05:40:04Z", "content": "In what was the biggest volcanic eruption of the 21st century so far, the Hunga Tonga-Hunga Ha'apai submarine volcano eruption from January 2022 was so violent that it rocked the Pacific, causing a m… [+2402 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA Plans Coverage of Roscosmos Spacewalk Outside Space Station - India Education Diary", "description": "NASA will provide live coverage as two Roscosmos cosmonauts conduct a spacewalk outside the International Space Station Thursday, June 22, for station upgrades and retrieval of equipment.Coverage will begin at 9:45 a.m. EDT on NASA Television, the NA", "url": "https://indiaeducationdiary.in/nasa-plans-coverage-of-roscosmos-spacewalk-outside-space-station/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/nasa_meatball_1_2.jpeg", "publishedAt": "2023-06-23T05:29:10Z", "content": "NASA will provide live coverage as two Roscosmos cosmonauts conduct a spacewalk outside the International Space Station Thursday, June 22, for station upgrades and retrieval of equipment.\r\nCoverage w… [+536 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "SpaceX preps for Friday launch of 56 Starlink satellites - Devdiscourse", "description": "Read more about (Update: Launched) SpaceX preps for Friday launch of 56 Starlink satellites on Devdiscourse", "url": "https://www.devdiscourse.com/article/technology/2498614-update-launched-spacex-preps-for-friday-launch-of-56-starlink-satellites", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_05_2022_10_26_20_6709552.jpg?width=920&format=jpeg", "publishedAt": "2023-06-23T05:04:47Z", "content": "SpaceX is targeting Friday, June 23 for the launch of 56 Starlink internet satellites into low-Earth orbit. The Falcon 9 rocket carrying these satellites is scheduled to lift off at 9:56 a.m. ET (13:… [+1294 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Revolutionary Discovery! Method to probe powerful solar storms uncovered - HT Tech", "description": "Scientists are making incredible progress to understand the speeds of particles during solar outbursts that spark massive solar storms impacting Earth.", "url": "https://tech.hindustantimes.com/tech/news/revolutionary-discovery-method-to-probe-powerful-solar-storms-uncovered-71687493147258.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/23/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1687493223260.jpg", "publishedAt": "2023-06-23T04:10:03Z", "content": "In a recent discovery, scientists have found a way to better understand the speed of solar particles that causes a solar storm. Did you know that the most energetic processes seen in the solar system… [+1811 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Geminid meteor mystery solved? It was a collision! - EarthSky", "description": null, "url": "https://earthsky.org/space/geminid-meteor-mystery-solved-collision/", "urlToImage": "https://earthsky.org/upl/2022/12/2022-Geminids-Josh-Ashley-ECP-54236-e1671728038271.jpg", "publishedAt": "2023-06-23T03:50:37Z", "content": "View at EarthSky Community Photos. | Josh Ashley of Amado, Arizona, made this composite image of Geminid meteors captured on December 14, 2022. Has a Geminid meteor mystery been solved?\r\nGeminid mete… [+3072 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "‘Chandrayaan-3’ fest from today at science centre - Indiatimes.com", "description": "Chhatrapati Sambhajinagar: Drawing, model-making, painting and quiz competitions are set to take place as a part of ‘Chandrayaan-3’ festival of the MG.", "url": "https://timesofindia.indiatimes.com/city/aurangabad/chandrayaan-3-fest-from-today-at-science-centre/articleshow/101204855.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-23T02:52:00Z", "content": "Rahul Gandhi slams BJP, RSS for dwelling in the past, blaming others"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New technology to study virus infections - EurekAlert", "description": "A new tool can identify cells that are actively responding to a SARS-CoV-2 infection. As reported in \"Science Advances\" by the Gargiulo lab, it can be used to screen for effective COVID-19 therapies and can be tailored to study other viruses as well.", "url": "https://www.eurekalert.org/news-releases/993382", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/f02e23d8-b2d6-4661-9203-21af74b0b130/Rendition/thumbnail/Content/Public", "publishedAt": "2023-06-23T02:00:12Z", "content": "image: This image shows a lung epithelial cell line, whose membranes and nuclei are stained in red and blue. The green signal defines cells expressing the fluorescent protein of response to SARS-CoV-… [+6276 chars]"}, {"source": {"id": null, "name": "Oup.com"}, "author": null, "title": "Observability of Low-Luminosity AGN in the Early Universe with JWST - Oxford Academic", "description": "Abstract. Active galactic nuclei (AGN) in the early Universe are thought to be prominent sources of energy and ionizing photons that affected the growth of thei", "url": "https://academic.oup.com/mnras/advance-article-abstract/doi/10.1093/mnras/stad1877/7205540", "urlToImage": "https://academic.oup.com/data/sitebuilderassetsoriginals/live/images/mnras/mnras_ogimage.png", "publishedAt": "2023-06-23T01:07:04Z", "content": null}, {"source": {"id": null, "name": "Oup.com"}, "author": null, "title": "Evidence for non-merger co-evolution of galaxies and their supermassive black holes - Oxford Academic", "description": "Abstract. Recent observational and theoretical studies have suggested that supermassive black holes (SMBHs) grow mostly through non-merger (‘secular’) processes", "url": "https://academic.oup.com/mnras/advance-article-abstract/doi/10.1093/mnras/stad1794/7205544", "urlToImage": "https://academic.oup.com/data/sitebuilderassetsoriginals/live/images/mnras/mnras_ogimage.png", "publishedAt": "2023-06-23T01:07:03Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Universal Physics Uncovered in the Dynamics of a Quantum System - SciTechDaily", "description": "New experiments with ultra-cold atomic gases shed light on how all interacting quantum systems evolve after a sudden energy influx. New experiments using one-dimensional gases of ultra-cold atoms reveal a universality in how quantum systems composed of many p…", "url": "https://scitechdaily.com/universal-physics-uncovered-in-the-dynamics-of-a-quantum-system/", "urlToImage": "https://scitechdaily.com/images/Abstract-Dynamic-Quantum-System-Concept.jpg", "publishedAt": "2023-06-22T22:39:33Z", "content": "Physicists at Penn State have discovered a universal reaction in quantum systems when disturbed by a large influx of energy. Using ultra-cold, one-dimensional gases, they were able to closely observe… [+2986 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Sinking seamount offers clues to slow motion earthquakes - Science Daily", "description": "The first ever 3D seismic imaging of a subducting seamount shows a previously unknown sediment trail in Earth's crust off the coast of New Zealand. Scientists think the sediment patches help release tectonic pressure gradually in slow slip earthquakes instead…", "url": "https://www.sciencedaily.com/releases/2023/06/230622120919.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-06-22T20:41:06Z", "content": "Scientists have long puzzled over what happens when seamounts -- mountains and volcanoes on the seafloor -- are pulled into subduction zones. Now, new research from The University of Texas at Austin … [+2778 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Computer scientists sequence cotton genome - Phys.org", "description": "Cotton is the primary source of natural fiber on Earth, yet only four of 50 known species are suitable for textile production. Computer scientists at DePaul University applied a bioinformatics workflow to reconstruct one of the most complete genomes of a top …", "url": "https://phys.org/news/2023-06-scientists-sequence-cotton-genome.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/computer-scientists-se.jpg", "publishedAt": "2023-06-22T20:30:04Z", "content": "Cotton is the primary source of natural fiber on Earth, yet only four of 50 known species are suitable for textile production. Computer scientists at DePaul University applied a bioinformatics workfl… [+5035 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "Phosphorus, a building block for life, was just discovered on a moon of Saturn - Salon", "description": "Saturn's moon Enceladus ejected plumes of water that contain phosphorus, considered essential for life", "url": "https://www.salon.com/2023/06/22/phosphorus-a-building-block-for-life-was-just-discovered-on-a-moon-of-saturn/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/06/planet_saturn_85757157.jpg", "publishedAt": "2023-06-22T19:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "How proteins protect mammalian sperm on their way to the egg cell - Phys.org", "description": "Mammalian seminal fluid contains a variety of proteins secreted by the accessory sex glands that are important for the processes involved in fertilization. One of these proteins, which is found in ungulates—and in particularly large quantities in boars—is the…", "url": "https://phys.org/news/2023-06-proteins-mammalian-sperm-egg-cell.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/how-proteins-protect-m.jpg", "publishedAt": "2023-06-22T16:33:03Z", "content": "by Leibniz-Institut für Zoo- und Wildtierforschung (IZW) im Forschungsverbund Berlin e.V.Mammalian seminal fluid contains a variety of proteins secreted by the accessory sex glands that are important… [+4035 chars]"}, {"source": {"id": null, "name": "Theglobestalk.com"}, "author": "https://m.facebook.com/theglobestalk/?ref=bookmarks", "title": "Unraveling the Enigma: Pulsars and the Milky Way's Central Black Hole - The Globe's Talk", "description": "Sagittarius A* (Sgr A*), the supermassive black hole at the center of the Milky Way, has been a focal point for testing GR under extreme conditions.", "url": "https://theglobestalk.com/pulsars-milky-ways-central-black-hole/", "urlToImage": "https://theglobestalk.com/wp-content/uploads/2023/06/images-66.jpeg", "publishedAt": "2023-06-22T16:24:41Z", "content": "The theory of general relativity (GR), proposed by Einstein over a century ago, remains one of the most influential scientific postulates. GR explains how the presence of massive objects alters the c… [+6362 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Molecular filament shielded our young solar system from supernova, suggests study - Phys.org", "description": "Isotope ratios found in meteorites suggest that a supernova exploded nearby while the sun and solar system were still forming. But the blast wave from a supernova that close could have potentially destroyed the nascent solar system. New calculations shows tha…", "url": "https://phys.org/news/2023-06-molecular-filament-shielded-young-solar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/molecular-filament-shi.jpg", "publishedAt": "2023-06-22T16:17:33Z", "content": "Isotope ratios found in meteorites suggest that a supernova exploded nearby while the sun and solar system were still forming. But the blast wave from a supernova that close could have potentially de… [+3025 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Kiona Smith", "title": "Astronomers Find a Crucial Ingredient for Life in a Cloud in Space - Inverse", "description": "The amino acid often associated with Thanksgiving dinner also exists in space, according to a recent study", "url": "https://www.inverse.com/science/astronomers-spot-tryptophan-in-a-nearby-nebula", "urlToImage": "https://imgix.bustle.com/uploads/getty/2023/6/22/ab539774-3ec2-4136-a3ee-c1469f54ada2-getty-157693929.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-22T16:15:25Z", "content": "We usually associate the amino acid tryptophan with turkeys, naps, or both, but it may also be related to our chances of finding alien life in the universe.\r\nData from NASAs Spitzer space telescope r… [+2467 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Dark Matter: A Baseless Hypothesis? | Pavel Kroupa, Francesca Chadha-Day, Bjorn Ekeberg - The Institute of Art and Ideas", "description": "Is our understanding of the universe fundamentally flawed? Trailblazing philosopher Bjørn Ekeberg, theoretical physicist Francesca Chadha-Day, and influentia...", "url": "https://www.youtube.com/watch?v=06Ngjb2CC2Y", "urlToImage": "https://i.ytimg.com/vi/06Ngjb2CC2Y/maxresdefault.jpg", "publishedAt": "2023-06-22T15:27:59Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Modified Einstein versus modified Euler for dark matter - Nature.com", "description": "Our current cosmological observations cannot distinguish between a cosmological model with a fifth force acting on dark matter and one for which the laws of gravity are modified. Instead, a method using future gravitational redshift data is proposed.", "url": "https://www.nature.com/articles/s41550-023-02003-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41550-023-02003-y/MediaObjects/41550_2023_2003_Fig1_HTML.png", "publishedAt": "2023-06-22T15:09:02Z", "content": null}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Neurotransmitter receptor patterns can separate sensory and cognitive networks - Drug Target Review", "description": "Neurotransmitter receptor patterns define key organisational principles in the brain, UK scientists have discovered.", "url": "https://www.drugtargetreview.com/news/110354/neurotransmitter-receptor-patterns-can-separate-sensory-and-cognitive-networks/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/neurotransmitter-receptors.jpg", "publishedAt": "2023-06-22T15:00:29Z", "content": "Posted: 22 June 2023 | Izzy Wood (Drug Target Review) | No comments yet\r\nNeurotransmitter receptor patterns define key organisational principles in the brain, UK scientists have discovered. \r\nA team … [+2898 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Terahertz Wave Camera Captures 3D Images of Microscopic Items - AZoOptics", "description": "Scientists from Loughborough University are the first to show how a terahertz wave camera can record 3D images of minuscule things concealed inside small objects.", "url": "https://www.azooptics.com/News.aspx?newsID=28340", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_28340_16874348458571559.jpg", "publishedAt": "2023-06-22T14:11:00Z", "content": "Scientists from Loughborough University are the first to show how a terahertz wave camera can record 3D images of minuscule things concealed inside small objects.\r\nMicroscopic, metallic objects distr… [+4502 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Astronomers discover new mini-Neptune exoplanet - Phys.org", "description": "An international team of astronomers reports the discovery of a new mini-Neptune exoplanet orbiting a nearby star. The newfound alien world, designated TOI-2018 b, is about two times larger and nine times more massive than the Earth. The finding was detailed …", "url": "https://phys.org/news/2023-06-astronomers-mini-neptune-exoplanet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astronomers-discover-n-3.jpg", "publishedAt": "2023-06-22T13:38:56Z", "content": "An international team of astronomers reports the discovery of a new mini-Neptune exoplanet orbiting a nearby star. The newfound alien world, designated TOI-2018 b, is about two times larger and nine … [+3077 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Chethan Kumar", "title": "Scientists propose solution to measuring pace of Universe expansion - Indiatimes.com", "description": "Science News: BENGALURU: The interpretation that the universe was expanding came after astronomers’ discovery in 1929 that galaxies are streaming away from us and e.", "url": "https://timesofindia.indiatimes.com/home/science/scientists-propose-solution-to-measuring-pace-of-universe-expansion/articleshow/101195438.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101195428,width-1070,height-580,imgsize-23066,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-22T13:12:00Z", "content": "<ul><li>News</li>\r\n<li>Science News</li>\r\n<li>Scientists propose solution to measuring pace of Universe expansion</li></ul>\r\nFOLLOW US ON SOCIAL MEDIAFacebookTwitterInstagramKOO APPYOUTUBE"}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "DNA shapes itself to execute new functions | Cornell Chronicle - Cornell Chronicle", "description": "DNA can mimic protein functions by folding into elaborate, three-dimensional structures, according to a study from researchers at Weill Cornell Medicine and the National Heart, Lung, and Blood Institute, part of the National Institutes of Health.", "url": "https://news.cornell.edu/stories/2023/06/dna-shapes-itself-execute-new-functions", "urlToImage": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/0622_dna_0.jpg?itok=oMx-1vEX", "publishedAt": "2023-06-22T12:56:21Z", "content": "DNA can mimic protein functions by folding into elaborate, three-dimensional structures, according to a study from researchers at Weill Cornell Medicine and the National Heart, Lung, and Blood Instit… [+3759 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "JWST and NASA: Understanding star formation in the early universe - Open Access Government", "description": "The James Webb Space Telescope (JWST), in collaboration with NASA, is conducting research into early star formation in galaxies", "url": "https://www.openaccessgovernment.org/star-formation-early-universe-jwst-nasa-collaboration/161647/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2023/06/iStock-1408340607-scaled.jpg", "publishedAt": "2023-06-22T12:35:26Z", "content": "One of its major programs, JADES (The JWST Advanced Deep Extragalactic Survey), aims to uncover and characterise faint, distant galaxies, devoting about 32 days to a telescope to understand the histo… [+3976 chars]"}, {"source": {"id": null, "name": "Shethepeople.tv"}, "author": "Pavi Vyas", "title": "Looking Back At India's Women-Led Space Mission Chandrayaan-2 - SheThePeople", "description": "Vanitha Muthayya and Ritu Karidhal from Indian Space Research Organisation (ISRO) changed history and made us all proud by making Chandrayaan-2 India's first-ever space mission led by two women. | News", "url": "https://www.shethepeople.tv/news/women-led-space-mission-chandrayaan-2", "urlToImage": "https://img-cdn.thepublive.com/fit-in/1200x627/shethepeople/media/media_files/QFgs3zfXtrggi7chkcl5.jpeg", "publishedAt": "2023-06-22T12:11:40Z", "content": "Vanitha Muthayya and Ritu Karidhal from Indian Space Research Organisation (ISRO) changed history and made us all proud by making Chandrayaan-2 India's first-ever space mission led by two women. Muth… [+2309 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UC San Diego Study Highlights On The Possible Origins Of Life - India Education Diary", "description": "Researchers at the University of California San Diego have identified the conditions for cell metabolism to emerge on the early Earth, shedding new light on the origins of life itself, along with the fundamental nature of biological carbon fixation.“", "url": "https://indiaeducationdiary.in/uc-san-diego-study-highlights-on-the-possible-origins-of-life/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/New_Research_from_UC_San_Diego_Sheds_Light_on_the_Possible_Origins_of_Life-1024x527.jpg", "publishedAt": "2023-06-22T11:15:19Z", "content": "Researchers at the University of California San Diego have identified the conditions for cell metabolism to emerge on the early Earth, shedding new light on the origins of life itself, along with the… [+5895 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UC San Diego First Tests Cancer Drugs In Space - India Education Diary", "description": "On May 21, 2023, scientists at University of California San Diego Sanford Stem Cell Institute launched several new nanobioreactor experiments onto the International Space Station (ISS) via the second Axiom Space Private Astronaut Mission, Axiom Missi", "url": "https://indiaeducationdiary.in/uc-san-diego-first-tests-cancer-drugs-in-space/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2023-06-22T10:55:49Z", "content": "On May 21, 2023, scientists at University of California San Diego Sanford Stem Cell Institute launched several new nanobioreactor experiments onto the International Space Station (ISS) via the second… [+5093 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Alex Daniel", "title": "Scientists just created a new state of matter – here's what that means - indy100", "description": "Scientists have just created an entirely new state of matter made out of subatomic particles.The bosonic correlated insulator, to be precise, is both a new material and a new state of matter, said researchers from California, Arizona and Japan. There are four…", "url": "https://www.indy100.com/science-tech/new-state-matter-subatomic-particles-new", "urlToImage": "https://www.indy100.com/media-library/the-discovery-may-help-scientists-understand-how-the-universe-is-put-together.jpg?id=34159146&width=1200&height=600&coordinates=0%2C131%2C0%2C132", "publishedAt": "2023-06-22T10:21:52Z", "content": "Scientists have just created an entirely new state of matter made out of subatomic particles.\r\nThe bosonic correlated insulator, to be precise, is both a new material and a new state of matter, said … [+2102 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": "Jiya Saini", "title": "The Truth About Ketone Supplements – and What They’re Really Doing to Us - Revyuh", "description": "What They Are Not Telling Us About Ketone Supplements Ketones naturally present in the body can act as energy sources for the brain and muscles. When one", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/the-truth-about-ketone-supplements-and-what-theyre-really-doing-to-us/", "urlToImage": "https://www.revyuh.com/wp-content/uploads/2023/06/The-Truth-About-Ketone-Supplements-and-What-Theyre-Really-Doing-to-Us.jpg", "publishedAt": "2023-06-22T10:11:00Z", "content": "Ketones naturally present in the body can act as energy sources for the brain and muscles. When one follows a ketogenic diet, which involves consuming extremely low carbohydrates and typically high f… [+2634 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "﻿UC San Diego Experts Unveil Cellular Process Behind Oxygen Production - India Education Diary", "description": "Take a deep breath. Now take nine more. According to new research, the amount of oxygen in one of those 10 breaths was made possible thanks to a newly identified cellular mechanism that promotes photosynthesis in marine phytoplankton.Described as “gr", "url": "https://indiaeducationdiary.in/uc-san-diego-experts-unveil-cellular-process-behind-oxygen-production/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/diatom_composition-1200-628-1024x536.jpg", "publishedAt": "2023-06-22T09:56:53Z", "content": "Take a deep breath. Now take nine more. According to new research, the amount of oxygen in one of those 10 breaths was made possible thanks to a newly identified cellular mechanism that promotes phot… [+7549 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Telescope captured charge-sign dependent cosmic ray modulation - Tech Explorist", "description": "The results indicate that cosmic ray electron count rates are strongly influenced by the solar modulation.", "url": "https://www.techexplorist.com/telescope-captured-charge-sign-dependent-cosmic-ray-modulation/62691/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/galactic-cosmic-ray.jpg", "publishedAt": "2023-06-22T09:25:56Z", "content": "The strength of galactic cosmic rays (GCRs) reaching Earth varies in reaction to changes in the Sun’s magnetic field, which affects how cosmic ray particles like electrons and protons move through sp… [+4068 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Tapeworm Infection Grants Ants Extended Lifespan, Alters Behaviour: Study - Transcontinental Times", "description": "GERMANY: In a groundbreaking discovery, researchers have found that a specific tapeworm infection is not only harmless to its ant hosts but actually extends their lifespan by up to three times.  The study, led by Professor Susanne Foitzik of Johannes Gutenber…", "url": "https://www.transcontinentaltimes.com/tapeworm-infection-give-ant-lifespan/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Tapeworm-Infection.jpg", "publishedAt": "2023-06-22T09:12:00Z", "content": "GERMANY: In a groundbreaking discovery, researchers have found that a specific tapeworm infection is not only harmless to its ant hosts but actually extends their lifespan by up to three times. \r\nThe… [+2987 chars]"}, {"source": {"id": null, "name": "Qrius.com"}, "author": "Qrius", "title": "A Comprehensive Paper24 Review and the Power of Help with Paper - Qrius", "description": "Byju's, the edtech unicorn has had to deal with mounting losses, layoffs, and pending loans, even as its auditor breaks association.", "url": "https://qrius.com/a-comprehensive-paper24-review-and-the-power-of-help-with-paper/", "urlToImage": "https://qrius.com/wp-content/uploads/2023/06/image1-1-1.jpg", "publishedAt": "2023-06-22T08:28:18Z", "content": "‍In the vast sea of academic help platforms, Paper24 emerges as a beacon of hope for students grappling with their papers. This service has etched its place in the academic community by offering reli… [+4427 chars]"}]}