{"status": "ok", "totalResults": 48, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA's Artemis 1 cryogenic test demonstration: Watch live stream - The Indian Express", "description": "NASA is on track to conduct an Artemis 1 cryogenic test demonstration starting on September 21. You can watch the demonstration live below.", "url": "https://indianexpress.com/article/technology/science/nasa-artemis-1-cryogenic-test-demonstration-8164256/", "urlToImage": "https://images.indianexpress.com/2022/09/NASA-Artemis-1-cryogenic-test-20220919.jpg", "publishedAt": "2022-09-21T10:05:01Z", "content": "NASA is on track to conduct an Artemis 1 cryogenic test demonstration starting on September 21. Since the last failed attempt to launch the Space Launch System (SLS) rocket, the space agencys teams h… [+1866 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA James Webb Space Telescope snaps first images of Mars; Reveals atmospheric secrets - HT Tech", "description": "The NASA James Webb Space Telescope has reached another milestone after taking the first images of Mars. The images reveal big secrets about its atmosphere.", "url": "https://tech.hindustantimes.com/tech/news/nasa-james-webb-space-telescope-snaps-first-images-of-mars-reveals-atmospheric-secrets-71663751192900.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/21/1600x900/Untitled_design_31_1_1663751225086_1663751225253_1663751225253.jpg", "publishedAt": "2022-09-21T09:08:59Z", "content": "The NASA James Webb Space Telescope is in no mood to stop awing and shocking us. It has been making revelation after revelation ever since it became operational. In fact, the images and data are so g… [+2573 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Nearest Black Hole To Our Solar System Discovered By Studying A Star's Orbit - Indiatimes.com", "description": "This is the era of space exploration, and we couldn't be happier to hear the words exoplanet, black hole, and habitable world every few days. Now, a study has observed a Sun-like star with a strange orbit.The star's orbital characteristics are so strange that…", "url": "https://www.indiatimes.com/technology/science-and-future/nearest-black-hole-to-our-solar-system-discovered-580193.html", "urlToImage": "https://im.indiatimes.in/content/2022/Sep/bh_visualization_632acba239d2a.jpg", "publishedAt": "2022-09-21T08:30:29Z", "content": "This is the era of space exploration, and we couldn't be happier to hear the words exoplanet, black hole, and habitable world every few days. Now,a study has observed a Sun-like star with a strange o… [+3043 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Nasa's Dart mission takes heavenly route to intentionally crash on asteroid - India Today", "description": "The DART mission is set to crash on an asteroid in a few days, but before it reaches its destination, it has used Jupiter as a practice target.", "url": "https://www.indiatoday.in/science/story/nasa-s-dart-mission-takes-heavenly-route-to-intentionally-crash-on-asteroid-2002852-2022-09-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/Jupiters-647x363.jpeg?IAylrTpAUR5iwKNrV8jfffp2NdMFH9k4", "publishedAt": "2022-09-21T08:09:37Z", "content": "The Double Asteroid Redirection Test (DART) mission is inching closer to its final days when it intentionally crashes on an asteroid to test a key technology that could be used to deflect asteroids h… [+2683 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA's Mars Helicopter completes 32nd flight on the Red Planet - Devdiscourse", "description": "Read more about NASA's Mars Helicopter completes 32nd flight on the Red Planet on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2186395-nasas-mars-helicopter-completes-32nd-flight-on-the-red-planet", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_09_2022_14_01_30_1667593.jpg?width=920&format=jpeg", "publishedAt": "2022-09-21T08:05:50Z", "content": "NASA's Mars Helicopter, Ingenuity, successfully completed its 32nd flight on the Red Planet over the weekend. The 55.3-second flight covered 93.74m at a max speed of 4.75 meters per second.\r\nThis was… [+1678 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "James Webb Telescope damaged in space, science ops using key instrument paused - India Today", "description": "The world's most powerful observatory has hit a technical glitch and science ops using its MIR instrument have been paused.", "url": "https://www.indiatoday.in/science/story/james-webb-telescope-damaged-in-space-science-ops-using-key-instrument-paused-2002829-2022-09-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/Jwst_22_2-647x363.jpeg?OInSTPctTFyIvnd1AGBv7NXcHGwp2ec0", "publishedAt": "2022-09-21T07:29:52Z", "content": "Located 1,50,000 kilometers away from Earth, the James Webb Space Telescope is a marvel of engineering, but it remains vulnerable to the harsh space environment. The spacecraft has now run into a new… [+3157 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Alert: Asteroid today! Space rock faster than a hypersonic missile heading for Earth - HT Tech", "description": "NASA has issued an alert due to an asteroid making close approach to Earth today. Here’s what the agency said.", "url": "https://tech.hindustantimes.com/tech/news/nasa-alert-asteroid-today-space-rock-faster-than-a-hypersonic-missile-heading-for-earth-71663744654150.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/21/1600x900/asteroid-3628185_1920_1631933514992_1663744717673_1663744717673.jpg", "publishedAt": "2022-09-21T07:19:30Z", "content": "We're just 20 days into the month of September and we have already witnessed more than 20 asteroids passing very close to Earth. August witnessed nearly 35 asteroids making close approaches to Earth … [+2093 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "AFP", "title": "American, Russians to blast off for ISS as Ukraine war rages - Mint Lounge", "description": "Western capitals, including Washington, have hit Moscow with  sanctions. But space has remained an outlier of cooperation between the two nations", "url": "https://lifestyle.livemint.com/smart-living/innovation/american-russians-to-blast-off-for-iss-as-ukraine-war-rages-111663738390429.html", "urlToImage": "https://images.livemint.com/img/2022/09/21/1140x641/SPACE-EXPLORATION-CREW-6_1663742131195_1663742131195_1663742247014_1663742247014.JPG", "publishedAt": "2022-09-21T07:10:33Z", "content": "A US astronaut and two Russian cosmonauts are set to blast off to the International Space Station Wednesday on a Russian-operated flight despite soaring tensions between Moscow and Washington over Ru… [+3031 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Dinosaur Population and Diversity Had Hit Rock Bottom Much Before the Extinction-Triggering Asteroid Struck Earth: Study - The Weather Channel", "description": "A new study suggests that not only did the dinosaur numbers dwindle, but their species diversity was itself quite limited, which anyway got them to the brink of extinction. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/science/news/2022-09-21-dinosaurs-population-and-diversity-declined-much-before-their", "urlToImage": "https://s.w-x.co/in-dinosaur_8.jpg", "publishedAt": "2022-09-21T06:56:50Z", "content": "The asteroid that slammed into the Earth's surface around 66 million years ago carries the tag of wiping 75% of Earth's lifeforms, including the dinosaur species. But now, scientists have suggested t… [+2756 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Maryland: New Craters Discovered on Mars by UMD Geologist and NASA Team - India Education Diary", "description": "Although it was billions of years ago that massive asteroids bombarded the rocky planets of the inner solar system, an international team of researchers with NASA’s InSight mission that includes a University of Maryland geologist today showed how the", "url": "https://indiaeducationdiary.in/university-of-maryland-new-craters-discovered-on-mars-by-umd-geologist-and-nasa-team/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-Maryland.png?fit=1024%2C512&ssl=1", "publishedAt": "2022-09-21T06:16:33Z", "content": "Although it was billions of years ago that massive asteroids bombarded the rocky planets of the inner solar system, an international team of researchers with NASAs InSight mission that includes a Uni… [+2462 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Minnesota: Octopuses prefer certain arms when hunting and adjust tactics to prey - India Education Diary", "description": "Famous for their eight arms, octopuses leverage all of their appendages to move, jet through the water and capture prey. But their movements can look awkward and seemingly unplanned at times, more closely resembling aliens than earthly creatures.“Nor", "url": "https://indiaeducationdiary.in/university-of-minnesota-octopuses-prefer-certain-arms-when-hunting-and-adjust-tactics-to-prey/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/University-of-Minnesota.jpg?fit=1024%2C576&ssl=1", "publishedAt": "2022-09-21T06:16:33Z", "content": "Famous for their eight arms, octopuses leverage all of their appendages to move, jet through the water and capture prey. But their movements can look awkward and seemingly unplanned at times, more cl… [+2368 chars]"}, {"source": {"id": null, "name": "Yanko Design"}, "author": "Sarang Sheth", "title": "The NASA X Interstellar RED3.721 Watch comes with a capsule containing actual meteor dust from Mars - Yanko Design", "description": "https://youtu.be/XYZIHartimYA timepiece that Elon Musk would most certainly try to acquire...As our species attempts at colonizing Mars in the next few decades,", "url": "https://www.yankodesign.com/2022/09/20/the-nasa-x-interstellar-red3-721-watch-comes-with-a-capsule-containing-actual-meteor-dust-from-mars/", "urlToImage": "https://www.yankodesign.com/images/design_news/2022/09/authentic_Martian_dust_is_encapsulated_in_this_watch_hero.jpg", "publishedAt": "2022-09-21T01:45:26Z", "content": "A timepiece that Elon Musk would most certainly try to acquire…\r\nAs our species attempts at colonizing Mars in the next few decades, the NASA X Interstellar RED3.721 watch puts a small piece of the r… [+4224 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Three-dimensional fossil algae more than 541 million years old reveal modern-looking ancestry of the plant kingdom - Phys.org", "description": "Paleontologists have identified a new genus and species of algae called Protocodium sinense that predates the origin of land plants and modern animals and provides new insight into the early diversification of the plant kingdom.", "url": "https://phys.org/news/2022-09-three-dimensional-fossil-algae-million-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/541-million-year-old-3.jpg", "publishedAt": "2022-09-21T00:00:06Z", "content": "Paleontologists have identified a new genus and species of algae called Protocodium sinense that predates the origin of land plants and modern animals and provides new insight into the early diversif… [+5626 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "Live long and prosper: A space traveler's dilemma? - Space.com", "description": "Relatively few humans have ever been exposed to the space environment.", "url": "https://www.space.com/live-long-prosper-long-term-spaceflight-health-risks", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ABs48aaWWBsS6v9Ar4imFN-1200-80.jpg", "publishedAt": "2022-09-20T22:14:12Z", "content": "Space medical scientists are pushing for the development of an international database on long-term health effects of spaceflight. \r\nThis is essential for protecting the health and performance of curr… [+7612 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sonia Fernandez", "title": "Did life get its start in micaceous clay? - Phys.org", "description": "In mythologies and origin stories around the world, various cultures and religions point to clay as the vessel of life, the primordial material that creator gods imbued with a self-sustaining existence. Nowadays we have biology to explain how life comes to be…", "url": "https://phys.org/news/2022-09-life-micaceous-clay.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/mica.jpg", "publishedAt": "2022-09-20T20:12:06Z", "content": "In mythologies and origin stories around the world, various cultures and religions point to clay as the vessel of life, the primordial material that creator gods imbued with a self-sustaining existen… [+4778 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's Hubble Space Telescope captures mysterious explosion - HT Tech", "description": "NASA’s Hubble Space Telescope has captured a mysterious explosion and now it has been revealed it is a newborn star located over 9,000 light-years away.", "url": "https://tech.hindustantimes.com/tech/news/nasas-hubble-space-telescope-captures-mysterious-explosion-71663703536010.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/20/1600x900/w49b_lg_1_1663703870715_1663703871231_1663703871231.jpg", "publishedAt": "2022-09-20T19:59:40Z", "content": "The Hubble SpaceTelescope never fails to astonish us. The telescope has once again left us mesmerised with a mysterious image that it took. It turned out to be a bright newborn star enveloped by a ve… [+1606 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "SwRI's Dr. William Bottke named AGU fellow - EurekAlert", "description": "Dr. William Bottke, director of Southwest Research Institute’s Department of Space Studies, has been named a Fellow of the American Geophysical Union (AGU).", "url": "https://www.eurekalert.org/news-releases/965268", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/a483c104-30f7-4798-8c7c-8df545584581/Rendition/thumbnail/Content/Public", "publishedAt": "2022-09-20T19:54:59Z", "content": "image: Dr. William Bottke, director of Southwest Research Institutes Space Studies Department, has been named a Fellow of the American Geophysical Union (AGU).view more \r\nCredit: Southwest Research I… [+3773 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA provides highlights from Mars exploration - AP Archive", "description": "(15 Sep 2022) RESTRICTION SUMMARY: MUST CREDIT NASA NASA - MUST CREDIT NASA Space - 18 February 2021 1. Perseverance Rover's touchdown on Mars ++MUTE++HEADLI...", "url": "https://www.youtube.com/watch?v=5TX4A5jCJQM", "urlToImage": "https://i.ytimg.com/vi/5TX4A5jCJQM/hqdefault.jpg", "publishedAt": "2022-09-20T19:28:06Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Passive cooling system could benefit off-grid locations: Relying on evaporation and radiation -- but not electricity -- the system could keep food fresh longer or supplement air conditioning in buildings - Science Daily", "description": "A new passive cooling system relies on evaporation and radiation and requires no electricity. The device can provide up to about 19 degrees Fahrenheit (9.3 degrees Celsius) of cooling from the ambient temperature, to help keep food fresh longer or supplement …", "url": "https://www.sciencedaily.com/releases/2022/09/220920115553.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-20T18:46:53Z", "content": "As the world gets warmer, the use of power-hungry air conditioning systems is projected to increase significantly, putting a strain on existing power grids and bypassing many locations with little or… [+6795 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Hubble Telescope Captures An Insightful Image of AGN Galaxy - India Today", "description": "The Hubble space telescope, which has now been working in tandem with the James Webb Space Telescope (JWST) has once again beamed back stunning images from d...", "url": "https://www.youtube.com/watch?v=dJLrIQ0Xpo8", "urlToImage": "https://i.ytimg.com/vi/dJLrIQ0Xpo8/maxresdefault.jpg", "publishedAt": "2022-09-20T18:45:01Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA To Test Artemis I Rocket For Launch Readiness On Wednesday - CBS Miami", "description": "Engineers are ready to reload NASA's Artemis moon rocket with supercold fuel Wednesday to make sure a repaired liquid hydrogen quick-disconnect fitting is le...", "url": "https://www.youtube.com/watch?v=yqsScLDvjzY", "urlToImage": "https://i.ytimg.com/vi/yqsScLDvjzY/hqdefault.jpg", "publishedAt": "2022-09-20T17:51:27Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "SAGE III Sees Tonga Aerosols, Water Vapor Months After Eruption - NASA", "description": "A key part of NASA's climate observing system, the Stratospheric Aerosol and Gas Experiment (SAGE) III instrument on the International Space Station (ISS) observed enhanced stratospheric aerosols and water vapor months after the Tonga eruption.", "url": "https://www.nasa.gov/feature/langley/sage-iii-sees-tonga-aerosols-water-vapor-months-after-eruption/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/iss066-e-161687.jpg", "publishedAt": "2022-09-20T17:48:28Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: Star-childhood shapes stellar evolution - ANI News", "description": "Washington [US], September 20 (ANI): In classical models of stellar evolution, so far little importance has been attached to the early evolution of stars. Scientists now show that the biography of stars is indeed shaped by their early stage.", "url": "https://www.aninews.in/news/science/study-star-childhood-shapes-stellar-evolution20220920220544", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220920141022.jpg", "publishedAt": "2022-09-20T16:35:00Z", "content": "Washington [US], September 20 (ANI): In classical models of stellar evolution, so far little importance has been attached to the early evolution of stars. Scientists now show that the biography of st… [+3763 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "MICROSCOPE satellite puts Einstein's general relativity to record-breaking test – Physics World - physicsworld.com", "description": "Orbital freefall experiment leaves the equivalence principle intact, at least for now", "url": "https://physicsworld.com/a/microscope-satellite-puts-einsteins-general-relativity-to-record-breaking-test/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/09/MICROSCOPE-satellite.jpg", "publishedAt": "2022-09-20T16:30:34Z", "content": "Free falling: artist's impression of the MICROSCOPE satellite. (Courtesy: CNES)\r\nThe equality of inertial and gravitational mass central to Einsteins general theory of relativity has been confirmed a… [+6789 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Endangered mouse study shares no-contact sampling method - ANI News", "description": "Washington [US], September 20 (ANI): Collecting genetic samples for small mammals can be tricky, but scientists found a noninvasive way to do it for San Francisco's endangered salt marsh harvest mouse.", "url": "https://www.aninews.in/news/science/endangered-mouse-study-shares-no-contact-sampling-method20220920200051", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220920143040.jpg", "publishedAt": "2022-09-20T14:30:00Z", "content": "Washington [US], September 20 (ANI): Collecting genetic samples for small mammals can be tricky, but scientists found a noninvasive way to do it for San Francisco's endangered salt marsh harvest mous… [+2677 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "A Habitable Ocean? Scientists Find Evidence of An Essential Life Component on Saturn’s Icy Moon, Enceladus! - The Weather Channel", "description": "From here, the next step would be revisiting Enceladus to see if a habitable ocean is actually inhabited, says the study co-author. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-09-20-evidence-of-essential-life-component-on-saturn-moon-enceladus", "urlToImage": "https://s.w-x.co/in-Enceladus_0.jpg", "publishedAt": "2022-09-20T13:16:59Z", "content": "Humanitys search for signs of life outside the Earth has taken it to numerous places, ranging from our closest, neighbouring worlds to unfamiliar exo-planets orbiting stars located millions of light-… [+2669 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "NASA makes astonishing discovery! Poles on the Moon moved as much as 300 km - HT Tech", "description": "NASA has discovered that the poles on the Moon changed with time, the agency revealed in a recently published blog. Here’s what NASA said.", "url": "https://tech.hindustantimes.com/tech/news/nasa-makes-astonishing-discovery-poles-on-the-moon-moved-as-much-as-300-km-71663673789960.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/20/1600x900/edu_srch_amazing_space_the_moon_1650610011044_1663677300118_1663677300118.png", "publishedAt": "2022-09-20T12:35:37Z", "content": "Did you know the Moon also has North and South poles, just like the Earth? NASA scientists have recently discovered that not only were the lunar poles were present billions of years ago, but they als… [+1982 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Saturn's mysterious rings & extreme tilt: Former moon may be responsible - Down To Earth Magazine", "description": "Saturn is unlikely to have had a tilt during its formation stages", "url": "https://www.downtoearth.org.in/news/science-technology/saturn-s-mysterious-rings-extreme-tilt-former-moon-may-be-responsible-85021", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2022-09-20/0.48556700_1663671778_istock-910211626.jpg", "publishedAt": "2022-09-20T11:30:57Z", "content": "A pre-existing moon likely left Saturn with its bright rings and extreme tilt, according to a new study.\r\nA close encounter with Saturn may have caused the former moon named ‘Chrysalis’ to disintegra… [+3569 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Water Found on the Meteorite That Struck Gloucestershire — Transcontinental Times - Transcontinental Times", "description": "UNITED KINGDOM: For the first time, scientists have found water from another planet in a meteorite. The meteorite was found after it struck a driveway in Winchcombe, Gloucestershire, in February. Scientists now think that the space water in the meteorite may …", "url": "https://www.transcontinentaltimes.com/water-found-on-the-meteorite-tha/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/09/FMrEbn9XoAMEctt-Russell-Chattaraj-1-1.jpeg", "publishedAt": "2022-09-20T10:07:30Z", "content": "UNITED KINGDOM: For the first time, scientists have found water from another planet in a meteorite. The meteorite was found after it struck a driveway in Winchcombe, Gloucestershire, in February. \r\nS… [+2178 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Astronomers warn of possible misinterpretation of planetary data captured by Webb - News9 LIVE", "description": "The James Webb Space Telescope is too precise for existing atmospheric models", "url": "https://www.news9live.com/science/astronomers-warn-of-possible-misinterpretation-of-planetary-data-captured-by-webb-197088", "urlToImage": "https://media.news9live.com/h-upload/2022/09/20/559919-1-5000-exoplanets-1041cropped.jpg", "publishedAt": "2022-09-20T09:17:20Z", "content": "Since the early 1990s, astronomers have discovered over 5,000 exoplanets. Scientists are now moving from merely identifying exoplanets to studying them. The newly launched James Webb Space Telescope … [+5191 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "A science teacher explains: What if there was no moon? - The Indian Express", "description": "Without the Moon, our whole idea of the universe would change dramatically, slowing our progress as a species.", "url": "https://indianexpress.com/article/parenting/learning/a-science-teacher-explains-moon-8161615/", "urlToImage": "https://images.indianexpress.com/2022/07/Supermoon-july-13-2022-5-featured.jpg", "publishedAt": "2022-09-20T09:14:48Z", "content": "Since time immemorial, the moon has enthused mankind to push the boundaries of creativity and aspirations and has been instrumental in the development of knowledge. Whether stimulating the idea of me… [+6692 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Jagran Josh", "title": "The Rhynchocephalians: Reptile that lived among dinosaurs discovered - Jagran Josh", "description": "Rhynchocephalians’ fossils have been discovered by Smithsonian researchers. A team of scientists says that the species once inhabited Jurassic North America about 150 million years ago alongside dinosaurs like Stegosaurus and Allosaurus.", "url": "https://www.jagranjosh.com/current-affairs/discovery-of-rhynchocephalians-that-lived-among-dinosaurs-1663662227-1", "urlToImage": "https://img.jagranjosh.com/images/2022/September/2092022/ani-reptile-compressed.jpg", "publishedAt": "2022-09-20T08:22:00Z", "content": "Smithsonian researchers have discovered a new extinct species that belong to the same ancient lineage as New Zealands living tuatara. The finding of the insect-eating animal, an old rhynchocephalian … [+2965 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "United Arab Emirates to launch first lunar rover in November - The Week", "description": "The United Arab Emirates will launch its first lunar rover in November, the mission manager said on Monday. Hamad Al Marzooqi told The National, a state-linked newspaper, that the Rashid rover, named for Dubai's ruling family, would be launched from the Kenne…", "url": "https://www.theweek.in/news/sci-tech/2022/09/20/united-arab-emirates-to-launch-first-lunar-rover-in-november.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/7/2/UAE-flag-desert-flag-UAE-Emirate-shut.jpg", "publishedAt": "2022-09-20T07:04:02Z", "content": "The United Arab Emirates will launch its first lunar rover in November, the mission manager said on Monday.\r\nHamad Al Marzooqi told The National, a state-linked newspaper, that the Rashid rover, name… [+1503 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dangerous sunspot AR3089 ready to blow up, threatens to blast Solar storms to Earth - HT Tech", "description": "The dangerous sunspot AR3089 has appeared on the Sun. Terrifyingly, it can send X-class solar flares and severe solar storms shooting towards Earth.", "url": "https://tech.hindustantimes.com/tech/news/dangerous-sunspot-ar3089-ready-to-blow-up-threatens-to-blast-powerful-solar-storms-to-earth-71663656481741.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/20/1600x900/sun-11030_1631065589823_1663656656766_1663656656766.jpg", "publishedAt": "2022-09-20T06:54:44Z", "content": "The Sun is displaying scarily erratic behavior as we reach near the peak of its solar maximum phase. On September 18, three regions in the southern hemisphere of the Sun simultaneously exploded, rele… [+1881 chars]"}, {"source": {"id": null, "name": "Ciolook.com"}, "author": "admin", "title": "SpaceX Launches 54 Starlink Satellites into Orbit After Numerous Weather Delays - CIO Look - CIO Look", "description": "After five days of weather delays, SpaceX launched a Falcon 9 rocket from Cape Canaveral on Sunday night, putting 54 more Starlink satellites in orbit as it pushes to complete more than 60 missions this year. SpaceX’s Starlink 4-34 mission was launched at 00:…", "url": "https://ciolook.com/spacex-launches-54-starlink-satellites-into-orbit-after-numerous-weather-delays/", "urlToImage": "https://ciolook.com/wp-content/uploads/2022/09/SpaceX-Launches-54-Starlink-Satellites-into-Orbit-After-Numerous-Weather-Delays.jpg", "publishedAt": "2022-09-20T06:39:47Z", "content": "After five days of weather delays, SpaceX launched a Falcon 9 rocket from Cape Canaveral on Sunday night, putting 54 more Starlink satellites in orbit as it pushes to complete more than 60 missions t… [+882 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Tianwen-1 Mars mission team wins top aerospace award: IAF - CGTN", "description": "China's Tianwen-1 spacecraft development team was awarded the World Space Award, the highest award by the International Astronautical Federation, at the 73rd International Astronautical Congress held in Paris, France, the China Aerospace Science and Technolog…", "url": "https://news.cgtn.com/news/2022-09-20/China-s-Tianwen-1-Mars-mission-team-wins-top-aerospace-award-IAF-1dtDHtfwQUg/index.html", "urlToImage": "https://news.cgtn.com/news/2022-09-20/China-s-Tianwen-1-Mars-mission-team-wins-top-aerospace-award-IAF-1dtDHtfwQUg/img/016b20b5254b44958f3366c48232c608/016b20b5254b44958f3366c48232c608-250.png", "publishedAt": "2022-09-20T06:30:01Z", "content": "China's Tianwen-1 spacecraft development team was awarded the World Space Award, the highest award by the International Astronautical Federation (IAF), at the 73rd International Astronautical Congres… [+2313 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "All about Super-Earths, their dwarf stars and how they're more habitable than our earth - Business Insider India", "description": "Astronomers now routinely discover planets orbiting stars outside of the solar system they're called exoplanets. But in summer 2022, teams working on NASA's", "url": "https://www.businessinsider.in/science/news/all-about-super-earths-their-dwarf-stars-and-how-theyre-more-habitable-than-our-earth/articleshow/94317934.cms", "urlToImage": "https://www.businessinsider.in/photo/94317934/all-about-super-earths-their-dwarf-stars-and-how-theyre-more-habitable-than-our-earth.jpg?imgsize=7818", "publishedAt": "2022-09-20T05:42:00Z", "content": "Astronomers now routinely discover planets orbiting stars outside of the solar system they're called exoplanets. But in summer 2022, teams working on NASA\r\n's Transiting Exoplanet Survey Satellite fo… [+6272 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Your Health: Brain-powered prosthetic ankle brings balance to amputees - WQAD News 8", "description": "Scientists are testing powered prosthetic ankles that may be game-changing for amputees.Read more: https://www.wqad.com/article/news/health/your-health/brain...", "url": "https://www.youtube.com/watch?v=aDRi6cNmLdU", "urlToImage": "https://i.ytimg.com/vi/aDRi6cNmLdU/hqdefault.jpg", "publishedAt": "2022-09-19T23:50:00Z", "content": null}, {"source": {"id": null, "name": "Gearrice.com"}, "author": "Sawyer Campbell", "title": "The spectacular encounter between two galaxies captured by the Hubble Telescope - Gearrice", "description": "What would become of a collision between two galaxies, that seemed the photograph captured by the Hubble Telescope, where it is possible to visualize what", "url": "https://www.gearrice.com/update/the-spectacular-encounter-between-two-galaxies-captured-by-the-hubble-telescope/", "urlToImage": "http://parentesis.com/imagesPosts/PORTADA_TELES.jpg", "publishedAt": "2022-09-19T17:10:42Z", "content": "What would become of a collision between two galaxies, that seemed the photograph captured by the Hubble Telescope, where it is possible to visualize what could happen from a tremendous cosmic collis… [+1154 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Space Robots - Arizona Public Media", "description": "It has now been 50 years since NASA astronauts last set foot on the Moon, but a return mission might soon be in the offing. This time, though, human explorer...", "url": "https://www.youtube.com/watch?v=D61Aoqtn8m0", "urlToImage": "https://i.ytimg.com/vi/D61Aoqtn8m0/hqdefault.jpg", "publishedAt": "2022-09-19T16:05:09Z", "content": null}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "Undergrad publishes theory on immune dysfunction in space | Cornell Chronicle - Cornell Chronicle", "description": "Rocky An ’23 proposes a theory that could solve the decades-old mystery of why astronauts’ immune systems become suppressed in space.", "url": "https://news.cornell.edu/stories/2022/09/undergrad-publishes-theory-immune-dysfunction-space", "urlToImage": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/0919_an_0.jpg?itok=uqhEyZI7", "publishedAt": "2022-09-19T15:52:41Z", "content": "Its been known for decades that astronauts immune systems become suppressed in space, leaving them vulnerable to disease, but the exact mechanisms of immune dysfunction have remained a mystery now a … [+4518 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "A New Technique May Help Scientists Discover Newborn Planets — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: Young planets are typically shrouded in thick layers of gas and dust, making their discovery difficult. Astronomers have noticed features on discs in recent years that they believe are the result of planets. Scientists at the Harvard & Smithson…", "url": "https://www.transcontinentaltimes.com/a-new-technique-planets/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/09/gu.png", "publishedAt": "2022-09-19T15:18:18Z", "content": "UNITED STATES: Young planets are typically shrouded in thick layers of gas and dust, making their discovery difficult. Astronomers have noticed features on discs in recent years that they believe are… [+2504 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mike Williams", "title": "Bird's enzyme points toward novel therapies - Phys.org", "description": "Thank the rare crested ibis for a clue that could someday help our bodies make better drugs.", "url": "https://phys.org/news/2022-09-bird-enzyme-therapies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/birds-enzyme-points-to.jpg", "publishedAt": "2022-09-19T14:38:58Z", "content": "Thank the rare crested ibis for a clue that could someday help our bodies make better drugs.\r\nThe species of bird is the only one known to naturally produce an enzyme able to generate a noncanonical … [+4380 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Kenna Hughes-Castleberry", "title": "Could MIT’s MOXIE Device Be the Future of Oxygen Production on Mars? - The Debrief", "description": "MOXIE, an experiment by MIT and NASA currently on board the Perseverance rover, aims to help find ways to produce oxygen in Mars' atmosphere.", "url": "https://thedebrief.org/could-mits-moxie-device-be-the-future-of-oxygen-production-on-mars/", "urlToImage": "https://thedebrief.org/wp-content/uploads/2022/09/Moxie.jpg", "publishedAt": "2022-09-19T14:15:03Z", "content": "At a distance of around 80 million miles from Earth, Earth’s planetary neighbor Mars has become the latest target for future space missions. While some like Elon Musk hope to terraform the planet and… [+4020 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists created synthetic living cells with lifelike functionality - Tech Explorist", "description": "Pioneering research using bacteria brings scientists a step closer to creating artificial cells.", "url": "https://www.techexplorist.com/scientists-created-synthetic-living-cells-lifelike-functionality/53832/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/09/protocell.jpg", "publishedAt": "2022-09-19T13:14:52Z", "content": "At the nexus of living and non-living matter, improving the spontaneous bottom-up construction of artificial cells with high organizational complexity and diversified functions is still a problem. To… [+2814 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Utrecht University: 45 million years of Antarctic temperature change- lessons for the future - India Education Diary", "description": "An international team of scientists used molecular fossils and machine learning to build the first charts of Antarctic Ocean temperatures over the past 45 million years, offering important insights into the mechanisms driving temperature changes and", "url": "https://indiaeducationdiary.in/utrecht-university-45-million-years-of-antarctic-temperature-change-lessons-for-the-future/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/12/1200px-Utrecht_University_logo.svg_.png?fit=1024%2C1024&ssl=1", "publishedAt": "2022-09-19T12:41:16Z", "content": "An international team of scientists used molecular fossils and machine learning to build the first charts of Antarctic Ocean temperatures over the past 45 million years, offering important insights i… [+3991 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Stars on the Rise | UNCG Research - UNC Greensboro", "description": "To gather data on young stars, Culbreath combs existing surveys of the night sky in visible light, infrared, the far infrared, radio, and other wavelengths. ...", "url": "https://www.youtube.com/watch?v=te97y-aHNsg", "urlToImage": "https://i.ytimg.com/vi/te97y-aHNsg/maxresdefault.jpg", "publishedAt": "2022-09-19T12:30:08Z", "content": null}, {"source": {"id": null, "name": "Analytics India Magazine"}, "author": "Bhuvana Kamath", "title": "Scientists Draw New Revolutionary Proteins with the Help of AI - Analytics India Magazine", "description": "Advancements ​​in the AI tools has led the researchers to come up with proteins that will lead to many new vaccines, sustainable biomaterials and treatments.", "url": "https://analyticsindiamag.com/scientists-draw-new-revolutionary-proteins-with-the-help-of-ai/", "urlToImage": "https://149695847.v2.pressablecdn.com/wp-content/uploads/2022/09/new-protein.png", "publishedAt": "2022-09-19T11:31:31Z", "content": null}]}