{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Speed Of Sound On Mars Is So Slow That Human Speech Would Sound Garbled - Indiatimes.com", "description": "An analysis of the sounds captured via Perseverance rover has revealed the speed of sound on our neighbouring planet Mars. The speed of sound on the Red Planet was ascertained by an international team of researchers, as revealed at the 53rd Lunar and Planetar…", "url": "https://www.indiatimes.com/technology/news/speed-of-sound-on-mars-is-so-slow-that-human-speech-would-sound-garbled-565211.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage12-copy_623c2a0dc53c9.jpg", "publishedAt": "2022-03-24T08:00:47Z", "content": "An analysis of the sounds captured via Perseverance rover has revealed the speed of sound on our neighbouring planet Mars. The speed of sound on the Red Planet was ascertained by an international tea… [+1943 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Milky Way had exciting teenage years, new study reveals our home galaxy is older than expected - India Today", "description": "Astronomers from the Max-Planck Institute for Astronomy in Germany have identified and studied the different phases in the evolution of our home galaxy.", "url": "https://www.indiatoday.in/science/story/milky-way-had-exciting-teenage-years-new-study-reveals-our-home-galaxy-is-older-than-expected-1928990-2022-03-24", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Milky_way_4-647x363.jpeg?.whg9xRcL3h4szbgFzUis2FBUTEOVlcw", "publishedAt": "2022-03-24T07:49:18Z", "content": null}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "NASA's latest sonification lets you listen to 5,000 worlds beyond Solar System - DNA India", "description": "Turning NASA data into sounds allows users to hear the pace of discovery, with additional information conveyed by the notes themselves.", "url": "https://www.dnaindia.com/science/report-nasa-s-latest-sonification-lets-you-listen-to-5000-worlds-beyond-solar-system-exoplanets-2941813", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/03/24/1180371-solar-system.jpg", "publishedAt": "2022-03-24T07:21:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Mar 24, 2022, 12:59 PM ISTNASA, the US space agency, has confirmed the number of known exoplanets passed 5,000 on Monday. Accordin… [+995 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Comet Leonard has disintegrated into pieces as it rounds the Sun - Tech Explorist", "description": "The remnants of Comet are presently in the morning sky as seen from Earth’s Southern Hemisphere.", "url": "https://www.techexplorist.com/comet-leonard-disintegrated-pieces-rounds-sun/45510/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/03/comet-leonard.jpg", "publishedAt": "2022-03-24T06:49:09Z", "content": "On Dec.12, 2021, comet Leonard, also known as C/2021 A1, made its closest approach to Earth. Discovered almost a year ago, it was the brightest comet in 2021 that passed by Earth, lighting up the sky… [+4467 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of California, Davis: Lettuce Could Protect Astronauts’ Bones on Mars Trip - India Education Diary", "description": "Astronauts might one day grow and eat genetically modified plants to ward off disease associated with long spaceflights. Researchers at the University of California, Davis, College of Engineering have developed a transgenic, or genetically modified,", "url": "https://indiaeducationdiary.in/university-of-california-davis-lettuce-could-protect-astronauts-bones-on-mars-trip/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/uc-davis.jpeg", "publishedAt": "2022-03-24T06:32:41Z", "content": "Astronauts might one day grow and eat genetically modified plants to ward off disease associated with long spaceflights. Researchers at the University of California, Davis, College of Engineering hav… [+2035 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Mars and Moon Mission Update - BollyInside", "description": "For a little more than a year, NASA’s Perseverance rover and its accompanying helicopter, Ingenuity, have been on Mars. The rover had travelled roughly 5", "url": "https://www.bollyinside.com/news/mars-and-moon-mission-update", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/Mars-and-Moon-Mission-Update.jpg", "publishedAt": "2022-03-24T06:25:32Z", "content": "For a little more than a year, NASAs Perseverance rover and its accompanying helicopter, Ingenuity, have been on Mars. The rover had travelled roughly 5 kilometres (3 miles) through Jezero Crater dur… [+6493 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Taking pictures of the history of the International Space Station before it crashes into the ocean - BollyInside", "description": "In January 2031, the International Space Station will fall to Earth and land in the depths of Point Nemo, a watery graveyard 2,000 miles (3,219", "url": "https://www.bollyinside.com/news/taking-pictures-of-the-history-of-the-international-space-station-before-it-crashes-into-the-ocean", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/Taking-pictures-of-the-history-of-the-International-Space-Station.jpg", "publishedAt": "2022-03-24T06:01:29Z", "content": "In January 2031, the International Space Station will fall to Earth and land in the depths of Point Nemo, a watery graveyard 2,000 miles (3,219 kilometres) north of Antarctica.\r\nThe space station wil… [+4205 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Scientists open last lunar sample that was vacuum sealed on the Moon 50 years ago - India Today", "description": "Scientists hope that the sample will open a window into the ancient history of the Moon and provide new information about the evolution of Earth's natural satellite.", "url": "https://www.indiatoday.in/science/story/scientists-open-last-lunar-sample-that-was-vacuum-sealed-on-the-moon-50-years-ago-1928920-2022-03-24", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Moon_sample_0-647x363.jpeg?7EFqxHyUaTB2.kyG8Z2rUAqCWVV.ah5V", "publishedAt": "2022-03-24T05:40:40Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BEWARE! A Gigantic, stadium-sized asteroid hurtling towards Earth today, says NASA - HT Tech", "description": "NASA reports that a gigantic 259 meters wide asteroid will be approaching Earth today, March 24.", "url": "https://tech.hindustantimes.com/tech/news/beware-a-gigantic-stadium-sized-asteroid-hurtling-towards-earth-today-says-nasa-71648098175407.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/24/1600x900/asteroid-6025507_1920_1648098187847_1648098218448.jpg", "publishedAt": "2022-03-24T05:08:05Z", "content": "A potentially hazardous asteroid is headed towards Earth today March 24, according to NASA. After a couple of smaller asteroids flew past the Earth earlier this week, this will be the largest asteroi… [+2045 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Bone density study confirms watery lifestyle of 'ominous' Spinosaurus; Risk of type 2 diabetes rises after COVID; organ transplant from donors who had COVID likely safe and more - Devdiscourse", "description": "Scientists said on Wednesday that Spinosaurus and its cousin Baryonyx possessed extremely compact bones that would have helped them stay submerged for underwater swimming as semiaquatic predators targeting large prey.  Risk of type 2 diabetes rises after COVI…", "url": "https://www.devdiscourse.com/article/science-environment/1974598-science-news-roundup-bone-density-study-confirms-watery-lifestyle-of-ominous-spinosaurus-risk-of-type-2-diabetes-rises-aft", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_02_2022_11_39_04_2012511.jpg?width=920&format=jpeg", "publishedAt": "2022-03-24T05:01:03Z", "content": "Following is a summary of current science news briefs.\r\nBone density study confirms watery lifestyle of 'ominous' Spinosaurus\r\nSpinosaurus, the largest-known carnivorous dinosaur, and its closest rel… [+1244 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Two satellites will be launched as part of a new project to search for water on the lunar surface of the Moon - BollyInside", "description": "Water molecules have just recently been discovered on the moon, a crucial resource for future long space expeditions to the moon and beyond. But, until", "url": "https://www.bollyinside.com/news/two-satellites-will-be-launched-as-part-of-a-new-project-to-search-for-water-on-the-lunar-surface-of-the-moon", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/1648095916_536_Two-satellites-will-be-launched-as-part-of-a-new.jpg", "publishedAt": "2022-03-24T04:25:27Z", "content": "Water molecules have just recently been discovered on the moon, a crucial resource for future long space expeditions to the moon and beyond. But, until today, pinpointing the specific place has been … [+3080 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "An asteroid has the potential to destroy an entire city. This is how NASA intends to proceed - BollyInside", "description": "The Earth is situated in a hazardous environment. Asteroids and comets, for example, are continually speeding through space and colliding with our planet.", "url": "https://www.bollyinside.com/news/an-asteroid-has-the-potential-to-destroy-an-entire-city-this-is-how-nasa-intends-to-proceed", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/An-asteroid-has-the-potential-to-destroy-an-entire-city.jpg", "publishedAt": "2022-03-24T04:13:30Z", "content": "The Earth is situated in a hazardous environment. Asteroids and comets, for example, are continually speeding through space and colliding with our planet. The majority of these are insignificant and … [+5472 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Shunned By European Space Agency, Russian ROSCOSMOS To Go Ahead With Solo Mars Mission Sans ESA Rover - EurAsian Times", "description": "Russia will commence work on its own Mars mission following the indefinite suspension of a joint project by the European Space Agency (ESA) in the aftermath of the Ukraine invasion, Interfax news agency quoted a top official as saying on March 18. The ESA ann…", "url": "https://eurasiantimes.com/russian-roscosmos-to-go-ahead-with-solo-mars-mission-sans-esa-rover/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/03/Russia-Mars-lander.png", "publishedAt": "2022-03-24T03:24:02Z", "content": "Russia will commence work on its own Mars mission following the indefinite suspension of a joint project by the European Space Agency (ESA) in the aftermath of the Ukraine invasion, Interfax news age… [+5439 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA Astronaut Mark Vande Hei Sets New Record for Longest US Space Voyage - BollyInside", "description": "When NASA astronaut Mark Vande Hei ascended into space 11 months ago, he had no idea how long he would be away from Earth, let alone if he would be able", "url": "https://www.bollyinside.com/news/nasa-astronaut-mark-vande-hei-sets-new-record-for-longest-us-space-voyage", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/NASA-Astronaut-Mark-Vande-Hei-Sets-New-Record-for-Longest.jpg", "publishedAt": "2022-03-24T03:13:25Z", "content": "When NASA astronaut Mark Vande Hei ascended into space 11 months ago, he had no idea how long he would be away from Earth, let alone if he would be able to break any records.\r\nHowever, when the clock… [+4302 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "NASA to seek a second moon lander, giving Bezos new opening - Moneycontrol", "description": "The National Aeronautics and Space Administration plans to release a draft request for proposals by the end of March for moon lander concepts for missions after the Artemis III program, which aims to bring astronauts to the moon in 2025, the agency announced …", "url": "https://www.moneycontrol.com/news/world/nasa-to-seek-a-second-moon-lander-giving-bezos-new-opening-8267761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/385602501-770x433.jpg", "publishedAt": "2022-03-24T02:36:07Z", "content": "A super blue blood moon sets behind the Golden Gate Bridge in San Francisco, California, U.S., on Wednesday, Jan. 31, 2018. Blue moons are the second full moon in a one-month period take place once e… [+2404 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Marshall Space Flight Center Director provides an update on the Artemis I mission - BollyInside", "description": "Jody Singer, Director of the Marshall Space Flight Center, spoke to the Rotary Club of Decatur. She briefed the group on the Space Launch System’s", "url": "https://www.bollyinside.com/news/marshall-space-flight-center-director-provides-an-update-on-the-artemis-i-mission", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/Marshall-Space-Flight-Center-Director-provides-an-update-on-the.jpg", "publishedAt": "2022-03-24T01:49:30Z", "content": "Jody Singer, Director of the Marshall Space Flight Center, spoke to the Rotary Club of Decatur. She briefed the group on the Space Launch Systems progress, the planned uncrewed Artemis mission, and A… [+1740 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Researchers find mechanism for long term memory storage - ThePrint", "description": "Washington [US], March 24 (ANI): While studying how memories are stored in the brain, a team identified a novel protein folding mechanism that is essential for long-term memory storage. The researchers further demonstrated that this mechanism is impaired in a…", "url": "https://theprint.in/science/researchers-find-mechanism-for-long-term-memory-storage/886006/", "urlToImage": null, "publishedAt": "2022-03-24T00:30:28Z", "content": "Washington [US], March 24 (ANI): While studying how memories are stored in the brain, a team identified a novel protein folding mechanism that is essential for long-term memory storage.\r\nThe research… [+1969 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "Incredible images capture a ridiculously swole galaxy - Inverse", "description": "Astronomers captured a new image of spiral galaxy with an overdeveloped arm. NGC 772 is on the Atlas of Peculiar Galaxies as one of the weirdest galaxies.", "url": "https://www.inverse.com/science/massive-spiral-galaxy", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/3/23/2ac48b3c-449a-424c-add1-18c99fdeb1d4-5edc7a26-9c7a-43d7-b56c-9aeb7287a951-noirlab2209a-copy.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-03-23T23:30:25Z", "content": "Its tough competition out there for a galaxy.\r\n With an estimate of nearly 2 trillion observable galaxies in the universe, you have to do what you can to stand out. For some, its about sheer muscle p… [+2513 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "US Space Force CHPS to Patrol the Moon - BollyInside", "description": "CHPS, a cutting-edge new network, may be able to regulate space traffic around the Moon. We’ll need a mechanism to track space trash and the expanding", "url": "https://www.bollyinside.com/news/us-space-force-chps-to-patrol-the-moon", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/US-Space-Force-CHPS-to-Patrol-the-Moon.jpg", "publishedAt": "2022-03-23T23:13:26Z", "content": "CHPS, a cutting-edge new network, may be able to regulate space traffic around the Moon.\r\nWell need a mechanism to track space trash and the expanding number of missions orbiting the Moon and beyond … [+3884 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The first pebbles from China’s Moon have sparked a study frenzy - BollyInside", "description": "Until recently, geochronologist Li Xian-research Hua’s was restricted to Earth’s molten rocks. However, when a Chinese spacecraft delivered the country’s", "url": "https://www.bollyinside.com/news/the-first-pebbles-from-chinas-moon-have-sparked-a-study-frenzy", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/The-first-pebbles-from-Chinas-Moon-have-sparked-a-study.jpg", "publishedAt": "2022-03-23T22:01:41Z", "content": "Until recently, geochronologist Li Xian-research Huas was restricted to Earths molten rocks. However, when a Chinese spacecraft delivered the countrys first Moon pebbles in December 2020, Li shifted … [+5383 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Fermi Arcs in an Antiferromagnet detected at BESSY II - Science Daily", "description": "Researchers have analyzed samples of NdBi crystals which display interesting magnetic properties. In their experiments including measurements at BESSY II they could find evidence for so called Fermi arcs in the antiferromagnetic state of the sample at low tem…", "url": "https://www.sciencedaily.com/releases/2022/03/220323125126.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-23T19:42:17Z", "content": "Reseachers have analysed samples of NdBi crystals which display interesting magnetic properties. In their experiments including measurements at BESSY II they could find evidence for so called Fermi a… [+1629 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Single-photon source paves the way for practical quantum encryption: New source is compact and operates at room temperature - Science Daily", "description": "Researchers describe new high-purity single-photon source that can operate at room temperature. The source is an important step toward practical applications of quantum technology, such as highly secure communication based on quantum key distribution (QKD).", "url": "https://www.sciencedaily.com/releases/2022/03/220323125124.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-23T19:35:16Z", "content": "Researchers have developed a new high-purity single-photon source that can operate at room temperature. The source is an important step toward practical applications of quantum technology, such as hi… [+4016 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Revamped design could take powerful biological computers from the test tube to the cell - Nanowerk", "description": "Researchers have developed long-lived biological computers that could potentially persist inside cells. They forgo the traditional DNA-based approach, opting instead to use the nucleic acid RNA to build computers.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60155.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60155.jpg", "publishedAt": "2022-03-23T19:29:43Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Ingenious AI Method Could Find Precious New Rare-Earth Compounds - ScienceAlert", "description": "Rare-earth elements are crucial components in all kinds of electronics, from smartphones and broadband cables to wind turbines and electric cars. But coming up with useful compounds that can expand our practical use of rare-earths is notoriously dif", "url": "https://www.sciencealert.com/ai-is-pointing-the-way-to-finding-new-rare-earth-compounds", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/PersonInspectingMineralSampleWithMagnifyingGlass_1024.jpg", "publishedAt": "2022-03-23T18:01:14Z", "content": "Rare-earth elements are crucial components in all kinds of electronics, from smartphones and broadband cables to wind turbines and electric cars. But coming up with useful compounds that can expand o… [+3254 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova, Tereza Pultarova", "title": "The Bohr model: The famous but flawed depiction of an atom - Space.com", "description": "The Bohr model is neat, but imperfect, depiction of atom structure.", "url": "https://www.space.com/bohr-model-atom-structure", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xnxfLdVuSgG3hcjNCgjMuX-1200-80.jpg", "publishedAt": "2022-03-23T17:09:29Z", "content": "The Bohr model, introduced by Danish physicist Niels Bohr in 1913, was a key step on the journey to understand atoms.\r\nAncient Greek thinkers already believed that matter was composed of tiny basic p… [+7695 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "Earth's Core Discovered to Have Strange Magnetic Waves ⋆ Ceng News - Ceng News", "description": "Small magnetic waves with a seven-year cycle have been discovered at Earth's core.Electric currents generated by the movement of molten", "url": "https://www.cengnews.com/news/earths-core-discovered-to-have-strange-magnetic-waves-352154.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/03/1648053411_earth-core.jpg", "publishedAt": "2022-03-23T16:37:46Z", "content": "Small magnetic waves with a seven-year cycle have been discovered at Earth’s core.\r\nElectric currents generated by the movement of molten iron deep within the planet’s core are responsible for the pl… [+3044 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Optimal metrology with programmable quantum sensors - Nature.com", "description": "A new approach to generating quantum sensors with close-to-optimal performance&nbsp;is demonstrated experimentally through&nbsp;Ramsey interferometry&nbsp;with (up to) N = 26 entangled atoms on a trapped-ion quantum computer, without a priori knowledge of the…", "url": "https://www.nature.com/articles/s41586-022-04435-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-04435-4/MediaObjects/41586_2022_4435_Fig1_HTML.png", "publishedAt": "2022-03-23T16:08:46Z", "content": "<li>Taylor, M. A. &amp; Bowen, W. P. Quantum metrology and its application in biology. Phys. Rep.615, 159 (2016).\r\nMathSciNet \r\n CAS \r\nGoogle Scholar \r\n</li><li>Wu, Y., Jelezko, F., Plenio, M. B. &am… [+7813 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "Faster Than A Missile! NASA’s Successful Launch Of BOLT II Can Make Hypersonic Travel A New Reality - EurAsian Times", "description": "The US Air Force’s Office of Scientific Research (AFOSR) successfully launched its Boundary Layer Transition and Turbulence (BOLT II) project onboard a two-stage sounding rocket on March 21 from NASA’s Wallops Test Flight Facility in Virginia. The launch is a…", "url": "https://eurasiantimes.com/nasas-successful-launch-of-bolt-ii-can-make-lightning-fast-travel/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/03/Sr71_Blackbird.jpg", "publishedAt": "2022-03-23T15:47:53Z", "content": "The US Air Forces Office of Scientific Research (AFOSR) successfully launched its Boundary Layer Transition and Turbulence (BOLT II) project onboard a two-stage sounding rocket on March 21 from NASAs… [+5049 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mike Williams", "title": "Don't underestimate undulating graphene: Unique electronics made possible by wavy patterns that channel electrons - Phys.org", "description": "Lay some graphene down on a wavy surface, and you'll get a guide to one possible future of two-dimensional electronics.", "url": "https://phys.org/news/2022-03-dont-underestimate-undulating-graphene-unique.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/dont-underestimate-und.jpg", "publishedAt": "2022-03-23T14:54:22Z", "content": "Lay some graphene down on a wavy surface, and you'll get a guide to one possible future of two-dimensional electronics. \r\nRice University scientists put forth the idea that growing atom-thick graphen… [+2798 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Contraband Corned Beef and the Gemini III Mission - NASA", "description": "Astronaut John Young, the pilot of the Gemini III mission, inspects his helmet in the ready room in preparation for the launch.", "url": "https://www.nasa.gov/image-feature/contraband-corned-beef-and-the-gemini-iii-mission/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/john_young_s65-23488orig.jpg", "publishedAt": "2022-03-23T14:53:42Z", "content": null}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "Nirmal Narayanan", "title": "Anti-universe where times runs backward could be real, scientists say - IBTimes India", "description": "Scientists believe that there could be a mirror image of our universe, which is very crucial to maintaining the symmetry of the universe", "url": "https://www.ibtimes.co.in/anti-universe-where-times-runs-backward-could-be-real-scientists-say-846828", "urlToImage": "https://data1.ibtimes.co.in/en/full/681127/universe-expanding-faster-rate-previously-calculated.png", "publishedAt": "2022-03-23T14:13:01Z", "content": "First proof of alien life on Mars may be detected by a UK space laboratory\r\nThe concept of the parallel universe has been the hottest genre among Hollywood filmmakers for years. Even though there is … [+1464 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Aussie scientists unravel vital role of 'junk' DNA - The Tribune India", "description": "A piece of DNA, previously considered as 'junk' material by scientists, could be the key to extinguishing fear-related memories for people with post-traumatic stress disorder (PTSD) and phobias, according to a new study led by Australian researchers.", "url": "https://www.tribuneindia.com/news/schools/aussie-scientists-unravel-vital-role-of-junk-dna-380018", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_856112348.jpg", "publishedAt": "2022-03-23T14:09:00Z", "content": "Sydney, March 23 \r\nA piece of DNA, previously considered as 'junk' material by scientists, could be the key to extinguishing fear-related memories for people with post-traumatic stress disorder (PTSD… [+2550 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Juno Spacecraft Captures Stunning View of Jupiter's Moons Io and Europa – And a Crater on Ganymede - SciTechDaily", "description": "NASA’s Juno mission captured this view of Jupiter’s southern hemisphere during the spacecraft’s 39th close flyby of the planet on January 12, 2022. Zooming in on the right portion of the image (see image below) reveals two more worlds in the same frame: Jupit…", "url": "https://scitechdaily.com/nasa-juno-spacecraft-captures-stunning-view-of-jupiters-moons-io-and-europa-crater-on-ganymede/", "urlToImage": "https://scitechdaily.com/images/Ganymede-Crater.jpg", "publishedAt": "2022-03-23T13:53:05Z", "content": "NASA’s Juno mission captured this view of Jupiter’s southern hemisphere during the spacecraft’s 39th close flyby of the planet on January 12, 2022. Credit: NASA/JPL-Caltech/SwRI/MSSS, Image processin… [+3056 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "ESAs Solar Orbiter to make its closest approach to Sun: Only 48 million km will lie between the two - News9 LIVE", "description": "Solar Orbiter's present, extremely elliptical orbit will fluctuate little over the next three years, ...", "url": "https://www.news9live.com/science/esas-solar-orbiter-to-make-its-closest-approach-to-sun-only-48-million-km-will-lie-between-the-two-160632", "urlToImage": "https://media.news9live.com/h-upload/2022/03/23/260017-solar-orbiter-sun.jpg", "publishedAt": "2022-03-23T13:02:37Z", "content": "ESA's Solar Orbiter spacecraft is on its way to the best vantage point of its mission route after being two years in space. NASA is also a contributor to the European Space Agency's mission. The prob… [+2679 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "ISS astronauts conduct spacewalk, NASA shares live footage. Watch here - Mint", "description": "Astronauts Raja Chari, Matthias Maurer are conducting a spacewalk to install new hoses on the International Space Station's Radiator Beam Valve Module, which helps regulate the station's temperature.", "url": "https://www.livemint.com/science/news/iss-astronauts-conduct-spacewalk-nasa-shares-live-footage-watch-here-11648038001640.html", "urlToImage": "https://images.livemint.com/img/2022/03/23/600x338/51732390695_6d2609b78a_k_1648038439482_1648038443186.jpg", "publishedAt": "2022-03-23T12:57:51Z", "content": "NASA had shared on 10 March that the astronauts from International Space Station (ISS) Expedition 66 will conduct two spacewalks Tuesday, 15 March, and Wednesday, 23 March, to continue upgrades to th… [+3294 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "'New type of UV light' kills 98% of microbes in a room and could help prevent the next pandemic - Daily Mail", "description": "'Far-UVC' light can kill microbes without damaging human skin, say experts at the University of St. Andrews, University of Dundee, University of Leeds, and Columbia University in New York.", "url": "https://www.dailymail.co.uk/sciencetech/article-10643177/New-type-UV-light-kills-98-microbes-room-help-prevent-pandemic.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/23/12/55699387-0-image-a-40_1648038267510.jpg", "publishedAt": "2022-03-23T12:44:52Z", "content": "A 'new' kind of ultraviolet light kills almost all microbes in a room and could help avoid another lethal pandemic, a new study shows. \r\nResearchers say 'far-UVC' light emitted from ceiling lamps can… [+9857 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Stephanie Mlot", "title": "NASA to Send Rockets Through Active Aurora for Science - PCMag India", "description": "The space agency wants to study how the northern lights interact with Earth's atmosphere.", "url": "https://in.pcmag.com/news/148542/nasa-to-send-rockets-through-active-aurora-for-science", "urlToImage": "https://sm.pcmag.com/t/pcmag_in/news/n/nasa-to-se/nasa-to-send-rockets-through-active-aurora-for-science_mrh6.1200.jpg", "publishedAt": "2022-03-23T12:13:28Z", "content": "NASA is set to launch a pair of rockets through an active aurora to study the natural light display.\r\nOften spotted in a polar climate, aurora borealis (also known as the northern lights) are actuall… [+1932 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Astronomers reveal clearest image yet of mysterious 'odd radio circle' - Daily Mail", "description": "There are now three leading theories about what causes 'odd radio circles' thanks to the new images captured by the South African Radio Astronomy Observatory's MeerKat radio telescope.", "url": "https://www.dailymail.co.uk/sciencetech/article-10643299/Astronomers-reveal-clearest-image-mysterious-odd-radio-circle.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/23/12/55698589-0-image-a-24_1648036839369.jpg", "publishedAt": "2022-03-23T11:59:59Z", "content": "They are astronomy's newest mystery objects, 'odd radio circles' a million light years across that were first spotted two years ago.\r\nNow, using the world's most capable radio telescopes, astronomers… [+6222 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Study Shows The Unimaginable Terrible Effects Of Dinosaur-Killing Asteroid - The Hans India", "description": "This massive cloud of sulfur-bearing gases, once airborne, blocked the Sun and cooled Earth for many ...", "url": "https://www.thehansindia.com/offbeat/study-shows-the-unimaginable-terrible-effects-of-dinosaur-killing-asteroid-734709", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/03/23/1283165-brutal-than.jpg", "publishedAt": "2022-03-23T11:30:06Z", "content": "A new study indicates that when the dinosaur-killing asteroid struck with Earth 66 million years ago, vast amounts of sulphur were hurled into the stratosphere that were far terrible than previously … [+2358 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Hubble telescope spies striking spiral galaxy that's part of a huge cosmic structure - Space.com", "description": "The cluster that includes this galaxy has more than 1,000 members.", "url": "https://www.space.com/spiral-galaxy-virgo-cluster-structure-hubble-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/V4E99PHEdS43XXmPyq2a76-1200-80.jpg", "publishedAt": "2022-03-23T10:45:44Z", "content": "The Hubble Space Telescope caught a galaxy on camera that underlies a much larger structure, known as the Virgo Cluster.\r\nThe image of spiral galaxy NGC 4571, approximately 60 million light-years fro… [+2026 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Growing uniformly sized nanodiamonds - Nanowerk", "description": "Scientists report a method to grow ultra-uniform nanodiamonds without the need for explosives. The technique also could be used to add beneficial single-atom defects in otherwise perfect crystals.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60148.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60148.jpg", "publishedAt": "2022-03-23T09:58:49Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "The James Webb Space Telescope has become a space rockstar - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/smart-living/innovation/the-james-webb-space-telescope-has-become-a-space-rockstar-111648025687335.html", "urlToImage": "https://images.livemint.com/img/2022/03/23/1140x641/NASA-Space-Telescope-0_1648025776198_1648025787087.jpg", "publishedAt": "2022-03-23T09:23:17Z", "content": "The James Webb Space Telescope successor to the famed Hubble Space Telescope blasted off from South America in December and reached its designated exploration point in January this year. Since then, … [+3941 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Ingenuity helicopter aces 22nd flight on Mars as it flies to new destination - India Today", "description": "The helicopter has flown for 4,647 meters on Mars as it is currently flying to the northwest portion of a region known as Séítah.", "url": "https://www.indiatoday.in/science/story/ingenuity-helicopter-aces-22nd-flight-on-mars-as-it-flies-to-new-destination-1928465-2022-03-23", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Ingenuity_8-647x363.jpeg?7slrgi.0rQdQMY9Bu5uMopGxIkD3gM0Y", "publishedAt": "2022-03-23T06:54:32Z", "content": null}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "NASA's Perseverance to Cover Longest Distance in a Single Month Using Artificial Intelligence | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Mission officials have said that the six-wheeled scientist is on a 5-kilometre journey that began March 14 and is full of sandpits, craters, and fields of sharp rocks. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-23-nasas-perseverance-to-cover-longest-distance-in-a-single-month", "urlToImage": "https://s.w-x.co/in-perseverance_1.jpg", "publishedAt": "2022-03-23T05:26:38Z", "content": "Using artificial intelligence, NASA's Perseverance Mars rover is trying to cover more distance in a single month than any rover before.\r\nMission officials have said that the six-wheeled scientist is … [+2521 chars]"}, {"source": {"id": null, "name": "Lankatimes.com"}, "author": "Izer", "title": "Giant debris cloud spotted by NASA telescope after celestial bodies collided - Lanka Times", "description": "Astronomers had the opportunity to observe a massive, star-sized debris cloud from such a collision as it passed in front of a nearby star and blocked", "url": "https://www.lankatimes.com/giant-debris-cloud-spotted-by-nasa-telescope-after-celestial-bodies-collided/", "urlToImage": "", "publishedAt": "2022-03-23T03:38:27Z", "content": "Astronomers had the opportunity to observe a massive, star-sized debris cloud from such a collision as it passed in front of a nearby star and blocked some of its light. This temporary dimming of sta… [+4341 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "OCT studies without noise. A new method for better detection of eye diseases - EurekAlert", "description": "Worldwide, as many as 285 million people suffer from serious eye diseases or blindness. Unfortunately, most of them do not have access to modern methods of treatment, so help often comes too late. This situation could change with the advent of a very signific…", "url": "https://www.eurekalert.org/news-releases/947221", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/a844e039-75bb-4576-a9b0-3e85f64cd737/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-23T02:05:12Z", "content": "image: OCT studies without noise. A new method for better detection of eye diseases. Photo: Karol Karnowskiview more \r\nCredit: Source IPC PAS/ICTER, Karol Karnowski\r\nWorldwide, as many as 285 million… [+6945 chars]"}, {"source": {"id": null, "name": "Heraldoffashion.com"}, "author": "Izer", "title": "Calculating the global carbon footprint of space science - Herald of Fashion", "description": "credit: natural astronomy (2022). DOI: 10.1038 / s41550-022-01639-6 A team of researchers at the University of Toulouse has attempted to calculate the", "url": "https://heraldoffashion.com/calculating-the-global-carbon-footprint-of-space-science/", "urlToImage": "https://heraldoffashion.com/wp-content/uploads/2022/03/Calculating-the-global-carbon-footprint-of-space-science.jpg", "publishedAt": "2022-03-22T22:36:13Z", "content": "natural astronomy (2022). DOI: 10.1038 / s41550-022-01639-6″ width=”685″ height=”436″/&gt; credit: natural astronomy (2022). DOI: 10.1038 / s41550-022-01639-6\r\nA team of researchers at the University… [+3138 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Scientists make yeast-free pizza dough that rises like the real thing - Livescience.com", "description": "Their goal was to make tasty dough without a chemical agent.", "url": "https://www.livescience.com/yeast-free-pizza-dough-physics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/itmojZMzmxs69a4uGMHLq8-1200-80.jpg", "publishedAt": "2022-03-22T21:18:20Z", "content": "A materials scientist with a yeast allergy set out to make a yeast-free pizza dough that still rises like a classic Neapolitan pie.\r\nNow, in a new paper published March 22 in the journal Physics of F… [+3842 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "International Sea Level Satellite Takes Over From Predecessor - NASA", "description": "Sentinel-6 Michael Freilich, the newest addition to a long line of ocean-monitoring satellites, becomes the reference satellite for sea level measurements.", "url": "https://www.nasa.gov/feature/jpl/international-sea-level-satellite-takes-over-from-predecessor/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/1-greenland-1600.jpg", "publishedAt": "2022-03-22T19:28:14Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "China plans to open its space station to tourism within a decade - Daily Mail", "description": "While there are no specific details for the future of space tourism in China, it is likely that people without formal astronaut training could be launched 'relatively soon'.", "url": "https://www.dailymail.co.uk/sciencetech/article-10640665/China-plans-open-space-station-tourism-decade.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/17/54317911-0-China_plans_to_complete_its_Tiangong_space_station_by_the_end_of-a-25_1647971125639.jpg", "publishedAt": "2022-03-22T18:56:35Z", "content": "China plans to open its new space station up to 'tourism' within the next decade - sparking what the country hopes is a race to compete with the likes of private American space tourists such as Jeff … [+10391 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ashley Balzer", "title": "NASA's Roman mission will test competing cosmic acceleration theories - Phys.org", "description": "A team of scientists has predicted the science return from one of NASA's Nancy Grace Roman Space Telescope's groundbreaking planned surveys, which will analyze millions of galaxies strewn across space and time. The mission's enormous, deep panoramas will prov…", "url": "https://phys.org/news/2022-03-nasa-roman-mission-cosmic-theories.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasas-roman-mission-wi.jpg", "publishedAt": "2022-03-22T18:45:38Z", "content": "These six cubes show the simulated distribution of galaxies at redshifts 9, 8, 5, 3, 2, and 1, with the corresponding cosmic ages shown. As the universe expands, the density of galaxies within each c… [+9896 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researcher documents what happened during the first attempt at a gravitational-wave observatory in Europe - Phys.org", "description": "First predicted in Einstein's theory of general relativity, gravitational waves are tiny ripples in spacetime generated by titanic and powerful cosmic events. The great physicist believed that no equipment would ever be sensitive to detect these faint cosmic …", "url": "https://phys.org/news/2022-03-documents-gravitational-wave-observatory-europe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-gravity.jpg", "publishedAt": "2022-03-22T18:45:32Z", "content": "First predicted in Einstein's theory of general relativity, gravitational waves are tiny ripples in spacetime generated by titanic and powerful cosmic events. The great physicist believed that no equ… [+2920 chars]"}, {"source": {"id": null, "name": "Thevalleypost.com"}, "author": "Izer", "title": "Physicists challenge haters, create quadrangular ice - Valley Post", "description": "The research team used a laser to melt the ice.Photo: Chris HigginsA team of physicists recently discovered a new phase of water ice, after They put", "url": "https://www.thevalleypost.com/physicists-challenge-haters-create-quadrangular-ice/", "urlToImage": null, "publishedAt": "2022-03-22T18:11:52Z", "content": "The research team used a laser to melt the ice.\r\nPhoto: Chris Higgins\r\nA team of physicists recently discovered a new phase of water ice, after They put normal Snow under unusually high pressure and … [+2915 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Raven Weber", "title": "What are they and how do they affect the Internet and electronics - Sprout Wired", "description": "It was only a matter of time before a solar storm struck Earth again. In 1859, the planet had already...", "url": "https://www.sproutwired.com/what-are-they-and-how-do-they-affect-the-internet-and-electronics/", "urlToImage": "https://www.sproutwired.com/wp-content/uploads/2022/03/What-are-they-and-how-do-they-affect-the-Internet.jpg", "publishedAt": "2022-03-22T17:43:14Z", "content": "It was only a matter of time before a solar storm struck Earth again. In 1859, the planet had already experienced the largest recorded event of its kind: it was the Carrington event. At that time tel… [+2797 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Study analyses the characteristics of Apophis, the asteroid that will approach Earth in 2029 - Nanowerk", "description": "The Apophis asteroid was discovered in 2004 and has been monitored since then due to its classification as a potentially hazardous asteroid (PHA), as it was estimated that it would have a 2% chance of hitting Earth.", "url": "https://www.nanowerk.com/news2/space/newsid=60138.php", "urlToImage": "https://www.nanowerk.com/news2/space/id60138.jpg", "publishedAt": "2022-03-22T16:58:30Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "A new experiment could confirm information as the fifth state of matter - Interesting Engineering", "description": "A scientist from the University of Portsmouth devised an experiment that they believe confirms the fifth state of matter.", "url": "https://interestingengineering.com/information-fifth-state-of-matter", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Z3G8DmayGm/sizes/dna-info_md.jpeg", "publishedAt": "2022-03-22T15:44:55Z", "content": "A scientist from the University of Portsmouth devised an experiment that they believe confirms the fifth state of matter, a discovery that would change the field of physics for good, a press release … [+2583 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Susanne Clara Bard", "title": "New study says an earlier spring could jeopardize the Arctic tundra's ability to store carbon - Phys.org", "description": "Every year, when the long, dark Arctic winter begins its retreat, the tundra ecosystem comes to life.", "url": "https://phys.org/news/2022-03-earlier-jeopardize-arctic-tundra-ability.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-study-says-an-earl.jpg", "publishedAt": "2022-03-22T15:34:03Z", "content": "Every year, when the long, dark Arctic winter begins its retreat, the tundra ecosystem comes to life.\r\n\"It goes from this kind of stark, dark, icy desert, and then all of a sudden it greens up and yo… [+5207 chars]"}, {"source": {"id": null, "name": "Deseret News"}, "author": null, "title": "How could a small asteroid impact protect us in the future? - Deseret News", "description": "On March 11, a small asteroid hit Earth off the coast of Norway. Due to advancing NASA technology, scientists can find more threatening asteroids before they hit Earth", "url": "https://www.deseret.com/2022/3/22/22989904/nasa-asteroid-hit-earth-space-impact", "urlToImage": "https://deseret.brightspotcdn.com/dims4/default/56edfcb/2147483647/strip/true/crop/1024x585+0+50/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2Fk1GYhJwca97GnpIS3Bi6wSoP9UI%3D%2F0x0%3A1024x683%2F1024x683%2Ffilters%3Afocal%28512x342%3A513x343%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23335744%2FAP21328250814088.jpeg", "publishedAt": "2022-03-22T14:12:00Z", "content": "On March 11, a small, 6-foot-wide asteroid hit Earth off the coast of Norway. \r\n<ul><li>Technology from NASA tracked the rocks movements two hours before it hit the planet. </li><li>This technology c… [+2628 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Supermassive black holes identified as likely cause of stopping star formation - News9 LIVE", "description": "The formation of supermassive black holes is what causes young galaxies to turn into old galaxies", "url": "https://www.news9live.com/science/supermassive-black-holes-identified-as-likely-cause-of-stopping-star-formation-160447", "urlToImage": "https://media.news9live.com/h-upload/2022/03/22/259770-potw1951acropped.jpg", "publishedAt": "2022-03-22T13:35:44Z", "content": "A combination of machine learning, sophisticated supercomputer simulations and data from large scale surveys of the cosmos have resulted in researchers getting closer to solve a 20 year old conundrum… [+3341 chars]"}, {"source": {"id": null, "name": "Polymerupdate.com"}, "author": null, "title": "Plastics waste – no problem; scientists develop enzymes to break down PET in weeks - polymerupdate.com", "description": "With an admissible lifespan of around 450 years, plastics, the wonder material of the sixties and se...", "url": "https://www.polymerupdate.com/news/important/22Mar2022/1158893/plastics-waste-–-no-problem-scientists-develop-enzymes-to-break-down-pet-in-weeks", "urlToImage": "https://www.polymerupdate.com/images/logo/200x200.png", "publishedAt": "2022-03-22T12:34:21Z", "content": "With an admissible lifespan of around 450 years, plastics, the wonder material of the sixties and seventies, have become a cause of major concern for the entire world due to irresponsible dumping of … [+3241 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Asteroid Ryugu could be a remnant of an extinct comet - Daily Mail", "description": "Samples from the diamond shaped, half-mile diameter space rock were returned to Earth for study by the Japan Aerospace Exploration Agency (JAXA) in 2020.", "url": "https://www.dailymail.co.uk/sciencetech/article-10639185/Asteroid-Ryugu-remnant-extinct-comet.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/10/43979755-0-image-a-5_1647946545549.jpg", "publishedAt": "2022-03-22T11:34:50Z", "content": "Asteroid Ryugu could be a remnant of an extinct comet that spent tens of thousands of years racing through the solar system, new data suggests.\r\nScientists believe it was then vaporised by high tempe… [+6783 chars]"}]}