{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Iron-depleted, oxidized chemistry of Earth's continental crust not from crystallization of mineral garnet: Study - Devdiscourse", "description": "The iron-poor composition of continental crust is a major reason why vast portions of the Earth's surface stand above sea level as dry land, making terrestrial life possible today.", "url": "https://www.devdiscourse.com/article/science-environment/2443506-iron-depleted-oxidized-chemistry-of-earths-continental-crust-not-from-crystallization-of-mineral-garnet-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_05_2023_01_50_13_5242831.jpg?width=920&format=jpeg", "publishedAt": "2023-05-08T01:50:15Z", "content": "A new research attempted to determine the understanding of Earth's crust by testing and ultimately eliminating one popular hypothesis about why continental crust is lower in iron and more oxidized co… [+6747 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Closer to Earth Than Ever Before: MIT Astronomers Detect Black Hole Devouring a Star - SciTechDaily", "description": "The event was spotted in infrared data — also a first — suggesting further searches in this band could turn up more such bursts. MIT astronomers have discovered a new tidal disruption event in infrared, providing insights into how supermassive black holes rip…", "url": "https://scitechdaily.com/closer-to-earth-than-ever-before-mit-astronomers-detect-black-hole-devouring-a-star/", "urlToImage": "https://scitechdaily.com/images/Star-Spaghettification-Black-Hole.gif", "publishedAt": "2023-05-08T01:42:11Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyMay 7, 2023\r\nThis animation depicts a star experiencing spaghettification as its sucked in by a supermassive black hole during a tidal disruption … [+11325 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "AI is helping astronomers make new discoveries and learn about the universe faster than ever before - EastMojo", "description": "AI has spread into every field of astronomy. As the technology has become more powerful, AI algorithms have begun helping astronomers tame massive data sets and discover new knowledge about the universe.", "url": "http://www.eastmojo.com/space/2023/05/08/ai-is-helping-astronomers-make-new-discoveries-and-learn-about-the-universe-faster-than-ever-before/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/01/universe_2250310_1920.jpg?fit=1920%2C1280&ssl=1", "publishedAt": "2023-05-08T01:30:00Z", "content": "The famous first image of a black hole just got two times sharper. A research team used artificial intelligence to dramatically improve upon its first image from 2019, which now shows the black hole … [+8329 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "An Esthetic Approach for Rehabilitation of Long-Span Edentulous Arch Using Artificial Intelligence - Cureus", "description": "Successful full-mouth rehabilitation requires contemporary and advanced treatment planning, especially in distal extension cases. Multiple treatment modalities are available in those cases. Treatment outcome in these patients remains challenging. Though impla…", "url": "https://www.cureus.com/articles/142769-an-esthetic-approach-for-rehabilitation-of-long-span-edentulous-arch-using-artificial-intelligence?score_article=true", "urlToImage": "https://assets.cureus.com/uploads/figure/file/570082/article_river_f9a62f00b5d611ed9e6ffb453601a9cb-Picture1-1-.png", "publishedAt": "2023-05-08T01:23:38Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Terrifying 60-foot asteroid speeding towards Earth for a close encounter! NASA reveals details - HT Tech", "description": "NASA expects a huge asteroid to make a close approach to Earth soon. The space agency has revealed important details about this oncoming space rock.", "url": "https://tech.hindustantimes.com/tech/news/terrifying-60-foot-asteroid-speeding-towards-earth-for-a-close-encounter-nasa-reveals-details-71683508260115.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/08/1600x900/cosmos-7935452_1920_Pixabay_1682401012706_1683508365599.jpg", "publishedAt": "2023-05-08T01:13:22Z", "content": "Asteroids have struck Earth several times in history and caused a major impact. According to NASA, a single asteroid collided with the planet nearly 65 million years ago, which is said to be the reas… [+1899 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "Reconstructing ancient bacterial genomes can revive previously unknown molecules – offering a potential source for new antibiotics - Daily Excelsior", "description": "Washington, May 7:Microorganisms – in particular bacteria – are skillful chemists that can produce an impressive diversity of chemical compounds known as natural products. These metabolites provide the microbes major evolutionary advantages, such as allowing …", "url": "https://www.dailyexcelsior.com/reconstructing-ancient-bacterial-genomes-can-revive-previously-unknown-molecules-offering-a-potential-source-for-new-antibiotics/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2023/05/download-13-6.jpg", "publishedAt": "2023-05-08T00:31:04Z", "content": "Washington, May 7:Microorganisms in particular bacteria are skillful chemists that can produce an impressive diversity of chemical compounds known as natural products.These metabolites provide the mi… [+6380 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Amazonian dark earth could be used to boost tree reforestation - Earth.com", "description": "Amazonian dark earth could be used to boost tree reforestation • Earth.com", "url": "https://www.earth.com/news/amazonian-dark-earth-could-be-used-to-boost-tree-reforestation/", "urlToImage": "https://cff2.earth.com/uploads/2023/05/07180838/Amazonian-dark-earth.jpg", "publishedAt": "2023-05-08T00:09:33Z", "content": "Between 450 BCE and 950 CE, Amerindian people living in todays Amazonia fundamentally transformed their habitats originally poor soils, enriching them with charcoal from their low-intensity fires use… [+6126 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Chinese Explorer Finds Signs of Recent Water on Mars - VOA Learning English", "description": "A new study suggests that water may have existed on Mars much more recently than past evidence has shown. The research is based on data collected by China’s Zhurong explorer.", "url": "https://learningenglish.voanews.com/a/chinese-explorer-finds-signs-of-recent-water-on-mars/7079261.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-dceb-08db4cde14b7_cx0_cy3_cw0_w1200_r1.jpg", "publishedAt": "2023-05-07T22:02:14Z", "content": "A new study suggests water may have existed on Mars much more recently than past evidence has shown.\r\nThe research is based on data collected by Chinas Zhurong explorer vehicle. The explorer, or rove… [+5124 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Abhinav Yadav", "title": "Why care about space — Part 2. More Subtle Reasons | by Abhinav Yadav | May, 2023 - Medium", "description": "Continuing from Why care about space series — these are subtle reasons that not everyone stops to think about. Did you know that Einstein’s theory of relativity has a practical application in our…", "url": "https://travellingthroughspace.medium.com/why-care-about-space-part-2-e7dcca62b29a", "urlToImage": "https://miro.medium.com/v2/da:true/resize:fit:768/1*AohVPQQRwKx4fa1DhOO42g.gif", "publishedAt": "2023-05-07T21:58:15Z", "content": "Continuing from Why care about spaceseries these are subtle reasons that not everyone stops to think about.\r\nNavigating our daily lives \r\nDid you know that Einsteins theory of relativity has a practi… [+3434 chars]"}, {"source": {"id": null, "name": "Ubergizmo"}, "author": "Paulo Montenegro", "title": "Shadowy Craters On The Moon Offer Clues To The Location Of Water Ice - Ubergizmo", "description": "NASA’s new hypersensitive optical camera, ShadowCam, has captured stunning images of the Moon’s permanently shadowed regions that may serve as potential landing sites for the upcoming crewed Artemis missions. These regions have been in darkness for more than …", "url": "https://www.ubergizmo.com/2023/05/shadowy-craters-moon-offer-clues-location-water-ice/", "urlToImage": "https://i0.wp.com/cdnssl.ubergizmo.com/wp-content/uploads/2023/05/satudated.jpg", "publishedAt": "2023-05-07T20:49:36Z", "content": "NASA’s new hypersensitive optical camera, ShadowCam, has captured stunning images of the Moon’s permanently shadowed regions that may serve as potential landing sites for the upcoming crewed Artemis … [+1794 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": "Keith Cowing", "title": "Bursts From Space: MeerKAT - The First Citizen Science Project Dedicated To Commensal Radio Transients - Space Ref", "description": "The newest generation of radio telescopes are able to survey large areas with high sensitivity and cadence, producing data volumes that require new methods to better understand the transient sky.", "url": "https://spaceref.com/newspace-and-tech/bursts-from-space-meerkat-the-first-citizen-science-project-dedicated-to-commensal-radio-transients/", "urlToImage": "https://media2.spaceref.com/wp-content/uploads/2023/05/06143528/Screen-Shot-2023-05-06-at-2.33.26-PM.png", "publishedAt": "2023-05-07T20:39:10Z", "content": "The mean optical and radio flux densities of our sample of radio variables, atop an underlying distribution of astrophysical classes (Stewart et al. 2018). Black crosses denote counterparts within th… [+3155 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Worlds Largest “Raptor” Dinosaurs Lived 10 Million Years Earlier Than Thought - SciTechDaily", "description": "The Utahraptor, the world's largest \"raptor\" dinosaur, is now estimated to be 135 million years old, 10 million years older than previously thought. The discovery has important implications for dinosaur evolutionary history and narrows the gap in the rock rec…", "url": "https://scitechdaily.com/worlds-largest-raptor-dinosaurs-lived-10-million-years-earlier-than-thought/", "urlToImage": "https://scitechdaily.com/images/Utahraptors-Prey-Trapped-Quicksand-Deposit.jpg", "publishedAt": "2023-05-07T19:14:41Z", "content": "ByUniversity of KansasMay 7, 2023\r\nCsotonyi illustration: Portrayal of Utahraptors and prey trapped in quicksand deposit of the Stikes Quarry bone bed at Utahraptor Ridge. A recent geological study h… [+5631 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Planting Seeds of Hope: “Zero Plant Extinction” Is Possible - SciTechDaily", "description": "Plant ecologist Richard T. Corlett proposes a strategy to prevent future land plant extinctions, including training more experts, creating an online \"metaherbarium,\" and establishing \"microreserves.\" Access to information and a lack of trained specialists are…", "url": "https://scitechdaily.com/planting-seeds-of-hope-zero-plant-extinction-is-possible/", "urlToImage": "https://scitechdaily.com/images/Plants-Hands-Dirt-Earth-Day-1.jpg", "publishedAt": "2023-05-07T17:33:44Z", "content": "ByCell PressMay 7, 2023\r\nPlant ecologist Richard T. Corlett argues that preventing all future land plant extinctions is achievable through training more plant experts, building an online metaherbariu… [+4866 chars]"}, {"source": {"id": null, "name": "Edmonton Journal"}, "author": "Nicole Bergot", "title": "Mars Mission: U of A researcher part of team selecting 30 rocks from the Red Planet - Edmonton Journal", "description": "Herd, curator of the U of A's Meteorite collection, is helping choose which rocks NASA’s rover Perseverance will gather to bring back to Earth.", "url": "https://edmontonjournal.com/news/local-news/mars-mission-u-of-a-researcher-part-of-team-selecting-30-rocks-from-the-red-planet", "urlToImage": "https://smartcdn.gprod.postmedia.digital/edmontonjournal/wp-content/uploads/2021/02/mars-rover-perseverance-landing-2021.jpg", "publishedAt": "2023-05-07T17:01:20Z", "content": "Article content\r\nThe return sample scientist well help decide which rocks can answer the most questions about Mars, not the least of which is has it ever been home to living things.\r\nIts absolutely p… [+1636 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Reveal What's Inside The Moon In New Findings - NDTV", "description": "The report further said that the seismic data effectively examine the inner composition of the objects in the solar system.", "url": "https://www.ndtv.com/science/scientists-reveal-whats-inside-the-moon-in-new-findings-4013844", "urlToImage": "https://c.ndtvimg.com/2023-05/c03kgdho_moon-unsplash_625x300_07_May_23.jpg", "publishedAt": "2023-05-07T16:08:30Z", "content": "The research has been published in Nature.\r\nThere has been a lot of curiosity about what is Moon made of and there have been several debates about whether its inner core is solid or molten. Now resea… [+2447 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "New image of galaxy with extremely bright region in centre shared - Inshorts", "description": "NASA has shared a new image of the galaxy 'NGC 5283' which has an active galactic nucleus, or AGN, which is an extremely bright region at the heart of a galaxy where a supermassive black hole exists. NGC 5283 is a Seyfert galaxy which differ from other galaxi…", "url": "https://inshorts.com/en/news/new-image-of-galaxy-with-extremely-bright-region-in-centre-shared-1683470430680", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2023/05_may/7_sun/img_1683469148099_117.jpg?", "publishedAt": "2023-05-07T14:41:33Z", "content": null}, {"source": {"id": null, "name": "LocalNews8.com"}, "author": "CNN Newsource", "title": "Are airplanes at risk from falling space debris like old rockets and satellites? - Local News 8 - LocalNews8.com", "description": "By Daniel Otis Click here for updates on this story     Toronto (CTV Network) — As the Earth’s orbit continues to fill with discarded rockets and old satellites, experts say airplanes could be in danger from falling debris. “There is a real risk,” Aaron Boley…", "url": "https://localnews8.com/news/2023/05/07/are-airplanes-at-risk-from-falling-space-debris-like-old-rockets-and-satellites/", "urlToImage": "https://localnews8.b-cdn.net/2020/12/Joint-KIFI-Local-News-8-and-MIFI-Eyewitness-News-3-Now-logo-scaled.jpg", "publishedAt": "2023-05-07T14:41:13Z", "content": "By Daniel Otis\r\nClick here for updates on this story\r\n    Toronto (CTV Network) — As the Earth’s orbit continues to fill with discarded rockets and old satellites, experts say airplanes could be in d… [+5042 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: New Space Exploration Partner, Mars Experience on Earth, Black Hole Week - SciTechDaily", "description": "Another partner for space exploration … A Mars experience right here on Earth … And a promising find outside our solar system … A few of the stories to tell you about – This Week at NASA! https://youtu.be/9CbCEsfZ7BE Another Nation Signs Up for Exploration Co…", "url": "https://scitechdaily.com/?p=275105", "urlToImage": "https://scitechdaily.com/images/GJ-486-b-Exoplanet-Star.jpg", "publishedAt": "2023-05-07T14:18:52Z", "content": "ByNASAMay 7, 2023\r\nGJ 486 b is about 30% larger than the Earth and three times as massive, which means it is a rocky world with stronger gravity than Earth. It orbits a red dwarf star in just under 1… [+3569 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "See astronauts relocate SpaceX Dragon capsule in time-lapsed highlights - VideoFromSpace", "description": "SpaceX Crew-6 astronauts NASA's Stephen Bowen and Woody Hoburg, the United Arab Emirates' Sultan Al Neyadi and Russian cosmonaut Andrey Fedyaev moved Crew Dr...", "url": "https://www.youtube.com/watch?v=UCl3QzBLLwQ", "urlToImage": "https://i.ytimg.com/vi/UCl3QzBLLwQ/maxresdefault.jpg", "publishedAt": "2023-05-07T14:01:01Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Antarctic ice sheet was more dynamic than previously thought - Earth.com", "description": "Antarctic ice sheet was more dynamic than previously thought • Earth.com", "url": "https://www.earth.com/news/antarctic-ice-sheet-was-more-dynamic-than-previously-thought/", "urlToImage": "https://cff2.earth.com/uploads/2023/05/06230331/Antarctic-ice-sheet2-scaled.jpg", "publishedAt": "2023-05-07T13:25:43Z", "content": "Deep beneath the West Antarctic Ice Sheet, lies a frigid, dark subglacial lake filled with tales yet to be discovered. More enigmatic than even the planets of our solar system, these mysterious lakes… [+9775 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "All about LIGO-India project, which has put country on elite astronomy map - The Federal", "description": "What is the LIGO-India project for which the Centre has approved Rs 2,600 crore? When will it start operating and why is it important? Here are your questions answered.", "url": "https://thefederal.com/explainers-2/all-about-ligo-india-project-which-has-put-country-on-elite-astronomy-map/", "urlToImage": "https://thefederal.com/file/2023/05/LIGO_India_site.jpg", "publishedAt": "2023-05-07T11:58:33Z", "content": "Last month, the Union Cabinet cleared Rs 2,600 crore for the Laser Interferometer Gravitational-Wave Observatory (LIGO) project that will come up in Hingoli, Maharashtra, some 590 km east of Mumbai. … [+5507 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Shares Old Pic Showing Saturn's Glorious Rings In Natural Colour - NDTV", "description": "NASA recently shared an old mesmerising picture of Saturn showing the gas giant's golden north hemisphere and its main rings in natural colour.", "url": "https://www.ndtv.com/science/nasa-shares-old-pic-showing-saturns-glorious-rings-in-natural-colour-4013163", "urlToImage": "https://c.ndtvimg.com/2023-05/tj7lcus8_saturn-pic_625x300_07_May_23.jpg", "publishedAt": "2023-05-07T10:46:29Z", "content": "In the picture, Saturn appears half-lit in gold, blue, and tan shades.\r\nNASA often shares space pictures and videos on its social media handle which usually leaves netizens mesmerised. The space agen… [+1795 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 7 May 2023: Helix Nebula! Will our Sun turn into THIS? - HT Tech", "description": "NASA Astronomy Picture of the Day today is that of a Helix Nebula, which is said to be formed by the death of a Sun-like star.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-7-may-2023-helix-nebula-will-our-sun-turn-into-this-71683455437252.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/07/1600x900/Helix2_CFHT_960_1683455489464_1683455495561.jpg", "publishedAt": "2023-05-07T10:32:17Z", "content": "Nebulae are colossal clouds of gas and dust in outer space that serve as the birthplace of stars, commonly referred to as \"stellar nurseries,\" and occasionally the site of their demise - and sometime… [+1736 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Scientists reveal how massive galaxies form in early universe - ThePrint", "description": "Beijing [China], May 7 (ANI/WAM): An international team of scientists has proved that gas recycling is the key factor in the formation of massive galaxies in the early universe and this discovery came after they observed a nebula located 11 billion light-year…", "url": "https://theprint.in/world/scientists-reveal-how-massive-galaxies-form-in-early-universe/1560884/", "urlToImage": null, "publishedAt": "2023-05-07T09:15:41Z", "content": "Beijing [China], May 7 (ANI/WAM): An international team of scientists has proved that gas recycling is the key factor in the formation of massive galaxies in the early universe and this discovery cam… [+1651 chars]"}, {"source": {"id": null, "name": "Ianslive.in"}, "author": "IANSLive", "title": "Cow urine can be a boon for humans: IVRI - IANS", "description": "The four-year-long study conducted by a nine-member team of scientists refuted the previous claim that cow urine is dangerous to humans and have asserted that cow urine extracts are full of medical and medicinal properties.In t", "url": "https://ianslive.in/news/cow_urine_can_be_a_boon_for_humans_ivri-965418/NATION/1", "urlToImage": "https://ianslive.in/upload/2023/May/07/r-1683446581202305071333011552_l.jpg", "publishedAt": "2023-05-07T08:26:10Z", "content": "Photo Credit: IANS\r\nIANSLive\r\nLucknow, May 7 (IANS) In a research, the senior scientists of the Indian Veterinary Research Institute (IVRI) in Bareilly have found that cow urine extract is rich in an… [+1273 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Webb Detects Water Vapour Signals Around a Rocky Super-Earth! | Weather.com - The Weather Channel", "description": "Webb’s initial observations suggest water vapour may have split out from an atmosphere enveloping GJ 486 b, however, its also possible  that these traces arose from the outer layer of its host star.", "url": "https://weather.com/en-IN/india/space/news/2023-05-06-webb-finds-water-vapour-rocky-super-earth-origin-puzzles-scientists", "urlToImage": "https://s.w-x.co/in-exoplanet_5.jpg", "publishedAt": "2023-05-07T07:35:55Z", "content": "A rocky exoplanet (an alien world outside our solar system) thats about three times more massive than the Earth has something unusual steaming up in its surroundings: traces of water vapour which, mo… [+3024 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Exploring the Cosmic Connection: Universe's Frequency Linked to Om Chanting - Transcontinental Times", "description": "INDIA: New research suggests that the frequency of the universe and the sacred sound of “Om” may be more connected than previously thought. A team of scientists from India and the United States have delved into the physics behind the ancient practise of chant…", "url": "https://www.transcontinentaltimes.com/cosmic-connection-universe-om/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/05/Om-Chanting.jpg", "publishedAt": "2023-05-07T07:28:09Z", "content": "INDIA: New research suggests that the frequency of the universe and the sacred sound of “Om” may be more connected than previously thought.\r\nA team of scientists from India and the United States have… [+3228 chars]"}, {"source": {"id": null, "name": "Northeastbylines.co.uk"}, "author": "Robert Nichol", "title": "The Euclid spacecraft will transform how we view the 'dark universe' - North East Bylines", "description": "Euclid is designed to provide us with a better understanding of the “mysterious” components of our universe, known as dark matter and dark energy", "url": "https://northeastbylines.co.uk/the-euclid-spacecraft-will-transform-how-we-view-the-dark-universe/", "urlToImage": "https://northeastbylines.co.uk/wp-content/uploads/2023/05/Euclid.jpg", "publishedAt": "2023-05-07T07:06:00Z", "content": "Robert Nichol, University of Surrey\r\nThe European Space Agencys (ESA) Euclid satellite completed the first part of its long journey into space on May 1 2023, when it arrived in Florida on a boat from… [+6147 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telangana Today", "title": "Chandrayaan 3, Aditya L1 to be launched in July - Telangana Today", "description": "The Chandrayaan 2 mission was launched in 2019, but its lander crashed-landed on the moon's surface due to glitches in the software.", "url": "https://telanganatoday.com/chandrayaan-3-aditya-l1-to-be-launched-in-july", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2023/05/ISRO.jpg", "publishedAt": "2023-05-07T06:55:34Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Hidden Oceans on Uranus' Moons? New Study Unveils Intriguing Possibilities - Times Now", "description": "Re-examination of Voyager data and new computer models suggest deep, hidden oceans on four large Uranian moons", "url": "https://www.timesnownews.com/technology-science/hidden-oceans-on-uranus-moons-new-study-unveils-intriguing-possibilities-article-100048093", "urlToImage": "https://static.tnn.in/thumb/msid-100048093,updatedat-1683440910265,width-1280,height-720,resizemode-75/100048093.jpg", "publishedAt": "2023-05-07T06:28:30Z", "content": "AP SSC Result Today LIVE (OUT): AP 10th Results DECLARED on bse.ap.gov.in, Details on Marks Memo, Pass Percentage and More"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Scientists Capture Fastest Molecule Movements Ever Seen with Advanced X-ray Techniques - Transcontinental Times", "description": "UNITED STATES: Researchers at the SLAC National Accelerator Laboratory have captured one of the fastest movements of a molecule called ferricyanide by utilising two ultrafast X-ray spectroscopy techniques", "url": "https://www.transcontinentaltimes.com/scientists-fastest-molecule-movement/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/05/Ferricyanide-1.jpg", "publishedAt": "2023-05-07T06:15:00Z", "content": "UNITED STATES: Researchers at the SLAC National Accelerator Laboratory have captured one of the fastest movements of a molecule called ferricyanide by utilising two ultrafast X-ray spectroscopy techn… [+2637 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "New black hole images reveal a glowing, fluffy ring and a high-speed jet - India Education Diary", "description": "In 2017, astronomers captured the first image of a black hole by coordinating radio dishes around the world to act as a single, planet-sized telescope. The synchronized network, known collectively as the Event Horizon Telescope (EHT), focused in on M", "url": "https://indiaeducationdiary.in/new-black-hole-images-reveal-a-glowing-fluffy-ring-and-a-high-speed-jet/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2023-05-07T04:40:10Z", "content": "In 2017, astronomers captured the first image of a black hole by coordinating radio dishes around the world to act as a single, planet-sized telescope. The synchronized network, known collectively as… [+5861 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "MIT engineers “grow” atomically thin transistors on top of computer chips - India Education Diary", "description": "Emerging AI applications, like chatbots that generate natural human language, demand denser, more powerful computer chips. But semiconductor chips are traditionally made with bulk materials, which are boxy 3D structures, so stacking multiple layers o", "url": "https://indiaeducationdiary.in/mit-engineers-grow-atomically-thin-transistors-on-top-of-computer-chips/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2023-05-07T04:36:08Z", "content": "Emerging AI applications, like chatbots that generate natural human language, demand denser, more powerful computer chips. But semiconductor chips are traditionally made with bulk materials, which ar… [+8368 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Scientists Are Using Bacteria To Make Salmon Healthier - SciTechDaily", "description": "Bacteria-free fish fry put scientists on the track to make fish more disease resistant. Researchers, including those from NTNU, are breeding bacteria-free fish fry. This is more important than you think. “We’re managing to keep the fry bacteria-free for up to…", "url": "https://scitechdaily.com/how-scientists-are-using-bacteria-to-make-salmon-healthier/", "urlToImage": "https://scitechdaily.com/images/Salmon-Fillet.jpg", "publishedAt": "2023-05-06T23:29:07Z", "content": "ByNorwegian University of Science and TechnologyMay 6, 2023\r\nResearchers at NTNUs Department of Biotechnology and Food Science are breeding bacteria-free fish fry, studying their growth, genes, and m… [+8992 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nanoscale Breakthrough – A Single-Molecule Valve - SciTechDaily", "description": "A revolutionary paradigm shift that will transform chemical and biochemical synthesis is on the horizon. The scientific community envisions utilizing minute molecules as foundational elements to construct objects, similar to how we assemble things with mechan…", "url": "https://scitechdaily.com/nanoscale-breakthrough-a-single-molecule-valve/", "urlToImage": "https://scitechdaily.com/images/Revolutionary-Nanovalve-Enables-Active-Control-of-Single-Molecule-Flows.jpg", "publishedAt": "2023-05-06T22:39:10Z", "content": "Schematic drawing of the working principle of the single-molecule valve. Credit: Yan Xu, Osaka Metropolitan University\r\nA revolutionary paradigm shift that will transform chemical and biochemical syn… [+3274 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Interstellar Boundary Explorer Reveals: The Heliosphere Has Ripples! - SciTechDaily", "description": "NASA’s Interstellar Boundary Explorer, or IBEX mission, has helped researchers learn something new about the heliosphere – the magnetic bubble created by the Sun that we live in. It turns out, the heliosphere has ripples! These ripples also change – likely du…", "url": "https://scitechdaily.com/nasas-interstellar-boundary-explorer-reveals-the-heliosphere-has-ripples/", "urlToImage": "https://scitechdaily.com/images/Boundary-of-Heliosphere-Mapped-for-First-Time-scaled.jpg", "publishedAt": "2023-05-06T21:49:23Z", "content": "ByNASAMay 6, 2023\r\nA diagram of our heliosphere. For the first time, scientists have mapped the heliopause, which is the boundary between the heliosphere (brown) and interstellar space (dark blue). C… [+2932 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Twinkle", "title": "Lunar Eclipse 2023: What is Flower Moon? Check The Photos of Penumbral Chandra Grahan Here. - Jagran Josh", "description": "Lunar Eclipse 2023: The first penumbral lunar eclipse of 2023 occurred on May 5. It was a Flower Moon. Check out this article to know more about the full moon, photos and more.", "url": "https://www.jagranjosh.com/general-knowledge/check-the-images-for-first-penumbral-eclipse-here-1683387487-1", "urlToImage": "https://img.jagranjosh.com/images/2023/May/752023/flower-moon-of-2023.jpg", "publishedAt": "2023-05-06T21:24:00Z", "content": "Lunar Eclipse 2023:The first Penumbral Lunar Eclipse of 2023 amazed the space enthusiast on May 5. People in areas of Asia, Africa, and other continents witnessed the celestial event. The penumbral e… [+2442 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "An artificially created object is visible in the picture of the Sun: what is it (photo) - The Times Hub", "description": "Spread the love To see this unusual detail in the images of the Sun, you need to look very closely, but the effort is worth it. An American astrophotographer, including taking pictures of the Sun, was able to photograph how the International Space Station (IS…", "url": "https://thetimeshub.in/an-artificially-created-object-is-visible-in-the-picture-of-the-sun-what-is-it-photo/", "urlToImage": null, "publishedAt": "2023-05-06T19:09:20Z", "content": "To see this unusual detail in the images of the Sun, you need to look very closely, but the effort is worth it. \r\nAn American astrophotographer, including taking pictures of the Sun, was able to phot… [+945 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": "Keith Cowing", "title": "Hubble Views Striking Starry Tendrils Of The Jellyfish Galaxy, JO175 - Space Ref", "description": "The jellyfish galaxy, JO175, appears to hang suspended in this image from the NASA/ESA Hubble Space Telescope.", "url": "https://spaceref.com/science-and-exploration/hubble-views-striking-starry-tendrils-of-the-jellyfish-galaxy-jo175/", "urlToImage": "https://media2.spaceref.com/wp-content/uploads/2023/05/06144841/tendrils.jpg", "publishedAt": "2023-05-06T18:49:43Z", "content": "The jellyfish galaxy JO175 appears to hang suspended in this image from the NASA/ESA Hubble Space Telescope. This galaxy lies over 650 million light-years from Earth in the appropriately-named conste… [+3203 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Future of Particle Beam Experimentation – Innovative New Algorithm Improves Our Understanding - SciTechDaily", "description": "The algorithm combines classical beam physics equations with machine-learning techniques to reduce the need for extensive data processing. When the linear accelerator at SLAC National Accelerator Laboratory is operational, groups of approximately one billion …", "url": "https://scitechdaily.com/the-future-of-particle-beam-experimentation-innovative-new-algorithm-improves-our-understanding/", "urlToImage": "https://scitechdaily.com/images/Particle-Beam-in-an-Accelerator-Graphic-Representation-scaled.jpg", "publishedAt": "2023-05-06T16:59:33Z", "content": "BySLAC National Accelerator LaboratoryMay 6, 2023\r\nA graphic representation of a particle beam in an accelerator. Credit: Greg Steward/SLAC National Accelerator Lab\r\nThe algorithm combines classical … [+5562 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's Hubble Telescope snaps RARE Lenticular galaxy - HT Tech", "description": "NASA’s Hubble Space Telescope has taken a snap of the unique Lenticular galaxy.", "url": "https://tech.hindustantimes.com/tech/news/nasas-hubble-telescope-snaps-rare-lenticular-galaxy-71683391723136.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/06/1600x900/hubble_ngc5283_v4_mstr_flat_final_1683391824576_1683391832309.jpg", "publishedAt": "2023-05-06T16:51:05Z", "content": "Despite decades of service and the launch of the latest James Webb Space Telescope, the Hubble Space Telescope has not stopped surprising scientists with its cosmic revelations. Recently, NASA's Hubb… [+1952 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Laura Ungar / AP Science Writer", "title": "Zoonomia: Genetic research reveals what humans share with animals | Laura Ungar / AP Science Writer - BusinessMirror", "description": "By comparing the genetic blueprints of an array of animals, scientists are gaining new insights into our own species and all we share with other creatures. One of the most striking revelations is that certain passages in the instructions for life have persist…", "url": "https://businessmirror.com.ph/2023/05/07/zoonomia-genetic-research-reveals-what-humans-share-with-animals/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2023/05/bio01-050723.jpg", "publishedAt": "2023-05-06T16:03:00Z", "content": "By comparing the genetic blueprints of an array of animals, scientists are gaining new insights into our own species and all we share with other creatures.\r\nOne of the most striking revelations is th… [+3815 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Alien transmission likely to happen in next 60 years, claim scientists - WION", "description": "Alien transmission likely to happen in next 60 years, claim scientists", "url": "https://www.wionews.com/science/alien-transmission-likely-to-happen-in-60-years-claim-scientists-589815", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/05/06/350170-untitled-design-2023-05-06t213115421.png", "publishedAt": "2023-05-06T15:53:13Z", "content": "The Laboratory of Statistical Biophysics at the Ecole Polytechnique Federale de Lausanne (EPFL) recently carried out research which hinted at the possibility of getting a hit on alien transmission in… [+2938 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Science For Everyone: What Are Black Holes? How The Colossal Behemoths Behave, And Why - ABP Live", "description": "Black holes are not really holes, but huge concentrations of matter packed into very tiny regions. They are so dense that their strong gravitational pull does not allow anything to escape.", "url": "https://news.abplive.com/science/science-for-everyone-black-holes-structure-anatomy-types-how-colossal-behemoths-behave-and-why-1600332", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/06/6a62170dd222e0eb823f10648a27101b1683373346783324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-05-06T14:20:27Z", "content": "Black Holes: Welcome back to \"Science For Everyone\", ABP Live's weekly science column. Last week, we discussed why it is said \"we are all made of stardust\". This week, we will discuss black holes, on… [+14689 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "188 meteorites found on Earth turned out to be fragments of Mars. - The Times Hub", "description": "Spread the love Of the thousands of meteorites found on Earth, about 188 have been confirmed to be Martian. But how did they get here? Over the turbulent history of our solar system, asteroids slammed into Mars with such force that debris was ejected into spa…", "url": "https://thetimeshub.in/188-meteorites-found-on-earth-turned-out-to-be-fragments-of-mars/", "urlToImage": null, "publishedAt": "2023-05-06T14:07:18Z", "content": "Of the thousands of meteorites found on Earth, about 188 have been confirmed to be Martian. But how did they get here? \r\nOver the turbulent history of our solar system, asteroids slammed into Mars wi… [+813 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Scientists Reconstruct Face Of 330 Million Years Old Crocodile-Like Tadpole Creature - News18", "description": "The expert claims the creatures could have been two or three meters long and its behavior would have been similar to that of modern crocodiles.", "url": "https://www.news18.com/viral/scientists-reconstruct-face-of-330-million-years-old-crocodile-like-tadpole-creature-7740451.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/wp-image-323-168338014716x9.jpg", "publishedAt": "2023-05-06T13:36:33Z", "content": "Digital reconstruction of broken fossils has enabled researchers to estimate how Crassigyrinus Scoticus, an ancient pre-dinosaur predator looked like. The paper on tetrapod evolution published in the… [+2187 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "World Astronomy Day- Orchids The International School, Nevta, organizes an astronomy exhibition - India Education Diary", "description": "Jaipur : Orchids The International School (OIS) Nevta, Jaipur, organized an Astronomy Exhibition in which students presented their models in astronomy. Students from grades 4 to 8 participated in this exhibition and presented their scientific a", "url": "https://indiaeducationdiary.in/world-astronomy-day-orchids-the-international-school-nevta-organizes-an-astronomy-exhibition/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/W-A-D-Pictures-461x1024.jpeg", "publishedAt": "2023-05-06T11:12:26Z", "content": "Jaipur : Orchids The International School (OIS) Nevta, Jaipur, organized an Astronomy Exhibition in which students presented their models in astronomy. Students from grades 4 to 8 participated in thi… [+2261 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "ANIKET DIXIT", "title": "Following a significant solar eruption, a coronal mass ejection is moving towards Earth - News Track English", "description": "USA: It appears as though the Sun is very active right now. Radio blackouts on Earth, particularly over Africa, were reported on Thursday as a result of solar flares caused by the explosion of sunspot AR3296. A Coronal Mass Ejection (CME), which may soon stri…", "url": "https://english.newstracklive.com/news/following-a-significant-solar-eruption-a-coronal-mass-ejection-is-moving-towards-earth-sc71-nu355-ta355-1276069-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/May/06/big_thumb/Screenshot-2023-05-06-155921_64562c0ecd6b4.png", "publishedAt": "2023-05-06T10:40:16Z", "content": "USA: It appears as though the Sun is very active right now. Radio blackouts on Earth, particularly over Africa, were reported on Thursday as a result of solar flares caused by the explosion of sunspo… [+2198 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "NASA's LunaH-Map CubeSat Heading Towards Doom as Mission Nears End - Transcontinental Times", "description": "UNITED STATES: Time is running out for NASA’s LunaH-Map CubeSat as attempts to fix a stuck valve in the spacecraft’s propulsion system come to a close. Launched last November as part of the Artemis 1 mission, LunaH-Map was one of 10 CubeSats launched as ride-…", "url": "https://www.transcontinentaltimes.com/nasas-lunah-map-cubesat-heading/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/05/NADA.jpg", "publishedAt": "2023-05-06T10:11:50Z", "content": "UNITED STATES: Time is running out for NASA’s LunaH-Map CubeSat as attempts to fix a stuck valve in the spacecraft’s propulsion system come to a close. Launched last November as part of the Artemis 1… [+2141 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Eta Aquariids meteor shower could peak tonight: How to watch the shooting stars - The Indian Express", "description": "Here is how you can view Eta Aquariids meteor shower, which is set to peak around May 6 and May 7.", "url": "https://indianexpress.com/article/technology/science/eta-aquariids-meteor-shower-peak-8594998/", "urlToImage": "https://images.indianexpress.com/2023/05/Eta-aquariid-meteor-shower-20230506.jpg", "publishedAt": "2023-05-06T10:10:28Z", "content": "Meteor showers happen when our planet passes through the debris left behind by asteroids and comets. When pieces of this debris collide with the Earths atmosphere they burn up, producing shooting sta… [+1624 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Possible origins and implications of atypical morphologies and domestication-like traits in wild golden jackals (Canis aureus) | Scientific Reports - Nature.com", "description": "Scientific Reports - Possible origins and implications of atypical morphologies and domestication-like traits in wild golden jackals (Canis aureus)", "url": "https://www.nature.com/articles/s41598-023-34533-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-34533-w/MediaObjects/41598_2023_34533_Fig1_HTML.png", "publishedAt": "2023-05-06T09:14:33Z", "content": "Camera surveillance and spatial analyses\r\nCamera surveillance took place between August and December 2020, at twelve~30 km2 sites located in the central and northern Golan Heights (Supplementary Tabl… [+13674 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Detection of long terminal repeat loci derived from endogenous retrovirus in junglefowl using whole-genome sequencing | Scientific Reports - Nature.com", "description": "Scientific Reports - Detection of long terminal repeat loci derived from endogenous retrovirus in junglefowl using whole-genome sequencing", "url": "https://www.nature.com/articles/s41598-023-34520-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-34520-1/MediaObjects/41598_2023_34520_Fig1_HTML.png", "publishedAt": "2023-05-06T09:12:12Z", "content": "<li>Boeke, J. D. &amp; Stoye, J. P. Retrotransposons, endogenous retroviruses, and the evolution of retroelements. In Retroviruses (eds Hughes, S. &amp; Varmus, H.) 343435 (Cold Spring Harbor Laborat… [+9262 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Astronomers have found a planet with clouds of iron and rain of liquid rubies - The Times Hub", "description": "Spread the love A football-shaped exoplanet known as WASP-121b has been found in space. It has an atmosphere, it is surrounded by metallic clouds, consisting of iron, corundum and titanium, from which ruby ​​rains periodically pour. As Stern said, citing rese…", "url": "https://thetimeshub.in/astronomers-have-found-a-planet-with-clouds-of-iron-and-rain-of-liquid-rubies/", "urlToImage": null, "publishedAt": "2023-05-06T09:07:19Z", "content": "A football-shaped exoplanet known as WASP-121b has been found in space. It has an atmosphere, it is surrounded by metallic clouds, consisting of iron, corundum and titanium, from which ruby rains per… [+311 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": "More from this author", "title": "Can Satellites Escape Away From Earth After Death? - Science ABC", "description": "Dead satellites are still revolving round Earth in high orbits. But there are factors ensuring they stay under Earth's gravity.", "url": "https://www.scienceabc.com/nature/animals/can-satellites-escape-away-from-earth-after-death.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2023/04/Spacecraft.jpg", "publishedAt": "2023-05-06T08:43:15Z", "content": "Table of Contents (click to expand)\r\nDead satellites are still revolving around Earth in high orbits, but there are factors and features to ensure they stay under the control of Earth’s gravity.\r\nIf … [+6911 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": "Kamal Saini", "title": "Will My Next Infection Kill Me? – Human Gut Signals Hope for a Future Free of Antibiotic Resistance - Revyuh", "description": "Human Gut Reveals How We Can Tackle Resistance to Antibiotics, According to New Study A report reveals that a staggering 70% of the world's bacteria have", "url": "https://www.revyuh.com/news/science-and-research/scientific-research/will-my-next-infection-kill-me-human-gut-signals-hope-for-a-future-free-of-antibiotic-resistance/", "urlToImage": "https://www.revyuh.com/wp-content/uploads/2023/05/Human-Gut-Signals-Antibiotic-resistance-free-Future.jpg", "publishedAt": "2023-05-06T07:17:31Z", "content": "A report reveals that a staggering 70% of the world’s bacteria have developed resistance to antibiotics, rendering the drugs largely ineffective. \r\nAntibiotics, which have been instrumental in extend… [+3170 chars]"}, {"source": {"id": null, "name": "Theindianpanorama.news"}, "author": "@theindpanorama", "title": "Saturn’s iconic rings are disappearing - The Indian Panorama", "description": "Science & Technology | Out there, nearly 1.5 billion kilometers away from Earth, is a ringed world that has mesmerised astronomers with its beauty. Saturn is known for not just", "url": "https://www.theindianpanorama.news/science-technology/saturns-iconic-rings-are-disappearing/", "urlToImage": "https://www.theindianpanorama.news/wp-content/uploads/2023/05/Saturn.jpg", "publishedAt": "2023-05-06T06:53:30Z", "content": "Out there, nearly 1.5 billion kilometers away from Earth, is a ringed world that has mesmerised astronomers with its beauty. Saturn is known for not just its humongous size, nine times wider than Ear… [+3543 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "AI takes over microbial experiments: accelerating research progress - Tech Explorist", "description": "Mapping Microbial Metabolism with BacterAI: No Prior Knowledge Required.", "url": "https://www.techexplorist.com/ai-takes-microbial-experiments-accelerating-research-progress/59967/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/ai-microbial-experiments-per-year.jpg", "publishedAt": "2023-05-06T06:41:37Z", "content": "Advancements in artificial intelligence (AI) can potentially revolutionize the field of microbial research. One notable breakthrough is the ability of AI to conduct a staggering number of microbial e… [+4960 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Tim Schauenberg", "title": "Dinosaurs Lived on a Scorching Planet, So Why Can't Humans? – The Wire Science - The Wire Science", "description": "Millions of years ago, the planet was much warmer than it is today. Yet it was teeming with life. So why does the climate crisis pose an existential threat to people?", "url": "https://science.thewire.in/environment/dinosaurs-scorching-planet-climate-crisis/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2023/05/05182558/dinosaurs-g5de825388_1920.jpg", "publishedAt": "2023-05-06T05:30:10Z", "content": "Representative image. Photo: Maryroselee/Pixabay\r\nBack in the times when 25-metre-long ocean dinosaurs swam the seas and the T-Rex and Triceratops roamed the ground we walk today, Earth was a hot pla… [+4588 chars]"}, {"source": {"id": null, "name": "Getbengal.com"}, "author": null, "title": "9-year-old Aarush from Kolkata honoured by NASA as India's youngest 'Citizen Scientist' - Get Bengal", "description": "Aarush Naskar loves the stars, the sun and is very interested in knowing about them", "url": "https://www.getbengal.com/details/aarush-9-year-old--from-kolkata-honoured-by-nasa-as-indias-youngest-citizen-scientist", "urlToImage": "https://www.getbengal.com/uploads/story_image/Aarush-Naskar-NASA.jpg", "publishedAt": "2023-05-06T05:13:07Z", "content": "Children nowadays have different distractions such as mobile phones, video games, and tons of other stuff. Technological advancement has its pros and cons which affect the students both negatively an… [+4674 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: China approves safety of first gene-edited crop; Lawmaker and head of NSF warn of delays to funding U.S. tech research - Devdiscourse", "description": "The soybean, developed by privately owned Shandong Shunfeng Biotechnology Co., Ltd, has two modified genes, significantly raising the level of healthy fat oleic acid in the plant.  Lawmaker and head of NSF warn of delays to funding U.S. tech research  Silicon…", "url": "https://www.devdiscourse.com/article/science-environment/2441938-science-news-roundup-china-approves-safety-of-first-gene-edited-crop-lawmaker-and-head-of-nsf-warn-of-delays-to-funding-us", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/06_05_2023_11_05_39_2207925.jfif?width=920&format=jpeg", "publishedAt": "2023-05-06T04:58:42Z", "content": "Following is a summary of current science news briefs.\r\nChina approves safety of first gene-edited crop\r\nChina has approved the safety of a gene-edited soybean, its first approval of the technology i… [+859 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Herbaceous planting for ecological restoration of urban brownfields based on mechanisms of the assembly of plant communities - EurekAlert", "description": "Brownfield restoration has become a frontier topic in the research on urban ecosystem governance. Optimizing brownfield ecosystems through proper bioremediation approaches can provide urban landscapes and habitats with sound ecological potentials. Currently, …", "url": "https://www.eurekalert.org/news-releases/988362", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/50f0efd5-dd7c-442a-ba31-53abc5fb8a55/Rendition/thumbnail/Content/Public", "publishedAt": "2023-05-06T02:00:23Z", "content": "Brownfield restoration has become a frontier topic in the research on urban ecosystem governance. Optimizing brownfield ecosystems through proper bioremediation approaches can provide urban landscape… [+5755 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Will Yellowstone’s geology produce rock music - EurekAlert", "description": "A scientist will attempt to turn seismic activity – recorded in real time at Yellowstone National Park – into music during an ambitious live performance at the 2023 Internet2 Community Exchange conference in Atlanta, Georgia, on Tuesday, 9 May.\nThe music will…", "url": "https://www.eurekalert.org/news-releases/988395", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/5b00c254-d339-4329-8dcb-edc57a26e30b/Rendition/thumbnail/Content/Public", "publishedAt": "2023-05-06T02:00:23Z", "content": "image: Dr Domenico Vicinanza, Anglia Ruskin Universityview more \r\nCredit: Dr Domenico Vicinanza\r\nA scientist will attempt to turn seismic activity – recorded in real time at Yellowstone National Park… [+3603 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "New replacement for the ISS. Airbus unveils its artificial gravity space station (video) - The Times Hub", "description": "Spread the love So far, the company has shown the project of only one space station module, but it is very interesting. 2030 The International Space Station will finish its work. Therefore, NASA is actively working with private contractors involved in the cre…", "url": "https://thetimeshub.in/new-replacement-for-the-iss-airbus-unveils-its-artificial-gravity-space-station-video/", "urlToImage": null, "publishedAt": "2023-05-05T17:08:45Z", "content": "So far, the company has shown the project of only one space station module, but it is very interesting. \r\n2030 The International Space Station will finish its work. Therefore, NASA is actively workin… [+723 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astro Alchemy: Neutron Star Mergers and the Birth of Heavy Elements - SciTechDaily", "description": "The merging of neutron stars, generating potent gamma-ray bursts (GRBs), is crucial for the creation of heavy elements in the universe. However, a 2021 discovery necessitates incorporating long burst GRBs, previously associated with black hole formation, into…", "url": "https://scitechdaily.com/astro-alchemy-neutron-star-mergers-and-the-birth-of-heavy-elements/", "urlToImage": "https://scitechdaily.com/images/Neutron-Stars-Collide-scaled.jpg", "publishedAt": "2023-05-03T14:04:20Z", "content": "ByNASAMay 3, 2023\r\nIn this illustration, two neutron stars begin to merge, blasting a jet of high-speed particles and producing a cloud of debris. Credit: Sonoma State Univ./A. Simonnet; NASA\r\nThe me… [+4449 chars]"}]}