{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "IISc Researchers Shed Light on Real-Time Mechanisms Behind Biological Process Such As Cell Division & Viral Infections - The Weather Channel", "description": "The researchers studied how the shape of the colloidal membranes changes as one increases the fraction of short rods in the solution. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/science/news/2022-09-13-researchers-unravel-mechanisms-behind-biological-processes", "urlToImage": "https://s.w-x.co/in-blood%20cells%20%281%29.jpg", "publishedAt": "2022-09-13T06:10:13Z", "content": "Researchers at the Indian Institute of Science (IISc) and their collaborators have unravelled the real-time mechanism involved in biological processes like cell division, cell mobility, transportatio… [+2299 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Curtin University: Study unearths ancient reef structure high and dry on the Nullarbor Plain - India Education Diary", "description": "Curtin researchers and international collaborators using advanced satellite imagery have discovered an ancient reef-like landform ‘hidden’ in plain view on the Nullarbor Plain, which has been preserved for millions of years since it first formed when", "url": "https://indiaeducationdiary.in/curtin-university-study-unearths-ancient-reef-structure-high-and-dry-on-the-nullarbor-plain/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png?fit=534%2C462&ssl=1", "publishedAt": "2022-09-13T06:08:58Z", "content": "Curtin researchers and international collaborators using advanced satellite imagery have discovered an ancient reef-like landform hidden in plain view on the Nullarbor Plain, which has been preserved… [+2294 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA NEOWISE Telescope makes shocking discovery! Scary 84-foot asteroid heading for Earth today - HT Tech", "description": "NASA has warned that a devastating 84 foot wide asteroid is heading dangerously towards Earth today. Will it be a planet killer? Here’s what NASA has to say.", "url": "https://tech.hindustantimes.com/tech/news/nasa-neowise-telescope-makes-shocking-discovery-scary-84-foot-asteroid-heading-for-earth-today-71663046053800.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/13/1600x900/43cb2d66-f88a-11ec-b6f2-35645806a8b6_1659186212429_1659186212429_1663046097691_1663046097691.jpg", "publishedAt": "2022-09-13T05:16:12Z", "content": "NASA, with the help of its NEOWISE Telescope, has discovered a huge asteroid heading dangerously towards Earth today. This particular asteroid has caused astronomers at the space agencies to worry as… [+1643 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "A Galaxy Swarm Was Discovered by Astronomers Orbiting A Hyperluminous Galaxy - NDTV", "description": "The observation offers crucial hints as to how extremely luminous galaxies develop and transform into intense quasars.", "url": "https://www.ndtv.com/science/a-galaxy-swarm-was-discovered-by-astronomers-orbiting-ahyperluminous-galaxy-3339557", "urlToImage": "https://c.ndtvimg.com/2022-09/aiv30gf_w04100913-is-located-in-an-area-that-is-at-least-ten-times-denser-than-the-typical-universe_625x300_13_September_22.jpg", "publishedAt": "2022-09-13T05:16:03Z", "content": "W0410-0913 is located in an area that is at least ten times denser than the typical universe.\r\nA swarm of galaxies orbiting the vicinity of a hyper-luminous and actively star-forming galaxy in the ea… [+1762 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble and Chandra data helps astronomers turn back the clock on stellar explosion - Devdiscourse", "description": "Read more about Hubble and Chandra data helps astronomers turn back the clock on stellar explosion on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2176514-hubble-and-chandra-data-helps-astronomers-turn-back-the-clock-on-stellar-explosion", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_09_2022_10_31_53_9500393.jpg?width=920&format=jpeg", "publishedAt": "2022-09-13T05:02:11Z", "content": "Astronomers using data from the Hubble Space Telescope and the Chandra X-ray Observatory have turned back the clock on the debris of a star that exploded several hundred years ago in Earth's timefram… [+1684 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "NASA delays Artemis 1 Moon rocket launch to September 27 - CNBCTV18", "description": "The moon mission that will be launched from Complex 39B at NASA's Kennedy Space Centre in Florida, has already failed to launch two times earlier.", "url": "https://www.cnbctv18.com/science/nasa-delays-artemis-1-moon-rocket-launch-to-september-27-14709731.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/09/NASA-Artemis-1019x573.jpg", "publishedAt": "2022-09-13T03:35:00Z", "content": "The moon mission that will be launched from Complex 39B at NASA's Kennedy Space Centre in Florida, has already failed to launch two times earlier."}, {"source": {"id": null, "name": "Forbque.com"}, "author": "Forbque", "title": "Asteroid: Asteroid twice as big as Taj Mahal is coming towards Earth! If it collides with the earth, there may be damage - Forbque", "description": "Big Alert for Earth: If you believe in things related to space, then there is important news for you. A huge asteroid twice the size of the Taj Mahal is coming towards Earth. Scientists have warned that today this asteroid may collide with the Earth. It is no…", "url": "https://forbque.com/asteroid-asteroid-twice-as-big-as-taj-mahal-is-coming-towards-earth-if-it-collides-with-the-earth-there-may-be-damage/", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/09/13/257ef44d3a07810da7998ca1b7e184e21663022537252550_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-09-13T02:29:29Z", "content": "Big Alert for Earth: If you believe in things related to space, then there is important news for you. A huge asteroid twice the size of the Taj Mahal is coming towards Earth. Scientists have warned t… [+1220 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "AFP", "title": "Webb telescope captures 'breathtaking' images of Orion Nebula - Deccan Herald", "description": "The wall of dense gas and dust resembles a massive winged creature, its glowing maw lit by a bright star as it soars through cosmic filaments. An international research team on Monday revealed the first images of the Orion Nebula captured with the James Webb …", "url": "https://www.deccanherald.com/science-and-environment/webb-telescope-captures-breathtaking-images-of-orion-nebula-1144592.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/09/13/orion-afp-1144592-1663034861.jpg", "publishedAt": "2022-09-13T02:07:41Z", "content": "The wall of dense gas and dust resembles a massive winged creature, its glowing maw lit by a bright star as it soars through cosmic filaments.\r\nAn international research team on Monday revealed the f… [+2274 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "(Updated) NASA's Moon-bound spacecraft enters safe mode; team working towards solution - Devdiscourse", "description": "Read more about (Updated) NASA's Moon-bound spacecraft enters safe mode; team working towards solution  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2175142-updated-nasas-moon-bound-spacecraft-enters-safe-mode-team-working-towards-solution", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/11_05_2022_13_36_35_8662285.jpg?width=920&format=jpeg", "publishedAt": "2022-09-13T02:02:02Z", "content": "NASA said on Saturday that its Moon's bound spacecraft, Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE), has entered safe mode and the mission operat… [+2154 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "Chance of meteor hitting Earth increased, says NASA - The Goa Spotlight", "description": "The National Aeronautics and Space Administration (NASA) recently reassessed the real chances of ast", "url": "https://thegoaspotlight.com/2022/09/13/chance-of-meteor-hitting-earth-increased-says-nasa/", "urlToImage": "https://cdn.dol.com.br/img/Artigo-Destaque/770000/4_00770835_0_.jpg?xid=1918584", "publishedAt": "2022-09-13T01:14:28Z", "content": "The National Aeronautics and Space Administration (NASA) recently reassessed the real chances of asteroid Bennu impacting planet Earth. According to the United States space agency, the probability of… [+1280 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Volcanoes were the key driver of Earth's mass extinctions - Earth.com", "description": "Volcanoes were the key driver of Earth's mass extinctions • Earth.com", "url": "https://www.earth.com/news/volcanoes-were-the-key-driver-of-earths-mass-extinctions/", "urlToImage": "https://cff2.earth.com/uploads/2022/09/12144730/Mega-volcanoes-scaled.jpg", "publishedAt": "2022-09-12T22:11:47Z", "content": "A new study led by Dartmouth College may finally settle a long-standing debate over what caused five major mass extinctions, including the event that ultimately wiped out the dinosaurs. While some sc… [+3365 chars]"}, {"source": {"id": null, "name": "Stardate.org"}, "author": null, "title": "More Mars | StarDate Online - Stardate.org", "description": "It’s time to get serious about Mars. The Sun’s fourth planet is moving into a spectacular phase, getting brighter and rising earlier by the night. It’ll shine at its absolute best in early December.But you don’t have to wait that long to appreciate it. Right …", "url": "https://stardate.org/radio/program/2022-09-12", "urlToImage": null, "publishedAt": "2022-09-12T22:06:52Z", "content": "Its time to get serious about Mars. The Suns fourth planet is moving into a spectacular phase, getting brighter and rising earlier by the night. Itll shine at its absolute best in early December.\r\nBu… [+1261 chars]"}, {"source": {"id": null, "name": "Thebothsidenews.com"}, "author": "Dhritashree Deka", "title": "NASA set for the launch of Artemis 1 for second time - thebothsidenews - The Bothside News", "description": "On Saturday, ground crews at Kennedy Space Center prepared for a second attempt to launch NASA's massive, next-generation moon rocket on its first voyage, in the hopes that the engineering issues that", "url": "https://thebothsidenews.com/nasa-artemis-1/world/all/09/04/2022/", "urlToImage": "https://thebothsidenews.com/wp-content/uploads/2022/09/SLSonpadAug17-scaled.jpg", "publishedAt": "2022-09-12T20:48:46Z", "content": "On Saturday, ground crews at Kennedy Space Center prepared for a second attempt to launch NASA’s massive, next-generation moon rocket on its first voyage, in the hopes that the engineering issues tha… [+1909 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Earth Information Center | Science Mission Directorate - Science@NASA", "description": "For more than 50 years, NASA satellites have provided open-source and publicly available data on Earth’s land, water, temperature, weather, and climate. To improve access to this key information, NASA Administrator Bill Nelson announced a concept for the Eart…", "url": "https://science.nasa.gov/earth-science/earth-information-center", "urlToImage": null, "publishedAt": "2022-09-12T20:32:39Z", "content": "For more than 50 years, NASA satellites have provided open-source and publicly available data on Earths land, water, temperature, weather, and climate. \r\nTo improve access to this key information, NA… [+1018 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Hubble Space Telescope spots spiraling stars in Small Magellanic Cloud - News9 LIVE", "description": "The Small Magellanic Cloud is a satellite galaxy of the Milky Way", "url": "https://www.news9live.com/science/hubble-space-telescope-spots-spiraling-stars-in-small-magellanic-cloud-195470", "urlToImage": "https://media.news9live.com/h-upload/2022/09/12/556268-hubblengc346spiralstsci-01gc9vd3ybjan5ctrttp74wz2dcropped.jpg", "publishedAt": "2022-09-12T20:27:05Z", "content": "The Small Magellanic Cloud is one of the many satellite galaxies of the Milky Way, with a chemically simpler composition, similar to one of the young galaxies in the early universe. The Hubble Space … [+1872 chars]"}, {"source": {"id": null, "name": "Igettalk.com"}, "author": "Soyiga Samuel Adeshina", "title": "How Long Is The Drive To The Universe's Edge? - I Get Talk", "description": "About 270,000,000,000,000,000,000,000 miles separate us from the edge of the observable universe. It will take 480,000,000,000,000,000 — or 4.8 1017 — years, or 35 million times the age of the universe, to get there if you travel at a constant 65 miles per ho…", "url": "https://igettalk.com/2022/09/how-long-is-the-drive-to-the-universes-edge.html", "urlToImage": "https://i0.wp.com/igettalk.com/wp-content/uploads/2022/09/universe-edge.jpg", "publishedAt": "2022-09-12T20:09:49Z", "content": "About 270,000,000,000,000,000,000,000 miles separate us from the edge of the observable universe.\r\nIt will take 480,000,000,000,000,000 or 4.8 1017 years, or 35 million times the age of the universe,… [+3013 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Tweak in Jupiter`s orbit may help life on Earth: Study - WION", "description": "It is quite logical to imagine that if Jupiters orbit is tweaked in any manner, the planet with massive gravity will have an effect on orbits of other planets in the Solar System. Read on to know how it will affect life on Earth", "url": "https://www.wionews.com/science/tweak-in-jupiters-orbit-may-help-life-on-earth-study-515584", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/08/23/208011-jupiter.jpg", "publishedAt": "2022-09-12T19:15:55Z", "content": "Jupiter is not just one massive blob of gas in the Solar System. It's much more than that. Jupiter absorbs many space-rocks travelling towards the inner Solar System, the Earth's neighbourhood. This … [+1574 chars]"}, {"source": {"id": null, "name": "Sparkchronicles.com"}, "author": null, "title": "“I photographed the black hole, science brings peace” – Il Golfo 24 - Spark Chronicles", "description": "“Science has a great responsibility and we have seen it above all in the years of the pandemic: it m", "url": "https://sparkchronicles.com/i-photographed-the-black-hole-science-brings-peace-il-golfo-24/", "urlToImage": "https://www.ilgolfo24.it/wp-content/uploads/2022/05/1.jpg", "publishedAt": "2022-09-12T18:41:45Z", "content": "Science has a great responsibility and we have seen it above all in the years of the pandemic: it must know how to disseminate without trivializing. And it does not admit that one suddenly becomes an… [+2401 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Study Considers if Near-Field Transducers Can Control Nanoscale Charge Conduction - AZoNano", "description": "An article published in the journal Advanced Optical Materials theoretically demonstrated the possibility of modulating the light, heat, and current by utilizing the NFT when incident on layers of black phosphorous (BP).", "url": "https://www.azonano.com/news.aspx?newsID=39667", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39667_1663007910324971.jpg", "publishedAt": "2022-09-12T18:40:00Z", "content": "Near-field plasmonics served as a support system to explore single-molecule spectroscopy, quantum information processing, and cavity quantum electrodynamics whose study critically requires control ov… [+6254 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Rameesha Sajwar", "title": "This Mesmerizing New James Webb Image Shows Ghostly Ripple Rings Around A Distant Star - Wonderful Engineering", "description": "Advertisement The James Webb Space Telescope has captured images of concentric “ripple” rings around a distant star. This has made astronomers agitated regarding the new data, a report from LiveScience reveals. The astonishing image was captured in July, shor…", "url": "https://wonderfulengineering.com/this-mesmerizing-new-james-webb-image-shows-ghostly-ripple-rings-around-a-distant-star/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/09/imgonline-com-ua-resize-425UrwHRAEHO7V5s.jpg", "publishedAt": "2022-09-12T18:32:57Z", "content": "The James Webb Space Telescope has captured images of concentric “ripple” rings around a distant star. This has made astronomers agitated regarding the new data, a report from LiveScience reveals.\r\nT… [+1534 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "James Urton-U. Washington", "title": "Female hummingbirds evolved a trick to keep males at bay - Futurity: Research News", "description": "Some female hummingbirds have evolved to look like males. A new study shows it's a way to keep passionate males at bay and spend more time at feeders.", "url": "https://www.futurity.org/female-hummingbirds-2797352/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/09/hummingbirds-1600.jpg", "publishedAt": "2022-09-12T18:12:08Z", "content": "Some female white-necked jacobin hummingbirds have male-like plumage and mimic male appearancebut not male behavior, researchers report.\r\nIn addition, their strength and body size are similar not to … [+5048 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "Solar Orbiter was hit by a Coronal Mass Ejection as it was About to Make a Flyby of Venus - Universe Today", "description": "Massive solar storms on the Sun are becoming more common as it moves into a period of increasing solar activity as part of Solar Cycle 25, which is expected to peak in 2025. There’s one spacecraft that will be very well placed to capture that increasing activ…", "url": "https://www.universetoday.com/157574/solar-orbiter-was-hit-by-a-coronal-mass-ejection-as-it-was-about-to-make-a-flyby-of-venus/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/09/7590.jpg", "publishedAt": "2022-09-12T17:48:17Z", "content": "Massive solar storms on the Sun are becoming more common as it moves into a period of increasing solar activity as part of Solar Cycle 25, which is expected to peak in 2025. There’s one spacecraft th… [+2717 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Through the quantum looking glass: A thin device triggers one of quantum mechanics' strangest and most useful phenomena - Science Daily", "description": "An ultrathin invention could make future computing, sensing and encryption technologies remarkably smaller and more powerful by helping scientists control a strange but useful phenomenon of quantum mechanics, according to new research.", "url": "https://www.sciencedaily.com/releases/2022/09/220912132323.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-12T17:36:18Z", "content": "An ultrathin invention could make future computing, sensing and encryption technologies remarkably smaller and more powerful by helping scientists control a strange but useful phenomenon of quantum m… [+6393 chars]"}, {"source": {"id": null, "name": "Vigourtimes.com"}, "author": "Daniel Gyllhem", "title": "Just Like That, We're Making Oxygen on Mars - Vigour Times", "description": "Millions of miles away on Mars, in a barren crater just north of the equator, a rover is wandering around, carrying a gold-coated gadget the size of a toaster. The machine inhales the Martian air and strips away contaminants. It splits the atmospheri", "url": "https://vigourtimes.com/just-like-that-were-making-oxygen-on-mars/", "urlToImage": "https://cdn.theatlantic.com/thumbor/5jOXr_q6rx14eQgY8lTgNyVL7pg=/0x43:2000x1085/1200x625/media/img/mt/2022/09/MarsMoxie/original.jpg", "publishedAt": "2022-09-12T17:15:07Z", "content": "Millions of miles away on Mars, in a barren crater just north of the equator, a rover is wandering around, carrying a gold-coated gadget the size of a toaster. The machine inhales the Martian air and… [+6615 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "NASA Only 2 Weeks Away From World’s First ‘Interplanetary Defense’ Test; DART Mission To Strike Asteroid Dimorphos - EurAsian Times", "description": "The US Double Asteroid Redirection Test (DART), the world’s first mission to test technology for defending Earth against potential asteroid or comet hazards, will impact its target asteroid Dimorphos on  September 26, NASA and Johns Hopkins Applied Physics La…", "url": "https://eurasiantimes.com/nasa-2-weeks-away-from-worlds-first-interplanetary-defense-test-dart/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/07/nasa-space.jpg", "publishedAt": "2022-09-12T16:56:31Z", "content": "The US Double Asteroid Redirection Test (DART), the worlds first mission to test technology for defending Earth against potential asteroid or comet hazards, will impact its target asteroid Dimorphos … [+7440 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Lake ice melting 8 days earlier on average, study finds - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-09-12T16:41:45Z", "content": ""}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "NOIRLab released a stunning image of the Lobster Nebula - Tech Explorist", "description": "Dark Energy Camera Captures Bright, Young Stars Blazing Inside Glowing Nebula", "url": "https://www.techexplorist.com/noirlab-released-stunning-image-lobster-nebula/53712/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/09/Inside-Glowing-Nebula.jpg", "publishedAt": "2022-09-12T16:18:24Z", "content": "The 570-megapixel US Department of Energy-fabricated Dark Energy Camera at NOIRLabs Cerro Tololo Inter-American Observatory in Chile is one of the most powerful tools in astronomy and astrophysics. T… [+4277 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "New Method to Transform CO2 From Exhaust Into Ethylene - AZoCleantech", "description": "Meenesh Singh and his team at the University of Illinois Chicago have found a means to transform the carbon dioxide extracted from industrial exhaust into ethylene, a crucial component of plastic manufacturing.", "url": "https://www.azocleantech.com/news.aspx?newsID=32229", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/SocialSharingImage_32229_16629802034647750.jpg", "publishedAt": "2022-09-12T15:37:00Z", "content": "Sep 12 2022Reviewed by Mila Perera\r\nMeenesh Singh and his team at the University of Illinois Chicago have found a means to transform the carbon dioxide extracted from industrial exhaust into ethylene… [+3564 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists have made first 3D model of planet orbitting binary star system - WION", "description": "A binary system involves two stars who orbit each other. Binary system can also have planets revolving around one or both the stars", "url": "https://www.wionews.com/science/scientists-have-made-first-3d-model-of-planet-orbitting-binary-star-system-515524", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/08/06/153383-eercbkmwsaaxtho.jpg", "publishedAt": "2022-09-12T15:36:09Z", "content": "Our search for exoplanets continues. With the help of latest technology, we have been building powerful telescopes that can not only scan the skies for what's visible, but also those that can pinpoin… [+1608 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lela Nargi", "title": "Newly discovered dinosaur shows pattern of huge animals with tiny arms - The Washington Post", "description": "", "url": "https://www.washingtonpost.com/kidspost/2022/09/12/meraxes-gigas-tiny-arms/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UAUAOIBPUEI63CONFPSH7PZWZY.jpg&w=1440", "publishedAt": "2022-09-12T14:39:36Z", "content": "Close your eyes and imagine a Tyrannosaurus rex. Can you see its huge head, sharp teeth and puny arms?\r\nThe late-Cretaceous-Period predator of the Northern Hemisphere wasnt the only dinosaur that had… [+3050 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Killed, grilled, buried! Scary Asteroid impact turns living things on Earth into charcoal - HT Tech", "description": "Can an asteroid turn living organisms into charcoal? This new study has something interesting to say about asteroid impact on Earth. Read here.", "url": "https://tech.hindustantimes.com/tech/news/killed-grilled-buried-scary-asteroid-impact-turns-living-things-on-earth-into-charcoal-71662992558555.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/12/1600x900/armageddon-g04afd197e_640_1662957770525_1662992689985_1662992689985.jpg", "publishedAt": "2022-09-12T14:24:56Z", "content": "We have heard countless stories in regard to how asteroids can be catastrophic. The end of the dinosaur era was due to an asteroid strike and same can happen to humans. Now, the latest study has reve… [+2161 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Stunning image of Sun captured by Inouye Solar Telescope, world's most powerful - HT Tech", "description": "The Inouye Solar Telescope has captured a mesmerizing image of the Sun’s atmosphere to mark the first anniversary of the solar telescope’s operation.", "url": "https://tech.hindustantimes.com/tech/news/stunning-image-of-sun-captured-by-inouye-solar-telescope-world-s-most-powerful-71662992315203.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/12/1600x900/1_1662992382816_1662992391717_1662992391717.jpg", "publishedAt": "2022-09-12T14:21:36Z", "content": "Earth has faced numerous solar flares these past few months and more are expected as the Sun moves ahead in its 11-year solar cycle, resulting in increased solar activity and solar output. As many as… [+1688 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Antarctica's \"Doomsday Glacier\" On Edge Of Disaster, Says Study. Here's What Will Happen If It Disintegrates - NDTV", "description": "The scary new study has alerted us about the rapid disintegration of one of the biggest glaciers in the world.", "url": "https://www.ndtv.com/world-news/antarcticas-doomsday-glacier-on-edge-of-disaster-says-study-heres-what-will-happen-if-it-disintegrates-3338186", "urlToImage": "https://i.ndtvimg.com/i/2018-04/reuters-antarctica_650x400_71525093417.jpg", "publishedAt": "2022-09-12T13:54:16Z", "content": "The Thwaites glacier in Antarctica is among the biggest glaciers in the world.\r\nA glacier in Antarctica is melting at a faster rate than previously expected, scientists announced this month. In a new… [+1786 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Astronomers captured the most detailed images of the radiation region in Orionʻs’ sword’ - Tech Explorist", "description": "Massive stars’ blasts hitting Orion's “sword” mapped in unprecedented detail using the Hawaiʻi telescope.", "url": "https://www.techexplorist.com/detailed-images-radiation-region-orionʻs-sword/53709/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/09/Orion-Bar.jpg", "publishedAt": "2022-09-12T13:41:45Z", "content": "Using W. M. Keck Observatory on Hawaii Island, astronomers have captured the most detailed and complete images of the zone where the famed constellation of Orion gets zapped with ultraviolet (UV) rad… [+2887 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Watch: Scientists reconstruct first picture of a black hole, know what was visible #shorts - DNAIndiaNews", "description": "😱Watch: Scientists reconstruct first picture of a black hole, know what was visible #shorts #trending  #space", "url": "https://www.youtube.com/watch?v=iTq0rtq0Rvo", "urlToImage": "https://i.ytimg.com/vi/iTq0rtq0Rvo/maxresdefault.jpg", "publishedAt": "2022-09-12T13:20:05Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul M. Sutter", "title": "It's Thought to Rain Diamonds on Uranus and Neptune, and now Scientists Duplicated it in the lab - Universe Today", "description": "The ice giant planets of Neptune and Uranus might have just the right conditions to rain diamonds. Unfortunately we can’t go and check ourselves, so we have to rely on laboratory recreations of their atmospheres to find out. And so that’s exactly what a team …", "url": "https://www.universetoday.com/157527/its-thought-to-rain-diamonds-on-uranus-and-neptune-and-now-scientists-duplicated-it-in-the-lab/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2017/08/diamond_rain_kraus_final-e1503458862750.jpg", "publishedAt": "2022-09-12T13:10:09Z", "content": "The ice giant planets of Neptune and Uranus might have just the right conditions to rain diamonds. Unfortunately we can’t go and check ourselves, so we have to rely on laboratory recreations of their… [+3327 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA-NASA's solar orbiter solves decades-old mystery around the sun's magnetic field - Republic World", "description": "ESA-NASA's solar orbiter has offered new clues about the origin of magnetic switchbacks and the role they play in accelerating the solar winds.", "url": "https://www.republicworld.com/science/space/esa-nasas-solar-orbiter-solves-decades-old-mystery-around-the-suns-magnetic-field-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/tddxmowxhrybnobs_1662982820.jpeg", "publishedAt": "2022-09-12T12:56:00Z", "content": "The ESA-NASA-made Solar Orbiter has solved a major mystery that was bugging astronomers for the last few decades. According to the European Space Agency (ESA), the orbiter, through the first-ever rem… [+2624 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "China : Third country in the world to discover new mineral on moon | oneindia news * space - Oneindia News", "description": "China has become only the third country to discover a new mineral on the moon after its scientists said on Friday that they had found one.  #newmineraldiscov...", "url": "https://www.youtube.com/watch?v=rVQI2IIeKsM", "urlToImage": "https://i.ytimg.com/vi/rVQI2IIeKsM/maxresdefault.jpg", "publishedAt": "2022-09-12T12:46:59Z", "content": null}, {"source": {"id": null, "name": "hortidaily.com"}, "author": null, "title": "Space agriculture and eye checks promoting healthy crews - hortidaily.com", "description": "Space botany and eye checks were at the top of the research schedule aboard the International Space Station on Wednesday. Life support system upgrades also continued during the middle of the…", "url": "https://www.hortidaily.com/article/9457678/space-agriculture-and-eye-checks-promoting-healthy-crews/", "urlToImage": "https://www.hortidaily.com/remote/https/agfstorage.blob.core.windows.net/misc/HD_com/2022/09/08/nasa.jpg?preset=OgImage", "publishedAt": "2022-09-12T12:44:04Z", "content": "Space botany and eye checks were at the top of the research schedule aboard the International Space Station on Wednesday. Life support system upgrades also continued during the middle of the week for… [+2422 chars]"}, {"source": {"id": null, "name": "Gizbot"}, "author": "Vishal Kawadkar", "title": "Astronomers Hunt “Super-Earth” Planets Nearby; Can They Harness Life? - Gizbot", "description": "Researchers have observed two planets that might be similar to our Earth but bigger. And, one might even be capable of sustaining life. According to a press release, a team of international astronomers announced that they have discovered two “Super-Earth” pla…", "url": "https://www.gizbot.com/internet/features/astronomers-hunt-super-earth-planets-nearby-can-they-harness-life-082563.html", "urlToImage": "https://www.gizbot.com/img/2022/09/elon-musk-jpg2-1662985031.jpg", "publishedAt": "2022-09-12T12:22:06Z", "content": "Researchers have observed two planets that might be similar to our Earth but bigger. And, one might even be capable of sustaining life. According to a press release, a team of international astronome… [+2315 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "SpaceX breaks a reusability record as it readies to launch its fully reusable Starship to orbit - Interesting Engineering", "description": "SpaceX fired up the engines of its Starship prototype as part of a static fire test that brings it closer to launching the fully reusable spacecraft to orbit.", "url": "https://interestingengineering.com/innovation/spacex-breaks-reusability-record-starship", "urlToImage": "https://inteng-storage.s3.amazonaws.com/2022/09/12/image/jpeg/6m0DquG9xbDt9YfCZrUnHljBacUWapzNy8F2aCjK.jpg", "publishedAt": "2022-09-12T12:17:09Z", "content": "SpaceX breaks Falcon 9 reusability record ahead of Starship launch\r\nSpaceX is developing Starship to drastically reduce the cost of spaceflight by utilizing a fully reusable launch system. The compan… [+1497 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Nasa's Juno probe to touch Europa, the moon with more water than Earth - India Today", "description": "Juno probe will conduct its closest flyby to Europa, Jupiter's Moon, and beam back fresh images and data as astronomers look for signs of life.", "url": "https://www.indiatoday.in/science/story/nasa-s-juno-probe-to-touch-europa-the-moon-with-more-water-than-earth-1999408-2022-09-12", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/Europa_a-647x363.jpeg?SoF7kN_r0cap7HSIXuQP9wB2fX5BnhFI", "publishedAt": "2022-09-12T12:08:10Z", "content": "Is there a world out there beyond Earth that could have supported life in the past or have conditions in the future? There are 5,000 potential candidates but the closest one is over 700 million kilom… [+2406 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Hubble Space Telescope: European Space Agency shares image of sparkling globular cluster Terzan 4 - DNA India", "description": "The study of globular clusters was greatly advanced by the 1990 deployment of the Hubble Space Telescope.", "url": "https://www.dnaindia.com/science/report-hubble-space-telescope-european-space-agency-shares-image-of-sparkling-globular-cluster-terzan-4-2984659", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/09/12/2538117-hubble-space-telescope-european-space-agency-shares-image-of-sparkling-globular-cluster-terzan-4.jpg", "publishedAt": "2022-09-12T11:58:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Sep 12, 2022, 05:43 PM ISTThis view of the globular cluster Terzan 4 was captured by the NASA/ESA Hubble Space Telescope and feat… [+1963 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Vinothini S", "title": "Is Mark Mester Gay? Age, Height, Net Worth - News - News", "description": "Is Mark Mester Gay? Fans of Mark Mester can check this article to know whether Mark Mester is Gay or not. Mark Mester is a American Journalist. Here we have provided Mark Mester's Age, Height, and Mark Mester Girlfriend's name, so read the article and know al…", "url": "https://latestnews.fresherslive.com/articles/is-mark-mester-gay-girlfriend-salary-age-height-1060752", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/09/12/is-mark-mester-gay-girlfriend-salary-age-height-631f17c9dd1a2-1662982089.jpg", "publishedAt": "2022-09-12T11:39:00Z", "content": "Is Mark Mester Gay?\r\nWant to know if Mark Mester is Gay or not? Then head into this article. As per biographygist, Mark Mester isn't gay. \r\nMark Mester Age\r\nThe American Journalist was born on 27 Dec… [+779 chars]"}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Agence France-Presse - AFP", "title": "Going back to Moon is must before Mars, NASA argues | Daily Sabah - Daily Sabah", "description": "Former American President John F. Kennedy announced in 1962 that the United States planned to put a man on the moon&#039;s surface by the end of the...", "url": "https://www.dailysabah.com/life/science/going-back-to-moon-is-must-before-mars-nasa-argues", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2022/09/12/thumbs/800x531/230369.jpg", "publishedAt": "2022-09-12T11:01:13Z", "content": "Former American President John F. Kennedy announced in 1962 that the United States planned to put a man on the moon's surface by the end of the decade.\r\nIt was the height of the Cold War and America … [+4004 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Vinothini S", "title": "Is Parth Samthaan Gay? Age, Height, Net Worth - News - News", "description": "Is Parth Samthaan Gay? Fans of Parth Samthaan can check this article to know whether Parth Samthaan is Gay or not. Parth Samthaan is a Actor, ‎Model. Here we have provided Parth Samthaan's Age, Height, and Parth Samthaan Girlfriend's name, so read the article…", "url": "https://latestnews.fresherslive.com/articles/is-parth-samthaan-gay-girlfriend-salary-age-height-1060717", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/09/12/is-parth-samthaan-gay-girlfriend-salary-age-height-631f0cca3ae43-1662979274.jpg", "publishedAt": "2022-09-12T10:51:56Z", "content": "Is Parth Samthaan Gay?\r\nWant to know if Parth Samthaan is Gay or not? Then head into this article. As per healthyceleb, Parth Samthaan isn't gay. \r\nParth Samthaan Age\r\nThe Actor, ‎Model, was born on … [+865 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "'We can find life outside the solar system in 25 years', researcher says - Space.com", "description": "New instruments are currently being developed that will supercharge our search for life across the Milky Way galaxy.", "url": "https://www.space.com/finding-life-outside-solar-system-in-25-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/G3ah7Ri9TToS79ttyUNuB4-1200-80.jpg", "publishedAt": "2022-09-12T10:08:28Z", "content": "We haven't found life on Mars yet, but one researcher believes we might be able to detect evidence of it on planets outside of the solar system within the next quarter of a century. \r\nSasha Quanz, an… [+5572 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Cornell University: NASA releases first Webb Telescope image of exoplanet - India Education Diary", "description": "For the first time, astronomers have used NASA’s James Webb Space Telescope (JWST) to take a direct image of a planet outside our solar system. The exoplanet is a gas giant, meaning it has no rocky surface and could not be habitable.NASA released the", "url": "https://indiaeducationdiary.in/cornell-university-nasa-releases-first-webb-telescope-image-of-exoplanet/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Cornell-University.png?fit=395%2C128&ssl=1", "publishedAt": "2022-09-12T07:44:48Z", "content": "For the first time, astronomers have used NASAs James Webb Space Telescope (JWST) to take a direct image of a planet outside our solar system. The exoplanet is a gas giant, meaning it has no rocky su… [+3333 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Cornell University: UVEX NASA mission advances with Cornell astronomers on team - India Education Diary", "description": "Cornell astronomers Anna Y. Q. Ho, assistant professor of astronomy in the College of Arts and Sciences, and Shrinivas R. Kulkarni, visiting professor of astronomy, are part of the mission team for the UltraViolet Explorer (UVEX) mission, which has a", "url": "https://indiaeducationdiary.in/cornell-university-uvex-nasa-mission-advances-with-cornell-astronomers-on-team/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Cornell-University.png?fit=395%2C128&ssl=1", "publishedAt": "2022-09-12T07:12:02Z", "content": "Cornell astronomers Anna Y. Q. Ho, assistant professor of astronomy in the College of Arts and Sciences, and Shrinivas R. Kulkarni, visiting professor of astronomy, are part of the mission team for t… [+929 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Scientists Uncover Evidence That the Late Cretaceous Hosted Icy Conditions in Antarctica - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. Let's pretend it's the Late Cretaceous, roughly 66 to 100 million years ago. We've got dinosaurs roaming the land and odd-looking early species of birds, although the shark as we know it is already swimm…", "url": "https://www.latestly.com/agency-news/science-news-scientists-uncover-evidence-that-the-late-cretaceous-hosted-icy-conditions-in-antarctica-4193813.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/news-default-img-784x441.jpg", "publishedAt": "2022-09-12T06:38:25Z", "content": "Washington [US], September 12 (ANI): Let's pretend it's the Late Cretaceous, roughly 66 to 100 million years ago. We've got dinosaurs roaming the land and odd-looking early species of birds, although… [+4871 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Giant Virus Found In Arctic Lake - Nation World News", "description": "Reading Time: 2 Minutes", "url": "https://nationworldnews.com/giant-virus-found-in-arctic-lake/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/09/Giant-virus-found-in-arctic-lake.jpg", "publishedAt": "2022-09-12T03:52:57Z", "content": "Reading Time: 2 Minutes\r\nGoing deeper into the depths of the Arctic, scientists have made a gruesome discovery. Like, for example, coming face to face with a giant virus that infects algae in an extr… [+1378 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "PTI", "title": "World News | Dream-walking Towards the Planetoid Bomb - LatestLY", "description": "Get latest articles and stories on World at LatestLY.   The DART mission to redirect an asteroid is billed as potentially planet-saving. But in the wrong hands it has seriously destructive potential.", "url": "https://www.latestly.com/agency-news/world-news-dream-walking-towards-the-planetoid-bomb-4193238.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News-784x441.jpg", "publishedAt": "2022-09-12T03:30:10Z", "content": "Baltimore(US), Sep 12 (360info) The DART mission to redirect an asteroid is billed as potentially planet-saving. But in the wrong hands it has seriously destructive potential.\r\n In September 2022 an … [+6296 chars]"}, {"source": {"id": null, "name": "Egypt Independent"}, "author": "CNN", "title": "The harvest moon will glow an eerie orange color as it rises in the sky. Here’s how to watch - Egypt Independent", "description": "CNN  —  If you need a sign other than pumpkin spice lattes that fall is in the air, look no further than the harvest moon. Stargazers can view the moon beginning around sunset on Friday, and it will p", "url": "https://www.egyptindependent.com/the-harvest-moon-will-glow-an-eerie-orange-color-as-it-rises-in-the-sky-heres-how-to-watch/", "urlToImage": "https://amayei.nyc3.digitaloceanspaces.com/2022/09/220909082357-harvest-moon-restricted.jpg", "publishedAt": "2022-09-11T21:33:45Z", "content": "CNN    If you need a sign other than pumpkin spice lattes that fall is in the air, look no further than the harvest moon.\r\nStargazers can view the moon beginning around sunset on Friday, and it will … [+3456 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Protein Differences Across Species Drive Biological Diversity - Technology Networks", "description": "Yale researchers have compared the proteomes of skin cells from 11 mammals, which, they say, will help scientists understand the molecular drivers of biodiversity and how these factors have evolved over time.", "url": "https://www.technologynetworks.com/proteomics/news/how-protein-differences-across-species-drive-biological-diversity-365540", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/365540/how-protein-differences-across-species-drive-biological-diversity-365540-640x360.jpg?cb=20220911", "publishedAt": "2022-09-11T16:58:28Z", "content": "To better understand what drives biological diversity on Earth, scientists have historically looked at genetic differences between species. But this only provides part of the picture. The traits of a… [+6382 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Astronomers Discover Oldest Planetary Nebula Inside 500 Million-Year-Old Galactic Cluster - ABP Live", "description": "Astronomers have discovered the oldest planetary nebula in a 500 million-year-old open galactic cluster. The nebula is a 'rare beauty with a hot blue heart'. It has a kinematic age of 70,000 years.", "url": "https://news.abplive.com/science/astronomers-discover-oldest-planetary-nebula-inside-500-million-year-old-galactic-cluster-1552824", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/09/11/799acb6a4c73259d3eff94452a869d981662901067087324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-09-11T15:51:08Z", "content": "An international team of astronomers led by researchers from The University of Hong Kong have discovered a rare celestial jewel inside a 500-million-year-old Galactic Open Cluster. The celestial jewe… [+5987 chars]"}, {"source": {"id": null, "name": "Samacharcentral.com"}, "author": "Shweta Varshney", "title": "Researchers find source of gamma rays in small neighboring galaxy - Samachar Central", "description": "Figure 1. A small satellite galaxy (green globe on the bottom left) of the Milky Way – called Sagittarius – has been observed from Earth through giant lobes of gamma radiation (aka the", "url": "https://samacharcentral.com/researchers-find-source-of-gamma-rays-in-small-neighboring-galaxy/", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/2-of-2-researchers-use.jpg", "publishedAt": "2022-09-11T13:53:27Z", "content": "Figure 1. A small satellite galaxy (green globe on the bottom left) of the Milky Way called Sagittarius has been observed from Earth through giant lobes of gamma radiation (aka the Fermi bubbles, pur… [+4170 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "A new quantum era is coming – 09/11/2022 – Álvaro Machado Dias - The Goa Spotlight", "description": "There is a consensus that our brain is the most beautiful and mysterious thing in the universe. It's", "url": "https://thegoaspotlight.com/2022/09/11/a-new-quantum-era-is-coming-09-11-2022-alvaro-machado-dias/", "urlToImage": "https://f.i.uol.com.br/fotografia/2019/05/25/15588131495ce999ddd4c56_1558813149_3x2_md.jpg", "publishedAt": "2022-09-11T13:20:20Z", "content": "There is a consensus that our brain is the most beautiful and mysterious thing in the universe.\r\nIt’s the ball of the day. We enthusiastically highlight the false promises of the internet of thought … [+10955 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "SpaceX lands Falcon 9 at sea after delivering the heaviest communication satellite; WATCH - Republic World", "description": "SpaceX launched its Falcon 9 rocket from NASA's Kennedy Space Center at 6:50 am IST in what was 14th flight for this booster, the most by any SpaceX rocket.", "url": "https://www.republicworld.com/science/space/spacex-lands-falcon-9-at-sea-after-delivering-the-heaviest-communication-satellite-watch-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/vd7dgghpeuzwuhok_1662898940.jpeg", "publishedAt": "2022-09-11T12:39:00Z", "content": "SpaceX successfully launched 34 Starlink satellites along with the AST SpaceMobile passenger satellite in the early hours of September 11. The two-stage Falcon 9 rocket lifted off from NASAs Kennedy … [+1951 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Fatima Shakeel", "title": "Mesmerizing Video Shows A Space Station Capturing An Aurora From Up Above - Wonderful Engineering", "description": "Advertisement Look at these mesmerizing pictures of auroras that have been captured by the International Space Station. You have to see it to believe it as this is definitely a sight to behold. After a massive solar storm hit the Earth’s atmosphere, NASA rele…", "url": "https://wonderfulengineering.com/mesmerizing-video-shows-a-space-station-capturing-an-aurora-from-up-above/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/09/ezgif-2-4b13406b83.jpg", "publishedAt": "2022-09-11T12:14:49Z", "content": "Look at these mesmerizing pictures of auroras that have been captured by the International Space Station. You have to see it to believe it as this is definitely a sight to behold. After a massive sol… [+2186 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Rameesha Sajwar", "title": "NASA’s Parker Solar Probe Might Catch A Solar Flare As It Flies Into The Sun – But It Will Still Survive - Wonderful Engineering", "description": "Advertisement The Parker Solar Probe is a spacecraft the size of a small car, that was launched during solar minimum, a regular period of most minor solar activity in the Sun’s 11-year solar cycle in 2018. Currently, the spacecraft has approached its 13th per…", "url": "https://wonderfulengineering.com/nasas-parker-solar-probe-might-catch-a-solar-flare-as-it-flies-into-the-sun-but-it-will-still-survive/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/09/imgonline-com-ua-resize-EMbTDAHixzo1BY.jpg", "publishedAt": "2022-09-11T12:11:58Z", "content": "The Parker Solar Probe is a spacecraft the size of a small car, that was launched during solar minimum, a regular period of most minor solar activity in the Sun’s 11-year solar cycle in 2018.\r\nCurren… [+3273 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Space news weekly recap: China's plans for lunar minerals, Indian reusable rocket and more - The Indian Express", "description": "From India's plan to build a reusable rocket to the James Webb Space Telescope capturing an \"Einstein Ring,\" here is our weekly space news recap.", "url": "https://indianexpress.com/article/technology/science/space-news-weekly-recap-einstein-ring-tarantula-nebula-and-the-moon-8144116/", "urlToImage": "https://images.indianexpress.com/2022/09/NASA-Artemis-launch-progress-aborted-20220901.jpg", "publishedAt": "2022-09-11T10:48:54Z", "content": "While NASA began its work to replace the faulty hydrogen seal on the Artemis 1 missions Space Launch System (SLS) rocket, ISRO announced that it will be working on designing and building a reusable l… [+8940 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Scientists Think the Moon May Contain Interstellar Objects — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: Finding interstellar objects is a difficult task as these cosmic bodies must not be gravitationally bound to any stars. However, the Moon, which is 384,400 kilometres from Earth, may contain interstellar objects.", "url": "https://www.transcontinentaltimes.com/2022/09/11/moon-interstellar-objects/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/09/IMG-20220911-WA0007_1200x675.jpg", "publishedAt": "2022-09-11T08:20:33Z", "content": "UNITED STATES: The distance between our solar system and the next nearest one is 4.3 light-years. It is called Alpha Centauri, and it is the location where the Proxima Centauri host star is orbited b… [+1895 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Five interesting facts you need to know about the Moon - The Indian Express", "description": "From the Moon having an \"atmosphere\" to the fact that it is shrinking, here are five important facts that you need to know about the natural satellite that dominates our night sky.", "url": "https://indianexpress.com/article/technology/science/5-interesting-facts-you-need-to-know-about-the-moon-8143692/", "urlToImage": "https://images.indianexpress.com/2022/07/Supermoon-july-13-2022-5-featured-1.jpg", "publishedAt": "2022-09-11T08:04:31Z", "content": "After two unsuccessful attempts at launching its Artemis 1 mission to the Moon, NASA engineers are now conducting maintenance works on the Space Launch System rocket while it is still at Launch Pad 3… [+4864 chars]"}, {"source": {"id": null, "name": "SatelliteProME.com"}, "author": null, "title": "SpaceX wins $1.4bn NASA contract for five astronaut launches - SatellitePro ME - SatelliteProME.com", "description": "The contract modification includes ground, launch, in-orbit, and return and recovery operations, cargo transportation for each mission, and a lifeboat capability while docked to the ISS.", "url": "https://satelliteprome.com/news/spacex-wins-1-4bn-nasa-contract-for-five-astronaut-launches/", "urlToImage": "https://satelliteprome.com/wp-content/uploads/2021/12/spacex-funding.jpg", "publishedAt": "2022-09-10T22:08:56Z", "content": "The contract modification includes ground, launch, in-orbit, and return and recovery operations, cargo transportation for each mission, and a lifeboat capability while docked to the ISS. \r\nNASA has a… [+1843 chars]"}]}