{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jordan Mendoza, USA TODAY", "title": "Underwater eruption of 'Sharkcano' captured by NASA satellites - USA TODAY", "description": "The underwater volcano near the Solomon Islands is known for being the home of sharks and other marine life despite having acidic, warm water.", "url": "https://www.usatoday.com/story/news/world/2022/05/26/sharkcano-eruption-nasa-pacific-ocean/9943385002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/05/26/USAT/9acb8c33-8140-4631-b216-1286f907d4b4-kavachi_oli2_2022134.jpg?auto=webp&crop=719,405,x0,y36&format=pjpg&width=1200", "publishedAt": "2022-05-26T19:26:17Z", "content": "An underwater volcano in the Pacific Ocean has begun to erupt, NASA images show. Living there: Sharks that can withstand extreme temperatures. \r\nOff the coast of the Solomon Islands, about 950 northe… [+2149 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Boeing capsule returns to Earth from space station - Times of India", "description": "Boeing's crew taxi returned to Earth from the International Space Station on Wednesday, completing a repeat test flight before NASA astronauts climb aboard. It was a quick trip back: The Starliner capsule parachuted into the New Mexico desert just four hours …", "url": "https://timesofindia.indiatimes.com/videos/international/boeing-capsule-returns-to-earth-from-space-station/videoshow/91820492.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-91820492,imgsize-22160.cms", "publishedAt": "2022-05-26T18:05:14Z", "content": "May 26, 2022, 11:35PM ISTSource: APBoeing's crew taxi returned to Earth from the International Space Station on Wednesday, completing a repeat test flight before NASA astronauts climb aboard. It was … [+441 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Magma beneath tectonic collision zones is wetter than previously thought - India Education Diary", "description": "A new study by geologists at the Woods Hole Oceanographic Institution (WHOI), MIT, and elsewhere has found that colliding continental plates may draw down more water than previously thought. The results could help to explain the explosiveness of some", "url": "https://indiaeducationdiary.in/magma-beneath-tectonic-collision-zones-is-wetter-than-previously-thought/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2022-05-26T17:25:51Z", "content": "A new study by geologists at the Woods Hole Oceanographic Institution (WHOI), MIT, and elsewhere has found that colliding continental plates may draw down more water than previously thought. The resu… [+5235 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "WhiteHat Jr and EnduroSat partner to enable kids to “Code a Satellite” - India Education Diary", "description": "New Delhi : In its effort to introduce new learning experiences and innovation, WhiteHat Jr will be enabling its students to access a live satellite to encourage space exploration and give a first-hand experience in space science. The satellite, name", "url": "https://indiaeducationdiary.in/whitehat-jr-and-endurosat-partner-to-enable-kids-to-code-a-satellite/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2022-05-26T16:59:23Z", "content": "New Delhi : In its effort to introduce new learning experiences and innovation, WhiteHat Jr will be enabling its students to access a live satellite to encourage space exploration and give a first-ha… [+2279 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA scientists to test James Webb Space Telescope on planet with lava-spewing clouds - Republic World", "description": "NASA says that the James Webb Space Telescope has locked its sight on two exoplanets- the lava-covered 55 Cancri e and the airless LHS 3844 b.", "url": "https://www.republicworld.com/science/space/nasa-scientists-to-test-james-webb-space-telescope-on-planet-with-lava-spewing-clouds-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/8iq84x8srprduuce_1653581765.jpeg", "publishedAt": "2022-05-26T16:33:00Z", "content": "Imagine a planet where a year lasts just 18 hours. This weird characteristic signifies that the planet is orbiting extremely close to its star and is tidally locked as a result. When a planet is tida… [+2931 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Dietmar Müller Et Al", "title": "How plate tectonics, mountains and deep-sea sediments have maintained Earth's 'Goldilocks' climate - Phys.org", "description": "For hundreds of millions of years, Earth's climate has warmed and cooled with natural fluctuations in the level of carbon dioxide (CO₂) in the atmosphere. Over the past century, humans have pushed CO₂ levels to their highest in 2 million years—overtaking natu…", "url": "https://phys.org/news/2022-05-plate-tectonics-mountains-deep-sea-sediments.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/how-plate-tectonics-mo.jpg", "publishedAt": "2022-05-26T15:18:06Z", "content": "For hundreds of millions of years, Earth's climate has warmed and cooled with natural fluctuations in the level of carbon dioxide (CO) in the atmosphere. Over the past century, humans have pushed CO … [+5842 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "Solar Orbiter's pictures of the sun are every bit as dramatic as you were hoping - Phys.org", "description": "On March 26, the ESA's Solar Orbiter made its closest approach to the sun so far. It ventured inside Mercury's orbit and was about one-third the distance from Earth to the sun. It was hot but worth it.", "url": "https://phys.org/news/2022-05-solar-orbiter-pictures-sun-bit.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/solar-orbiters-picture.jpg", "publishedAt": "2022-05-26T15:17:01Z", "content": "On March 26, the ESA's Solar Orbiter made its closest approach to the sun so far. It ventured inside Mercury's orbit and was about one-third the distance from Earth to the sun. It was hot but worth i… [+5001 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Deena Theresa", "title": "The first Australians ate the giant eggs of huge flightless birds, researchers confirm - Interesting Engineering", "description": "The first Australians ate the giant eggs of huge flightless birds, according to a research conducted by the universities of Cambridge and Turin.", "url": "https://interestingengineering.com/australians-ate-giant-eggs-birds", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/jvwvrRyXwx/sizes/egg-bird_md.jpeg", "publishedAt": "2022-05-26T15:13:09Z", "content": "Centuries ago, the Demon Ducks of Doom roamed the Earth.\r\nTrue to their name, they were giant flightless birds - two-meter tall, weighing 200 kg - with massive beaks. \r\nNow imagine sharing your neigh… [+4447 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA achieves major milestone in its quest to land Artemis III astronauts on the Moon - Republic World", "description": "NASA recently achieved a major milestone with the Interim Cryogenic Propulsion Stage (ICPS) that would power the rocket carrying astronauts to the Moon.", "url": "https://www.republicworld.com/science/space/nasa-achieves-major-milestone-in-its-quest-to-land-artemis-iii-astronauts-on-the-moon-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/i19lhhsqlonhv8bm_1653573012.jpeg", "publishedAt": "2022-05-26T14:06:00Z", "content": "NASAs preparations for landing astronauts on the Moon are ramping up. The agency announced that it achieved a major milestone with the interim cryogenic propulsion stage (ICPS) that would power the r… [+2497 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Researchers reveal decline of diatoms due to ocean acidification - The Siasat Daily", "description": "Kiel: A new study shows an unexpected negative impact of Carbon Dioxide (CO2) on important plankton groups. The findings of the research were published in the journal 'Nature'. While calcifying organisms like oysters and corals have difficulty forming their s…", "url": "https://www.siasat.com/researchers-reveal-decline-of-diatoms-due-to-ocean-acidification-2335149/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/05/diatoms_MAY26.jpg", "publishedAt": "2022-05-26T13:47:00Z", "content": "Kiel: A new study shows an unexpected negative impact of Carbon Dioxide (CO2) on important plankton groups.\r\nThe findings of the research were published in the journal ‘Nature’.\r\nWhile calcifying org… [+5200 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "OMG! 2 km wide asteroid approaching Earth at 47200 mph - DNAIndiaNews", "description": "A giant asteroid, roughly twice the size of Burj Khalifa, is heading towards Earth. As per NASA, the enormous asteroid is roughly 1.8 km in diameter.#asteroi...", "url": "https://www.youtube.com/watch?v=5d8PDgzyBMU", "urlToImage": "https://i.ytimg.com/vi/5d8PDgzyBMU/maxresdefault.jpg", "publishedAt": "2022-05-26T13:45:03Z", "content": null}, {"source": {"id": null, "name": "Eletimes.com"}, "author": "https://www.facebook.com/eletimes", "title": "Impeccable Quantum Computing in Computers gets Real - ELE Times", "description": "In modern computers, errors during the processing and storage of information have become a rarity due to high-quality fabrication.", "url": "https://www.eletimes.com/impeccable-quantum-computing-in-computers-gets-real", "urlToImage": "https://www.eletimes.com/wp-content/uploads/2022/05/error-free-quantum-com-1-e1653567749368.jpg", "publishedAt": "2022-05-26T12:34:34Z", "content": "In modern computers, errors during the processing and storage of information have become a rarity due to high-quality fabrication. However, for critical applications, where even single errors can hav… [+3588 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Louise Lerner", "title": "Why did Mars dry out? New study points to unusual answers - Phys.org", "description": "Mars once ran red with rivers. The telltale tracks of past rivers, streams and lakes are visible today all over the planet. But about three billion years ago, they all dried up—and no one knows why.", "url": "https://phys.org/news/2022-05-mars-unusual.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/why-did-mars-dry-out-n.jpg", "publishedAt": "2022-05-26T12:19:22Z", "content": "Mars once ran red with rivers. The telltale tracks of past rivers, streams and lakes are visible today all over the planet. But about three billion years ago, they all dried upand no one knows why.\r\n… [+5618 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s NASA Psyche Falcon Heavy launch slips to September - Teslarati", "description": "SpaceX’s first dedicated Falcon Heavy launch for NASA has been hit by a seven-week delay after spacecraft engineers discovered a software anomaly during preflight processing. Named after the exotic metallic asteroid it’s designed to explore, NASA’s Psyche spa…", "url": "https://www.teslarati.com/spacex-falcon-heavy-nasa-psyche-launch-delay/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/05/Falcon-Heavy-Flight-3-STP-2-B1052-B1053-B1057-horizontal-integration-SpaceX-1-edit-2-c-1000x600-1.jpg", "publishedAt": "2022-05-26T11:00:48Z", "content": "SpaceX’s first dedicated Falcon Heavy launch for NASA has been hit by a seven-week delay after spacecraft engineers discovered a software anomaly during preflight processing.\r\nNamed after the exotic … [+3768 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "SpaceX Falcon 9 lifts off with cremated remains of 47 people in memorial spaceflight - Republic World", "description": "SpaceX launched its Transporter-5 mission in its Falcon 9 rocket from the Cape Canaveral Space Force Station in Florida at 12:05 am (IST) on May 26.", "url": "https://www.republicworld.com/science/space/spacex-falcon-9-lifts-off-with-cremated-remains-of-47-people-in-memorial-spaceflight-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/v9ojmvxwgca2dfb3_1653561046.jpeg", "publishedAt": "2022-05-26T10:43:00Z", "content": "SpaceX launched its Transporter-5 mission in its Falcon 9 rocket from the Cape Canaveral Space Force Station in Florida at 12:05 am (IST) on May 26. Meant to be a ride-share mission, but it is also b… [+1860 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "'Dragon of Death': Giant Flying Dinosaur with 30-foot Wingspan Dug up in Argentina - News18", "description": "Present during the Cretaceous period, Pterosaurs were known for their very large skulls, hyper-elongated necks, and robust yet short bodies.", "url": "https://www.news18.com/news/buzz/dragon-of-death-giant-flying-dinosaur-with-30-foot-wingspan-dug-up-in-argentina-5250817.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/pterosaur-165356080716x9.png", "publishedAt": "2022-05-26T10:27:13Z", "content": "A team of researchers in Argentina has discovered the largest flying vertebrates ever found. The species found by the researchers is called Pterosaur, which used to roam around the skies approximatel… [+2189 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Florida: Sea turtle conservation gets boost from new DNA detection method - India Education Diary", "description": "DNA “fingerprints” left behind by sea turtles offer scientists a simple, powerful way of tracking the health and whereabouts of these endangered animals, a key step forward in their conservation.A study led by University of Florida researchers is the", "url": "https://indiaeducationdiary.in/university-of-florida-sea-turtle-conservation-gets-boost-from-new-dna-detection-method/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/University-of-Florida.png", "publishedAt": "2022-05-26T10:23:07Z", "content": "DNA fingerprints left behind by sea turtles offer scientists a simple, powerful way of tracking the health and whereabouts of these endangered animals, a key step forward in their conservation.\r\nA st… [+5962 chars]"}, {"source": {"id": null, "name": "Scientific Computing World"}, "author": null, "title": "CLOUD discovers how aerosols rapidly form and grow at high altitude - Scientific Computing World", "description": "A research project exploring the connection between galactic cosmic rays and cloud formation has discovered that Aerosol particles can form and grow in Earth’s upper troposphere", "url": "https://www.scientific-computing.com/news/cloud-discovers-how-aerosols-rapidly-form-and-grow-high-altitude", "urlToImage": null, "publishedAt": "2022-05-26T09:38:44Z", "content": "A research project exploring the connection between galactic cosmic rays and cloud formation has discovered that Aerosol particles can form and grow in Earths upper troposphere. The research paper ha… [+4088 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA InSight Mars Lander set to DIE, takes LAST selfie - HT Tech", "description": "The selfie captured by NASA InSight Mars lander on April 24 was declared as the last selfie ever clicked by it. This picture describes every bit of Mars lander’s hardships.", "url": "https://tech.hindustantimes.com/tech/news/nasa-insight-mars-lander-set-to-die-takes-last-selfie-71653557450369.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/26/1600x900/3bJuDPq6oyCE6A9jz4jS8W-1024-80.jpg_1653557530614_1653557544560.webp", "publishedAt": "2022-05-26T09:34:03Z", "content": "This selfie captured by the NASA InSight Mars Lander on April 24 has already become iconic after it was declared that it will be the last selfie ever taken by the lander. The picture encapsulates the… [+2129 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chinese Zhurong rover attacked by the notorious Mars DUST: Will it DIE? - HT Tech", "description": "Chinese Mars rover, the Zhurong, is expected to last until the end of 2022 after the rover is being covered by the destructive Martian dust.", "url": "https://tech.hindustantimes.com/tech/news/chinese-zhurong-rover-attacked-by-the-notorious-mars-dust-will-it-die-71653554729589.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/26/1600x900/FRANCE-SCIENCE-SPACE-2_1653554834130_1653554857679.jpg", "publishedAt": "2022-05-26T08:48:07Z", "content": "Mars is one of the most active planets in the solar system for the space research - be it NASA or CNSA, both have sent their robots there to dig out information and research facts about Mars. But the… [+1732 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Toward customizable timber, grown in a lab - Nanowerk", "description": "Researchers show they can control the properties of lab-grown plant material, which could enable the production of wood products with little waste.", "url": "https://www.nanowerk.com/news2/biotech/newsid=60730.php", "urlToImage": "https://www.nanowerk.com/news2/biotech/id60730.jpg", "publishedAt": "2022-05-26T08:13:49Z", "content": "Nanowerk Newsletter\r\nGet our Biotechnology News updates to your inbox!"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Tau Herculids meteor shower 2022: May 30-31 could see 1,000 shooting stars per hour - WION", "description": "The Tau Herculids, a potentially new — and brief — meteor shower that could appear before the end of the month. This meteor shower will either go down in history or wont appear at all, which is a fascinating duality for a science like astronomy, which is norm…", "url": "https://www.wionews.com/world/tau-herculids-meteor-shower-2022-may-30-31-could-see-1000-shooting-stars-per-hour-482286", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/01/04/122305-0001bm1vq.jpg", "publishedAt": "2022-05-26T08:06:26Z", "content": "While the term \"shooting star\" is a misnomer, seeing a bright object arc across the night sky is a sight to behold. We witness shooting stars when tiny particles collide with Earth's atmosphere and b… [+1639 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Russian, NASA Astronauts ‘Fight It Out’ At International Space Station; US Crew Says Wanted To ‘Poke Holes’ In His Logic - EurAsian Times", "description": "The repercussions of Russia’s invasion of Ukraine appear to be extending into space as well, with a NASA astronaut revealing rising tensions with Russian cosmonauts aboard the International Space Station (ISS). NASA astronaut Mark Vande Hei who returned to Ea…", "url": "https://eurasiantimes.com/russian-nasa-astronauts-fight-it-out-at-international-space-station/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/05/Russia-e1653551849487.jpg", "publishedAt": "2022-05-26T08:01:00Z", "content": "The repercussions of Russia’s invasion of Ukraine appear to be extending into space as well, with a NASA astronaut revealing rising tensions with Russian cosmonauts aboard the International Space Sta… [+4184 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "New discovery about distant galaxies: Stars are heavier than we thought - Nanowerk", "description": "A team of astrophysicists has arrived at a major result regarding star populations beyond the Milky Way. The result could change our understanding of a wide range of astronomical phenomena, including the formation of black holes, supernovae and why galaxies d…", "url": "https://www.nanowerk.com/news2/space/newsid=60729.php", "urlToImage": "https://www.nanowerk.com/news2/space/id60729.jpg", "publishedAt": "2022-05-26T07:59:34Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "‘Quantum Internet’ inches closer with advance in data teleportation - The Indian Express", "description": "A team of physicists has taken a significant step toward this computer network of the future, using a technique called quantum teleportation to send data across three physical locations.", "url": "https://indianexpress.com/article/technology/science/quantum-internet-inches-closer-with-advance-in-data-teleportation-7937382/", "urlToImage": "https://images.indianexpress.com/2022/05/Quantum-internet-teleportation-featured-may-2022.jpg", "publishedAt": "2022-05-26T07:48:37Z", "content": "From Santa Barbara, California, to Hefei, China, scientists are developing a new kind of computer that will make todays machines look like toys.Harnessing the mysterious powers of quantum mechanics, … [+7065 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Gregory Robinson, Program Manager for NASA's James Webb Space Telescope, has been named to the 'TIME100' list. - BollyInside", "description": "Gregory Robinson, the director of NASA’s James Webb Space Telescope Program, has been nominated to TIME100, the magazine’s annual list of the 100 most", "url": "https://www.bollyinside.com/news/gregory-robinson-program-manager-for-nasas-james-webb-space-telescope-has-been-named-to-the-time100-list", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/Gregory-Robinson-Program-Manager-for-NASAs-James-Webb-Space-Telescope.jpeg", "publishedAt": "2022-05-26T07:13:29Z", "content": "Gregory Robinson, the director of NASAs James Webb Space Telescope Program, has been nominated to TIME100, the magazines annual list of the 100 most influential leaders.\r\nRobinson joins other TIME100… [+4112 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Is Earth's core rusting? Research hints at catastrophic changes under the surface - India Today", "description": "Earth's core made up of molten iron has been a key player in the evolution of the planet and researchers are looking at a common phenomenon feared by metalworkers the world over - rusting.", "url": "https://www.indiatoday.in/science/story/is-earth-s-core-rusting-research-hints-at-catastrophic-changes-under-the-surface-1954295-2022-05-26", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/Earth_w-647x363.jpeg?xyibaMwg9_jJLZku3GE8fuH.R_wqmAgb", "publishedAt": "2022-05-26T05:52:06Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Viral! This man REJECTS call on iPhone from astronaut on International Space Station, breaks Internet! - HT Tech", "description": "In a hilarious incident, a man rejected a call on his iPhone from an astronaut aboard the International Space Station high above Earth. He shared the story on Reddit, Internet bursts out in laughter.", "url": "https://tech.hindustantimes.com/tech/news/viral-this-man-rejects-call-on-iphone-from-astronaut-on-international-space-station-breaks-internet-71653542893079.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/26/1600x900/SPACE-EXPLORATION-NASA-AXIOM-2_1650883667756_1653542981265.JPG", "publishedAt": "2022-05-26T05:33:15Z", "content": "We are all guilty of not answering a phone call even when we see the phone ringing. It could be for many reasons such as being busy on another task or just not feeling comfortable receiving a call fr… [+2810 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "NASA's Solar Sail Project 'Diffractive lightsails' Aims to See 'Sun As Never Before' - News18", "description": "US space agency NASA is planning to invest about $2 million over two years to develop a new solar sail concept that could propel a mission to the Sun.", "url": "https://www.news18.com/news/buzz/nasas-solar-sail-project-diffractive-lightsails-aims-to-see-sun-as-never-before-5247925.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/solar-165353991316x9.png", "publishedAt": "2022-05-26T04:40:47Z", "content": "US space agency NASA is planning to invest about $2 million over two years to develop a new solar sail concept that could propel a mission to the Sun. The solar sail concept, called Diffractive light… [+1860 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Specific neural circuit in mice can help detect the dimmest shadows possible - News-Medical.Net", "description": "Mice use a specific neural pathway to detect shadows, and it can detect just about the dimmest shadows possible, according to new research from Aalto University and the University of Helsinki. The human eye has the same neural circuit, which researchers think…", "url": "https://www.news-medical.net/news/20220526/Specific-neural-circuit-in-mice-can-help-detect-the-dimmest-shadows-possible.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_714912_16535394215721114.png", "publishedAt": "2022-05-26T04:33:00Z", "content": "Mice use a specific neural pathway to detect shadows, and it can detect just about the dimmest shadows possible, according to new research from Aalto University and the University of Helsinki. The hu… [+4041 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Not just pollen in the spring: Wild grass releases a variety of particles into the air - EurekAlert", "description": "The aboveground portions of plants release particles such as fungal spores, pollen, bacteria, viruses, algae, and cell debris that can act as the nuclei of cloud droplets and ice crystals. A multi-institutional team of researchers has reported the first chara…", "url": "https://www.eurekalert.org/news-releases/953863", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/06753268-7408-4ca1-8925-7b509da40af2/Rendition/thumbnail/Content/Public", "publishedAt": "2022-05-26T02:00:45Z", "content": "The Science\r\nLiving organisms release particles such as fungal spores, pollen, bacteria, viruses, algae, and cell debris. In the atmosphere, these particles can act as the nuclei for cloud droplets a… [+3395 chars]"}, {"source": {"id": null, "name": "Hardwoodparoxysm.com"}, "author": "Shannon Bailey", "title": "\"I photographed the black hole, science brings peace\" - Il Golfo 24 - Hardwood Paroxysm", "description": "“Science bears a great responsibility and we have seen it above all in the years of the epidemic: it must know how to disseminate without belittling it.", "url": "https://hardwoodparoxysm.com/i-photographed-the-black-hole-science-brings-peace-il-golfo-24/", "urlToImage": "https://www.ilgolfo24.it/wp-content/uploads/2022/05/1.jpg", "publishedAt": "2022-05-26T01:59:35Z", "content": "Science bears a great responsibility and we have seen it above all in the years of the epidemic: it must know how to disseminate without belittling it. It does not admit that one suddenly becomes an … [+2375 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A nascent black hole was 'kicked' through space by gravitational waves - BollyInside", "description": "One particular black hole understands how to unwind. It was created when two others spiralled and collided. This new black hole received a “kick” during", "url": "https://www.bollyinside.com/news/a-nascent-black-hole-was-kicked-through-space-by-gravitational-waves", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/A-nascent-black-hole-was-kicked-through-space-by-gravitational.jpeg", "publishedAt": "2022-05-26T00:01:43Z", "content": "One particular black hole understands how to unwind.\r\nIt was created when two others spiralled and collided. This new black hole received a kick during its development, which threw it away from its b… [+4253 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX Falcon 9 rocket launch of the Transporter 5 mission - First Coast News", "description": "A rideshare flight to a sun-synchronous orbit with numerous small microsatellites and nanosatellites for commercial and government customers.", "url": "https://www.youtube.com/watch?v=iPmqSeSnR9g", "urlToImage": "https://i.ytimg.com/vi/iPmqSeSnR9g/hqdefault.jpg", "publishedAt": "2022-05-25T23:36:23Z", "content": null}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "As they travel through space for billions of years, the Voyager space probes are able to educate humanity about immortality and legacy. - BollyInside", "description": "Voyager 1 is the most furthest located human-made object from Earth. It is presently over 15 billion miles (24 billion kilometers) from Earth in", "url": "https://www.bollyinside.com/news/as-they-travel-through-space-for-billions-of-years-the-voyager-space-probes-are-able-to-educate-humanity-about-immortality-and-legacy", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/As-they-travel-through-space-for-billions-of-years-the.jpeg", "publishedAt": "2022-05-25T23:25:14Z", "content": "Voyager 1 is the most furthest located human-made object from Earth. It is presently over 15 billion miles (24 billion kilometers) from Earth in interstellar space after passing through Jupiter, Satu… [+5519 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA invites the media to a conference on space station science and climate research - BollyInside", "description": "At 1 p.m., NASA will hold a media conference. EDT Tuesday, June 2, to discuss the hardware, technology demonstrations, and science experiments, including", "url": "https://www.bollyinside.com/news/nasa-invites-the-media-to-a-conference-on-space-station-science-and-climate-research", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/NASA-invites-the-media-to-a-conference-on-space-station.jpeg", "publishedAt": "2022-05-25T20:49:34Z", "content": "At 1 p.m., NASA will hold a media conference. EDT Tuesday, June 2, to discuss the hardware, technology demonstrations, and science experiments, including a new climate research probe, that will be de… [+3034 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "NASA says \"something weird is going on\" with the cosmos - Boing Boing", "description": "In a recent press release containing new images captured by the Hubble Space Telescope, the National Aeronautic and Space Administration said that something weird was going on in outer space. No, r…", "url": "https://boingboing.net/2022/05/25/nasa-says-something-weird-is-going-on-with-the-cosmos.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/05/potw2004a.jpg?fit=1200%2C876&ssl=1", "publishedAt": "2022-05-25T17:06:00Z", "content": "In a recent press release containing new images captured by the Hubble Space Telescope, the National Aeronautic and Space Administration said that something weird was going on in outer space. No, rea… [+1780 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "390 million-year-old fish-like creature revealed to be one of our earliest ancestors - Daily Mail", "description": "A new stud led by scientists at the RIKEN Cluster for Pioneering Research in Japan shows that the creature, called Palaeospondylus gunni, could be one of our earliest ancestors.", "url": "https://www.dailymail.co.uk/sciencetech/article-10853801/390-million-year-old-fish-like-creature-revealed-one-earliest-ancestors.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/25/16/58272693-0-image-a-115_1653491376389.jpg", "publishedAt": "2022-05-25T16:59:51Z", "content": "A 390 million-year-old, fish-like creature with four limbs is probably not who you'd expect to find in your family tree. \r\nBut a new study has shown that the creature, called Palaeospondylus gunni, c… [+6877 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Marcelo Gleiser", "title": "Can science explain the beginning of the Universe? - Big Think", "description": "Everyone loves a good origins story.", "url": "https://bigthink.com/13-8/origin-universe/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/05/13-8_Origin_Lead.jpg", "publishedAt": "2022-05-25T16:00:00Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Earth’s orbital debris problem is worsening, and policy solutions are difficult - Ars Technica", "description": "\"Who's responsible? Who pays? How much do they pay?\"", "url": "https://arstechnica.com/science/2022/05/earths-orbital-debris-problem-is-worsening-and-policy-solutions-are-difficult/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/05/GettyImages-1097845748-760x380.jpg", "publishedAt": "2022-05-25T15:09:40Z", "content": "38 with 32 posters participating\r\nDave Hebert, Caleb Henry, Therese Jones, and Eric Berger at Ars Frontiers 2022 on the growing problem of orbital debris. Click here for transcript.\r\nOne of the great… [+4047 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sayantani Biswas", "title": "Earth Picked Up An Alien ‘wow’ Signal 45 Years Ago. Source? Read Here To Know | Mint - Mint", "description": "Did humanity’s first contact with aliens already happen back in 1977? What was the source of the signal? Read below", "url": "https://www.livemint.com/science/news/earth-picked-up-an-alien-wow-signal-45-years-ago-source-read-here-to-know-11653490456118.html", "urlToImage": "https://images.livemint.com/img/2022/05/25/600x338/download_1653490473257_1653490476976.jpg", "publishedAt": "2022-05-25T14:55:52Z", "content": "What did the aliens say about almost half a century ago on the night of 15 august 1977?\r\nYes, that's right, aliens.\r\nAre they communicating with us in real or is this a story straight out of the Stev… [+2700 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Scott Alan Johnston", "title": "Spacesuits are leaking water and NASA is holding off any spacewalks until they can solve the problem - Phys.org", "description": "NASA's spacesuits are getting old. The extra-vehicular mobility units—EMUs for short—were designed and built for spacewalks outside NASA's space shuttles, which flew for the last time in 2011. Nowadays, the EMUs are an integral part of maintaining and upgradi…", "url": "https://phys.org/news/2022-05-spacesuits-leaking-nasa-spacewalks-problem.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/spacesuits-are-leaking.jpg", "publishedAt": "2022-05-25T14:32:11Z", "content": "NASA's spacesuits are getting old. The extra-vehicular mobility unitsEMUs for shortwere designed and built for spacewalks outside NASA's space shuttles, which flew for the last time in 2011. Nowadays… [+4557 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "ESA Develops Self-Cleaning Spacecraft Surfaces. All About The New Feature - ABP Live", "description": "A project led by the ESA is developing microbe-killing coatings suitable for use within spacecraft cabins to help combat invisible stowaways like micoorganisms, which can make the spacecraft sick.", "url": "https://news.abplive.com/science/esa-develops-self-cleaning-spacecraft-surfaces-all-about-the-new-feature-1533706", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/05/25/25e4c73a7f7521c16d0d5959a570f7af_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-05-25T13:22:54Z", "content": "New Delhi: Several microorganisms reside in space, and can pose a serious threat to the health of astronauts who live and work in Earth orbit. Now, a project led by the European Space Agency (ESA) is… [+4321 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Are Ancient Remains Of Mercury Hiding On Earth? Here's Why Scientists Think So - Indiatimes.com", "description": "Are shards of planet Mercury hiding on Earth? Scientists think that Mercury, the closest planet to our Sun was once a much larger cosmic body, until it collided with another space object and got ripped of its mantle. What remains of it now is the core, and sc…", "url": "https://www.indiatimes.com/technology/science-and-future/are-ancient-remains-of-mercury-hiding-on-earth-heres-why-scientists-think-so-570505.html", "urlToImage": "https://im.indiatimes.in/content/2022/May/FBImage15-copy_628e0ae75d70b.jpg", "publishedAt": "2022-05-25T10:53:32Z", "content": "Are shards of planet Mercury hiding on Earth? Scientists think that Mercury, the closest planet to our Sun was once a much larger cosmic body, until it collided with another space object and got ripp… [+3229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA announces early plan to send astronauts to Mars; Solicits feedback - The Indian Express", "description": "NASAis calling on industry, academia, international communities and other stakeholders to provide input on its early plan for a mission to Mars.", "url": "https://indianexpress.com/article/technology/science/nasa-announces-early-plan-to-send-astronauts-to-mars-solicits-feedback-7935625/", "urlToImage": "https://images.indianexpress.com/2022/05/NASA-Mars-mission-plan-released-featured-May-2022.jpg", "publishedAt": "2022-05-25T10:23:05Z", "content": "NASA has shared its early plans to send astronauts to Mars for 30 days. The space agency had released a draft set of high-level objectives earlier this year. These identify 50 points falling under fo… [+1843 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Blackhole bonanza: AstroSat witnesses birth for 500th time - Ahmedabad Mirror", "description": "By&nbsp;Manasi Saraf Joshi\n\nThe mystery around the black holes, cosmic enigmas where strong gravitational pull does not even allow light to escape, still attracts scientists globally. Indian scientists have made a breakthrough in the field, with their space t…", "url": "https://www.ahmedabadmirror.com/blackhole-bonanza-astrosat-witnesses-birth-for-500th-time/81833231.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1653417907977.jpg-org", "publishedAt": "2022-05-25T10:04:20Z", "content": "By Manasi Saraf Joshi\r\nThe mystery around the black holes, cosmic enigmas where strong gravitational pull does not even allow light to escape, still attracts scientists globally. Indian scientists ha… [+2072 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Newly-Discovered Black Holes In Dwarf Galaxies Could Explain How They're Formed - Indiatimes.com", "description": "Researchers at the University of North Carolina at Chapel Hill have discovered a treasure trove of massive black holes, hidden inside dwarf galaxies, offering us a glimpse into how the supermassive black hole that’s at the centre of the Milky Way came into ex…", "url": "https://www.indiatimes.com/technology/science-and-future/astronomers-discover-multiple-massive-black-holes-hiding-in-dwarf-galaxies-570467.html", "urlToImage": "https://im.indiatimes.in/content/2022/May/Facebook-Image---2022-05-25T133040567_628de33842239.jpg", "publishedAt": "2022-05-25T08:59:30Z", "content": "Researchers at the University of North Carolina at Chapel Hill have discovered a treasure trove of massive black holes, hidden inside dwarf galaxies, offering us a glimpse into how the supermassive b… [+3646 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "A completely new type of magnetic wave discovered deep down - Tech Explorist", "description": "There are also other, more elusive, dynamic processes happening deep down below our feet.", "url": "https://www.techexplorist.com/completely-new-type-magnetic-wave-discovered-outermost-part-earth-outer-core/47557/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/Earths-outer-core.jpg", "publishedAt": "2022-05-25T08:22:46Z", "content": "Understanding the origin of the magnetic field, why it constantly fluctuates, how it interacts with the solar wind, and, indeed, why it is currently weakening- all these questions are topics of inter… [+2844 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Texas at Austin: Low-Cost Gel Film Can Pluck Drinking Water From Desert Air - India Education Diary", "description": "More than a third of the world’s population lives in drylands, areas that experience significant water shortages. Scientists and engineers at The University of Texas at Austin have developed a solution that could help people in these areas access cle", "url": "https://indiaeducationdiary.in/university-of-texas-at-austin-low-cost-gel-film-can-pluck-drinking-water-from-desert-air/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-4-1.jpg", "publishedAt": "2022-05-25T07:12:47Z", "content": "More than a third of the worlds population lives in drylands, areas that experience significant water shortages. Scientists and engineers at The University of Texas at Austin have developed a solutio… [+3339 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: One word a day- CAPSTONE - The Indian Express", "description": "What is CAPSTONE and its objectives? Space missions like CAPSTONE are popular topics for the UPSC CSE and the aspirants cannot afford to ignore them in both prelims and GS III mains.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-one-word-a-day-capstone-7934912/", "urlToImage": "https://images.indianexpress.com/2022/05/upsc-essential-1.jpg", "publishedAt": "2022-05-25T06:53:06Z", "content": "Word: CAPSTONE\r\nSubject: Science and Technology, Space\r\nWhat is CAPSTONE?\r\nThe Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE), is a CubeSat Mission … [+3178 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Hypnotic! Hubble captures massive star cluster in spiral Whirlpool Galaxy - India Today", "description": "Messier 51 or the M51 galaxy was discovered by Charles Messier in 1773 and is located 31 million light-years away from Earth.", "url": "https://www.indiatoday.in/science/story/hypnotic-hubble-captures-massive-star-cluster-in-spiral-whirlpool-galaxy-1953803-2022-05-25", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/M51-647x363.jpeg?vndtQgpGzGuhk76f4H9lBAazfiCslEaN", "publishedAt": "2022-05-25T05:37:56Z", "content": null}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "PTI", "title": "NASA's Curiosity rover finds a mysterious doorway on Mars, spark speculations - CNBCTV18", "description": "For the past ten years, NASA's Curiosity rover has been trundling around the surface of Mars, taking photos in its quest to understand the history and geology of the red planet and perhaps even find signs of life. Last week it took a photo that appeared to sh…", "url": "https://www.cnbctv18.com/science/nasas-curiosity-rover-finds-a-mysterious-doorway-on-mars-sparks-speculations-13607052.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/05/Curiosity-rover.jpg", "publishedAt": "2022-05-25T05:18:00Z", "content": "MiniFor the past ten years, NASA's Curiosity rover has been trundling around the surface of Mars, taking photos in its quest to understand the history and geology of the red planet and perhaps even f… [+97 chars]"}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Long-hypothesized 'next generation wonder material' created for first time - Chemie.de", "description": "For over a decade, scientists have attempted to synthesize a new form of carbon called graphyne with limited success. That endeavor is now at an end, though, thanks to new research from the Univer ...", "url": "https://www.chemeurope.com/en/news/1176225/long-hypothesized-next-generation-wonder-material-created-for-first-time.html", "urlToImage": "https://rs1.chemie.de/images//171913-75.jpg", "publishedAt": "2022-05-25T03:54:24Z", "content": "For over a decade, scientists have attempted to synthesize a new form of carbon called graphyne with limited success. That endeavor is now at an end, though, thanks to new research from the Universit… [+4170 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Julian Dossett", "title": "Watch a Robot Shaped Like Pasta Escape a Maze - CNET", "description": "These \"soft robots\" could help us gather energy from natural environments.", "url": "https://www.cnet.com/science/watch-a-robot-shaped-like-pasta-escape-a-maze/", "urlToImage": "https://www.cnet.com/a/img/resize/f25ee70e86f10965ef14636e15c46a61b68f363e/2022/05/24/5e5b2800-72d5-427c-97b4-03874cd5a5e5/screen-shot-2022-05-24-at-4-47-56-pm.png?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-05-24T23:22:07Z", "content": "A robot that looks like a piece of rotini pasta can propel itself through a maze without humans helping it. \r\nResearchers from North Carolina State University and the University of Pennsylvania devel… [+2531 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "Lunar eclipse filmed 100 million km from Earth - OI Canadian", "description": "These pictures of thetotal lunar eclipse May 15-16 last are very impressive: taken in space by the probe Lucythey show us (accelerated), and in an unprecedented way, the disappearance of Moon at the t", "url": "https://oicanadian.com/lunar-eclipse-filmed-100-million-km-from-earth/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/largeoriginal/6/9/7/697ab4ef67_50189745_eclipse-lune-16-mai-eso.jpg", "publishedAt": "2022-05-24T23:03:20Z", "content": "These pictures of thetotal lunar eclipse May 15-16 last are very impressive: taken in space by the probe Lucythey show us (accelerated), and in an unprecedented way, the disappearance of Moon at the … [+1213 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "See Skydiving Salamanders Show Off Their Complex Aerial Maneuvers - CNET", "description": "Wandering salamanders are the flying squirrels of the amphibian world.", "url": "https://www.cnet.com/science/biology/see-skydiving-salamanders-show-off-their-complex-aerial-maneuvers/", "urlToImage": "https://www.cnet.com/a/img/resize/0746ef1229b8e6aa17413546052d3d379bf3fb2e/2022/05/23/972dc8b8-65ac-4591-9fc5-05275a95df5b/a-vagrans-vertical.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-05-24T20:16:00Z", "content": "High up in the canopy of the California redwood forests, the wandering salamander lives, eats and soars. Scientists are marveling at the skydiving amphibians and their ability to effortlessly glide a… [+2173 chars]"}]}