{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Black hole billiards in the centers of galaxies - Science Daily", "description": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggested solution involves a chaotic triple drama inside a giant d…", "url": "https://www.sciencedaily.com/releases/2022/03/220309131909.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T18:33:10Z", "content": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggest… [+6705 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Veronique Greenwood", "title": "Sharks Sleep, Even When Both Eyes Are Wide Open - The New York Times", "description": "While sharks have a reputation for always being on the move, some of them really do catch some rest.", "url": "https://www.nytimes.com/2022/03/09/science/sharks-sleep.html", "urlToImage": "https://static01.nyt.com/images/2022/03/09/science/09tb-sleepingsharks1/09tb-sleepingsharks1-facebookJumbo.jpg", "publishedAt": "2022-03-09T17:46:10Z", "content": "This time, said Craig Radford, a professor of marine science at the University of Auckland and an author of the new paper, the researchers were looking to compare the sharks metabolisms during these … [+1719 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "X-ray view of subducting tectonic plates: High pressure softens the Earth's crust in subduction zones and can detach it from the plate - Science Daily", "description": "Earth's thin crust softens considerably when it dives down into the Earth attached to a tectonic plate. That is demonstrated by X-ray studies carried out on a mineral which occurs in large quantities in basaltic crust. This softening can even cause the crust …", "url": "https://www.sciencedaily.com/releases/2022/03/220309111037.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T17:04:35Z", "content": "Earth's thin crust softens considerably when it dives down into the Earth attached to a tectonic plate. That is demonstrated by X-ray studies carried out using DESY's X-ray source PETRA III on a mine… [+3351 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Spiders Use Electric Fields to Fly, And We May Finally Know How - ScienceAlert", "description": "Having never evolved wings, many species of spider instead evolved an uncanny ability to take to the skies using nothing more than a few short threads of gossamer dangling from their dainty butts.", "url": "https://www.sciencealert.com/simulations-show-in-unprecedented-detail-how-spiders-fly-using-electromagnetism", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/SpiderLitByBokehLight_1024.jpg", "publishedAt": "2022-03-09T17:03:51Z", "content": "Having never evolved wings, many species of spider instead evolved an uncanny ability to take to the skies using nothing more than a few short threads of gossamer dangling from their dainty butts.\r\nJ… [+3535 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Structure of the moiré exciton captured by imaging its electron and hole - Nature.com", "description": "Imaging the electron and hole that bind to form interlayer excitons in a 2D moiré material enables direct measurement of its diameter and indicates&nbsp;the localization of its centre of mass.", "url": "https://www.nature.com/articles/s41586-021-04360-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-021-04360-y/MediaObjects/41586_2021_4360_Fig1_HTML.png", "publishedAt": "2022-03-09T16:53:43Z", "content": "<li>Wang, Z. et al. Evidence of high-temperature exciton condensation in two-dimensional atomic double layers. Nature574, 7680 (2019).\r\nADS \r\n CAS \r\nGoogle Scholar \r\n</li><li>Wang, J. et al. Optical … [+8991 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Global warming combined with other changes in the environment presents 'double whammy' for birds - Science Daily", "description": "A new study rolls back the curtain on half a century of evidence detailing the impact of climate change on more than 60 different bird species.  It found that half of all changes to key physical and behavioral bird characteristics since the 1960s can be linke…", "url": "https://www.sciencedaily.com/releases/2022/03/220309104515.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T16:51:45Z", "content": "A new study from researchers at The Australian National University (ANU) rolls back the curtain on half a century of evidence detailing the impact of climate change on more than 60 different bird spe… [+3458 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Avian secret: The key to agile bird flight is switching quickly between stable and unstable gliding - Phys.org", "description": "While it had been assumed that unstable gliding was the key to agility in bird flight, a collaboration between aerospace engineers at the University of Michigan and biologists at the University of British Columbia revealed that stability plays a role.", "url": "https://phys.org/news/2022-03-avian-secret-key-agile-bird.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/avian-secret-the-key-t.jpg", "publishedAt": "2022-03-09T16:49:40Z", "content": "While it had been assumed that unstable gliding was the key to agility in bird flight, a collaboration between aerospace engineers at the University of Michigan and biologists at the University of Br… [+4964 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Scientists plan to bring back extinct Christmas Island rat by gene-editing DNA - Daily Mail", "description": "It could be possible to bring back the extinct Christmas Island rat using the CRISPR gene editing technique, according to Dr Tom Gilbert at the University of Copenhagen.", "url": "https://www.dailymail.co.uk/sciencetech/article-10594185/Scientists-plan-bring-extinct-Christmas-Island-rat.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/09/16/55144063-0-image-a-20_1646843199986.jpg", "publishedAt": "2022-03-09T16:37:57Z", "content": "Scientists have revealed plans to bring back the extinct Christmas Island rat, 119 years after it was wiped out. \r\nIn a new paper, an international team of academics outline how the use of CRISPR a g… [+9348 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Original Buzz Aldrin moon walk photo sells for $7,700 at auction - Devdiscourse", "description": "A series of original NASA photographs from the Apollo missions sold for a total of 1.16 million Danish crowns ($171,831) in an auction in Copenhagen on Wednesday.  The 74 privately-owned photographs from the Apollo 8-17 missions included the famous one of Buz…", "url": "https://www.devdiscourse.com/article/technology/1955629-original-buzz-aldrin-moon-walk-photo-sells-for-7700-at-auction", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_33_56_2660097.png?width=920&format=jpeg", "publishedAt": "2022-03-09T16:14:22Z", "content": "A series of original NASA photographs from the Apollo missions sold for a total of 1.16 million Danish crowns ($171,831) in an auction in Copenhagen on Wednesday.\r\nThe 74 privately-owned photographs … [+1302 chars]"}, {"source": {"id": null, "name": "Hhmi.org"}, "author": null, "title": "When Ribosomes Collide: How Bacteria Clean Up After Molecular Crashes - Howard Hughes Medical Institute", "description": "Tiny cellular machines called ribosomes build proteins. When this building process goes awry in bacteria, ribosomes collide, triggering the arrival of a first responder molecule that begins a rescue operation.", "url": "https://www.hhmi.org/news/when-ribosomes-collide-how-bacteria-clean-after-molecular-crashes", "urlToImage": "https://www.hhmi.org/sites/default/files/ecdisomes-overview-952x480.jpg", "publishedAt": "2022-03-09T16:01:12Z", "content": "When ribosomes collide in the cells of complex organisms, from yeast to humans, they trigger a quality control process that keeps protein production on track. New work suggests that the collisions (a… [+5449 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A surprisingly soft mineral may control how Earth recycles rocks - Phys.org", "description": "The geological events we see on the surface of the Earth as mountains, volcanoes and earthquakes are expressions of processes that are happening deep in our planet. Here on the Earth's crust, we're part of a conveyor belt system called plate tectonics where o…", "url": "https://phys.org/news/2022-03-x-ray-view-subducting-tectonic-plates.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/x-ray-view-of-subducti.jpg", "publishedAt": "2022-03-09T16:00:07Z", "content": "The geological events we see on the surface of the Earth as mountains, volcanoes and earthquakes are expressions of processes that are happening deep in our planet. Here on the Earth's crust, we're p… [+7159 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "An 'oracle' for predicting the evolution of gene regulation - Phys.org", "description": "Despite the sheer number of genes that each human cell contains, these so-called \"coding\" DNA sequences comprise just 1% of our entire genome. The remaining 99% is made up of \"non-coding\" DNA—which, unlike coding DNA, does not carry the instructions to build …", "url": "https://phys.org/news/2022-03-oracle-evolution-gene.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/an-oracle-for-predicti.jpg", "publishedAt": "2022-03-09T16:00:02Z", "content": "Despite the sheer number of genes that each human cell contains, these so-called \"coding\" DNA sequences comprise just 1% of our entire genome. The remaining 99% is made up of \"non-coding\" DNAwhich, u… [+8740 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA selects UK-based firm to develop equipment for extracting oxygen from Moon dust - Republic World", "description": "ESA has selected a team led by Thales Alenia Space in the UK for the design and development of an experimental payload to extract oxygen from the lunar soil.", "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/esa-selects-uk-based-firm-to-develop-equipment-for-extracting-oxygen-from-moon-dust-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/jrhv2l51zesjghuf_1646838839.jpeg", "publishedAt": "2022-03-09T15:56:00Z", "content": "The European Space Agency (ESA) has selected a team led by Thales Alenia Space in the UK for the design and development of an experimental device to extract oxygen from the lunar soil. Comprised of f… [+2139 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "China's Yutu 2 Rover Sends Back Image After 3 Years On Moon's Far Side | Science & Tech - Ommcom News", "description": "Beijing:  China's Yutu 2 rover, traversing the harsh environment of the moon's far side, has returned a view of its path over the last three years.Yutu 2 touched down on the lunar far side in January 2019 atop the Chang'e 4 lander, making the pair th", "url": "https://ommcomnews.com/science-tech/chinas-yutu-2-rover-sends-back-image-after-3-years-on-moons-far-side", "urlToImage": "https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/03/09200938/112b32f60ead923c97d3111bf99f9abb.jpg", "publishedAt": "2022-03-09T14:39:59Z", "content": "Beijing:  China’s Yutu 2 rover, traversing the harsh environment of the moon’s far side, has returned a view of its path over the last three years.\r\nYutu 2 touched down on the lunar far side in Janua… [+1659 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Past Climate Change May Have Influenced Fossilization - AZoCleantech", "description": "Climate change can impact life on Earth. According to a new study, it can also influence the dead.", "url": "https://www.azocleantech.com/news.aspx?newsID=31297", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31297_16468254146348397.jpg", "publishedAt": "2022-03-09T13:41:00Z", "content": "Climate change can impact life on Earth. According to a new study, it can also influence the dead.\r\nA fossil of a crustacean claw exoskeleton from the Posidonia Shale in Germany. Image Credit: Drew M… [+4228 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": null, "title": "New Study Sheds Light on Early Human Hair Evolution - Newswise", "description": "Researchers in the Primate Genomics Lab at the George Washington University examined what factors drive hair variation in a wild population of lemurs known as", "url": "https://www.newswise.com/articles/new-study-sheds-light-on-early-human-hair-evolution", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/03/09/6228aa613d400_MilneEdwardsSifaka-NRowe-AllTheWorldsPrimates.jpg&width=600&height=600", "publishedAt": "2022-03-09T13:05:00Z", "content": "Newswise — WASHINGTON (March 9, 2022) — Hair is an important feature of primate — including human — diversity and evolution, serving functions tied to thermoregulation, protection, camouflage and sig… [+2574 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Juno spacecraft clicks Jupiter`s moon casting shadow on the gas giant - WION", "description": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on Earth as when Moon comes between the Sun and Earth, the sha…", "url": "https://www.wionews.com/science/nasa-juno-spacecraft-clicks-jupiters-moon-casting-shadow-on-gas-giant-460580", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/03/09/246450-jupiter.jpg", "publishedAt": "2022-03-09T12:51:21Z", "content": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on… [+1028 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Rocket Stage-Lunar Collision Saga Continues: Space Junk Crashes Into Far Side of the Moon; Leaves a 65-Foot Wide Crater | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Usually, when a human-made object strikes a celestial object, it's by design. And that very fact makes this impact an unplanned experiment for scientists studying the Moon. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-09-space-junk-crashes-into-far-side-of-the-moon-leaves-a-65-foot-wide", "urlToImage": "https://s.w-x.co/in-Rocket-Booster-Crash-Moon.gif", "publishedAt": "2022-03-09T12:33:37Z", "content": "A wayward rocket stage on a collision path with the Moon had been gaining a lot of attention since the beginning of 2022. While the incident brought up heated discussion on the many dangers of space … [+2409 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "Study Using Microrobots Demonstrates How Animal Swarms Respond to Danger - AZoRobotics", "description": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Bechinger, a member of the Cluster of Excellence \"Centre for t…", "url": "https://www.azorobotics.com/News.aspx?newsID=12798", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ThumbForNews_12798_16468293543237810.jpg", "publishedAt": "2022-03-09T12:27:00Z", "content": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Be… [+4446 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "What Happens to Matter Swallowed by Black Holes Could Be Explained by Wormholes. ⋆ Ceng News - Ceng News", "description": "By considering wormholes, hypothetical bridges connecting distant points in the Universe, physicists may have discovered what happens to matter that", "url": "https://www.cengnews.com/news/what-happens-to-matter-swallowed-by-black-holes-could-be-explained-by-wormholes-311765.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/03/1646819975_black-hole.jpg", "publishedAt": "2022-03-09T12:06:55Z", "content": "By considering wormholes, hypothetical bridges connecting distant points in the Universe, physicists may have discovered what happens to matter that is swallowed by black holes.\r\nThe researchers from… [+3563 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Meet the 10-armed, 325-mn-year-old octopus fossil named after Biden - Deccan Herald", "description": "By Tom Fletcher for The Conversation In an ancient shallow bay of what is now Montana, the body of an octopus-like creature the size of a fist was buried on the seafloor. Some 325-328 million years later, a new paper published in Nature Communications provide…", "url": "https://www.deccanherald.com/science-and-environment/meet-the-10-armed-325-mn-year-old-octopus-fossil-named-after-biden-1089683.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/03/09/2022-03-08t162324z19686872rc2uxs98elwwrtrmadp3science-octopus1-1089683-1646825612.jpg", "publishedAt": "2022-03-09T11:33:32Z", "content": "By Tom Fletcher for The Conversation\r\nIn an ancient shallow bay of what is now Montana, the body of an octopus-like creature the size of a fist was buried on the seafloor.\r\nSome 325-328 million years… [+4499 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akash Dutta", "title": "NASA Psyche gets ready to fly to this special ASTEROID! Know how it can change humanity forever - HT Tech", "description": "The Psyche mission by NASA is almost ready after getting huge solar arrays installed in the spacecraft. The mission will see the Psyche spacecraft take a trip to a mysterious metal-rich asteroid", "url": "https://tech.hindustantimes.com/tech/news/nasa-psyche-gets-ready-to-fly-to-this-special-asteroid-know-how-it-can-change-humanity-forever-71646825065274.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/09/1600x900/missionswebNASAPsyche_1646825116356_1646825140464.jpg", "publishedAt": "2022-03-09T11:27:41Z", "content": "The ambitious project of NASA - The Psyche Mission - is almost ready for its launch after getting huge solar arrays installed to the spacecraft. The Psyche spacecraft is going to explore a metal-rich… [+2148 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Jets from the supermassive black hole created massive bubbles at Milky Way’s center - Tech Explorist", "description": "The structures themselves are 11 kiloparsecs tall.", "url": "https://www.techexplorist.com/jets-supermassive-black-hole-created-massive-bubbles-milky-ways-center/45179/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/massive-bubbles.jpg", "publishedAt": "2022-03-09T11:04:56Z", "content": "There are two enormous bubbles of scorching gas expanding from the core of the Milky Way has into near-galactic space. First seen in 2020 by the X-ray telescope eRosita, the bubbles extend far above … [+4919 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "The sun readies for its close-up as Europe's Solar Orbiter approaches - Space.com", "description": "No spacecraft before has taken a camera so close to the sun.", "url": "https://www.space.com/solar-orbiter-scorching-close-approach", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KuSDFUQZvWEKJyikdqV2xg-1200-80.jpg", "publishedAt": "2022-03-09T11:00:31Z", "content": "The European Solar Orbiter mission will make its closest approach to the sun later this month, promising to capture images that could unravel some of the mysterious behaviours of the star at the hear… [+4166 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "​​​​​​​Research sheds light on mysterious messenger RNA modifications - Phys.org", "description": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long remained a fundamental mystery in molecular biology.", "url": "https://phys.org/news/2022-03-mysterious-messenger-rna-modifications.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2015/messengerrna.png", "publishedAt": "2022-03-09T10:00:02Z", "content": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long… [+3900 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Genes Inherited From Mom or Dad Could Shape Behaviors - Technology Networks", "description": "According to new research led by scientists at University of Utah Health, each parent has their own impact on hormones and other chemical messengers that control mood and behavior.", "url": "https://www.technologynetworks.com/genomics/news/how-genes-inherited-from-mom-or-dad-could-shape-behaviors-359377", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359377/how-genes-inherited-from-mom-or-dad-could-shape-behaviors-359377-640x360.jpg?cb=20220309", "publishedAt": "2022-03-09T09:27:11Z", "content": "Parenting is not the only way moms and dads impact the behavior of their offspring. Genes matter, too. And although most of our genes are inherited in pairsone copy from each parentmoms and dads exer… [+5742 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Laurence Malcom", "title": "Earth will run out of oxygen: when, date - Persia Digest", "description": "Mediotempo Mexico City / 08.03.2022 21:44:20 over time, planet earth I encountered many climate-related problems, such as Natural disasersIn addition, of course, climate change. All of this, of course, has an effect In the planet’s atmosphere. It’s because of…", "url": "https://persiadigest.com/earth-will-run-out-of-oxygen-when-date/", "urlToImage": null, "publishedAt": "2022-03-09T04:07:10Z", "content": "over time, planet earth I encountered many climate-related problems, such as Natural disasersIn addition, of course, climate change. All of this, of course, has an effect In the planet’s atmosphere. … [+931 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "JHU-created material could lead to stronger, lighter and safer helmets and vehicles - EurekAlert", "description": "A team of Johns Hopkins University researchers created shock-absorbing material that protects like a metal, but is lighter, stronger, reusable. The new foam-like material could be a game-changer for helmets, body armor, and automobile and aerospace parts.", "url": "https://www.eurekalert.org/news-releases/945823", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/3a6d6eef-cb08-4c69-9c17-4a1bfc19c7f9/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-09T02:04:44Z", "content": "video: Liquid crystal elastomer structure tested in drop tester machine.view more \r\nCredit: Johns Hopkins University\r\nA team of Johns Hopkins University researchers created shock-absorbing material t… [+2435 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Fundamental growth limitations in Antarctic fish - Science Daily", "description": "Antarctic fish have adapted over millennia to survive in the freezing temperatures of the Southern Ocean. However, in doing so, they have lost their ability to grow at rates seen in their warmer water cousins, even when they are now held at the same water tem…", "url": "https://www.sciencedaily.com/releases/2022/03/220308202229.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T00:00:00Z", "content": "Antarctic fish have adapted over millennia to survive in the freezing temperatures of the Southern Ocean.However, in doing so, they have lost their ability to grow at rates seen in their warmer water… [+3662 chars]"}, {"source": {"id": null, "name": "Globelynews.com"}, "author": "Wendy Whitman Cobb", "title": "UAE Mars Mission Seeks to Bring Hope to More Places Than the Red Planet - Globely News", "description": "Abu Dhabi's Mars Mission could enable a new generation of space exploration.", "url": "https://globelynews.com/middle-east/uae-mars-mission-project-hope/", "urlToImage": "https://i0.wp.com/globelynews.com/wp-content/uploads/2019/05/Omran_Sharaf_at_Hope_Scientific_Mission_Announcement_Event-e1561572802143.jpg?resize=1000%2C563&ssl=1", "publishedAt": "2022-03-08T22:36:10Z", "content": "On July 14, a new Mars-bound spacecraft will launch from Japan. While several Mars missions are planned to launch over the next month, what makes this different is whos launching it: the United Arab … [+4682 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Sound can stimulate blind retina to transmit signals to the brain via an ultrasonic retinal prosthesis - Medical Xpress", "description": "Retinal degenerative diseases, caused by progressive degeneration of the light-sensitive photoreceptors in the retina, is one of the major causes of vision loss and blindness, affecting tens of millions of people worldwide. Although the rods and cones which a…", "url": "https://medicalxpress.com/news/2022-03-retina-transmit-brain-ultrasonic-retinal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/retina.jpg", "publishedAt": "2022-03-08T21:27:18Z", "content": "Retinal degenerative diseases, caused by progressive degeneration of the light-sensitive photoreceptors in the retina, is one of the major causes of vision loss and blindness, affecting tens of milli… [+6117 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Check out 20 years of iconic images courtesy of NASA's Hubble telescope - TechSpot", "description": "The workhorse that is the Hubble Space Telescope has provided humanity with jaw-dropping images of our solar system and the universe at large for more than 30...", "url": "https://www.techspot.com/news/93698-check-out-20-years-iconic-images-courtesy-nasa.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/03/2022-03-08-image-36.jpg", "publishedAt": "2022-03-08T20:58:00Z", "content": "In brief: NASA is celebrating the 20th anniversary of the installation of the Advanced Camera for Surveys on the Hubble Space Telescope by looking back at some of the more than 125,000 pictures captu… [+2686 chars]"}, {"source": {"id": null, "name": "InsideHook"}, "author": "Tanner Garrity", "title": "Does NASA Have the Ability to Shoot Down a Life-Threatening Asteroid? - InsideHook", "description": "If \"Don't Look Up\" happens in real life, NASA does have some options for dangerous asteroids and comets that approach Earth.", "url": "https://www.insidehook.com/daily_brief/science/nasa-shoot-down-asteroids", "urlToImage": "https://www.insidehook.com/wp-content/uploads/2022/03/hero-1.jpg?w=1200", "publishedAt": "2022-03-08T20:44:13Z", "content": "Considering that in the last two years we’ve seen six million people die from a global virus, a mob of Americans attack the Capitol Building and the first major land war in Europe since the end of Wo… [+4429 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Meet the project manager working to develop the rocket that will bring Mars samples to Earth - Phys.org", "description": "Right now, some 182 million miles (293 million kilometers) separate the red clay of Alabama from the dusty red planet Mars. But groundbreaking flight hardware developed at NASA's Marshall Space Flight Center in Huntsville, Alabama, will soon close that distan…", "url": "https://phys.org/news/2022-03-rocket-mars-samples-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasas-angie-jackman-wo.jpg", "publishedAt": "2022-03-08T19:49:09Z", "content": "Right now, some 182 million miles (293 million kilometers) separate the red clay of Alabama from the dusty red planet Mars. But groundbreaking flight hardware developed at NASA's Marshall Space Fligh… [+4668 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA's Mars rover Perseverance snags 7th Red Planet rock sample - Space.com", "description": "Perseverance will grab one more sample from its current site and then head toward an ancient river delta.", "url": "https://www.space.com/mars-rover-perseverance-collects-7th-sample", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wdpjD42nrdoFR5fbZFy9VY-1200-80.jpeg", "publishedAt": "2022-03-08T19:45:26Z", "content": "NASA's Perseverance rover now has seven Mars rock samples in its collection.\r\nThe car-sized robot drilled into another Martian rock and socked away the resulting core, mission team members announced … [+2534 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's NICER Telescope Sees Hot Spots Merge on a Magnetar - NASA", "description": "For the first time, NASA’s Neutron star Interior Composition Explorer (NICER) has observed the merging of multimillion-degree X-ray spots on the surface of a magnetar, a supermagnetized stellar core no larger than a city.", "url": "https://www.nasa.gov/feature/goddard/2022/nasa-s-nicer-telescope-sees-hot-spots-merge-on-a-magnetar/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/nicer_iss.gif", "publishedAt": "2022-03-08T18:54:29Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Engineering NASA's Return to the Moon - NASA", "description": "These engineers developed and tested Space Launch System software that will tell the rocket how to operate for the first 8 minutes of Artemis during launch and ascent.", "url": "https://www.nasa.gov/image-feature/engineering-nasa-s-return-to-the-moon/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/ceb_2369.jpg", "publishedAt": "2022-03-08T16:31:10Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Tiny ‘skyscrapers’ help bacteria convert sunlight into electricity - India Education Diary", "description": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise ‘nano-housing’ where sun-loving bacteria can grow quickly. The researchers were then able to extract the bacteria’s waste electrons, left over from photo", "url": "https://indiaeducationdiary.in/university-of-cambridge-tiny-skyscrapers-help-bacteria-convert-sunlight-into-electricity/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg", "publishedAt": "2022-03-08T16:21:03Z", "content": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise nano-housing where sun-loving bacteria can grow quickly. The researchers were then able to extract the… [+3824 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Traces of life in the Earth's deep mantle - Science Daily", "description": "The rapid development of fauna 540 million years ago has permanently changed the Earth - deep into its lower mantle. A team has now found traces of this development in rocks from this zone.", "url": "https://www.sciencedaily.com/releases/2022/03/220308102802.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T16:09:07Z", "content": "The rapid development of fauna 540 million years ago has permanently changed the Earth -- deep into its lower mantle. A team led by ETH researcher Andrea Giuliani found traces of this development in … [+3933 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Animals evolved the ability to gallop 472 million years ago - Phys.org", "description": "Few human adults gallop; the equine gait tends to be the preserve of little kids mimicking horses or exercise classes. But for camels, lions and giraffes, galloping is a key fixture of their repertoire as they shift up through the gears. However, Eric McElroy…", "url": "https://phys.org/news/2022-03-animals-evolved-ability-gallop-million.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/animals-evolved-the-ab.jpg", "publishedAt": "2022-03-08T15:57:32Z", "content": "Stochastic character mapping for the best fit evolutionary model (ARD) showing the probability of having an asymmetrical gait. Branch color is the probability of having an asymmetrical gait (red) or … [+4600 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Using Plankton Shells to Gauge the Accuracy of Climate Models - AZoCleantech", "description": "Earth scientists have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s history. The results from this study help bridge the gap between empirical observations and existing cli…", "url": "https://www.azocleantech.com/news.aspx?newsID=31292", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31292_16467543670315250.jpg", "publishedAt": "2022-03-08T15:50:57Z", "content": "Earth scientists in the United States and the United Kingdom have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s … [+5395 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's Mars rover reveals new features on the red planet - CGTN", "description": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist on Monday.", "url": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/index.html", "urlToImage": "https://news.cgtn.com/news/2022-03-08/China-s-Mars-rover-reveals-new-features-on-the-red-planet--18eZg7fXTPi/img/3fdec88f93ed474187756d7b39fed3bb/3fdec88f93ed474187756d7b39fed3bb-750.png", "publishedAt": "2022-03-08T15:00:57Z", "content": "Initial data collected by China's Mars rover Zhurong suggests the landscape it has traveled has been subject to long periods of weathering in the past by wind and even water, reported New Scientist o… [+1163 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telanganatoday", "title": "Now, you can send your name to Space - Telangana Today", "description": "Hyderabad: If it has been your dream to fly to Space, then there is one way to at least partially fulfill it. Now, you can send your name to Space – all thanks to a new initiative by the National Aeronautics and Space Administration (NASA). All you have to do…", "url": "https://telanganatoday.com/now-you-can-send-your-name-to-space", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/03/Boarding-pass.jpg", "publishedAt": "2022-03-08T13:11:58Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "It seemed like the most dangerous asteroid in a decade, but it definitely won't hit Earth - Space.com", "description": "The asteroid threatened to hit Earth next year, not giving enough time for a deflection mission.", "url": "https://www.space.com/most-dangerous-asteroid-in-decade-miss-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vPsFVcbBycuGt9qYUSV6Ca-1200-80.jpg", "publishedAt": "2022-03-08T11:00:14Z", "content": "A recently discovered asteroid seemed to be on a trajectory to hit Earth next year, but orbit recalculation eventually revealed it will miss our planet. \r\nThe 230-feet-wide (70 meters) asteroid\r\n 202… [+3014 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Elon Musk's SpaceX Launched 646 Satellites in 2021 As Part of Starlink Internet Project: Report | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "- Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-08-elon-musks-spacex-launched-646-starlink-satellites-in-2021-report", "urlToImage": "https://s.w-x.co/in-satellite%20%281%29.jpg", "publishedAt": "2022-03-08T10:57:59Z", "content": "Tech billionaire Elon Musk-led SpaceX launched 646 Starlink satellites in 2021, marking a 48.9% increase in its March 2021 satellite population of 1,322, according to a report.\r\nIn the past 18 months… [+1248 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Scientists significantly improved micro-computed tomography - Tech Explorist", "description": "Advances in micro-computed tomography.", "url": "https://www.techexplorist.com/scientists-significantly-improved-micro-computed-tomography/45154/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/micro-computed-tomography-scanner.jpg", "publishedAt": "2022-03-08T10:57:30Z", "content": "Also known as microtomography, Micro-computed tomography (Micro-CT) is a 3D imaging technique that generates 3D images of the internal structure of samples with small dimensions. It is generally used… [+3475 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Chandrayaan-2 makes first-of-its-kind observations below Moon’s surface - DNA India", "description": "The Chandrayaan 2 spectrometer has made the first observations of the global distribution of Argon-40 in the Exosphere of the Moon.", "url": "https://www.dnaindia.com/science/report-chandrayaan-2-makes-first-of-its-kind-observations-below-moon-s-surface-2938438", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/03/08/1025211-1005679-chandrayaan-2.jpg", "publishedAt": "2022-03-08T09:58:00Z", "content": "The Chandra's Atmospheric Composition Explorer-2 (CHACE-2), a quadrupole mass spectrometer onboard Chandrayaan-2 mission, has made the first-of-its-kind observations of the global distribution of Arg… [+3942 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Curiosity rover spotted a beautiful “flower” on Mars - The Times Hub", "description": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens. Despite the fact that this object is very similar to terrestrial coral, it is …", "url": "https://thetimeshub.in/curiosity-rover-spotted-a-beautiful-flower-on-mars", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/03/rover-curiosity-zafiksiroval-krasivyj-cvetok-na-marse-28e0336.jpg", "publishedAt": "2022-03-08T09:30:05Z", "content": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens.\r\nDespite the fact … [+1380 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "US Wants To Send A Satellite To Patrol The Space Around Moon - Indiatimes.com", "description": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military capabilities to monitor the space beyond between Earth and Mo…", "url": "https://www.indiatimes.com/technology/science-and-future/us-satellite-to-patrol-moon-563914.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage11-copy_6227156dc6715.jpg", "publishedAt": "2022-03-08T08:39:21Z", "content": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military c… [+1864 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "Neurons Involved in Memory Recall Identified; Could Inform Therapeutic Strategies - Genetic Engineering & Biotechnology News", "description": "Researchers discover neurons that separate experience into segments, then help the brain \"time travel\" and remember.", "url": "https://www.genengnews.com/topics/translational-medicine/neurons-involved-in-memory-recall-identified-could-inform-therapeutic-strategies/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2018/08/Feb14_2018_Getty_478186687_MemoryLossBrain_6006417318918-2.jpg", "publishedAt": "2022-03-08T08:00:34Z", "content": "Researchers headed by a team at Cedars-Sinai have discovered two types of brain cells that play a key role in dividing continuous human experience into distinct segments that can be recalled later. M… [+7774 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Largest Molecule yet Spotted in a Planet-forming Disc (ESOcast 253 Light) - European Southern Observatory (ESO)", "description": "How do the ingredients for life end up on planets? The discovery of the largest molecule ever found in a planet-forming disc is providing clues.More informat...", "url": "https://www.youtube.com/watch?v=uxMaFRxVLPY", "urlToImage": "https://i.ytimg.com/vi/uxMaFRxVLPY/maxresdefault.jpg", "publishedAt": "2022-03-08T08:00:31Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Biologists observe a molecular 'hand-off' that plays a key role in reproduction - Phys.org", "description": "Everyone considers sperm to be made exclusively by males. Well, it turns out that females also contribute to what makes a sperm a sperm.", "url": "https://phys.org/news/2022-03-biologists-molecular-hand-off-key-role.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/sperm.jpg", "publishedAt": "2022-03-08T07:44:09Z", "content": "Everyone considers sperm to be made exclusively by males. Well, it turns out that females also contribute to what makes a sperm a sperm.\r\nNearly 20% of couples in the United States fail to conceive n… [+4042 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "This SUV-sized spacecraft will find if Jupiter's icy Moon Europa has conditions for life - India Today", "description": "When fully assembled, this spacecraft will be as large as an SUV with solar arrays long enough to span a basketball court.", "url": "https://www.indiatoday.in/science/story/nasa-europa-clipper-mission-jupiter-conditions-for-life-1922035-2022-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Europa_Clipper-647x363.jpeg?J_nbAYnhe1NLTFQselNG4aTyBqX9tNBO", "publishedAt": "2022-03-08T05:14:20Z", "content": null}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Scientists open 50-year-old sample from Moon to study lunar conditions before sending humans back - India Today", "description": "The samples had remained locked so far after it was collected and sealed in the vacuum of the Moon by Apollo 17 astronauts.", "url": "https://www.indiatoday.in/science/story/nasa-moon-mission-artemis-lunar-surface-sample-minerals-1922016-2022-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Moon_sample-647x363.jpeg?6oAyMogHkHJXasb.xOtz_XBWdVmxNz3V", "publishedAt": "2022-03-08T04:44:08Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Increasing frequency of El Niño events expected by 2040 - Science Daily", "description": "Global weather fluctuations called El Niño events are likely to become more frequent by 2040, a new study shows.", "url": "https://www.sciencedaily.com/releases/2022/03/220307113147.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T01:42:58Z", "content": "Global weather fluctuations called El Niño events are likely to become more frequent by 2040, a new study shows.El Niño -- the unusual warming of surface waters in the eastern tropical Pacific Ocean … [+1925 chars]"}]}