{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Wu Jiayun", "title": "Study reveals seasonal peak photosynthesis hindered by late canopy development in northern ecosystems - Phys.org", "description": "The dynamic change mechanism of the seasonal peak rate of photosynthesis, also known as GPPmax (Maximum Gross Primary Productivity), has become a hot topic in carbon cycle research. In the Northern Hemisphere, the GPPmax of vegetation is closely related to th…", "url": "https://phys.org/news/2022-12-reveals-seasonal-peak-photosynthesis-hindered.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/study-reveals-seasonal.jpg", "publishedAt": "2022-12-29T18:26:03Z", "content": "The dynamic change mechanism of the seasonal peak rate of photosynthesis, also known as GPPmax (Maximum Gross Primary Productivity), has become a hot topic in carbon cycle research. In the Northern H… [+2948 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Mars Dust Storm Poses No Threat to Perseverance's Rock Samples, Says NASA — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: NASA is confident that the tubes or caches of valuable Mars samples will not be disturbed on the Red Planet by dust, wind, or darkness. NASA’s Perseverance rover has been dropping material caches in the shape of lightsabers on the surface of Ma…", "url": "https://www.transcontinentaltimes.com/mars-nasa-perseverances-rock-sample/", "urlToImage": "https://media.transcontinentaltimes.com/2022/12/NASA-Mars-300x169.jpg", "publishedAt": "2022-12-29T18:20:53Z", "content": "UNITED STATES: NASA is confident that the tubes or caches of valuable Mars samples will not be disturbed on the Red Planet by dust, wind, or darkness.\r\nNASA’s Perseverance rover has been dropping mat… [+2894 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Take solar system's grand tour as all eight planets came together on same night - Republic World", "description": "This rare phenomenon occurred on December 28 when Mercury, Venus, Mars, Jupiter and Saturn lined up in the night sky from the south-western horizon.", "url": "https://www.republicworld.com/science/space/take-solar-systems-grand-tour-as-all-eight-planets-came-together-on-same-night-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/p4p30rno0qa0mz6r_1672335752.jpeg", "publishedAt": "2022-12-29T17:47:00Z", "content": "The universe gave astronomy lovers a blockbuster year-ender as all eight planets of the solar system came together on the same night. This rare phenomenon occurred on December 28 when Mercury, Venus,… [+1257 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "TESS detects new 'hot Jupiter' exoplanet orbiting a rapidly rotating star - Phys.org", "description": "Using NASA's Transiting Exoplanet Survey Satellite (TESS), an international team of astronomers has detected a new \"hot Jupiter\" exoplanet. The newfound alien world, estimated to be nearly three times as massive as Jupiter, orbits a rapidly rotating star know…", "url": "https://phys.org/news/2022-12-tess-hot-jupiter-exoplanet-orbiting.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/tess-detects-new-hot-j.jpg", "publishedAt": "2022-12-29T16:50:01Z", "content": "Using NASA's Transiting Exoplanet Survey Satellite (TESS), an international team of astronomers has detected a new \"hot Jupiter\" exoplanet. The newfound alien world, estimated to be nearly three time… [+3125 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Awesome! Earth rising behind the Moon! A miracle? Check how NASA did it - HT Tech", "description": "NASA has shared a rare view of Earth rising behind the Moon! Here is how it captured the rare peekaboo moment when Earth popped up behind our Moon.", "url": "https://tech.hindustantimes.com/tech/news/awesome-earth-rising-behind-the-moon-a-miracle-check-how-nasa-did-it-71672331133631.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/29/1600x900/moon_earth_1672331275977_1672331284031_1672331284031.PNG", "publishedAt": "2022-12-29T16:28:56Z", "content": "In a rare moment that is simply amazing, NASA captured the Earth and the Moon in a way that seems simply miraculous. NASA has shared an animated video that shows our Earth rising behind the Moon. No … [+1996 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor, Tia Ghose", "title": "The 10 most massive black hole findings from 2022 - Livescience.com", "description": "From \"rogue\" black holes cruising the cosmos to one of the oldest black hole ancestors in this universe, this year's findings truly sucked us in.", "url": "https://www.livescience.com/black-hole-discoveries-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yxJUja5UHFs7wWiFz9Jd4T-1200-80.jpg", "publishedAt": "2022-12-29T16:00:00Z", "content": "Black holes are scary beasts — objects so massive that not even light can escape their clutches. \r\nIn 2022, we learned more about these gravitational monsters than ever before — from the first direct… [+8093 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Liu Jia", "title": "First results from LHAASO place tighter constraints on dark matter's lifetime - Phys.org", "description": "Scientists from the Large High Altitude Air Shower Observatory (LHAASO) have presented roughly 1.5 years of observational data, calculating new limits on the lifetime of heavy dark matter particles that have masses between 105 and 109 giga-electron volts.", "url": "https://phys.org/news/2022-12-results-lhaaso-tighter-constraints-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/first-results-from-lha.jpg", "publishedAt": "2022-12-29T15:56:03Z", "content": "Scientists from the Large High Altitude Air Shower Observatory (LHAASO) have presented roughly 1.5 years of observational data, calculating new limits on the lifetime of heavy dark matter particles t… [+2449 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Gesine Steiner", "title": "The vertebral column develops in the same way in modern animals as it did 300 million years ago - Phys.org", "description": "A study conducted by researchers from the Museum für Naturkunde in Berlin revealed the evolution of ossification patterns in the backbones of four-legged vertebrates. Antoine Verrière and his colleagues were able to reconstruct the patterns of how the bones i…", "url": "https://phys.org/news/2022-12-vertebral-column-modern-animals-million.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/the-vertebral-column-d.jpg", "publishedAt": "2022-12-29T15:51:03Z", "content": "A study conducted by researchers from the Museum für Naturkunde in Berlin revealed the evolution of ossification patterns in the backbones of four-legged vertebrates. Antoine Verrière and his colleag… [+4368 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Stargazers, Quadrantids Meteor Shower to peak soon, check when to catch it - HT Tech", "description": "Stargazers can have a mesmerizing view of the first meteor shower of 2023! Know when and how to catch the Quadrantids meteor shower.", "url": "https://tech.hindustantimes.com/tech/news/stargazers-quadrantids-meteor-shower-to-peak-soon-check-when-to-catch-it-71672328466017.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/29/1600x900/Meteor_Shower_1672328686949_1672328688064_1672328688064.jpg", "publishedAt": "2022-12-29T15:45:31Z", "content": "For stargazers, 2023 is set to start with a bang! Literally. They should get ready for an astounding view of the sky because the first meteor shower of 2023 is about to adorn the night skies. The Qua… [+2033 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "A star's dramatic transformation revealed in Hubble image - Devdiscourse", "description": "Read more about A star's dramatic transformation revealed in Hubble image on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2302838-a-stars-dramatic-transformation-revealed-in-hubble-image", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/29_12_2022_20_59_54_2380067.jpg?width=920&format=jpeg", "publishedAt": "2022-12-29T15:30:49Z", "content": "The NASA/ESA Hubble Space Telescope's flashback picture of the star V838 Monocerotis (V838 Mon) shows remarkable changes in the lighting of the encompassing dusty cloud formations. This phenomenon, k… [+1206 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Transcriptional adaptation found to play a role in inherited epigenetic changes - Phys.org", "description": "A team of researchers at the Max Planck Institute for Heart and Lung Research, working with a colleague from Temple University, has found that transcriptional adaptation appears to play a role in inherited epigenetic changes.", "url": "https://phys.org/news/2022-12-transcriptional-play-role-inherited-epigenetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/transcriptional-adapta.jpg", "publishedAt": "2022-12-29T15:30:01Z", "content": "A team of researchers at the Max Planck Institute for Heart and Lung Research, working with a colleague from Temple University, has found that transcriptional adaptation appears to play a role in inh… [+2676 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "China reveals ambitious plans for Asia's largest optical telescope - Interesting Engineering", "description": "The new telescope will have an aperture of 19.7 feet (6 meters) by 2024 while its mirror will be expanded to 26.2 feet (8 m) by 2030.", "url": "https://interestingengineering.com/innovation/asias-largest-optical-telescope", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/12/29/image/jpeg/O0EUoWrb47Gu7ttv3wqDUW1iQlVlKopPzqCzb7kW.jpg", "publishedAt": "2022-12-29T15:13:00Z", "content": "If all goes to plan, the novel facility would become the first world-class optical telescope in the eastern hemisphere capable of competing with facilities in the Western Hemisphere at sites such as … [+1119 chars]"}, {"source": {"id": null, "name": "Grid.news"}, "author": "Dan Vergano", "title": "The James Webb Space Telescope got us closer than ever to the Big Bang - Grid", "description": "From distant planets to the earliest galaxies, the James Webb Space Telescope has delivered for astronomers and the world. Here’s a big-picture look at the big pictures.", "url": "https://www.grid.news/story/science/2022/12/29/the-james-webb-space-telescope-took-us-closer-to-the-big-bang-than-ever-before-in-2022/", "urlToImage": "https://www.grid.news/resizer/pnS5eqPXtpjeVcrSPjQOxMVM7T4=/1200x630/filters:format(png):quality(100)/cloudfront-us-east-1.images.arcpublishing.com/thesummit/DNZBX5BR5ZHLHGMH5YBFVZLQYI.png", "publishedAt": "2022-12-29T14:30:58Z", "content": "Last Christmas, NASA delivered a gift to astronomers and humanity by launching the James Webb Space Telescope (JWST), a present that kept on giving the whole year through. The space agencys largest a… [+14229 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "2 possibly Earth-like worlds, just 16 light-years away - EarthSky", "description": null, "url": "https://earthsky.org/space/2-possibly-earth-like-worlds-gj-1002b-gj-1002c/", "urlToImage": "https://earthsky.org/upl/2022/12/Kepler-186f-artist-concept-April-18-2014.jpg", "publishedAt": "2022-12-29T13:04:07Z", "content": "View larger. | Nearby habitable planets? Astronomers have discovered 2 new Earth-mass exoplanets orbiting the habitable zone of a nearby red dwarf star. The star is less than 16 light-years away. Thi… [+6072 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tia Ghose", "title": "11 amazing Earth discoveries from 2022 - Livescience.com", "description": "Earth has been thoroughly explored, yet is still teeming with secrets. In 2022, scientists unearthed several of them.", "url": "https://www.livescience.com/11-amazing-earth-discoveries-from-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vdhBJ3s6Dq7L4kPKncZ2xA-1200-80.jpg", "publishedAt": "2022-12-29T13:00:44Z", "content": "Explorers have scaled the planet's highest peak and trawled its deepest ocean trench, yet Earth is still teeming with secrets waiting to be discovered. \r\nEvery year, scientists chip away at the myste… [+9526 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: NASA mulls SpaceX backup plan for crew of Russia's leaky Soyuz ship - Devdiscourse", "description": "Read more about Science News Roundup: NASA mulls SpaceX backup plan for crew of Russia's leaky Soyuz ship on Devdiscourse", "url": "https://www.devdiscourse.com/article/technology/2302591-science-news-roundup-nasa-mulls-spacex-backup-plan-for-crew-of-russias-leaky-soyuz-ship", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_06_2022_10_02_51_124674.webp?width=920&format=jpeg", "publishedAt": "2022-12-29T12:58:08Z", "content": "Following is a summary of current science news briefs.\r\nNASA mulls SpaceX backup plan for crew of Russia's leaky Soyuz ship\r\nNASA is exploring whether SpaceX's Crew Dragon spacecraft can potentially … [+458 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Godzilla in Space: ESO's Cone Nebula Image is a Stunner — Transcontinental Times - Transcontinental Times", "description": "GERMANY: Astronomers are in disbelief after seeing a magnificent photograph of a cone nebula in outer space. Cone Nebula resembles to Godzilla–like shape The image of cone nebula slightly resembles to Monstervese movie icon Godzilla. Beside the resemblance to…", "url": "https://www.transcontinentaltimes.com/godzilla-in-space-esos-cone-nebula/", "urlToImage": "https://media.transcontinentaltimes.com/2022/12/eso2215a-1200x675-Russell-Chattaraj.jpg", "publishedAt": "2022-12-29T11:37:58Z", "content": "GERMANY: Astronomers are in disbelief after seeing a magnificent photograph of a cone nebula in outer space.\r\nCone Nebula resembles to Godzilla–like shape\r\nThe image of cone nebula slightly resembles… [+2073 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "https://m.facebook.com/khushant.runghe", "title": "Top 6 Science and Technology Feats: Witness the Breathtaking Discoveries of 2022 — Transcontinental Times - Transcontinental Times", "description": "INDIA: Kannada Film Industry, aka Sandalwood, has always been the powerhouse of unique and intriguing films. Kannada Cinema has held a strong grasp on viewers since its inception. Still, in recent years it has literally mastered a hit recipe of blending massy…", "url": "https://www.transcontinentaltimes.com/sandalwood-gems-top-5-kannada-films-of-2022-so-far/", "urlToImage": "https://media.transcontinentaltimes.com/2022/11/Best-Kannada-Films-300x169.jpg", "publishedAt": "2022-12-29T10:52:00Z", "content": "INDIA: Kannada Film Industry, aka Sandalwood, has always been the powerhouse of unique and intriguing films. Kannada Cinema has held a strong grasp on viewers since its inception. Still, in recent ye… [+3427 chars]"}, {"source": {"id": null, "name": "Fatherly"}, "author": "Devan McGuinness", "title": "5 Lessons From NASA's Stunning New Images Of Winter On Mars - Fatherly", "description": "NASA's new photos of Mars show how the planet is transformed during the winter months. It offers great weird snowy lessons for kids and adults.", "url": "https://www.fatherly.com/news/lessons-winter-on-mars", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/12/28/c97fa4e8-357b-4c14-b063-40629128c5f8-1-pia25552.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-12-29T10:00:25Z", "content": "When most of us think of the planet Mars, we think of varied landscapes covered with dry, red dirt. But new photos released by NASA remind us theres way more to the Red Planet than that including sno… [+3263 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Parade Of Planets 2022: When Can They Be Seen Together And Aligned? - Nation World News", "description": "Before the end of the year, Earth will be able to witness a spectacle as the planets circle the Sun they will line up And humans will be able to see them", "url": "https://nationworldnews.com/parade-of-planets-2022-when-can-they-be-seen-together-and-aligned/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/12/Parade-of-Planets-2022-When-can-they-be-seen-together.jpeg", "publishedAt": "2022-12-29T09:42:49Z", "content": "Before the end of the year, Earth will be able to witness a spectacle as the planets circle the Sun they will line up And humans will be able to see them together in a phenomenon that, although it do… [+1354 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "700-foot asteroid strike: This horrific thing will happen on Earth to this city - HT Tech", "description": "An asteroid strike can be unimaginably devastating. While NASA is tracking most hazardous asteroids, you can still know about the destruction a 700-foot asteroid strike on Earth is capable of.", "url": "https://tech.hindustantimes.com/tech/news/700foot-asteroid-strike-this-horrific-thing-will-happen-on-earth-to-this-city-71672303775998.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/29/1600x900/Screenshot_2022-12-29_120450_1672303846428_1672303857870_1672303857870.png", "publishedAt": "2022-12-29T09:21:44Z", "content": "Asteroids and comets are the biggest threat to humanity in the entire universe. Our entire solar system is filled with these space rocks ranging in size from a few millimeters to hundreds of kilomete… [+2178 chars]"}, {"source": {"id": null, "name": "Craven Herald"}, "author": "Lesley Tate", "title": "Martin Lunn looks ahead to January and the night sky - Craven Herald", "description": "IT’S almost January, the beginning of another year, and what a start we will have astronomically.", "url": "https://www.cravenherald.co.uk/news/23203994.martin-lunn-looks-ahead-january-night-sky/", "urlToImage": "https://www.cravenherald.co.uk/resources/images/16286002/?type=og-image", "publishedAt": "2022-12-29T08:00:00Z", "content": "ITS almost January, the beginning of another year, and what a start we will have astronomically.\r\nIn the first few days we have the Moon appearing to pass by very close to the planet Mars. Although w… [+6999 chars]"}, {"source": {"id": null, "name": "Telecompaper"}, "author": null, "title": "SpaceX launches 54 next generation Starlink internet satellites - Telecompaper EN", "description": "Telecompaper - Telecom news and research", "url": "https://www.telecompaper.com/news/spacex-launches-54-next-generation-starlink-internet-satellites--1448679", "urlToImage": null, "publishedAt": "2022-12-29T07:53:40Z", "content": null}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Year Ender 2022: Artemis I To Webb’s First Full-Colour Images – Top NASA Accomplishments - ABP Live", "description": "NASA launched the world's most powerful rocket as part of Artemis I, and released the first full-colour images captured by the James Webb Space Telescope, the world's most powerful telescope, in 2022.", "url": "https://news.abplive.com/science/year-ender-2022-artemis-i-to-webb-s-first-full-colour-images-top-nasa-accomplishments-1572327", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/29/409ed9a53aa048211c47018b73d7c5951672297445990324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-12-29T07:07:27Z", "content": "NASA Accomplishments of 2022: The year 2022 was an important one for NASA because the space agency launched one of the most awaited missions of all time, Artemis I, and released the first full-colour… [+34149 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "GT Correspondent", "title": "Asteroid faster than a ballistic missile is on its way to Earth - Times Now", "description": "According to NASA, it is already on its way to Earth, travelling at a startling 51246 kilometres per hour, about five times the speed of a hypersonic ballistic missile.", "url": "https://www.timesnownews.com/technology-science/asteroid-faster-than-a-ballistic-missile-is-on-its-way-to-earth-article-96588572", "urlToImage": "https://static.tnn.in/thumb/msid-96588572,imgsize-100,updatedat-1672294905870,width-1280,height-720,resizemode-75/96588572.jpg", "publishedAt": "2022-12-29T06:21:45Z", "content": "CBSE Class 10 Date Sheet 2023 Released on cbse.gov.in, Exams begin Feb 15, end on Mar 21 with Mathematics"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Is there life on Mars? Nasa scientist answers - India Today", "description": "Several countries are currently engaged in exploring the Red Giant as it continues to throw challenges one after another.", "url": "https://www.indiatoday.in/science/story/is-there-life-on-mars-nasa-scientist-answers-2314867-2022-12-29", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/mars_15-sixteen_nine.jpg?VersionId=8s9RkEt55xvK5Ul7sEdwJ.DZrysPswpA", "publishedAt": "2022-12-29T05:57:08Z", "content": "By India Today Web Desk: As the Perseverance rover begins dropping titanium tubes on the surface of the Red Planet for future missions to be picked up, the foundational question of the Mars mission f… [+2604 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers unravel how cells use their sense of touch to make decisions during embryogenesis - News-Medical.Net", "description": "A research team at the Cluster of Excellence Physics of Life of TU Dresden and the University of California, Santa Barbara, reveals how cells sense their mechanical environment as they build tissues during embryogenesis.", "url": "https://www.news-medical.net/news/20221228/Researchers-unravel-how-cells-use-their-sense-of-touch-to-make-decisions-during-embryogenesis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/6/Anatomical_structure_of_biological_animal_cell_with_organelles-eranicle_1d73b50575dc4546875a4a2fc7d429a6-620x480.jpg", "publishedAt": "2022-12-29T04:44:00Z", "content": "A research team at the Cluster of Excellence Physics of Life of TU Dresden and the University of California, Santa Barbara, reveals how cells sense their mechanical environment as they build tissues … [+5284 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Monkey Experiment Reveals a Brain Switch That Could Be Useful For Space Travel - ScienceAlert", "description": "For humans to ever venture out among the stars, we will have to solve some hefty logistical problems.", "url": "https://www.sciencealert.com/monkey-experiment-reveals-a-brain-switch-that-could-be-useful-for-space-travel", "urlToImage": "https://www.sciencealert.com/images/2022/12/astronaut_sleeping_hibernation_pod.jpg", "publishedAt": "2022-12-29T03:14:18Z", "content": "For humans to ever venture out among the stars, we will have to solve some hefty logistical problems.\r\nNot the least of these is the travel time involved. Space is so large, and human technology so l… [+4101 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "We might finally know why Earth's north magnetic pole is moving - BGR", "description": "Scientists say the North Pole's location has moved drastically over the past several decades and they may finally know why.", "url": "https://bgr.com/science/we-might-finally-know-why-earths-north-magnetic-pole-is-moving/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/03/AdobeStock_194080021.jpeg?quality=82&strip=all", "publishedAt": "2022-12-29T03:07:00Z", "content": "When you think of the North Pole’s location, you probably imagine it is the centermost point at the top of our planet. However, the North Magnetic Pole has actually been moving gradually since away f… [+1983 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Carolyn Collins Petersen", "title": "Navigation Could be Done on the Moon Just by Looking at Nearby Landmarks - Universe Today", "description": "When Moon explorers go onto the surface, they'll use digital devices with landmark data provided by an AI program to help them navigate.", "url": "https://www.universetoday.com/159409/navigation-could-be-done-on-the-moon-just-by-looking-at-nearby-landmarks/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/08/artemis_humans_space_moon_gateway_main-scaled-e1672270273411.jpg", "publishedAt": "2022-12-28T23:32:55Z", "content": "When humans start living and working on the Moon in the Artemis missions, they’re going to need good navigational aids. Sure, they’ll have a GPS equivalent to help them find their way around. And, th… [+4862 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Record-breaking year for rocket launches from Brevard County - WKMG News 6 ClickOrlando", "description": "Brevard County has seen 60 rocket launches throughout 2022, bringing an average of more than one launch per week as they year comes to a close.", "url": "https://www.youtube.com/watch?v=VEJJKd6xUCU", "urlToImage": "https://i.ytimg.com/vi/VEJJKd6xUCU/maxresdefault.jpg", "publishedAt": "2022-12-28T22:25:32Z", "content": null}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Dinosaurs - A Mammal's Foot Found In A Dinosaur's Stomach 100 Million Years Ago - Nation World News", "description": "Paleontologists studying the fossil of a small four-winged dinosaur have found a fossilized mammoth leg in the predator's stomach.", "url": "https://nationworldnews.com/dinosaurs-a-mammals-foot-found-in-a-dinosaurs-stomach-100-million-years-ago/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/12/Dinosaurs-a-mammals-foot-found-in-a-dinosaurs-stomach-483x300.jpg", "publishedAt": "2022-12-28T22:19:28Z", "content": "Paleontologists studying the fossil of a small four-winged dinosaur have found a fossilized mammoth leg in the predator’s stomach.\r\nNow that we’ve grasped that there were feathered, more bird-like di… [+2545 chars]"}, {"source": {"id": null, "name": "Kjzz.org"}, "author": null, "title": "New evidence suggestions Mars may have earthquakes and volcanic eruptions - KJZZ", "description": "Earth has tectonic plates that move from an active interior. That lack of a dynamic surface on Mars for billions of years has led researchers to believe that the planet is geologically dead.Except, University of Arizona-led study is challenging that idea.", "url": "https://kjzz.org/content/1834636/new-evidence-suggestions-mars-may-have-earthquakes-and-volcanic-eruptions", "urlToImage": "https://media.kjzz.org/s3fs-public/mars_planet_getty_20221007.jpg", "publishedAt": "2022-12-28T22:16:27Z", "content": "Earth has tectonic plates that move from an active interior. That lack of a dynamic surface on Mars for billions of years has led researchers to believe that the planet is geologically dead.\r\nExcept,… [+1028 chars]"}, {"source": {"id": null, "name": "The Atlantic"}, "author": null, "title": "The Most Relatable Space Robot Has Died - msnNOW", "description": "NASA’s InSight mission was the little lander that kinda, mostly could.", "url": "https://www.theatlantic.com/science/archive/2022/12/nasa-insight-mars-lander/672594/?utm_source=msn", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA15KJJZ.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-12-28T20:37:19Z", "content": "Here is the happy part: For more than four years, a funky-looking spacecraft did something remarkable. It was in many ways just another robot, a combination of hardy materials, circuits, and sensors … [+6087 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Eight Ways Students Can Dive Into NASA STEM in 2023 - NASA", "description": "Here are some fun and engaging NASA STEM resources to bring the excitement of space exploration into your classroom or to learners at home in 2023.", "url": "https://www.nasa.gov/feature/eight-ways-students-can-dive-into-nasa-stem-in-2023/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/kathylueders_students2launch_aug2022.jpg", "publishedAt": "2022-12-28T18:45:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "We've Never Found Anything Like The Solar System. Is It a Freak in Space? - ScienceAlert", "description": "Since the landmark discovery in 1992 of two planets orbiting a star outside of our Solar System, thousands of new worlds have been added to a rapidly growing list of 'exoplanets' in the Milky Way galaxy.  We've learnt many things from this vast catalogue...", "url": "https://www.sciencealert.com/weve-never-found-anything-like-the-solar-system-is-it-a-freak-in-space", "urlToImage": "https://www.sciencealert.com/images/2022/12/TheSolarSystemInBoldColorShowingRedGlowingSunOnLeft.jpg", "publishedAt": "2022-12-28T17:00:16Z", "content": "Since the landmark discovery in 1992of two planets orbiting a star outside of our Solar System, thousands of new worlds have been added to a rapidly growing list of 'exoplanets' in the Milky Way gala… [+11912 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "The James Webb Space Telescope can use its full name in British journal again after controversy - Space.com", "description": "The Royal Astronomical Society briefly mandated that all journal articles refer to the observatory as 'JWST', before NASA cleared former chief James Webb of persecuting queer staffers.", "url": "https://www.space.com/james-webb-space-telescope-royal-astronomical-society", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZW5sYRKFkqfyqu4LL4DLJH-1200-80.jpg", "publishedAt": "2022-12-28T17:00:00Z", "content": "A prominent British scientific society is allowing James Webb's name to appear in academic papers again, following an \"apparent failure\" to investigate the former NASA chief's past.\r\nThe Royal Astron… [+2973 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists uncover a novel cellular mechanism that regulates aging and fertility - Phys.org", "description": "Research at the Institute of Molecular Biology and Biotechnology (IMBB) of the Foundation for Research and Technology-Hellas (FORTH), published today in the journal Nature Aging, reveals a fundamental quality control mechanism that operates in cells to safegu…", "url": "https://phys.org/news/2022-12-scientists-uncover-cellular-mechanism-aging.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/forth-imbb-scientists.jpg", "publishedAt": "2022-12-28T16:45:03Z", "content": "Research at the Institute of Molecular Biology and Biotechnology (IMBB) of the Foundation for Research and Technology-Hellas (FORTH), published today in the journal Nature Aging, reveals a fundamenta… [+7167 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "How Fast Do Galaxies Move? - Nation World News", "description": "I understand that the question refers to the motion of galaxies with respect to the rest of the universe, for example, not to the rotation of a galaxy around", "url": "https://nationworldnews.com/how-fast-do-galaxies-move/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/12/How-fast-do-galaxies-move.jpg", "publishedAt": "2022-12-28T15:51:05Z", "content": "I understand that the question refers to the motion of galaxies with respect to the rest of the universe, for example, not to the rotation of a galaxy around its axis. The first thing I wanted to mak… [+5065 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Exotic clasts in Chang'e-5 samples indicate unexplored terrane on moon - Phys.org", "description": "The Chang'e-5 mission touched down in the Mons Rümker region of the northern Oceanus Procellarum of the moon and returned 1.731 kg of lunar regolith.", "url": "https://phys.org/news/2022-12-exotic-clasts-change-samples-unexplored.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/exotic-clasts-in-chang-2.jpg", "publishedAt": "2022-12-28T15:50:28Z", "content": "The Chang'e-5 mission touched down in the Mons Rümker region of the northern Oceanus Procellarum of the moon and returned 1.731 kg of lunar regolith.\r\nRecognizing exotic clasts (i.e., non-Chang'e-5 l… [+2851 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Jace Dela Cruz", "title": "Researchers Develop a Software that Transforms Drawings into Tiny Sculptures Made of DNA - Tech Times", "description": "This new open-source software enables users to convert drawings into DNA-based 3D structures.", "url": "https://www.techtimes.com/articles/285537/20221228/researchers-develop-software-drawings-tiny-sculptures-dna.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/418076/spain-technology-economy.jpg", "publishedAt": "2022-12-28T14:30:00Z", "content": "Researchers from Duke University and Arizona State University have produced tiny nanoscale structures such as bowls, vases, and housewares.\r\nHowever, these are no ordinary objects, for they are not m… [+2875 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Quadrantids meteor shower to light up skies next year. Check date, key details - The Economic Times", "description": "The Quadrantids meteor shower is known for its brilliant fireball meteors, which may produce up to 200 meteors per hour in a spectacular display. At its peak, it could expose 200 meteors every hour.", "url": "https://economictimes.indiatimes.com/news/international/us/quadrantids-meteor-shower-to-light-up-skies-next-year-check-date-key-details/articleshow/96575481.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96575681,width-1070,height-580,imgsize-3064,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-28T14:22:00Z", "content": "The Quadrantids, the first meteor shower of 2023, is going to light up our skies soon. Due to its high level of activity, the Quadrantids meteor shower is regarded as one of the greatest of the year.… [+1713 chars]"}, {"source": {"id": null, "name": "Hackster.io"}, "author": "Gareth Halfacree", "title": "NASA's NEO Surveyor Aims to Spot Potentially Dangerous Near-Earth Objects Before They're a Problem - Hackster.io", "description": "Designed to scan for large NEOs in infrared, NEO Surveyor is the first space telescope built specifically to keep the planet safe.", "url": "https://www.hackster.io/news/nasa-s-neo-surveyor-aims-to-spot-potentially-dangerous-near-earth-objects-before-they-re-a-problem-966c0e717946", "urlToImage": "https://hackster.imgix.net/uploads/attachments/1540319/_OEk0gXpfN4.blob?auto=compress%2Cformat&w=600&h=450&fit=min", "publishedAt": "2022-12-28T14:19:17Z", "content": "NASA's NEO Surveyor, the world's first space telescope purpose-built for finding and tracking potentially dangerous near-Earth objects (NEOs), has passed its technical review bringing it a step close… [+2503 chars]"}, {"source": {"id": null, "name": "Wbaa.org"}, "author": "Benjamin Thorp", "title": "Scientists have recorded the first-ever sound of a dust devil on Mars - WBAA", "description": "Scientists have recorded the first-ever sound of a dust devil on Mars", "url": "https://www.wbaa.org/purdue-news/2022-12-28/scientists-have-recorded-the-first-ever-sound-of-a-dust-devil-on-mars", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/e59cc9d/2147483647/strip/true/crop/800x420+0+57/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F51%2F25%2F60e7ce5e4f56a1b1f7f89b22f3a0%2Fwiens-marslo.jpg", "publishedAt": "2022-12-28T13:47:00Z", "content": "Scientists have recorded the first-ever sound of a dust devil on Mars.\r\nThe recording sounds like it could have been made in any windy corner of Earth - but it was actually captured over 54 million m… [+1619 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Nergis Firtina", "title": "A crocodile that coexisted with dinosaurs is discovered by scientists - Interesting Engineering", "description": "University of Sao Paulo researchers defined a new crocodile species that lived alongside dinosaurs.", "url": "https://interestingengineering.com/science/a-crocodile-that-coexisted-with-dinosaurs-is-discovered-by-scientists", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/12/28/image/jpeg/nCYSxK5hFjJTI8ctI9DskL5pNz4i0oplMjwyF0GB.jpg", "publishedAt": "2022-12-28T13:39:00Z", "content": "As reported by the Independent, the fossil, which is primarily made up of a partially intact skull roof and most of the reptile's right side, was discovered in 1987 in the Monte Alto district of the … [+1675 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "What time will International Space Station astronauts celebrate New Year? - msnNOW", "description": "New Year arrives at different times around the world. So what time will astronauts on the International Space Station, whizzing around the Earth 16 times a day, celebrate the new year?", "url": "https://indianexpress.com/article/technology/science/international-space-station-new-year-time-8348783/", "urlToImage": "https://images.indianexpress.com/2022/12/International-space-station-expedition-28-20221228.jpg", "publishedAt": "2022-12-28T13:22:00Z", "content": "People across the world will celebrate the arrival of the new year at different times of the day as the clock strikes 12 for their timezone. But what about the International Space Station (ISS) astro… [+1287 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "South Korea’s lunar orbiter Danuri enters Moon’s orbit - The Siasat Daily", "description": "South Korea's unmanned space vehicle Danuri has successfully entered the orbit of the Moon earlier than planned, the science ministry said", "url": "https://www.siasat.com/south-koreas-lunar-orbiter-danuri-enters-moons-orbit-2490113/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/01/Moon.jpg", "publishedAt": "2022-12-28T13:13:22Z", "content": "Seoul: South Korea’s unmanned space vehicle Danuri has successfully entered the orbit of the Moon earlier than planned, the science ministry said on Wednesday.\r\nDanuri, also known as the Korea Pathfi… [+2102 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Researchers investigate which animals perceive time the fastest - News9 LIVE", "description": "The scientists investigated the temporal perception of over 100 animals", "url": "https://www.news9live.com/science/researchers-investigate-which-animals-perceive-time-the-fastest-216847", "urlToImage": "https://media.news9live.com/h-upload/2022/12/28/596846-david-clode-fgywskt10xw-unsplash.jpg", "publishedAt": "2022-12-28T12:02:04Z", "content": "Researchers have investigated how quickly different animals experience the passing of time, or the rate at which they can perceive changes in the world, known as temporal perception. Over 100 differe… [+1686 chars]"}, {"source": {"id": null, "name": "BOOM"}, "author": "The Conversation", "title": "India's Private Spaceship To SpaceX Starship: 5 Missions To Watchout For In 2023 | BOOM - BOOM", "description": "The year 2023 is set to be another busy one for space exploration. Here are five of the most exciting missions to watch out for.", "url": "https://www.boomlive.in/explainers/space-new-exploration-2023-india-spacex-starship-20577", "urlToImage": "https://www.boomlive.in/h-upload/2022/12/28/995128-nasa-00a0.jpg", "publishedAt": "2022-12-28T10:50:13Z", "content": "Gareth Dorrian, University of Birmingham and Ian Whittaker, Nottingham Trent UniversityIt's been an eventful year for space exploration, with successes including the completion of Nasa's Artemis 1 mi… [+6472 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Eirian Jane Prosser", "title": "The astronomical events you don't want to miss in 2023 - Daily Mail", "description": "From meteor showers to solar eclipses, to crescent moons peaking out beside Saturn and Venus, there is a lot the sky you do not want to miss in 2023.", "url": "https://www.dailymail.co.uk/sciencetech/article-11554981/The-astronomical-events-dont-want-miss-2023.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/19/18/65742747-0-image-a-14_1671473521467.jpg", "publishedAt": "2022-12-28T10:40:54Z", "content": "From meteor showers to solar eclipses, to crescent moons peaking out beside Saturn and Venus, there is a lot going on in the sky you do not want to miss in 2023. \r\nThe year will kick off with the ann… [+11888 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Wind Farms Could Be Key To Power Future Mars Expeditions | Weather.com - The Weather Channel", "description": "While Mars' frequent dust storms might be a solar panel's bane, it only helps amp up energy generation for wind farms.", "url": "https://weather.com/en-IN/india/space/news/2022-12-28-wind-farms-could-be-key-to-power-future-mars-expeditions", "urlToImage": "https://s.w-x.co/in-wind_farm_mars.jpg", "publishedAt": "2022-12-28T07:28:09Z", "content": "\"My battery is low and it's getting dark.\"\r\n\"My power's really low, so this may be the last image I can send. Don't worry about me though: my time here has been both productive and serene. If I can k… [+3959 chars]"}, {"source": {"id": null, "name": "Yomiuri.co.jp"}, "author": null, "title": "Mars InSight lander retires after 4-year mission - The Japan News", "description": "LOS ANGELES (Reuters) — NASA has formally retired its Mars InSight lander, the first robotic probe specially designed to study the deep interior of a distant world, four years after it arrived on the surface of the red planet, the U.S. space agency announced …", "url": "https://japannews.yomiuri.co.jp/science-nature/science/20221228-80348/", "urlToImage": "https://japannews.yomiuri.co.jp/wp-content/uploads/2022/12/10224316.jpg", "publishedAt": "2022-12-28T07:24:00Z", "content": "NASA / JPL-Caltech / Handout via Reuters / FileThe Instrument Deployment Camera, located on the robotic arm of NASAs InSight lander, took this image of the Martian surface on Nov. 26, 2018.\r\nReuters\r… [+2660 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Astronomers discovered the Milky Way's ancient heart - BGR", "description": "Astronomers say they have now discovered the ancient Milky Way core from when our galaxy was still new to the universe.", "url": "https://bgr.com/science/astronomers-discovered-the-milky-ways-ancient-heart/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/07/ap_19159445054533.jpg?quality=82&strip=all", "publishedAt": "2022-12-28T03:05:00Z", "content": "The Milky Way is over 13 billion years old, and in that time, it has apparently had more than one galactic core. At least, that’s what a new study suggests. The study in question was published in The… [+1941 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "NASA, Alaska researchers to scan asteroid with radio waves - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-12-28T01:32:40Z", "content": ""}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Spiral Galaxies Like Ours Can Turn Into Fuzzy Blobs, And Now We Know How - ScienceAlert", "description": "Not all galaxies are built alike.", "url": "https://www.sciencealert.com/spiral-galaxies-like-ours-can-turn-into-fuzzy-blobs-and-now-we-know-how", "urlToImage": "https://www.sciencealert.com/images/2022/12/hubble-grand-design.jpg", "publishedAt": "2022-12-28T01:21:57Z", "content": "Not all galaxies are built alike.\r\nThere are spectacular, sparkling spirals with graceful arms curling elegantly out into space. There are small, indistinct blobs. There are strange rings with hollow… [+3688 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study Sheds Lights on New Insights into the Timeline of Mammal Evolution - LatestLY", "description": "Get latest articles and stories on Science at LatestLY.  A new study, published today in the journal Nature, has provided the most detailed timeline of mammal evolution to date.", "url": "https://www.latestly.com/agency-news/science-news-study-sheds-lights-on-new-insights-into-the-timeline-of-mammal-evolution-4641524.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/12/ANI-20221227210630-588x441.jpg", "publishedAt": "2022-12-28T01:00:27Z", "content": "Washington [US], December 28 (ANI): A new study, published today in the journal Nature, has provided the most detailed timeline of mammal evolution to date.\r\nThe research describes a new and fast com… [+4583 chars]"}, {"source": {"id": null, "name": "Dbrnews.com"}, "author": "CORINNE PURTILL Los Angeles Times", "title": "Dinosaurs were in their prime, not in decline, when fateful asteroid hit - Denison Bulletin Review", "description": "Paleontologists agree that a massive asteroid strike triggered the end of the dinosaurs, but a debate has persisted over the reptiles’ overall state at the time of the fateful collision.", "url": "https://dbrnews.com/news/world/dinosaurs-were-in-their-prime-not-in-decline-when-fateful-asteroid-hit/article_85a5a3dc-3b9a-533c-91d8-48711d63cec9.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/dbrnews.com/content/tncms/assets/v3/editorial/8/5a/85a5a3dc-3b9a-533c-91d8-48711d63cec9/63ab213cb64db.preview.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2022-12-27T21:45:00Z", "content": "Paleontologists agree that a massive asteroid strike triggered the end of the dinosaurs, but a debate has persisted over the reptiles overall state at the time of the fateful collision.\r\nWere non-avi… [+26593 chars]"}, {"source": {"id": null, "name": "Hawaiipublicradio"}, "author": "HPR News Staff", "title": "UH astronomers discover distant planet is doomed (in 2.5 million years) - Hawaiipublicradio", "description": "Astronomers at the University of Hawaiʻi are expecting a distant planet to collide with its star.", "url": "https://www.hawaiipublicradio.org/local-news/2022-12-27/uh-astronomers-discover-distant-planet-is-doomed", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/deed9d5/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F3e%2Fca9b30504e47b133e071867fea22%2Fkepler-1658b.jpg", "publishedAt": "2022-12-27T20:40:00Z", "content": "Discovered in 2019, Kepler 1658b has a similar size and mass to Jupiter.\r\nBut new findings by University of Hawaii astronomers show the orbit around its star is decreasing, meaning it's on a slow col… [+839 chars]"}, {"source": {"id": null, "name": "Bbntimes.com"}, "author": "Emily Newton", "title": "Rocket Science: Understanding How Rockets Work - BBN Times", "description": "Ever wonder how rockets work or what it takes to get astronauts to the Moon or Mars?", "url": "https://www.bbntimes.com/science/rocket-science-understanding-how-rockets-work", "urlToImage": "https://www.bbntimes.com/images/articles/global-economy/Understanding_How_Rockets_Work.jpg", "publishedAt": "2022-12-27T20:37:30Z", "content": "Ever wonder how rockets work or what it takes to get astronauts to the Moon or Mars? \r\nRocket science may be complicated, but its easier to understand after learning about a few basic principles at p… [+6604 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Kiona Smith", "title": "Hubble spots a peculiar galaxy with long, twisting space tentacles - Inverse", "description": "The Hubble Space Telescope is surveying some of the weirdest galaxies in the universe.", "url": "https://www.inverse.com/science/peculiar-galaxies", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/12/27/ea64a172-8e08-40d0-93fe-6914bd3b5baa-potw2252a.jpg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.516&fp-y=0.7286", "publishedAt": "2022-12-27T18:45:25Z", "content": "ESO 415-19 is a\r\n galaxy with a past, but were not here to judge.\r\nAt some point in its history, ESO 415-19 had a close encounter with another galaxy, and its never been the same since. The gravity f… [+2673 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "NASA Releases Fresh Image of Rossette Nebula — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: The National Aeronautics and Space Administration (NASA) Chandra X-ray Observatory has released a composite image of Rosette Nebula.", "url": "https://www.transcontinentaltimes.com/nasa-releases-image-rossette-nebula/", "urlToImage": "https://media.transcontinentaltimes.com/2022/12/Rossette-Nebula-300x169.jpg", "publishedAt": "2022-12-26T08:55:16Z", "content": "UNITED STATES: The National Aeronautics and Space Administration (NASA) Chandra X-ray Observatory has released a composite image that depicts a section of the 5,000-light-year-distance Rosette Nebula… [+1683 chars]"}]}