{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Forbes"}, "author": "Elizabeth Howell", "title": "Water Is Not Your Friend While Getting Ready For Bed In Space - Forbes", "description": "Space residents need to take extra precautions to stop water from getting into their house's innards.", "url": "https://www.forbes.com/sites/elizabethhowell1/2022/05/02/water-is-not-your-friend-while-getting-ready-for-bed-in-space/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62700805f43c83d7d6b1ef86/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-05-02T20:00:02Z", "content": "European Space Agency Matthias Maurer shows how to get ready for bed. His sleeping quarters are just ... [+] over his head.\r\nMatthias Maurer/ESA\r\nAs any homeowner would tell you, water is not your fr… [+1680 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "May's lunar eclipse and a wild-card meteor shower may offer double spectacle - Space.com", "description": "It's going to be an exciting month!", "url": "https://www.space.com/lunar-eclipse-meteor-shower-may-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GWJhEgaiYiAorrWx7p9C2M-1200-80.jpg", "publishedAt": "2022-05-02T19:49:34Z", "content": "May offers an unusual skywatching bounty: the possibility of two major celestial highlights occurring within the span of a single month.\r\nThe first, a total lunar eclipse\r\n, is a certainty, but the s… [+6689 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Automated synthesis allows for discovery of unexpected charge transport behavior in organic molecules - Nanowerk", "description": "Scientists have demonstrated a major breakthrough in using automated synthesis to discover new molecules for organic electronics applications. Using automated synthesis, the team was able to rapidly scan through a library of molecules with precisely defined s…", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60532.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60532.jpg", "publishedAt": "2022-05-02T19:41:21Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "NASA: Webb Telescope Is Fully Aligned and Perfectly Sharp - ExtremeTech", "description": "NASA's James Webb Space Telescope is now aligned and looking good. The successor to Hubble is almost ready to begin observations.", "url": "https://www.extremetech.com/extreme/334899-nasa-webb-telescope-is-fully-aligned-and-perfectly-sharp", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2022/04/webb-illustration-1041-640x353.jpg", "publishedAt": "2022-05-02T19:41:00Z", "content": "When it was on the ground, the James Webb Space Telescope was the cause of much hand-wringing and debate at NASA. The project encountered numerous setbacks and cost overruns, but it has all paid off … [+2708 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "We've created a device that could allow instant disease diagnosis – while fitting inside your phone lens - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "Melbourne, May 2: Infectious diseases such as malaria remain a leading cause of death in many regions. This is partly because people there don’t have access to medical diagnostic tools that can detect these diseases (along with a range of non-infectious disea…", "url": "https://www.dailyexcelsior.com/weve-created-a-device-that-could-allow-instant-disease-diagnosis-while-fitting-inside-your-phone-lens/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/05/download-7-1.jpg", "publishedAt": "2022-05-02T18:37:14Z", "content": "Melbourne, May 2: Infectious diseases such as malaria remain a leading cause of death in many regions. This is partly because people there don’t have access to medical diagnostic tools that can detec… [+5009 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Rocket Lab plans launch, booster catch with helicopter after days of delays - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-05-02T18:07:26Z", "content": ""}, {"source": {"id": null, "name": "SlashGear"}, "author": "Nadeem Sarwar", "title": "Scientists Just Made A Big Discovery About The Earth's Crust - SlashGear", "description": "Scientists have learned new information about the history of our planet -- specifically about the makeup of the top layers, how they&#039;ve been moving, and when.", "url": "https://www.slashgear.com/850104/scientists-just-made-a-big-discovery-about-the-earths-crust/", "urlToImage": "https://www.slashgear.com/img/gallery/scientists-just-made-a-big-discovery-about-the-earths-crust/l-intro-1651514563.jpg", "publishedAt": "2022-05-02T18:05:00Z", "content": "According to SpaceRef, \"Earth's outer shell consists of about 15 shifting blocks of crust,\" that have been moving over millions of years to form the continents and unique landforms that currently exi… [+1235 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Massive Earthquake Swarm in Antartica Likely the Result of Giant Awakening Volcano - Galaxy Reporters", "description": "A colossal earthquake swarm was detected in Antarctica, which researchers say was likely the result of a long-dormant volcano awakening. An earthquake swarm refers to incidents in which many seismic events occur in the same small area over a relatively short …", "url": "https://galaxyreporters.com/massive-earthquake-swarm-in-antartica-likely-the-result-of-giant-awakening-volcano/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_1940380357-scaled.jpg", "publishedAt": "2022-05-02T18:03:18Z", "content": "A colossal earthquake swarm was detected in Antarctica, which researchers say was likely the result of a long-dormant volcano awakening.\r\nAn earthquake swarm refers to incidents in which many seismic… [+1340 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Millisecond pulsars may explain excess radiation from centre of Milky Way - News9 LIVE", "description": "A population of 100,000 pulsars may explain the phenomenon known as Galactic Centre Excess", "url": "https://www.news9live.com/science/millisecond-pulsars-may-explain-excess-radiation-from-centre-of-milky-way-167976", "urlToImage": "https://media.news9live.com/h-upload/2022/05/02/330534-pulsar-bannercropped.jpg", "publishedAt": "2022-05-02T17:47:55Z", "content": "Researchers have suggested a new explanation for an excess of gamm-ray emissions originating from the centre of the Milky Way, a phenomenon known as the Galactic Centre Excess. Gamma-rays have extrem… [+2046 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How the dinosaur extinction changed plant evolution - Phys.org", "description": "With the extinction of large, non-flying dinosaurs 66 million years ago, large herbivores were missing on Earth for the subsequent 25 million years. Since plants and herbivorous animals influence each other, the question arises whether, and how this very long…", "url": "https://phys.org/news/2022-05-dinosaur-extinction-evolution.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/dinosaur-extinction.jpg", "publishedAt": "2022-05-02T17:27:09Z", "content": "by German Centre for Integrative Biodiversity Research (iDiv) Halle-Jena-Leipzig With the extinction of large, non-flying dinosaurs 66 million years ago, large herbivores were missing on Earth for th… [+3658 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Studies find the seeds of a forest's renewal after wildfire, drought: Seed production of more than 700 trees species worldwide quantified, assessed with climate lens - Science Daily", "description": "By quantifying the seed production of more than 700 trees species worldwide and how each species' productivity can vary by location, two new studies can help boost the success of efforts to replant and restore forests after devastating wildfires, droughts or …", "url": "https://www.sciencedaily.com/releases/2022/05/220502125407.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-02T17:13:16Z", "content": "A forest's ability to regenerate after devastating wildfires, droughts or other disturbances depends largely on seed production. Findings from two new studies led by Duke University researchers could… [+4687 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Tiny sensor used to track the migratory patterns of monarch butterflies - Science Daily", "description": "Scientists have developed a tracking system that can be attached to monarch butterflies and transmit data about their location all throughout their three-month migratory journey south.", "url": "https://www.sciencedaily.com/releases/2022/05/220502120508.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-02T17:07:14Z", "content": "Millions of monarch butterflies migrate each fall to a specific cluster of mountain peaks in central Mexico. How exactly they navigate to their winter home, and the way they choose their path, is a t… [+3117 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Photonic slide rule: Simultaneous resolving of wavelength and polarization state - Phys.org", "description": "Mid-wavelength infrared (MWIR) is a unique regime with various potential applications in fingerprint detections. It is also one of three atmospheric transmission windows that shows significant possibilities in low-light-level night vision and free-space commu…", "url": "https://phys.org/news/2022-05-photonic-simultaneous-wavelength-polarization-state.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/photonic-slide-rulesim.jpg", "publishedAt": "2022-05-02T16:51:56Z", "content": "Figure 1. (a) The conventional slide rule (left) is driven by mechanical rotation and read out visually with an easy-to-use size. As an analog, an ultra-compact prototype of the photonic counterpart … [+5936 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A new strategy for active metasurface design provides a full 360° phase tunable metasurface - Science Daily", "description": "An international team of researchers has demonstrated a widely applicable methodology enabling a full 360° active phase modulation for metasurfaces while maintaining significant levels of uniform light amplitude. This strategy can be fundamentally applied to …", "url": "https://www.sciencedaily.com/releases/2022/05/220502120458.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-02T16:47:35Z", "content": "An international team of researchers led by Professor Min Seok Jang of KAIST and Professor Victor W. Brar of the University of Wisconsin-Madison has demonstrated a widely applicable methodology enabl… [+3807 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Study supports stronger conservation efforts Appalachians and the Gulf Coast, US - Science Daily", "description": "Study of Campanula americana supports strengthening conservation efforts in glacial refugia areas because of their high genetic diversity. Conservation of those areas in the southern Appalachians and the Gulf Coast has implications for other areas of the coun…", "url": "https://www.sciencedaily.com/releases/2022/05/220502120439.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-02T16:43:13Z", "content": "During the last ice age, glaciers covered vast portions of North America.But some regions, including areas of the southern Appalachians and the Gulf Coast, had more temperate climates in which plants… [+3212 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Search reveals eight new sources of black hole echoes — ScienceDaily - Verve Times", "description": "Scattered across our Milky Way galaxy are tens of millions of black holes -- immensely strong gravitational wells of spacetime, from which infalling matter, and even light, can never escape. Black holes are dark by definition, except on the rare occa", "url": "https://vervetimes.com/search-reveals-eight-new-sources-of-black-hole-echoes-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-02T16:41:26Z", "content": "Scattered across our Milky Way galaxy are tens of millions of black holes — immensely strong gravitational wells of spacetime, from which infalling matter, and even light, can never escape. Black hol… [+6069 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study of ancient predators sheds light on how humans did—or didn't—find food - Phys.org", "description": "A new Rice University-led analysis of the remains of ancient predators reveals new information about how prehistoric humans did—or didn't—find their food.", "url": "https://phys.org/news/2022-05-ancient-predators-humans-didor-didntfind.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/study-of-ancient-preda.jpg", "publishedAt": "2022-05-02T16:39:21Z", "content": "A new Rice University-led analysis of the remains of ancient predators reveals new information about how prehistoric humans didor didn'tfind their food.\r\n\"Sabertooth carcass consumption behavior and … [+2239 chars]"}, {"source": {"id": null, "name": "OregonLive"}, "author": "Douglas Perry | The Oregonian/OregonLive", "title": "Brisk walking pace results in ‘younger biological age,’ possibly adding years to your life: study - OregonLive", "description": "A brisk pace is associated with longer telomeres, a biological-age genetic marker, and so a lifetime of speedy walking could add years to your life – possibly many years.", "url": "https://www.oregonlive.com/health/2022/05/brisk-walking-pace-results-in-younger-biological-age-possibly-adding-years-to-your-life-study.html", "urlToImage": "https://www.oregonlive.com/resizer/WT69mzRTJO9sEzliWSgl--e2ufs=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/PIO4JRFCQJBTRILT5SZG2KUXFM.jpeg", "publishedAt": "2022-05-02T16:35:00Z", "content": "Walking fast every day will help you live longer, a new study indicates.\r\nA brisk pace is associated with longer telomeres, a biological-age genetic marker, and so a lifetime of speedy walking could … [+2933 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Potentially Hazardous Asteroid '418135' to Zoom Past Earth on Thursday: NASA | All You Need to Know - India.com", "description": "The asteroid swings by our planet roughly every seven years, with the next close flyby predicted to come on May 25, 2029.", "url": "https://www.india.com/science/asteroid-news-potentially-hazardous-asteroid-418135-to-zoom-past-earth-on-thursday-nasa-all-you-need-to-know-5370887/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/07/Meteorite-Asteroid-Space-Earth-Planet-Comet-6059746.jpg", "publishedAt": "2022-05-02T16:22:43Z", "content": "Washington: A potentially hazardous giant asteroid is set to zoom past Earth with a 37,400 kmph speed on Thursday, May 5, according to National Aeronautics and Space Administration (NASA). The astero… [+2459 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "Nasa captures image of fourth strong solar flare of the year - Yahoo News", "description": "The fourth strong solar flare of 2022 is unlikely to cause a geomagnetic storm", "url": "https://www.independent.co.uk/space/strong-solar-flare-2022-b2069954.html", "urlToImage": "https://static.independent.co.uk/2022/05/02/16/April-30-X1-flare_131-171-304-1536x1536.jpeg?quality=75&width=1200&auto=webp", "publishedAt": "2022-05-02T16:12:18Z", "content": "A strong solar flare has erupted from the Sun, the fourth flare of such similar intensity in 2022, but an associated stream of charged particles discharged by the Sun will likely miss the Earth.\r\nNas… [+1913 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Don't miss Mercury shine with the crescent moon in tonight's sky! - Space.com", "description": "The fleeting planet will shine high above the horizon after sunset.", "url": "https://www.space.com/mercury-crescent-moon-sky-may-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YZNkZFmWyRikoVWnEJ3eWP-1200-80.jpg", "publishedAt": "2022-05-02T16:00:40Z", "content": "The moon will point the way to the usually elusive Mercury tonight (May 2).\r\nYou can catch the two celestial bodies to the west, about 45 minutes after sunset, according to NASA. Mercury will be a fu… [+1875 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Five thousand exoplanets at the NASA Exoplanet Archive - Nature.com", "description": "The past three decades have seen the number of known exoplanets grow by over three orders of magnitude. To mark the milestone, the Lead Scientist of the NASA Exoplanet Archive, Jessie Christiansen, looks at the history, the contents and the future of this com…", "url": "https://www.nature.com/articles/s41550-022-01661-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41550-022-01661-8/MediaObjects/41550_2022_1661_Fig1_HTML.png", "publishedAt": "2022-05-02T15:53:31Z", "content": "<li>Christiansen, J. in Handbook of Exoplanets (eds Deeg, H. &amp; Belmonte, J.) 19331947 (Springer, 2018).\r\n</li><li>Wolszczan, A. &amp; Frail, D. A. Nature355, 145147 (1992).\r\nADS \r\n Article \r\nGoog… [+3281 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Adam Bankhurst", "title": "Fossils of Giant Whale-Like Creatures Called Ichthyosaurs Found in Swiss Alps - IGN - IGN", "description": "The fossils of three large Ichthyosaurs, extinct marine reptiles that lived roughly 250 million years ago, have been found in a surprising place - the Swiss Alps.", "url": "https://www.ign.com/articles/mysterious-fossil-of-giant-dolphin-like-creature-found-in-swiss-alps-ichthyosaur", "urlToImage": "https://assets-prd.ignimgs.com/2022/05/02/ict-1651502143979.png?width=1280", "publishedAt": "2022-05-02T15:33:07Z", "content": "The fossils of three large Ichthyosaurs, extinct marine reptiles that lived roughly 250 million years ago, have been found in a surprising place - the Swiss Alps.\r\nAs reported by CNN, these Ichthyosa… [+2697 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Nanotechnology enables visualization of RNA structures at near-atomic resolution - Nanowerk", "description": "Combination of nucleic acid nanotechnology and cryo-EM gives unprecedented insights into the structures of large and small RNAs, advancing RNA biology and drug design", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60531.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60531_1.jpg", "publishedAt": "2022-05-02T15:25:12Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Cristian Antonescu", "title": "Astronomer Royal Says Humanity Should Leave Space Missions to Robots - Optic Flux", "description": "Since the dawn of time, humans wanted to travel among the stars and the depths of the heavens. While technology allowed the human race to explore a very tiny part of space, astronomers might need to apply a different recipe. Instead of trying to send humans t…", "url": "https://www.opticflux.com/astronomer-royal-says-humanity-should-leave-space-missions-to-robots/18958/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/05/space-mission.jpg", "publishedAt": "2022-05-02T15:15:23Z", "content": "Since the dawn of time, humans wanted to travel among the stars and the depths of the heavens. While technology allowed the human race to explore a very tiny part of space, astronomers might need to … [+1607 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Scientists Find Brain Circuits In Mice That Transmit ‘Pleasant Touch’ Making Hugs Feel So Good - Indiatimes.com", "description": "Hugging, holding hands have been scientifically proven to be good for mental health. But until now, we didn’t really know why we get a pleasant feeling.                        UnsplashAlso Read: Human Brain’s Processing And Responsiveness Stays High Until Age…", "url": "https://www.indiatimes.com/technology/science-and-future/scientists-find-brain-circuits-in-mice-that-transmit-pleasant-touch-making-hugs-feel-so-good-568477.html", "urlToImage": "https://im.indiatimes.in/content/2022/May/Facebook-Image-70_626f800b00886.jpg", "publishedAt": "2022-05-02T15:08:33Z", "content": "Hugging, holding hands have been scientifically proven to be good for mental health. But until now, we didnt really know why we get a pleasant feeling.\r\nUnsplash\r\nAlso Read: Human Brains Processing A… [+2091 chars]"}, {"source": {"id": null, "name": "Lbl.gov"}, "author": null, "title": "First 'Telomere to Telomere' Human Genome Reveals Secrets of the Centromere - Berkeley Lab - Lawrence Berkeley Lab (.gov)", "description": "Adapted from a news release by Robert Sanders When scientists announced the complete sequence of the human genome in 2003, they were fudging a bit. In fact, nearly 20 years later, about 8% of the genome has never been fully sequenced, largely because it consi…", "url": "https://newscenter.lbl.gov/2022/05/02/gapless-genome-centromeres/", "urlToImage": "http://newscenter.lbl.gov/wp-content/uploads/sites/2/2022/04/chromosome.png", "publishedAt": "2022-05-02T15:00:56Z", "content": "A chromosome (blue) imaged during cell replication. The chromosome is duplicated, and protein strands called spindle fibers (red) are attached to the chromosome copies to pull them apart, so that eac… [+3474 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Incredible Animation Shows The Actual Scale Of Our Solar System - IFLScience", "description": "Everyone knows that as mere Earth-dwellers, our home planet is but a pale blue dot when compared to other celestial bodies. Even our nearby planets quickly", "url": "https://www.iflscience.com/space/incredible-animation-shows-the-actual-scale-of-our-solar-system/", "urlToImage": "https://cdn.iflscience.com/images/07f1f818-9541-5bf2-a72b-00da216bf250/default-1651492612-cover-image.jpg", "publishedAt": "2022-05-02T14:43:00Z", "content": "Everyone knows that as mere Earth-dwellers, our home planet is but a pale blue dot when compared to other celestial bodies. Even our nearby planets quickly become magnitudes larger than ourselves, an… [+945 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Charlotte Edwards", "title": "Solar flare ‘could sideswipe Earth’ TODAY sparking power grid fluctuating geomagnetic storm... - The US Sun", "description": "", "url": "https://www.the-sun.com/tech/5245693/solar-flare-storm-hit-earth-today/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/05/MF-Solar-Storm-Earth-OFFPLAT.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2022-05-02T14:42:00Z", "content": "SPACE experts are predicting that a solar flare could \"sideswipe\" the Earth today.\r\nWhen a solar flare hits the Earth's magnetic field, it can result in a solar storm that affects the power grid and … [+1868 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Researchers Discover Earth-like Features On Saturn's Moon- Titan. Read Here | Mint - Mint", "description": "A research has revealed the presence of landscapes on the surface of this Moon formed due to a global sand cycle driven by seasons.", "url": "https://www.livemint.com/science/news/researchers-discover-earth-like-features-on-saturn-s-moon-titan-read-here-11651499928974.html", "urlToImage": "https://images.livemint.com/img/2022/05/02/600x338/saturn--621x414_1651500093839.jpg", "publishedAt": "2022-05-02T14:30:55Z", "content": "A team of researchers led by Stanford University geologist Mathieu Lapotre has revealed the presence of landscapes on the surface of this Moon formed due to a global sand cycle driven by seasons.\r\nTi… [+3430 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Tokyo University of Science", "title": "Lighting the tunnel of plant evolution: Scientists explore importance of two-pore channels in plants - Newswise", "description": "Two-pore channels (TPCs) are ancient ion channels present in the cells of both animals and plants.", "url": "https://www.newswise.com/articles/lighting-the-tunnel-of-plant-evolution-scientists-explore-importance-of-two-pore-channels-in-plants", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/05/02/626fe86fa9612_Low-ResInfographic.jpg.png&width=600&height=600", "publishedAt": "2022-05-02T14:05:00Z", "content": "Newswise — Two-pore channels (TPCs) are ancient ion channels present in the cells of both animals and plants. In animals, including humans, these ion channels play important roles in biological activ… [+6608 chars]"}, {"source": {"id": null, "name": "Laughingsquid.com"}, "author": "https://www.facebook.com/lori.dorn", "title": "NASA Perseverance Captures Magnificent HD Footage of a Solar Eclipse Featuring the Mars Moon Phobos - Laughing Squid", "description": "The NASA Perseverance Mars Rover captured absolutely magnificent HD footage of a rarely seen solar eclipse featuring the Mars moon Phobos.", "url": "https://laughingsquid.com/mars-moon-phobos-solar-eclipse/", "urlToImage": "https://laughingsquid.com/wp-content/uploads/2022/04/Solar-Eclipse-Over-Mars-Moon-Phobos.jpeg", "publishedAt": "2022-05-02T14:01:24Z", "content": "The NASA Perseverance Mars Rover captured absolutely magnificent HD footage of a rarely seen solar eclipse featuring Phobos, one of two moons orbiting the Red Planet using its onboard Mastcam-Z camer… [+516 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Spatiotemporal regulation of chemical reactions using only audible sound - Phys.org", "description": "Spatiotemporal regulation of multistep enzyme reactions through compartmentalization is essential in studies that mimic natural systems such as cells and organelles. Until now, scientists have used liposomes, vesicles, or polymersomes to physically separate t…", "url": "https://phys.org/news/2022-05-spatiotemporal-chemical-reactions-audible.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/using-sound-to-control.jpg", "publishedAt": "2022-05-02T13:40:55Z", "content": "Spatiotemporal regulation of multistep enzyme reactions through compartmentalization is essential in studies that mimic natural systems such as cells and organelles. Until now, scientists have used l… [+4222 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Oak Ridge National Laboratory", "title": "Story tips: Fueling up on savings, COVID’s behavior effect, cosmic collisions, seismic and sound, and space-to-ground comms - Newswise", "description": "ORNL story tips: Fueling up on savings, COVID’s behavior effect, cosmic collisions, seismic and sound, and space-to-ground comms", "url": "https://www.newswise.com/coronavirus/story-tips-fueling-up-on-savings-covid-s-behavior-effect-cosmic-collisions-seismic-and-sound-and-space-to-ground-comms", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/05/02/626fdd116adab_MicrosoftTeams-image3.png&width=600&height=600", "publishedAt": "2022-05-02T13:40:00Z", "content": "Transportation — Fueling up on savings \r\nOak Ridge National Laboratory researchers determined that for every 5 miles per hour that drivers travel over a 50-mph speed limit, fuel economy decreases by … [+5618 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA observatory captures strong X-Class solar flare - Devdiscourse", "description": "Read more about NASA observatory captures strong X-Class solar flare on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2022947-nasa-observatory-captures-strong-x-class-solar-flare", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/02_05_2022_19_04_09_4848604.jpg?width=920&format=jpeg", "publishedAt": "2022-05-02T13:34:37Z", "content": "A strong solar flare was emitted by the Sun on Saturday, April 30, 2022. An image of the event was captured by NASA's Solar Dynamics Observatory (SDO) which keeps an eye on solar activity, the agency… [+1131 chars]"}, {"source": {"id": null, "name": "Eejournal.com"}, "author": null, "title": "An FPGA Flies on Mars – EEJournal - EE Journal", "description": "Mars ain’t the kind of place to raise your kids. In fact it’s cold as hell – Elton John, Rocketman  Mars is hard. Only 26 of 56 missions sent to Mars have been successful. Landing on Ma…", "url": "https://www.eejournal.com/article/an-fpga-flies-on-mars/", "urlToImage": "https://www.eejournal.com/wp-content/uploads/2022/01/SL-021422.jpg", "publishedAt": "2022-05-02T13:04:03Z", "content": "Mars ain’t the kind of place to raise your kids.In fact it’s cold as hell Elton John, Rocketman \r\nMars is hard. Only 26 of 56 missions sent to Mars have been successful. Landing on Mars is especially… [+13043 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA Crew-3 astronauts complete spacesuit tests before leaving ISS on May 5; see pics - Republic World", "description": "SpaceX is having a pretty busy week as it is now preparing to bring back astronauts of the Crew-3 mission was launched to the International Space Station.", "url": "https://www.republicworld.com/science/space/nasa-crew-3-astronauts-complete-spacesuit-tests-before-leaving-iss-on-may-5-see-pics-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/kmomdqnfmqv0rulf_1651493067.jpeg", "publishedAt": "2022-05-02T12:41:00Z", "content": "SpaceX is having a pretty busy week as it is now preparing to bring back astronauts of the Crew-3 mission was launched to the International Space Station (ISS) in November 2021. The mission team comp… [+2393 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Planetary scientists come up with new explanation for orbits of gas giants - News9 LIVE", "description": "The scientists suggest a scenario challenging the leading explanation of star system formation", "url": "https://www.news9live.com/science/planetary-scientists-come-up-with-new-explanation-for-orbits-of-gas-giants-167928", "urlToImage": "https://media.news9live.com/h-upload/2022/05/02/330354-solar-system-formation.jpg", "publishedAt": "2022-05-02T12:21:58Z", "content": "Researchers have advanced a new theory that can potentially solve a long standing mystery about the Solar System, that is how did the gas giants of Jupiter, Saturn, Uranus and Neptune assume their cu… [+5068 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "Scientists discovered a new mode of materials growth - Tech Explorist", "description": "Spiral growth graphene.", "url": "https://www.techexplorist.com/scientists-discovered-new-mode-materials-growth/47060/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/graphene.jpg", "publishedAt": "2022-05-02T11:17:04Z", "content": "Until now, the discovery of new materials and the development of materials highly depends on the experiences gained by many experimental tries and thus are very time-consuming. Controllable materials… [+3319 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "ANU: Venus and Jupiter to get hearts racing with celestial \"kiss\" - India Education Diary", "description": "Although Venus and Jupiter get close to one another every few years, this time there is also Mars and Saturn in the mix which is pretty rare, watching from afar, like the creepy neighbour next door.Early risers are in for a celestial treat this weeke", "url": "https://indiaeducationdiary.in/anu-venus-and-jupiter-to-get-hearts-racing-with-celestial-kiss/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/10/ANU.jpg", "publishedAt": "2022-05-02T11:01:29Z", "content": "Although Venus and Jupiter get close to one another every few years, this time there is also Mars and Saturn in the mix which is pretty rare, watching from afar, like the creepy neighbour next door.\r… [+1547 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Special kinds of rocks on Mars hints at violent volcanic eruptions: Study - The Indian Express", "description": "Researchers have determined that the olivine-rich bedrock in the Gusev crater and in and around the Jezero crater on Mars may be a special type of rock called “ignimbrite”, which forms due to violent volcanic eruptions.", "url": "https://indianexpress.com/article/technology/science/special-kinds-of-rocks-on-mars-hints-at-violent-volcanic-eruptions-study-7897993/", "urlToImage": "https://images.indianexpress.com/2022/05/Oilivine-rich-rocks-on-mars-ignimbrite-volcanic-eruptions.jpg", "publishedAt": "2022-05-02T10:52:57Z", "content": "A team of researchers at the Arizona State Universitys School of Earth and Space Exploration has determined that the olivine-rich bedrock in the Gusev crater and in and around the Jezero crater on Ma… [+3211 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Black Moon solar eclipse looks otherworldly in stunning images - Space.com", "description": "Space and land views showed the moon taking a bite out of the sun on April 30.", "url": "https://www.space.com/amazing-images-solar-eclipse-april-30-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pXmrURKruWbCyeHye7CdvV-1200-80.jpg", "publishedAt": "2022-05-02T10:25:52Z", "content": "A rare solar eclipse Saturday (April 30) stunned viewers across Antarctica, the southern tip of South America, and the Pacific and Atlantic Oceans.\r\nWhile much of the partial solar eclipse of April 3… [+4049 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "When and where medium-sized black holes could form? - Tech Explorist", "description": "Astronomers identified the possible location of medium‑sized black holes.", "url": "https://www.techexplorist.com/when-where-medium-sized-black-holes-form/47056/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/NGC-1385.jpg", "publishedAt": "2022-05-02T09:26:22Z", "content": "When and how medium-sized black holes- between the size of a stellar-mass black hole and a supermassive black hole- form remains unclear. Most of the theories for their formation rely on conditions f… [+2482 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble captures a spiral galaxy lying 42 million light-years from Earth - Devdiscourse", "description": "Read more about Hubble captures a spiral galaxy lying 42 million light-years from Earth  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2022683-hubble-captures-a-spiral-galaxy-lying-42-million-light-years-from-earth", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/02_05_2022_14_43_00_4628937.jpg?width=920&format=jpeg", "publishedAt": "2022-05-02T09:13:39Z", "content": "The European Space Agency has shared a new picture wherein the NASA/ESA Hubble Space Telescope spies M99 - a magnificent spiral galaxy which lies roughly 42 million light-years from Earth in the cons… [+1274 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Sinead Butler", "title": "Canadian astronauts cannot commit crimes in space anymore thanks to new legislation - indy100", "description": "Astronauts from Canada will not be allowed to commit crimes in space thanks to the country introducing a new amendment.While it’s hard to imagine that there’s a lot of crime and lawlessness taking place in space, nevertheless the new legislation has been put …", "url": "https://www.indy100.com/science-tech/canadian-astronaut-ban-crime-space", "urlToImage": "https://www.indy100.com/media-library/spacex-crew-4-mission-arrived-at-iss.jpg?id=29747785&width=1200&coordinates=0%2C166%2C0%2C334&height=600", "publishedAt": "2022-05-02T09:01:39Z", "content": "Astronauts from Canada will not be allowed to commit crimes in space thanks to the country introducing a new amendment.\r\nWhile its hard to imagine that theres a lot of crime and lawlessness taking pl… [+2190 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "SNS", "title": "Solar energy outperforms nuclear on powering crewed missions to Mars - The Statesman", "description": "\"Compressed hydrogen energy storage falls into this category as well,\" noted co-lead author Anthony Abel, a chemical and biomolecular engineering PhD student at UC Berkeley. \"For grid-scale energy storage, it's not used commonly, although that is projected to…", "url": "https://www.thestatesman.com/supplements/science_supplements/solar-energy-outperforms-nuclear-powering-crewed-missions-mars-1503066804.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/04/0cab22c911de9c0e24563af0f9491c59-1.jpg", "publishedAt": "2022-05-02T08:57:55Z", "content": "Human ground expeditions on Mars can be powered by solar energy harvesting, argued researchers from the University of California.\r\nModern science has exposed the red planet as a potential source of a… [+4036 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "The first partial solar eclipse of 2022 wowed viewers - Tech Explorist", "description": "This gives the Sun a crescent shape.", "url": "https://www.techexplorist.com/first-partial-solar-eclipse-2022-wowed-viewers/47044/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/solar-eclipse.jpg", "publishedAt": "2022-05-02T07:57:35Z", "content": "The first partial solar eclipse of this year- which took place on Saturday, April 30- was visible across Antarctica, the southern tip of South America, and the Pacific and Atlantic Oceans.\r\nThis part… [+1049 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "NASA Scientists Solve Mystery Behind Explosions on Sun That Trigger Solar Flares | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "The team at NASA's Magnetospheric Multiscale Mission (MMS) has a new theory that explains how the most explosive type of magnetic reconnection—called fast reconnection—occurs and why it happens at a consistent speed. - Articles from The Weather Channel | weat…", "url": "https://weather.com/en-IN/india/space/news/2022-05-02-scientists-solve-mystery-behind-explosions-on-sun", "urlToImage": "https://s.w-x.co/in-sun_6.jpg", "publishedAt": "2022-05-02T07:52:30Z", "content": "Scientists at NASA have developed a theory that explains how explosions occur on the Sun and help better predict geomagnetic storms and solar flares that can impact Earth.\r\nAn explosive process calle… [+2825 chars]"}, {"source": {"id": null, "name": "Solidstatelightingdesign.com"}, "author": "Olivia Hines", "title": "Scientists record the largest earthquakes on Mars on the Red Planet - Solid State Lighting Design", "description": "Scientists say they have identified the two largest tremors ever recorded on the Red Planet. swamp is a seismic The event that occurs on the surface of", "url": "https://www.solidstatelightingdesign.com/scientists-record-the-largest-earthquakes-on-mars-on-the-red-planet/", "urlToImage": "https://www.solidstatelightingdesign.com/wp-content/uploads/2022/05/Scientists-record-the-largest-earthquakes-on-Mars-on-the-Red.jpg", "publishedAt": "2022-05-02T07:50:44Z", "content": "Scientists say they have identified the two largest tremors ever recorded on the Red Planet.\r\nswamp is a seismic The event that occurs on the surface of Mars. It is similar to earthquakes that occur … [+3916 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Queen Mary University of London: Largest ever survey of exoplanet atmospheres reveals mysteries of 'hot Jupiters' - India Education Diary", "description": "Scientists, including from Queen Mary University of London, used observational data of 25 hot Jupiters – the largest amount of archival data ever examined in a single exoplanet atmosphere survey.The research explains why the atmospheres of many hot J", "url": "https://indiaeducationdiary.in/queen-mary-university-of-london-largest-ever-survey-of-exoplanet-atmospheres-reveals-mysteries-of-hot-jupiters/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/Queen-Mary-University-of-London.jpg", "publishedAt": "2022-05-02T07:32:02Z", "content": "Scientists, including from Queen Mary University of London, used observational data of 25 hot Jupiters the largest amount of archival data ever examined in a single exoplanet atmosphere survey.\r\nThe … [+3469 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Astronomers to Make 'Groundbreaking Revelation' About Milky Way's Black Hole Soon. When And Where to WATCH - India.com", "description": "The conference will be streamed online on the ESO website and on the ESO YouTube channel. There will be simultaneous press conferences organised around the world, including in Washington D.C., Santiago de Chile, Mexico City, Tokyo, and Taipei.", "url": "https://www.india.com/science/science-news-astronomers-groundbreaking-revelation-about-milky-ways-black-hole-soon-when-and-where-to-watch-event-horizon-telescope-direct-link-5369576/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/05/Astronomers.jpg", "publishedAt": "2022-05-02T07:13:40Z", "content": "New Delhi: The European Southern Observatory (ESO) and the Event Horizon Telescope (EHT) project will hold a press conference to present new Milky Way results from the EHT. In 2019, the EHT collabora… [+3226 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Total lunar eclipse, Jupiter-Mars conjunction and more celestial events to watch in May 2022 - Devdiscourse", "description": "Read more about Total lunar eclipse, Jupiter-Mars conjunction and more celestial events to watch in May 2022 on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2022567-total-lunar-eclipse-jupiter-mars-conjunction-and-more-celestial-events-to-watch-in-may-2022", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_05_2021_17_48_30_1275338.png?width=920&format=jpeg", "publishedAt": "2022-05-02T07:09:35Z", "content": "NASA has shared skywatching highlights for the month of May, which include a total lunar eclipse, a couple of great planet-spotting opportunities such as the conjunction between Jupiter and Mars and … [+1551 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Aliens? NASA's Ingenuity Helicopter Captures Images Of UFO-like Debris on Mars - News18", "description": "The disk-like structure, which resembled a UFO, is actually the debris of the parachute and the back shell that assisted Perseverance and Ingenuity for a safe landing.", "url": "https://www.news18.com/news/buzz/aliens-nasas-ingenuity-helicopter-captures-images-of-ufo-like-debris-on-mars-5093923.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/ufo-165147314816x9.png", "publishedAt": "2022-05-02T06:32:59Z", "content": "The Mars helicopter, Ingenuity, recently captured a set of eerie images of what looked like extra-terrestrial debris. The debris, however, belonged to NASA (National Aeronautics and Space Administrat… [+1710 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "Scientists discover all the 'ingredients' for life on asteroids - TweakTown", "description": "Scientists have confirmed in a new study that it's possible for asteroids to contain the key 'building blocks' of DNA and RNA.", "url": "https://www.tweaktown.com/news/85941/scientists-discover-all-the-ingredients-for-life-on-asteroids/index.html", "urlToImage": "https://static.tweaktown.com/news/8/5/85941_01_scientists-discover-all-the-ingredient-for-life-on-asteroids_full.jpg", "publishedAt": "2022-05-02T05:01:01Z", "content": "A new study has confirmed that on some asteroids, the seeds of life are present, which means life could have been brought to Earth and not developed on the planet.\r\nThe quest to find the origin of li… [+2109 chars]"}, {"source": {"id": null, "name": "World Atlas"}, "author": "Aidan Remple", "title": "What Is The Largest Planet In The Solar System? - Worldatlas.com", "description": "The eight planets in our solar system come in a wide variety of sizes. Some are true behemoths, while others are relatively small.", "url": "https://www.worldatlas.com/space/what-is-the-largest-planet-in-the-solar-system.html", "urlToImage": "https://www.worldatlas.com/r/w1200-q80/upload/05/33/a5/untitled-1-01.png", "publishedAt": "2022-05-02T04:03:51Z", "content": "The eight planets in our solar system come in a wide variety of sizes. Some are true behemoths, while others are relatively small. Which planets are the biggest and which are the smallest? \r\nJupiter … [+10130 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Veronica Tucker", "title": "Photo collected by NASA - Tech News Inc", "description": "Many wonder if it can be found on other planets Extraterrestrial life forms. Of particular concern in this regard is Mars, which has always been the", "url": "https://technewsinc.com/photo-collected-by-nasa/", "urlToImage": null, "publishedAt": "2022-05-02T03:26:02Z", "content": "Many wonder if it can be found on other planets Extraterrestrial life forms. Of particular concern in this regard is Mars, which has always been the subject of debate among experts. Now one has even … [+2181 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Record Largest ‘Marsquakes’ on the Red Planet - VOA Learning English", "description": "Scientists identify the two largest “marsquakes” to be recorded on the Red Planet", "url": "https://learningenglish.voanews.com/a/scientists-record-largest-marsquakes-on-the-red-planet/6549469.html", "urlToImage": "https://gdb.voanews.com/02210000-0aff-0242-1fe7-08da295db12c_cx3_cy3_cw93_w1200_r1.jpg", "publishedAt": "2022-05-01T22:02:29Z", "content": "Scientists say they have identified the two largest marsquakes ever recorded on the Red Planet.\r\nA marsquake is a seismic event that happens on Mars. It is similar to earthquakes that happen on our p… [+3573 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Mars Perseverance Rover Campaign #2: The Delta Front - SciTechDaily", "description": "Recently on Mars, NASA's Perseverance rover officially began the “Delta Front Campaign.” This second campaign of the mission commenced on April 18th, 2022, the 415th sol since landing. Each campaign represents a sub-portion of the Mars 2020 mission and is ded…", "url": "https://scitechdaily.com/nasa-mars-perseverance-rover-campaign-2-the-delta-front/", "urlToImage": "https://scitechdaily.com/images/NASA-Perseverance-Rover-Artistic-Rendering-scaled.jpg", "publishedAt": "2022-05-01T21:55:44Z", "content": "ByDenise Buckner, University of FloridaMay 1, 2022\r\nArtistic rendering of NASAs Perseverance rover. Credit: NASA/JPL-Caltech\r\nRecently on Mars\r\nMars is the second smallest planet in our solar system … [+4345 chars]"}, {"source": {"id": null, "name": "Reportdoor.com"}, "author": "Sharon Ross", "title": "NASA will continue several planetary missions into celestial bodies - REPORT DOOR - Report Door", "description": "NASA has extended the planetary science missions of eight of its spacecraft, which will help deepen the understanding of the solar system. Each of the", "url": "https://www.reportdoor.com/nasa-will-continue-several-planetary-missions-into-celestial-bodies/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/05/e1-pia25175.jpg?w=1024", "publishedAt": "2022-05-01T17:09:10Z", "content": "NASA has extended the planetary science missions of eight of its spacecraft, which will help deepen the understanding of the solar system.\r\nEach of the missions was reviewed by more than 50 people. T… [+4524 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Hubble Space Telescope images exceptionally fluffy galaxy - Digital Trends", "description": "In this week's image from the Hubble Space Telescope, you can see an unusual type of galaxy called an ultra-diffuse galaxy.", "url": "https://www.digitaltrends.com/news/hubble-ultra-diffuse-galaxy/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/hubble-spies-a-tenuous-diffuse-galaxy.jpg", "publishedAt": "2022-05-01T16:20:10Z", "content": "In this week’s image from the Hubble Space Telescope, you can see an unusual type of galaxy called an ultra-diffuse galaxy. The galaxy GAMA 526784 is shown as a smear of light across the center of th… [+2088 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Hubble Image Shows Two Interacting Galaxies That Appear To Form The Number '10' - Indiatimes.com", "description": "NASA's Hubble Telescope recently shared an image of two stunning galaxies far away that appear to be interacting with each other. The pair of gravitationally interacting galaxies is called Arp 147. In the image, the galaxies appear to be forming an interstell…", "url": "https://www.indiatimes.com/technology/science-and-future/hubble-image-shows-two-interacting-galaxies-that-appear-to-form-the-number-10-568360.html", "urlToImage": "https://im.indiatimes.in/content/2022/Apr/Capture_626cbe88d990f.PNG", "publishedAt": "2022-05-01T15:20:24Z", "content": "NASA's Hubble Telescope recently shared an image of two stunning galaxies far away that appear to be interacting with each other. The pair of gravitationally interacting galaxies is called Arp 147. \r… [+1809 chars]"}, {"source": {"id": null, "name": "Parisbeacon.com"}, "author": "Paris Beacon", "title": "Jupiter gets a ‘mole’: they capture a huge black spot on the surface of the planet (PHOTOS) - Paris Beacon News", "description": "NASA’s Juno spacecraft captured the image of a massive black spot on the surface of Jupiter during its 40th close pass by the giant planet on February 25, 2022. As detailed by NASA in a recent communiquéthis mysterious stain is actually the big shadow project…", "url": "https://www.parisbeacon.com/92368/", "urlToImage": "https://www.parisbeacon.com/wp-content/uploads/2022/05/Jupiter-gets-a-mole-they-capture-a-huge-black-spot.jpg", "publishedAt": "2022-05-01T13:05:57Z", "content": "NASA’s Juno spacecraft captured the image of a massive black spot on the surface of Jupiter during its 40th close pass by the giant planet on February 25, 2022. \r\nAs detailed by NASA in a recent comm… [+1213 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA Johnson Space Center Director Returns to Conway to Deliver CCU Commencement Address - BollyInside", "description": "Vanessa Ellerbe Wyche, the leader of NASA’s spaceflight hub in charge of the astronaut corps, mission control, and the International Space Station, will", "url": "https://www.bollyinside.com/news/nasa-johnson-space-center-director-returns-to-conway-to-deliver-ccu-commencement-address", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/04/NASA-Johnson-Space-Center-Director-Returns-to-Conway-to-Deliver.webp_.webp.webp", "publishedAt": "2022-04-30T20:37:27Z", "content": "Vanessa Ellerbe Wyche, the leader of NASAs spaceflight hub in charge of the astronaut corps, mission control, and the International Space Station, will return to her hometown on May 7 to deliver the … [+4557 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA’s future moon base could be powered by water from Earth’s atmosphere - BollyInside", "description": "NASA intends to send a team of astronauts to the moon in 2025, with the goal of constructing the first-ever lunar scientific facility. It’s a lofty", "url": "https://www.bollyinside.com/news/nasas-future-moon-base-could-be-powered-by-water-from-earths-atmosphere", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/04/NASAs-future-moon-base-could-be-powered-by-water-from.jpeg", "publishedAt": "2022-04-30T20:13:26Z", "content": "NASA intends to send a team of astronauts to the moon in 2025, with the goal of constructing the first-ever lunar scientific facility. Its a lofty ambition born of the agencys larger Artemis objectiv… [+4266 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Themeinwp.", "title": "Why a day on Venus is longer than a year - The Times Hub", "description": "Photo: pixabay .comBecame known why the day on Venus is longer than the year The atmosphere of Venus — it is not a separate part of the planet that does not interact with its solid surface. Researchers from the University of California, led by Stephen Cain, f…", "url": "https://thetimeshub.in/why-a-day-on-venus-is-longer-than-a-year/371/", "urlToImage": null, "publishedAt": "2022-04-30T09:43:37Z", "content": "Photo: pixabay .comBecame known why the day on Venus is longer than the year\r\nThe atmosphere of Venus — it is not a separate part of the planet that does not interact with its solid surface.\r\nResearc… [+2031 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "Watch: This is what happens when you wring a wet towel in space - Times Now", "description": "Water would normally flow down to the ground the moment you squeeze a towel. However, when astronaut Chris Hadfield did it on the International Space Station, the water clung to the washcloth instead, forming a tube over it and eventually over his hands that …", "url": "https://www.timesnownews.com/viral/watch-this-is-what-happens-when-you-wring-a-wet-towel-in-space-article-91154591", "urlToImage": "https://static.tnn.in/thumb/msid-91154591,imgsize-100,width-1280,height-720,resizemode-75/91154591.jpg", "publishedAt": "2022-04-28T14:28:05Z", "content": "Fire breaks out at petrol pump in Indore while fuel is being unloaded from tanker, triggers panic WATCH"}]}