{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "New discovery says the closest black hole to Earth isn’t a black hole at all - BGR", "description": "What was once believed to be the Earth's closest black hole has now been classified as a two-star system with a vampiric star.", "url": "http://bgr.com/science/new-discovery-says-the-closest-black-hole-to-earth-isnt-a-black-hole-at-all/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/10/BGRpic-Recovered-Recovered-Recovered.jpg?quality=82&strip=all", "publishedAt": "2022-03-10T00:03:00Z", "content": "The Earth’s closest black hole isn’t a black hole at all. Instead, astronomers say it’s just a two-star system where one star is sucking the life out of the other.\r\nEarth’s closest black hole isn’t a… [+2741 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Grant Currin", "title": "We keep sending rovers to the same spot on Mars for 1 fascinating reason - Interesting Engineering", "description": "China's space agency landed a rover, Zhurong, on Mars. The spacecraft is exploring Utopia Planitia, which is on the border between the northern lowlands and the southern highlands.", "url": "https://interestingengineering.com/mars-rover-landing-site", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/nR6bJVg56o/sizes/zhurong-location_md.png", "publishedAt": "2022-03-10T00:01:39Z", "content": "China's Mars rover, Zhurong, touched down on the Red Planet a little over a year ago. Earlier this week, scientists published the first significant report of what Zhurong has seen so far.\r\nThe paper … [+5169 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "LIVE NOW: We're Opening One of the Last Apollo Moon Samples, Untouched for Nearly 50 ... - Latest Tweet by - LatestLY", "description": "The latest Tweet by NASA states, 'LIVE NOW: We're opening one of the last Apollo Moon samples, untouched for nearly 50 years. What are we hoping to learn? Join us on @TwitterSpaces to talk with NASA experts—or share your questions with #AskNASA. Wondering who…", "url": "https://www.latestly.com/socially/technology/science/live-now-were-opening-one-of-the-last-apollo-moon-samples-untouched-for-nearly-50-latest-tweet-by-nasa-3455292.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/04/nasa-784x441.jpg", "publishedAt": "2022-03-09T23:28:38Z", "content": "LIVE NOW: We're opening one of the last Apollo Moon samples, untouched for nearly 50 years. What are we hoping to learn?\r\nJoin us on @TwitterSpaces to talk with NASA expertsor share your questions wi… [+604 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How a virus packages its genetic material: Simulations could help design nanocontainers used in drug delivery - Science Daily", "description": "Physics and astronomy professors have developed a theory and performed a series of simulations that may help explain how a virus finds its native genome and how capsids form around it and not around other RNAs in the cell.", "url": "https://www.sciencedaily.com/releases/2022/03/220309165541.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T22:06:56Z", "content": "Each simple RNA virus has a genome, its \"native RNA.\" This genome dictates how the virus replicates in cells to eventually cause disease. The genome also has the code for making a capsid, the protein… [+3054 chars]"}, {"source": {"id": null, "name": "The Hitavada"}, "author": "The Hitavada", "title": "NASA’s Perseverance grabs 7th rock sample on Mars - The Hitavada", "description": "NASA’s Perseverance rover has grabbed one more sample from Mars, taking the total number of collection to seven. Perseverance drilled the seventh sample from the floor of the Red Planet’s Jezero Crater. The car-sized robot will drill one more sample from the …", "url": "https://www.thehitavada.com/Encyc/2022/3/10/NASA-s-Perseverance-grabs-7th-rock-sample-on-Mars.html", "urlToImage": "https://www.thehitavada.com/Encyc/2022/3/10/NASA-Perseverance-grabs_202203100310346930_H@@IGHT_315_W@@IDTH_525.jpg", "publishedAt": "2022-03-09T21:56:46Z", "content": "NASA’s Perseverance rover has grabbed one more sample from Mars, taking the total number of collection to seven. Perseverance drilled the seventh sample from the floor of the Red Planet’s Jezero Crat… [+1574 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/evan.gough.3", "title": "How did Earth go From Molten Hellscape to Habitable Planet? - Universe Today", "description": "Earth might have become habitable sooner than thought. But for that to happen, something had to remove all those GHGs more quickly.", "url": "https://www.universetoday.com/154874/how-did-earth-go-from-molten-hellscape-to-habitable-planet/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/11/Hadean-Small.jpg", "publishedAt": "2022-03-09T21:53:22Z", "content": "Earth formed from the Sun’s protoplanetary disk about 4.6 billion years ago. In the beginning, it was a molten spheroid with scorching temperatures. Over time, it cooled, and a solid crust formed. Ev… [+12872 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: COVID-19 can cause brain shrinkage, memory loss - study; Original Buzz Aldrin moon walk photo sells for $7,700 at auction and more - Devdiscourse", "description": "The scientists said that the effects were even seen in people who had not been hospitalised with COVID, and whether the impact could be partially reversed or if they would persist in the long term needed further investigation.  Original Buzz Aldrin moon walk …", "url": "https://www.devdiscourse.com/article/science-environment/1955919-science-news-roundup-covid-19-can-cause-brain-shrinkage-memory-loss---study-original-buzz-aldrin-moon-walk-photo-sells-for", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_02_2022_17_27_02_7766389.jpg?width=920&format=jpeg", "publishedAt": "2022-03-09T20:58:08Z", "content": "Following is a summary of current science news briefs.\r\nVariant that combines Delta and Omicron identified; dogs sniff out virus with high accuracy\r\nThe following is a summary of some recent studies … [+2912 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "196 lasers help scientists recreate the conditions inside gigantic galaxy clusters - Nanowerk", "description": "Experiments point the way to solving mystery that keeps clusters hot.", "url": "https://www.nanowerk.com/news2/space/newsid=59991.php", "urlToImage": "https://www.nanowerk.com/news2/space/id59991_1.jpg", "publishedAt": "2022-03-09T20:14:32Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "Huge asteroid slammed into Greenland just a few million years after the dinosaurs died out - Space.com", "description": "It's much, much older than originally anticipated.", "url": "https://www.space.com/greenland-impact-crater-hiawatha-age", "urlToImage": "https://cdn.mos.cms.futurecdn.net/K5sJ476dyzhLyNHDB2FT3b-1200-80.jpg", "publishedAt": "2022-03-09T20:11:27Z", "content": "Hidden under Greenland's thick ice sheet, scientists found what they thought was the scar of an asteroid impact perhaps just thousands of years old, fresh enough that humans were already on the scene… [+2678 chars]"}, {"source": {"id": null, "name": "Reportdoor.com"}, "author": "Sharon Ross", "title": "NASA's human Moon lander program finally gets full funding in new budget bill - REPORT DOOR - Report Door", "description": "If Congress’ sweeping new spending bill is signed, it would finally provide full funding to some major NASA projects that have been underfunded over the", "url": "https://www.reportdoor.com/nasas-human-moon-lander-program-finally-gets-full-funding-in-new-budget-bill/", "urlToImage": null, "publishedAt": "2022-03-09T19:56:53Z", "content": "If Congress sweeping new spending bill is signed, it would finally provide full funding to some major NASA projects that have been underfunded over the last few years. Notably, NASAs program to devel… [+4708 chars]"}, {"source": {"id": null, "name": "Bangkok Post"}, "author": "AFP", "title": "Buzz Aldrin's famous 1969 moon walk picture sells at auction - ฺBangkok Post", "description": "COPENHAGEN - More than 70 original NASA photographs including a celebrated image of Buzz Aldrin's moon walk taken by Neil Armstrong were sold at auction in Copenhagen on Wednesday for more than 155,000 euros ($172,000).", "url": "https://www.bangkokpost.com/world/2276575/buzz-aldrins-famous-1969-moon-walk-picture-sells-at-auction", "urlToImage": "https://static.bangkokpost.com/media/content/20220310/c1_4250051_700.jpg", "publishedAt": "2022-03-09T19:45:00Z", "content": "COPENHAGEN - More than 70 original NASA photographs including a celebrated image of Buzz Aldrin's moon walk taken by Neil Armstrong were sold at auction in Copenhagen on Wednesday for more than 155,0… [+993 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Black hole billiards in the centers of galaxies - Science Daily", "description": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggested solution involves a chaotic triple drama inside a giant d…", "url": "https://www.sciencedaily.com/releases/2022/03/220309131909.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T18:33:10Z", "content": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggest… [+6705 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Scientists Think They Could Resurrect an Extinct Rat but Don't Really Want To - Gizmodo", "description": "Gene editing could potentially bring back the Christmas Island rat—but who wants more rats?", "url": "https://gizmodo.com/scientists-think-they-could-resurrect-an-extinct-rat-bu-1848627643", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/d2968888ad3c31cf1bcc285f3b753726.jpg", "publishedAt": "2022-03-09T18:23:00Z", "content": "A team of scientists recently modeled the likelihood of hauling a species back from dead, using the Christmas Island rat, a large rodent that went extinct between 1902 and 1908, as their hypothetical… [+3841 chars]"}, {"source": {"id": null, "name": "insideHPC"}, "author": "staff", "title": "Pusan National University: Research Sheds Light on Friction in Multi-layered Graphene - insideHPC", "description": "March 9, 2022 — According to research released  by Pusan National University in South Korea, multi-layered graphene is a promising carbon-based nanomaterial for a variety of next-generation technologies, but the relationships between its surface structures an…", "url": "https://insidehpc.com/2022/03/pusan-national-university-research-sheds-light-on-friction-in-multi-layered-graphene/", "urlToImage": "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Roadrunner_supercomputer_HiRes.jpg/2560px-Roadrunner_supercomputer_HiRes.jpg", "publishedAt": "2022-03-09T18:16:01Z", "content": "insideHPC in association with the technology analyst firm OrionX.net today announced the launch of the @HPCpodcast, featuring OrionX.net analyst Shahin Khan and Doug Black, insideHPCs editor-in-chief… [+621 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "The Associated Press", "title": "Fossil indicates octopus ancestors lived 100 million years before dinosaurs emerged - News9 LIVE", "description": "The oldest known ancestor of octopi, a 330 million year old specimen, has been unearthed in Montana...", "url": "https://www.news9live.com/science/fossil-indicates-octopus-ancestors-lived-100-million-years-before-dinosaurs-emerged-158218", "urlToImage": "https://media.news9live.com/h-upload/2022/03/09/253361-10002cropped.jpg", "publishedAt": "2022-03-09T18:10:21Z", "content": "Scientists have found the oldest known ancestor of octopuses an approximately 330 million-year-old fossil unearthed in Montana. The researchers concluded the ancient creature lived millions of years … [+1757 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Avian secret: The key to agile bird flight is switching quickly between stable and unstable gliding - Phys.org", "description": "While it had been assumed that unstable gliding was the key to agility in bird flight, a collaboration between aerospace engineers at the University of Michigan and biologists at the University of British Columbia revealed that stability plays a role.", "url": "https://phys.org/news/2022-03-avian-secret-key-agile-bird.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/avian-secret-the-key-t.jpg", "publishedAt": "2022-03-09T16:49:40Z", "content": "While it had been assumed that unstable gliding was the key to agility in bird flight, a collaboration between aerospace engineers at the University of Michigan and biologists at the University of Br… [+4964 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The evolution, evolvability and engineering of gene regulatory DNA - Nature.com", "description": "A framework for studying&nbsp;and engineering gene regulatory DNA&nbsp;sequences, based on deep neural sequence-to-expression models trained&nbsp;on&nbsp;large-scale libraries of random DNA, provides insight into the evolution, evolvability and fitness landsc…", "url": "https://www.nature.com/articles/s41586-022-04506-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-04506-6/MediaObjects/41586_2022_4506_Fig1_HTML.png", "publishedAt": "2022-03-09T16:29:36Z", "content": "<li>Wittkopp, P. J. &amp; Kalay, G. Cis-regulatory elements: molecular mechanisms and evolutionary processes underlying divergence. Nat. Rev. Genet.13, 5969 (2011).\r\nPubMed \r\nGoogle Scholar \r\n</li><l… [+22736 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA selects UK-based firm to develop equipment for extracting oxygen from Moon dust - Republic World", "description": "ESA has selected a team led by Thales Alenia Space in the UK for the design and development of an experimental payload to extract oxygen from the lunar soil.", "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/esa-selects-uk-based-firm-to-develop-equipment-for-extracting-oxygen-from-moon-dust-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/jrhv2l51zesjghuf_1646838839.jpeg", "publishedAt": "2022-03-09T15:56:00Z", "content": "The European Space Agency (ESA) has selected a team led by Thales Alenia Space in the UK for the design and development of an experimental device to extract oxygen from the lunar soil. Comprised of f… [+2139 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "NASA’s NICER Telescope Observes Merging of X-Ray Spots on a Magnetar Surface - AZoQuantum", "description": "Neutron star Interior Composition Explorer (NICER) of NASA has for the first time witnessed the integration of multimillion-degree X-Ray spots on the surface of a magnetar — a supermagnetized stellar core that is no larger than a city.", "url": "https://www.azoquantum.com/News.aspx?newsID=8836", "urlToImage": "https://www.azoquantum.com/images/news/ImageForNews_8836_1646825637310567.gif", "publishedAt": "2022-03-09T14:59:00Z", "content": "Nasa's neutron star Interior Composition Explorer (NICER) has, for the first time, witnessed the integration of multimillion-degree X-Ray spots on the surface of a magnetar — a supermagnetized stella… [+5521 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Past Climate Change May Have Influenced Fossilization - AZoCleantech", "description": "Climate change can impact life on Earth. According to a new study, it can also influence the dead.", "url": "https://www.azocleantech.com/news.aspx?newsID=31297", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31297_16468254146348397.jpg", "publishedAt": "2022-03-09T13:41:00Z", "content": "Climate change can impact life on Earth. According to a new study, it can also influence the dead.\r\nA fossil of a crustacean claw exoskeleton from the Posidonia Shale in Germany. Image Credit: Drew M… [+4228 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Juno spacecraft clicks Jupiter`s moon casting shadow on the gas giant - WION", "description": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on Earth as when Moon comes between the Sun and Earth, the sha…", "url": "https://www.wionews.com/science/nasa-juno-spacecraft-clicks-jupiters-moon-casting-shadow-on-gas-giant-460580", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/03/09/246450-jupiter.jpg", "publishedAt": "2022-03-09T12:51:21Z", "content": "Play of shadows in space causes a great many effects. The celestial bodies come between a star and another planet and cast their shadow on the latter. We are very well familiar with this play here on… [+1028 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Rocket Stage-Lunar Collision Saga Continues: Space Junk Crashes Into Far Side of the Moon; Leaves a 65-Foot Wide Crater | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Usually, when a human-made object strikes a celestial object, it's by design. And that very fact makes this impact an unplanned experiment for scientists studying the Moon. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-09-space-junk-crashes-into-far-side-of-the-moon-leaves-a-65-foot-wide", "urlToImage": "https://s.w-x.co/in-Rocket-Booster-Crash-Moon.gif", "publishedAt": "2022-03-09T12:33:37Z", "content": "A wayward rocket stage on a collision path with the Moon had been gaining a lot of attention since the beginning of 2022. While the incident brought up heated discussion on the many dangers of space … [+2409 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "Study Using Microrobots Demonstrates How Animal Swarms Respond to Danger - AZoRobotics", "description": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Bechinger, a member of the Cluster of Excellence \"Centre for t…", "url": "https://www.azorobotics.com/News.aspx?newsID=12798", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ThumbForNews_12798_16468293543237810.jpg", "publishedAt": "2022-03-09T12:27:00Z", "content": "A herd of antelope feeds peacefully on a meadow. Suddenly, a lion shows up, and the herd flees. But how do they manage to do so collectively? Konstanz physicist Chun-Jen Chen and Professor Clemens Be… [+4446 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "China's Yutu 2 rover transmits intriguing panoramic images from hidden side of the Moon - Republic World", "description": "The Yutu 2 rover had landed on the far side of the Moon in January 2019 atop the Chang'e 4 lander and has been scanning the lunar surface ever since.", "url": "https://www.republicworld.com/world-news/russia-ukraine-crisis/chinas-yutu-2-rover-transmits-intriguing-panoramic-images-from-hidden-side-of-the-moon-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/qqbnih2xl7rmhssw_1646827602.jpeg", "publishedAt": "2022-03-09T12:23:00Z", "content": "China's Yutu 2 rover, which has completed three years on the Moon, has beamed back an intriguing panoramic picture of its location. The rover had landed on the far side of the Moon in January 2019 at… [+1966 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "What Happens to Matter Swallowed by Black Holes Could Be Explained by Wormholes. ⋆ Ceng News - Ceng News", "description": "By considering wormholes, hypothetical bridges connecting distant points in the Universe, physicists may have discovered what happens to matter that", "url": "https://www.cengnews.com/news/what-happens-to-matter-swallowed-by-black-holes-could-be-explained-by-wormholes-311765.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/03/1646819975_black-hole.jpg", "publishedAt": "2022-03-09T12:06:55Z", "content": "By considering wormholes, hypothetical bridges connecting distant points in the Universe, physicists may have discovered what happens to matter that is swallowed by black holes.\r\nThe researchers from… [+3563 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akash Dutta", "title": "NASA Psyche gets ready to fly to this special ASTEROID! Know how it can change humanity forever - HT Tech", "description": "The Psyche mission by NASA is almost ready after getting huge solar arrays installed in the spacecraft. The mission will see the Psyche spacecraft take a trip to a mysterious metal-rich asteroid", "url": "https://tech.hindustantimes.com/tech/news/nasa-psyche-gets-ready-to-fly-to-this-special-asteroid-know-how-it-can-change-humanity-forever-71646825065274.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/09/1600x900/missionswebNASAPsyche_1646825116356_1646825140464.jpg", "publishedAt": "2022-03-09T11:27:41Z", "content": "The ambitious project of NASA - The Psyche Mission - is almost ready for its launch after getting huge solar arrays installed to the spacecraft. The Psyche spacecraft is going to explore a metal-rich… [+2148 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Miguel Brown", "title": "Asteroid to Hit Earth on 2023 Reviewed by Scientists No Longer a Threat - Nature World News", "description": "A finding of a highly deadly asteroid set astrophysicists on a thrilling experience trip prior this season.\r\nScientists at the Mount Lemmon Laboratory in Arizona detected an extraterrestrial around 70-meters (230 ft) large, early on January 6th of year 2022.", "url": "https://www.natureworldnews.com/articles/49809/20220309/asteroid-earth-2023-asteroid-2022-ae1.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/58620/australia-japan-science-space-asteroid-hayabusa.jpg", "publishedAt": "2022-03-09T11:08:42Z", "content": "A finding of a highly deadly asteroid set astrophysicists on a thrilling experience trip prior this season.\r\nScientists at the Mount Lemmon Laboratory in Arizona detected an extraterrestrial around 7… [+3854 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Jets from the supermassive black hole created massive bubbles at Milky Way’s center - Tech Explorist", "description": "The structures themselves are 11 kiloparsecs tall.", "url": "https://www.techexplorist.com/jets-supermassive-black-hole-created-massive-bubbles-milky-ways-center/45179/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/massive-bubbles.jpg", "publishedAt": "2022-03-09T11:04:56Z", "content": "There are two enormous bubbles of scorching gas expanding from the core of the Milky Way has into near-galactic space. First seen in 2020 by the X-ray telescope eRosita, the bubbles extend far above … [+4919 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "The sun readies for its close-up as Europe's Solar Orbiter approaches - Space.com", "description": "No spacecraft before has taken a camera so close to the sun.", "url": "https://www.space.com/solar-orbiter-scorching-close-approach", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KuSDFUQZvWEKJyikdqV2xg-1200-80.jpg", "publishedAt": "2022-03-09T11:00:31Z", "content": "The European Solar Orbiter mission will make its closest approach to the sun later this month, promising to capture images that could unravel some of the mysterious behaviours of the star at the hear… [+4166 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "​​​​​​​Research sheds light on mysterious messenger RNA modifications - Phys.org", "description": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long remained a fundamental mystery in molecular biology.", "url": "https://phys.org/news/2022-03-mysterious-messenger-rna-modifications.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2015/messengerrna.png", "publishedAt": "2022-03-09T10:00:02Z", "content": "A team led by scientists at the University of Birmingham has come a step closer to uncovering the purpose of a distinctive set of modifications found at the beginning of messenger RNA which have long… [+3900 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "A zigzag blueprint for topological electronics - Nanowerk", "description": "A new study confirms switching mechanism for a new, proposed generation of ultra-low energy 'topological electronics'.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=59981.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id59981.jpg", "publishedAt": "2022-03-09T09:57:30Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Biologists Just Totally Proved Wrong a Long-Standing Rumor About Sharks - ScienceAlert", "description": "It's been rumored that sharks don't sleep at all; the fact some sharks must stay on the move to facilitate their breathing has contributed to this idea.", "url": "https://www.sciencealert.com/marine-biologists-confirm-sharks-do-indeed-sleep-often-with-both-eyes-open", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/SpottedSwellSharkInDarkEnvironmentLitByGoldenLight_1024.jpg", "publishedAt": "2022-03-09T06:22:54Z", "content": "It's been rumored that sharks don't sleep at all; the fact some sharks must stay on the move to facilitate their breathing has contributed to this idea.\r\nA new study, however, finally confirms what a… [+3238 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Laurence Malcom", "title": "Earth will run out of oxygen: when, date - Persia Digest", "description": "Mediotempo Mexico City / 08.03.2022 21:44:20 over time, planet earth I encountered many climate-related problems, such as Natural disasersIn addition, of course, climate change. All of this, of course, has an effect In the planet’s atmosphere. It’s because of…", "url": "https://persiadigest.com/earth-will-run-out-of-oxygen-when-date/", "urlToImage": null, "publishedAt": "2022-03-09T04:07:10Z", "content": "over time, planet earth I encountered many climate-related problems, such as Natural disasersIn addition, of course, climate change. All of this, of course, has an effect In the planet’s atmosphere. … [+931 chars]"}, {"source": {"id": null, "name": "Globelynews.com"}, "author": "Wendy Whitman Cobb", "title": "UAE Mars Mission Seeks to Bring Hope to More Places Than the Red Planet - Globely News", "description": "Abu Dhabi's Mars Mission could enable a new generation of space exploration.", "url": "https://globelynews.com/middle-east/uae-mars-mission-project-hope/", "urlToImage": "https://i0.wp.com/globelynews.com/wp-content/uploads/2019/05/Omran_Sharaf_at_Hope_Scientific_Mission_Announcement_Event-e1561572802143.jpg?resize=1000%2C563&ssl=1", "publishedAt": "2022-03-08T22:36:10Z", "content": "On July 14, a new Mars-bound spacecraft will launch from Japan. While several Mars missions are planned to launch over the next month, what makes this different is whos launching it: the United Arab … [+4682 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Check out 20 years of iconic images courtesy of NASA's Hubble telescope - TechSpot", "description": "The workhorse that is the Hubble Space Telescope has provided humanity with jaw-dropping images of our solar system and the universe at large for more than 30...", "url": "https://www.techspot.com/news/93698-check-out-20-years-iconic-images-courtesy-nasa.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/03/2022-03-08-image-36.jpg", "publishedAt": "2022-03-08T20:58:00Z", "content": "In brief: NASA is celebrating the 20th anniversary of the installation of the Advanced Camera for Surveys on the Hubble Space Telescope by looking back at some of the more than 125,000 pictures captu… [+2686 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Angie Jackman Works to Develop Rocket That Will Bring Mars Samples to Earth – NASA Mars Exploration - NASA Mars Exploration", "description": "Meet the project manager of the first rocket to launch from the surface of another planet, the Mars Ascent Vehicle.", "url": "https://mars.nasa.gov/news/9141/nasas-angie-jackman-works-to-develop-rocket-that-will-bring-mars-samples-to-earth/", "urlToImage": "https://mars.nasa.gov/system/news_items/main_images/9141_PIA25078-web.jpg", "publishedAt": "2022-03-08T17:50:56Z", "content": "NASA’s Mars Sample Return mission will revolutionize our understanding of Mars by returning samples for study using the most sophisticated instruments around the world. These samples, collected by Pe… [+358 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Engineering NASA's Return to the Moon - NASA", "description": "These engineers developed and tested Space Launch System software that will tell the rocket how to operate for the first 8 minutes of Artemis during launch and ascent.", "url": "https://www.nasa.gov/image-feature/engineering-nasa-s-return-to-the-moon/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/ceb_2369.jpg", "publishedAt": "2022-03-08T16:31:10Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cambridge: Tiny ‘skyscrapers’ help bacteria convert sunlight into electricity - India Education Diary", "description": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise ‘nano-housing’ where sun-loving bacteria can grow quickly. The researchers were then able to extract the bacteria’s waste electrons, left over from photo", "url": "https://indiaeducationdiary.in/university-of-cambridge-tiny-skyscrapers-help-bacteria-convert-sunlight-into-electricity/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/cambridge-University.jpg", "publishedAt": "2022-03-08T16:21:03Z", "content": "The researchers, from the University of Cambridge, used 3D printing to create grids of high-rise nano-housing where sun-loving bacteria can grow quickly. The researchers were then able to extract the… [+3824 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Parental control: Researchers learn how genes from Mom or Dad shape behavior - Phys.org", "description": "Parenting is not the only way moms and dads impact the behavior of their offspring. Genes matter, too. And although most of our genes are inherited in pairs—one copy from each parent—moms and dads exert their genetic influence in different ways. According to …", "url": "https://phys.org/news/2022-03-parental-genes-mom-dad-behavior.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/parental-control-resea.jpg", "publishedAt": "2022-03-08T16:00:04Z", "content": "Parenting is not the only way moms and dads impact the behavior of their offspring. Genes matter, too. And although most of our genes are inherited in pairsone copy from each parentmoms and dads exer… [+6048 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Animals evolved the ability to gallop 472 million years ago - Phys.org", "description": "Few human adults gallop; the equine gait tends to be the preserve of little kids mimicking horses or exercise classes. But for camels, lions and giraffes, galloping is a key fixture of their repertoire as they shift up through the gears. However, Eric McElroy…", "url": "https://phys.org/news/2022-03-animals-evolved-ability-gallop-million.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/animals-evolved-the-ab.jpg", "publishedAt": "2022-03-08T15:57:32Z", "content": "Stochastic character mapping for the best fit evolutionary model (ARD) showing the probability of having an asymmetrical gait. Branch color is the probability of having an asymmetrical gait (red) or … [+4600 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Using Plankton Shells to Gauge the Accuracy of Climate Models - AZoCleantech", "description": "Earth scientists have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s history. The results from this study help bridge the gap between empirical observations and existing cli…", "url": "https://www.azocleantech.com/news.aspx?newsID=31292", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31292_16467543670315250.jpg", "publishedAt": "2022-03-08T15:50:57Z", "content": "Earth scientists in the United States and the United Kingdom have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s … [+5395 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telanganatoday", "title": "Now, you can send your name to Space - Telangana Today", "description": "Hyderabad: If it has been your dream to fly to Space, then there is one way to at least partially fulfill it. Now, you can send your name to Space – all thanks to a new initiative by the National Aeronautics and Space Administration (NASA). All you have to do…", "url": "https://telanganatoday.com/now-you-can-send-your-name-to-space", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/03/Boarding-pass.jpg", "publishedAt": "2022-03-08T13:11:58Z", "content": null}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Elon Musk's SpaceX Launched 646 Satellites in 2021 As Part of Starlink Internet Project: Report | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "- Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-08-elon-musks-spacex-launched-646-starlink-satellites-in-2021-report", "urlToImage": "https://s.w-x.co/in-satellite%20%281%29.jpg", "publishedAt": "2022-03-08T10:57:59Z", "content": "Tech billionaire Elon Musk-led SpaceX launched 646 Starlink satellites in 2021, marking a 48.9% increase in its March 2021 satellite population of 1,322, according to a report.\r\nIn the past 18 months… [+1248 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/sakharkar.ashwini", "title": "Scientists significantly improved micro-computed tomography - Tech Explorist", "description": "Advances in micro-computed tomography.", "url": "https://www.techexplorist.com/scientists-significantly-improved-micro-computed-tomography/45154/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/micro-computed-tomography-scanner.jpg", "publishedAt": "2022-03-08T10:57:30Z", "content": "Also known as microtomography, Micro-computed tomography (Micro-CT) is a 3D imaging technique that generates 3D images of the internal structure of samples with small dimensions. It is generally used… [+3475 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Curiosity rover spotted a beautiful “flower” on Mars - The Times Hub", "description": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens. Despite the fact that this object is very similar to terrestrial coral, it is …", "url": "https://thetimeshub.in/curiosity-rover-spotted-a-beautiful-flower-on-mars", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/03/rover-curiosity-zafiksiroval-krasivyj-cvetok-na-marse-28e0336.jpg", "publishedAt": "2022-03-08T09:30:05Z", "content": "Martian “flower”/Channel 24 Collage Earth magnificent images of the surface of the Red Planet. This time, a tiny flower-shaped mineral, only 1 centimeter wide, hit his camera lens.\r\nDespite the fact … [+1380 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Chandrayaan-2 explores Argon-40 in the lunar exosphere - The Week", "description": "Mission's spectrometer makes first observations of global distribution of Argon-40", "url": "https://www.theweek.in/news/sci-tech/2022/03/08/chandrayaan-2-explores-argon-40-in-the-lunar-exosphere-.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/June/Chandrayaan-2-space-exploration-mission-afp.jpg", "publishedAt": "2022-03-08T08:42:00Z", "content": "The Chandra's Atmospheric Composition Explorer-2 (CHACE-2), a quadrupole mass spectrometer onboard Chandrayaan-2 mission, has made the first-of-its-kind observations of the global distribution of Arg… [+3939 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "US Wants To Send A Satellite To Patrol The Space Around Moon - Indiatimes.com", "description": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military capabilities to monitor the space beyond between Earth and Mo…", "url": "https://www.indiatimes.com/technology/science-and-future/us-satellite-to-patrol-moon-563914.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage11-copy_6227156dc6715.jpg", "publishedAt": "2022-03-08T08:39:21Z", "content": "Let the space games begin! As countries take their Earthly race to outer space, Moon is going to take some heat in the coming decades. It appears that the United States wants to expand its military c… [+1864 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "Neurons Involved in Memory Recall Identified; Could Inform Therapeutic Strategies - Genetic Engineering & Biotechnology News", "description": "Researchers discover neurons that separate experience into segments, then help the brain \"time travel\" and remember.", "url": "https://www.genengnews.com/topics/translational-medicine/neurons-involved-in-memory-recall-identified-could-inform-therapeutic-strategies/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2018/08/Feb14_2018_Getty_478186687_MemoryLossBrain_6006417318918-2.jpg", "publishedAt": "2022-03-08T08:00:34Z", "content": "Researchers headed by a team at Cedars-Sinai have discovered two types of brain cells that play a key role in dividing continuous human experience into distinct segments that can be recalled later. M… [+7774 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Largest Molecule yet Spotted in a Planet-forming Disc (ESOcast 253 Light) - European Southern Observatory (ESO)", "description": "How do the ingredients for life end up on planets? The discovery of the largest molecule ever found in a planet-forming disc is providing clues.More informat...", "url": "https://www.youtube.com/watch?v=uxMaFRxVLPY", "urlToImage": "https://i.ytimg.com/vi/uxMaFRxVLPY/maxresdefault.jpg", "publishedAt": "2022-03-08T08:00:31Z", "content": null}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "This SUV-sized spacecraft will find if Jupiter's icy Moon Europa has conditions for life - India Today", "description": "When fully assembled, this spacecraft will be as large as an SUV with solar arrays long enough to span a basketball court.", "url": "https://www.indiatoday.in/science/story/nasa-europa-clipper-mission-jupiter-conditions-for-life-1922035-2022-03-08", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Europa_Clipper-647x363.jpeg?J_nbAYnhe1NLTFQselNG4aTyBqX9tNBO", "publishedAt": "2022-03-08T05:14:20Z", "content": null}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Increasing frequency of El Niño events expected by 2040 — ScienceDaily - Verve Times", "description": "Global weather fluctuations called El Niño events are likely to become more frequent by 2040, a new study shows.El Niño -- the unusual warming of surface waters in the eastern tropical Pacific Ocean -affects climate, ecosystems and societies worldwid", "url": "https://vervetimes.com/increasing-frequency-of-el-nino-events-expected-by-2040-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-08T04:26:54Z", "content": "Global weather fluctuations called El Niño events are likely to become more frequent by 2040, a new study shows.El Niño — the unusual warming of surface waters in the eastern tropical Pacific Ocean -… [+1924 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Cameron Duke, Live Science", "title": "Spiders Caught Hunting in Giant Synchronized Swarms, And Now We Know How - ScienceAlert", "description": "Pack hunting spiders exist in places other than your nightmares. While most spiders enjoy solitary lives, 20 of the roughly 50,000 known spider species live in colonies.", "url": "https://www.livescience.com/social-spiders-hunt-in-packs", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/TightBallOfOrangeSpidersOnALargeWeb_1024.jpg", "publishedAt": "2022-03-08T00:43:50Z", "content": "Pack hunting spiders exist in places other than your nightmares. While most spiders enjoy solitary lives, 20 of the roughly 50,000 known spider species live in colonies.\r\nOne species, Anelosimus exim… [+3417 chars]"}]}