{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Mark Johnson", "title": "Signs of butchery, possible cannibalism found on ancient human relative's bone - The Washington Post", "description": "Cannibalism is not unusual in the animal kingdom, but the closer the practice gets to Homo sapiens, the more complex and uncomfortable the questions it raises.", "url": "https://www.washingtonpost.com/science/2023/06/26/ancient-human-cannibalism/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H6HRHFFYRQIJNSHXZCG775OBXY.jpeg&w=1440", "publishedAt": "2023-06-26T14:24:59Z", "content": "Comment on this story\r\nComment\r\nUsing a magnifying glass to search for signs that an animal might have bitten or chewed the bone of a 1.5-million-year-old human relative, a paleoanthropologist found … [+6039 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Hyenas inherit power from mothers, but it's a privilege they pay dearly for, finds 30-year study - Phys.org", "description": "In some monarchies, inherited power offers a ladder that can be ascended to absolute authority—be it through diplomacy, ruthlessness, or the passing of time. But in hyena monarchies, inherited power is a slippery downward slide. A study from the Max Planck In…", "url": "https://phys.org/news/2023-06-hyenas-inherit-power-mothers-privilege.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/hyenas-inherit-power-f.jpg", "publishedAt": "2023-06-26T14:17:04Z", "content": "In some monarchies, inherited power offers a ladder that can be ascended to absolute authoritybe it through diplomacy, ruthlessness, or the passing of time. But in hyena monarchies, inherited power i… [+4935 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Unlocks Hidden Secrets of Primate Evolution - SciTechDaily", "description": "Analyses of 50 primate genomes through comparative genomics unveil essential genetic processes involved in primate speciation, adaptive phenotypic changes, and the evolution of social systems. A series of publications from the first phase program of the Prima…", "url": "https://scitechdaily.com/new-research-unlocks-hidden-secrets-of-primate-evolution/", "urlToImage": "https://scitechdaily.com/images/Rainbow-Monkey-Evolution-Primate.jpg", "publishedAt": "2023-06-26T14:11:38Z", "content": "ByBGI GroupJune 26, 2023\r\nAn international research consortium co-led by scientists from multiple universities has released a series of studies detailing new high-quality reference genomes from 50 pr… [+17021 chars]"}, {"source": {"id": null, "name": "The News Minute"}, "author": null, "title": "Four minor planets named after Indian scientists, one of them a Malayali - The News Minute", "description": "The International Astronomical Union (IAU) has named minor planets after four Indians, among whom is a 38-year-old Malayali man. As per the latest bulletin of the Working Group Small Bodies Nomenclature (WGSBN), which is the working group of the IAU, the four…", "url": "https://www.thenewsminute.com/article/four-minor-planets-named-after-indian-scientists-one-them-malayali-178990", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Aswinsekhar_1200.jpg", "publishedAt": "2023-06-26T14:11:35Z", "content": "The Malayali in the group is Aswin Sekhar, a 38-year-old Palakkad native who has been credited for the discovery of asteroid 2000LJ27.The International Astronomical Union (IAU) has named minor planet… [+1637 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Yeast dust makes a cheap, fast virus test - Phys.org", "description": "Researchers from The University of Queensland have made a dust from baker's yeast that can detect COVID-19 and could safeguard communities against future pandemics.", "url": "https://phys.org/news/2023-06-yeast-cheap-fast-virus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/yeast-dust-makes-a-che-2.jpg", "publishedAt": "2023-06-26T14:03:03Z", "content": "Researchers from The University of Queensland have made a dust from baker's yeast that can detect COVID-19 and could safeguard communities against future pandemics.\r\nThe powdery \"nanoprobes\" develope… [+2966 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "James Webb Space Telescope could determine if nearby exoplanet is habitable - Space.com", "description": "What does it take to turn a habitable planet into a world more like Venus?", "url": "https://www.space.com/nearby-exoplanet-habitable-james-webb-space-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LwSeha64w6PGwRRwBT5fNG-1200-80.jpeg", "publishedAt": "2023-06-26T14:00:30Z", "content": "A rocky exoplanet orbiting a red dwarf star 98 light-years away could hold the secret about how likely it is for planets like Earth to transform into inhospitable worlds like Venus.\r\nThe exoplanet\r\n,… [+4991 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Li Yuan", "title": "Zhurong rover detects extremely weak magnetic fields on surface of Mars' Utopia Basin - Phys.org", "description": "A joint research team led by Prof. Du Aimin from the Institute of Geology and Geophysics of the Chinese Academy of Sciences (IGGCAS) has found extremely weak magnetic fields during the Zhurong rover's first 1-km traverse on Mars. This indicates no detectable …", "url": "https://phys.org/news/2023-06-zhurong-rover-extremely-weak-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/zhurong-rover-detects.jpg", "publishedAt": "2023-06-26T13:52:07Z", "content": "A joint research team led by Prof. Du Aimin from the Institute of Geology and Geophysics of the Chinese Academy of Sciences (IGGCAS) has found extremely weak magnetic fields during the Zhurong rover'… [+2375 chars]"}, {"source": {"id": null, "name": "Spectroscopyonline.com"}, "author": "Spectroscopy Staff", "title": "Scientists Pioneer Advanced Method for Assessing Lipid Peroxidation - Spectroscopy Online", "description": "Scientists have developed an innovative method combining response surface methodology (RSM) and artificial intelligence network (AIN) to accurately estimate malondialdehyde (MDA) levels, a crucial biomarker for lipid peroxidation and oxidative stress measurem…", "url": "https://www.spectroscopyonline.com/view/scientists-pioneer-advanced-method-for-assessing-lipid-peroxidation", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/spectroscopy/34e2c4067eb1ee1ec262ede64677a245e8379da3-4000x2500.jpg?fit=crop&auto=format", "publishedAt": "2023-06-26T13:50:23Z", "content": "Oxidative stress is a biological phenomenon resulting from the damaging effects of reactive oxygen species. This phenomenon negatively impacts several molecules in the human body, resulting in the fo… [+3025 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Astronomers directly capture world described as 'Jupiter's younger sibling' - Interesting Engineering", "description": "It is the first time astrometry has been used to find 'a giant planet orbiting a young analog of the Sun,' one of the researchers said.", "url": "https://interestingengineering.com/science/astronomers-directly-capture-world-jupiters-sibling", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/26/image/jpeg/E7urgm3xvMLGFsVCeJokogXhlyBBrGHLIcgbK2Xy.jpg", "publishedAt": "2023-06-26T13:45:00Z", "content": "Another successful exoplanet photo shoot @keckobservatory using direct imaging + astrometry, this time of AF Lep b, a Jupiter-like planet orbiting a Sun-like star https://t.co/c3Lceu5bZt Congrats to … [+1372 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "John Anderer", "title": "Ke-don't? Endurance athletes actually perform worse after taking ketone supplements - Study Finds", "description": "Ketones are chemicals produced by the liver by breaking down fat.", "url": "https://studyfinds.org/endurance-ketone-supplements/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2023/01/Protein-powder-scoop-scaled.jpg", "publishedAt": "2023-06-26T13:40:25Z", "content": "HAMILTON, Ontario — More and more competitors, particularly endurance athletes, are turning to ketone supplements in hopes of improving their performances and speed. Now, however, researchers from Mc… [+3355 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Jyoti", "title": "Reasons Why You Should Ditch Your Bra In Bed - HerZindagi", "description": "While there are numerous theories and beliefs about bras, one of the most common is that you shouldn’t wear one while sleeping. So, here’s a breakdown of reasons why it is suggested that you ditch your bra before going to bed.", "url": "https://www.herzindagi.com/web-stories/health/why-you-should-not-wear-a-bra-at-night-in-bed-ws-13371", "urlToImage": "https://images.herzindagi.info/webstories/13371/social--11--1687721117.jpeg", "publishedAt": "2023-06-26T13:30:59Z", "content": "<ul>While there are numerous theories and beliefs about bras, one of the most common is that you shouldnt wear one while sleeping. So, heres a breakdown of reasons why it is suggested that you ditch … [+866 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "Cochlea cell atlas built from single-cell sequencing discovers new cell types, uncovers hidden molecular features - Phys.org", "description": "Researchers at the Pasteur Institute in France have conducted an in-depth genomic study of mouse cochlea to create a comprehensive transcriptomic atlas of the auditory organ at a molecular level.", "url": "https://phys.org/news/2023-06-cochlea-cell-atlas-built-single-cell.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/cochlea-cell-atlas-bui.jpg", "publishedAt": "2023-06-26T13:30:03Z", "content": "Researchers at the Pasteur Institute in France have conducted an in-depth genomic study of mouse cochlea to create a comprehensive transcriptomic atlas of the auditory organ at a molecular level.\r\nIn… [+4406 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New millisecond pulsar detected with FAST - Phys.org", "description": "Using the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a team of Chinese astronomers has detected a new millisecond pulsar in the globular cluster Messier 53. The finding is reported in a research paper published June 16 on the pre-print serv…", "url": "https://phys.org/news/2023-06-millisecond-pulsar-fast.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-millisecond-pulsar-1.jpg", "publishedAt": "2023-06-26T13:30:02Z", "content": "Using the Five-hundred-meter Aperture Spherical radio Telescope (FAST), a team of Chinese astronomers has detected a new millisecond pulsar in the globular cluster Messier 53. The finding is reported… [+3132 chars]"}, {"source": {"id": null, "name": "Science X"}, "author": "Bob Yirka", "title": "Best of Last Week—Reconstructing an Anglo-Saxon teen, AI death spiral, gas stoves emit cancer-causing chemical - Science X", "description": "It was an interesting week for historical research as an international team of historians, archaeologists and evolution specialists reported that warfare was responsible for the boom-bust cycles of Neolithic societies—they found evidence of violent conflicts …", "url": "https://sciencex.com/news/2023-06-weekreconstructing-anglo-saxon-teen-ai-death.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/best-of-last-week--rec-1.jpg", "publishedAt": "2023-06-26T13:24:13Z", "content": "It was an interesting week for historical research as an international team of historians, archaeologists and evolution specialists reported that warfare was responsible for the boom-bust cycles of N… [+2718 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "Remote lake emissions from the Tibetan Plateau challenge global climate modeling - Phys.org", "description": "Earth's complex systems interact between atmospheric, terrestrial, hydrological, cryological (ice and snow) and biological processes in feedback loops. Understanding their relationships is important for modeling their future impacts, particularly regarding cl…", "url": "https://phys.org/news/2023-06-remote-lake-emissions-tibetan-plateau.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/remote-lake-emissions.jpg", "publishedAt": "2023-06-26T13:23:45Z", "content": "Earth's complex systems interact between atmospheric, terrestrial, hydrological, cryological (ice and snow) and biological processes in feedback loops. Understanding their relationships is important … [+5024 chars]"}, {"source": {"id": null, "name": "Snexplores.org"}, "author": null, "title": "Scientists Say: Ellipse - Science News Explores", "description": "Ellipse describes the shapes of planetary orbits around their stars and explains the wacky acoustic phenomenon of “whispering chambers.”", "url": "https://www.snexplores.org/article/scientists-say-ellipse-definition-pronunciation", "urlToImage": "https://www.snexplores.org/wp-content/uploads/2023/06/1440_SS_ellipse_feat.jpg", "publishedAt": "2023-06-26T13:04:16Z", "content": "acoustics: The science of sound.\r\nbronze: A metallic alloy that consists primarily of copper and tin, but may include other metals. It is harder and more durable than copper.\r\nellipse: An oval curve … [+1159 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Is dark matter fuzzy? Ultracold state of matter sheds light on dark matter candidate - Space.com", "description": "The experiment on Earth could help scientists understand what dark matter is really made of.", "url": "https://www.space.com/dark-matter-fuzzy-ultracold-state-of-matter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/58WPB7nJVmvK8CsHkiy7gM-1200-80.jpg", "publishedAt": "2023-06-26T12:57:39Z", "content": "An exotic, ultracold state of matter on Earth is helping scientists study the behavior of \"fuzzy\" dark matter. \r\nDark matter\r\n is an invisible form of matter that makes up about 85% of the matter in … [+3698 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Researchers Help Unravel the Mystery of Sleep - SciTechDaily", "description": "New sleep research has unveiled surprising links between the brain and the gut. Sleep holds paramount importance among human activities — its deficiency even for a single night can impede our cognitive functions, responsiveness, and overall daily performance.…", "url": "https://scitechdaily.com/?p=280346", "urlToImage": "https://scitechdaily.com/images/Young-Woman-Sleeping-Happily.jpg", "publishedAt": "2023-06-26T12:44:48Z", "content": "Dragana Rogulja is a researcher who uses fruit flies and mice to delve into intriguing aspects of sleep, exploring its necessity for survival and the disconnection of the sleeping brain from the exte… [+12171 chars]"}, {"source": {"id": null, "name": "Science X"}, "author": null, "title": "Design students turn ion beam facility into artwork - Science X", "description": "Science X network: Science X is a network of high quality websites with most complete and comprehensive daily coverage of the full sweep of science, technology, and medicine news", "url": "https://sciencex.com/wire-news/449224791/design-students-turn-ion-beam-facility-into-artwork.html", "urlToImage": "https://scx0.b-cdn.net/tmpl/v2/img/logo_70.png", "publishedAt": "2023-06-26T12:41:05Z", "content": "Two students from the Design Academy Eindhoven (the Netherlands) will spend the next few weeks transforming the gray six-meter-long and one-and-a-half-meter-wide tube of DIFFER's Ion Beam Facility in… [+3473 chars]"}, {"source": {"id": null, "name": "Mynation.com"}, "author": "Asianet Mynation", "title": "Uncovering India's Rich Tribal Heritage: A Cultural Journey - MyNation", "description": "Uncover the captivating world of India's tribal heritage on a cultural journey through diverse communities, traditional art forms, vibrant festivals, sustainable lifestyles, and preservation initiatives. Discover the rich tapestry of customs, music, folklore,…", "url": "https://www.mynation.com/travel/uncovering-india-s-rich-tribal-heritage-a-cultural-journey-rwv0bz", "urlToImage": "https://static-ai.asianetnews.com/images/01h3vtrt6z4htv0hxc25cv39h0/screenshot-2023-06-26-at-5-56-50-pm_1200x630xt.jpg", "publishedAt": "2023-06-26T12:07:12Z", "content": "India, a land of diverse cultures and traditions, is home to a remarkable tapestry of tribal communities. Nestled amidst the country's natural landscapes, these tribes have preserved their unique her… [+3044 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kiley Price", "title": "New state of matter discovered using ultradense crystals - Space.com", "description": "By shining a strong beam of light through two chemical compounds, scientists discovered a unique new state of matter made of particles called excitons.", "url": "https://www.livescience.com/physics-mathematics/exotic-new-state-of-matter-discovered-by-squishing-subatomic-particles-into-an-ultradense-crystal", "urlToImage": "https://cdn.mos.cms.futurecdn.net/a5Z3NsHGjXcbPbW3SjgJAo-1200-80.gif", "publishedAt": "2023-06-26T12:00:53Z", "content": "Physicists have discovered an exotic new state of matter that takes the form of a highly ordered crystal of subatomic particles. The new state of matter, called a \"bosonic correlated insulator,\" coul… [+2822 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Protein is essential for neuronal axon structure and circuit connections in flies and humans - Tech Explorist", "description": "Perlecan is key for sustaining the structural integrity of neuronal axons.", "url": "https://www.techexplorist.com/protein-essential-neuronal-axon-structure-circuit-connections-flies-humans/62999/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/retractiopn-ball.jpg", "publishedAt": "2023-06-26T11:54:20Z", "content": "Neurons require controlled polarisation and synaptic material travel to preserve their individual structure and electrical characteristics. Indeed, axonal transport disruption has been linked to vari… [+3839 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "James Webb Space Telescope makes sensational discovery on coolest exoplanet TRAPPIST-1 c - HT Tech", "description": "NASA’s James Webb Space Telescope discovers that TRAPPIST-1 c is likely to have no atmosphere at all or a thin atmosphere.", "url": "https://tech.hindustantimes.com/tech/news/james-webb-space-telescope-makes-sensational-discovery-on-coolest-exoplanet-trappist-1-c-71687780137717.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/26/1600x900/NASA_1687780203579_1687780221600.jpg", "publishedAt": "2023-06-26T11:53:55Z", "content": "Back in February 2017, researchers with the help of the Spitzer Space Telescope discovered a large batch of Earth-sized rocky exoplanets. Ever since then, researchers have been trying to study the at… [+1966 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Anushka Vats", "title": "NASA Releases Amazing Ultraviolet Images Captured By MAVEN Spacecraft | See Pics - Jagran English", "description": "According to the space agency in this color scheme atmospheric ozone appears purple while clouds and hazes appear white or blue", "url": "https://english.jagran.com/world/nasa-releases-amazing-ultraviolet-images-captured-by-maven-spacecraft-see-pics-10084662", "urlToImage": "https://imgeng.jagran.com/images/2023/jun/NASA Mars1687780554596.jpg", "publishedAt": "2023-06-26T11:53:00Z", "content": "NASA shared some unseen pictures of Mars taken from the space agency's MAVEN (Mars Atmosphere and Volatile EvolutioN) spacecraft. While one of the ultraviolet images of the planet was taken in July 2… [+2196 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Stellar collisions reveal new path to Gamma-ray bursts - Open Access Government", "description": "An international team of astrophysicists studying a gamma-ray burst (GRB) may have discovered a new way to destroy stars in our galaxy", "url": "https://www.openaccessgovernment.org/stellar-collisions-gamma-ray-bursts/161832/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2023/06/279724-scaled.jpg", "publishedAt": "2023-06-26T11:46:22Z", "content": "While most gamma-ray bursts (GRBs) are produced by exploding massive stars or neutron-star mergers, GRB 191019A appears to have originated from the collision of stars or stellar remnants near a super… [+4361 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shattering Preconceptions: Diverse Spinosaur Species Roamed Cretaceous Britain - SciTechDaily", "description": "A recent study by the University of Southampton indicates that distinct spinosaur groups lived in Cretaceous Britain, challenging previous beliefs. Using a spinosaur tooth from the Hastings Museum, researchers found it belonged to a different species, not the…", "url": "https://scitechdaily.com/shattering-preconceptions-diverse-spinosaur-species-roamed-cretaceous-britain/", "urlToImage": "https://scitechdaily.com/images/White-Rock-Spinosaurid-scaled.jpg", "publishedAt": "2023-06-26T11:11:22Z", "content": "ByPeerJJune 26, 2023\r\nIllustration of White Rock spinosaurid by Anthony Hutchings. A new study by paleontologists at the University of Southamptons EvoPalaeoLab shows that several distinct groups of … [+6228 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "In a first, rat organs successfully transplanted after 100-day storage - Interesting Engineering", "description": "The new 'rewarming' technique involves the use of iron oxide nanoparticles added to a cryoprotectant chemical.", "url": "https://interestingengineering.com/science/successfully-transplant-rat-organ-stored-100", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/26/image/jpeg/SAGWxyVO9vxjbQgbMH2xnOljNWzJyLO5caLc9bPN.jpg", "publishedAt": "2023-06-26T10:56:00Z", "content": "The new 'warming' method \r\nTo solve the uneven heating issues, the team has developed a specialized nano-warming process that warms the organ inside out. \r\nThe new rewarming technique involves using … [+2044 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "CityU Physicist Develops a Novel Quantum Theory of Light-Induced Matter, Opening the Door to Cutting-Edge Optical Technologies - AZoOptics", "description": "A team led by a physicist from City University of Hong Kong (CityU) recently developed a new quantum theory that explains the “light-induced phase” of matter and predicts its novel functionalities.", "url": "https://www.azooptics.com/News.aspx?newsID=28344", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_28344_16877748830891109.png", "publishedAt": "2023-06-26T10:13:00Z", "content": "A team led by a physicist from City University of Hong Kong (CityU) recently developed a new quantum theory that explains the “light-induced phase” of matter and predicts its novel functionalities. T… [+4971 chars]"}, {"source": {"id": null, "name": "Thenationalnews.com"}, "author": "Sarwat Nasir", "title": "Nasa spacecraft to deliver asteroid samples to Earth in September - The National", "description": "A capsule containing asteroid material is expected to land in a desert in Utah", "url": "https://www.thenationalnews.com/world/uk-news/2023/06/26/nasa-spacecraft-to-deliver-asteroid-samples-to-earth-in-september/", "urlToImage": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/uQ7sPJRnT9DcQ8RkFyV87uZSi20=/800x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/BBLXEBO4B5LV6SIDCRGQKBESUY.jpg", "publishedAt": "2023-06-26T10:07:41Z", "content": "A Nasa spacecraft is set to deliver asteroid samples to Earth after almost seven years of deep space travel.\r\nThe Osiris-Rex spacecraft landed on asteroid Bennu on October 21, 2020, to collect sample… [+2903 chars]"}, {"source": {"id": null, "name": "DIYphotography"}, "author": "Alex Baker", "title": "Juno mission captures beautiful swirling clouds over Jupiter - DIY Photography", "description": "NASA has released newly captured and edited images from its Juno mission. The images show a beautiful swirling mass of clouds over the gas giant Jupiter. The mission completed its 49th close flyby of Jupiter on March 1, 2023. “As the spacecraft flew low over …", "url": "https://www.diyphotography.net/juno-mission-captures-beautiful-swirling-clouds-over-jupiter/", "urlToImage": "https://www.diyphotography.net/wp-content/uploads/2023/06/juno-jupiter.jpg", "publishedAt": "2023-06-26T09:28:36Z", "content": "NASA has released newly captured and edited images from its Juno mission. The images show a beautiful swirling mass of clouds over the gas giant Jupiter.\r\nThe mission completed its 49th close flyby o… [+946 chars]"}, {"source": {"id": null, "name": "Wrvo.org"}, "author": "Ari Daniel", "title": "Why do some people get rashes in space? There's a clue in astronaut blood - WRVO Public Media", "description": "A new study of astronaut blood finds that space travel reduces the expression of 100 genes related to the immune system.", "url": "https://www.wrvo.org/2023-06-26/why-do-some-people-get-rashes-in-space-theres-a-clue-in-astronaut-blood", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/f2f28ea/2147483647/strip/true/crop/4444x2333+0+500/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2023%2F06%2F23%2Fdavid-saint-jacques-and-the-canadian-study-marrow-f9cf4d03721191a3ccee8054c91f898fe4ad1537.jpg", "publishedAt": "2023-06-26T09:22:00Z", "content": "Astronauts are supposed to be in excellent health. It's part of the job description. They quarantine before blasting off to avoid getting sick and derailing a mission. Once aloft, they live and work … [+4840 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Using electric fields to control the movement of defects in crystals - Nanowerk", "description": "This work has important implications for improving the properties and manufacturing processes of typically brittle ionic and covalent crystals, including semiconductors.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=63229.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id63229.jpg", "publishedAt": "2023-06-26T09:20:42Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "Do dead stars crash with the light of 500 million suns? - INSIGHTSIAS - Insights IAS", "description": "Source: TH  Context: Astrophysicists are studying the origins and nature of fast radio bursts (FRBs), powerful radio frequency emissions from distant galaxies, which last only milliseconds. Recent findings suggest that FRBs may be triggered by the collision o…", "url": "https://www.insightsonindia.com/2023/06/26/do-dead-stars-crash-with-the-light-of-500-million-suns/", "urlToImage": null, "publishedAt": "2023-06-26T09:20:09Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Why phage viruses could be the key to treating deadly infections — if they can be harnessed safely - Nature.com", "description": "Interest is growing in how little-known viruses could be used to overcome drug-resistant bacteria.", "url": "https://www.nature.com/articles/d41586-023-01982-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01982-2/d41586-023-01982-2_25523778.jpg", "publishedAt": "2023-06-26T09:06:54Z", "content": null}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "Youth on Tech Latest Episode: Revealing Moon Mysteries, Exploring the Universe - PR Newswire", "description": "/PRNewswire/ -- This is a report from Science and Technology Daily: China has revealed its plan to send astronauts to the moon by 2030. Themed by the...", "url": "https://www.prnewswire.com/news-releases/youth-on-tech-latest-episode-revealing-moon-mysteries-exploring-the-universe-301862909.html", "urlToImage": "https://mma.prnewswire.com/media/2103035/Youth_on_Tech_EP3.mp4?p=medium", "publishedAt": "2023-06-26T08:25:00Z", "content": "BEIJING, June 26, 2023 /PRNewswire/ -- This is a report from Science and Technology Daily:  China has revealed its plan to send astronauts to the moon by 2030. Themed by the \"Revealing Moon Mysteries… [+4764 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Clues About the Origin of Complex Life Revealed - Technology Networks", "description": "New research has revealed that eukaryotes trace their roots back to a common ancestor from the Asgard archaea.", "url": "https://www.technologynetworks.com/cell-science/news/new-clues-about-the-origin-of-complex-life-revealed-375251", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/375251/new-clues-about-the-origin-of-complex-life-revealed-375251-640x360.jpg?cb=20230626", "publishedAt": "2023-06-26T08:10:45Z", "content": "Thor, the legendary Norse god from the mythological city of Asgard, is not alone. According to groundbreaking research published in the journal Nature, we humans along with eagles, starfish, daisies … [+5792 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Weaker bonds break more easily than any of the strong polymer - Tech Explorist", "description": "Weaker bonds strengthen the polymers.", "url": "https://www.techexplorist.com/weaker-bonds-break-easily-any-strong-polymer/62974/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Tougher-Materials-1.jpg", "publishedAt": "2023-06-26T07:20:48Z", "content": "MIT and Duke University chemists developed a novel approach to strengthening polymers by inserting weaker links into the material. \r\nThe researchers discovered that utilizing a weaker form of crossli… [+3969 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "130-foot asteroid 2023 MO2 set to zoom past Earth at a fiery 46370 kmph, NASA reveals - HT Tech", "description": "130foot asteroid 2023 MO2 set to zoom past Earth at a fiery 46370 kmph NASA reveals NASA has warned that a massive 130foot wide Asteroid 2023 MO2 will make its closest approach towards Earth tomorrow. Is it a matter of concern A huge number of giant asteroids…", "url": "https://tech.hindustantimes.com/web-stories/130foot-asteroid-2023-mo2-set-to-zoom-past-earth-at-a-fiery-46370-kmph-nasa-reveals-71687780955456.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/26/1600x900/space-7785863_1920_1687781116793_1687781135831.png/", "publishedAt": "2023-06-26T06:43:31Z", "content": "Photo Credit: Pixabay\r\n NASA has warned that a massive 130-foot wide Asteroid 2023 MO2 will make its closest approach towards Earth tomorrow. Is it a matter of concern? \r\nPhoto Credit: Pixabay\r\n A hu… [+1522 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Why today really isn't 24 hours long - Big Think", "description": "As the Earth spins and wobbles on its axis and revolves elliptically around the Sun, each day changes from the last. \"24 hours\" isn't right.", "url": "https://bigthink.com/starts-with-a-bang/day-isnt-24-hours/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/06/The_Earth_seen_from_Apollo_17_Original_Orientation.jpg?resize=1200,630", "publishedAt": "2023-06-26T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Dunya News"}, "author": null, "title": "Hubble glimpses a glistening cluster - Dunya News", "description": "This cluster of tightly bound stars lies more than 8,000 light-years away from Earth", "url": "https://dunyanews.tv/en/Technology/735014-Hubble-Glimpses-a-Glistening-Cluster", "urlToImage": "https://img.dunyanews.tv/news/2023/June/06-26-23/news_big_images/735014_19857813.jpg", "publishedAt": "2023-06-26T05:05:32Z", "content": "Technology\r\nThis cluster of tightly bound stars lies more than 8,000 light-years away from Earth \r\n(Web Desk) - The teeming stars of the globular cluster NGC 6544 glisten in this image from the NASA/… [+1153 chars]"}, {"source": {"id": null, "name": "Intelligentliving.co"}, "author": "Luana Steffen", "title": "7 Clues Your Hair Reveals About Your Health - Intelligent Living", "description": "Your hair can give away information about your health. According to research, changes in your hair’s appearance, texture, or thickness may indicate underlying medical concerns. Here’s how to determine whether your hair changes are brought on by a medical cond…", "url": "https://www.intelligentliving.co/7-clues-your-hair-reveals-about-your-health/", "urlToImage": "https://www.intelligentliving.co/wp-content/uploads/2022/06/7-Things-Your-Hair-Says-About-Your-Health0.jpg", "publishedAt": "2023-06-26T04:09:26Z", "content": "Your hair can give away information about your health. According to research, changes in your hair’s appearance, texture, or thickness may indicate underlying medical concerns. Here’s how to determin… [+6356 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: New Earth Information Center, Atmosphere Around a Rocky Exoplanet - SciTechDaily", "description": "Showcasing NASA’s new Earth Information Center … In search of an atmosphere around a rocky exoplanet … And getting ready for an important delivery … A few of the stories to tell you about – This Week at NASA! https://youtu.be/Sogrmpd6oII Showcasing the New Ea…", "url": "https://scitechdaily.com/this-week-nasa-new-earth-information-center-atmosphere-around-a-rocky-exoplanet/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-TRAPPIST-1-c-scaled.jpg", "publishedAt": "2023-06-26T02:54:25Z", "content": "ByNASAJune 25, 2023\r\nNASA unveiled a new Earth Information Center at its headquarters, providing both a physical exhibit and a virtual platform that demonstrate how NASAs data can be used to address … [+5765 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Europe Prepares to Launch Spacecraft to Observe 'Dark Side’ of Universe - VOA Learning English", "description": "The European Space Agency prepares to launch a spacecraft to study dark matter and dark energy across the universe. The Euclid spacecraft is expected to launch on July 1.", "url": "https://learningenglish.voanews.com/a/europe-prepares-to-launch-spacecraft-to-observe-dark-side-of-universe/7148712.html", "urlToImage": "https://gdb.voanews.com/01000000-c0a8-0242-a036-08db73f32f5b_w1200_r1.jpg", "publishedAt": "2023-06-25T22:01:27Z", "content": "The European Space Agency (ESA) is preparing to launch a spacecraft designed to study the mysteries of dark matter and dark energy across far reaches of the universe.\r\nThe launch of ESAs Euclid space… [+4169 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Igor Bonifacic", "title": "NASA is recycling 98 percent of astronaut pee and sweat on the ISS into drinkable water - Yahoo Singapore News", "description": "This week, NASA revealed that the International Space Station’s Environmental Control and Life Support System (ECLSS) is recycling 98 percent of all water...", "url": "https://www.engadget.com/nasa-is-recycling-98-percent-of-astronaut-pee-and-sweat-on-the-iss-into-drinkable-water-184332789.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5g.G_FDlhdnQqrLtjBTrYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MjA-/https://s.yimg.com/os/creatr-uploaded-images/2023-06/38efb3d0-1387-11ee-ad23-f4b07937f8c8", "publishedAt": "2023-06-25T18:43:32Z", "content": "NASA has achieved a technological milestone that could one day play an important role in missions to the Moon and beyond. This week, the space agency revealed\r\n (via Space.com\r\n) that the Internation… [+2165 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Steve Huff", "title": "Before Dinosaurs, These Guys Had a Serious Eating Flaw - Newser", "description": "Rhynchosaurs had a single set of teeth they wore down to nubs, may have starved to death in old age", "url": "https://www.newser.com/story/336837/dinosaur-predecessors-looked-like-they-wore-grins-nope.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1478775-12-20230625140952.jpeg", "publishedAt": "2023-06-25T18:30:00Z", "content": "In the age before the towering dinosaurs we know so well from textbooks and Jurassic Park movies, an ugly-cute creature about the size of a pig called the rhynchosaur roamed the Earth, chomping on to… [+2168 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "Another Key Amino Acid Found in Space: Tryptophan - Universe Today", "description": "Astronomers continue to find more and more of the building blocks of life out in space. This time, researchers have announced the discovery of the amino acid tryptophan. They used data from the Spitzer Space Telescope when it observed the Perseus Molecular Co…", "url": "https://www.universetoday.com/162093/another-key-amino-acid-found-in-space-tryptophan/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/ic348.jpg", "publishedAt": "2023-06-25T17:26:45Z", "content": "Astrochemistry is the study of how molecules can form and react in space. Its roots trace back to the 1800s when astronomers such as William Wollaston and Joseph von Fraunhofer began identifying atom… [+2778 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Eerie Echo Detected Coming From Milky Way's Black Hole 200 Years Ago (Listen) - Good News Network", "description": "Scientists have recorded a sound coming from the supermassive black hole at the center of our Milky Way, from an event around 200 years ago.", "url": "https://www.goodnewsnetwork.org/sound-echo-from-milky-way-black-hole-200-yrs-ago/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2021/06/image-milky-way-center-released-X-ray-NASA_CXC_UMass_Q.D.-Wang.jpg", "publishedAt": "2023-06-25T17:16:00Z", "content": "NASA/CXC/UMass/Q.D. Wang\r\nAn international team of scientists has recorded a sound that came from the supermassive black hole at the center of our Milky Way galaxy, stemming from an event around 200 … [+2372 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ISRO's Chandrayaan-3 shines in new pictures ahead of mid-July launch - Republic World", "description": "ISRO is targeting the launch of India's third mission to the Moon, Chandrayaan-3 between July 12-19 from Sriharikota aboard the LVM3 rocket.", "url": "https://www.republicworld.com/science/space/isros-chandrayaan-3-shines-in-new-pictures-ahead-of-mid-july-launch-imageid-1.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/images/xhdpi/ca6fmjejiqrci5li_1687694814.jpeg", "publishedAt": "2023-06-25T16:27:00Z", "content": "Weighing 1,725 kg, the Lander is carrying a 26 kg rover; both having a mission life of one lunar day or 14 Earth days."}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Warming temperatures could make female turtles better mothers - Earth.com", "description": "Warming temperatures could make female turtles better mothers • Earth.com", "url": "https://www.earth.com/news/warming-temperatures-could-make-female-turtles-better-mothers/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/25102311/Turtle-temperatures-scaled.jpg", "publishedAt": "2023-06-25T16:23:55Z", "content": "In a revolutionary new study from Duke University, researchers have found that not only do warmer temperatures make turtle eggs more likely to hatch as females, but these females may also be better e… [+4380 chars]"}, {"source": {"id": null, "name": "Udayavani.com"}, "author": "Udayavani", "title": "Y chromosome loss in men with age linked with worse cancer outcomes - Udayavani English", "description": "Udayavani is leading Kannada newspaper and online Kannada news website, delivering latest news from Mangalore, Udupi, Bangalore, Karnataka, India.", "url": "https://www.udayavani.com/", "urlToImage": "https://www.udayavani.com/wp-content/themes/desktop-udayavni/images/place-holder-620.jpg", "publishedAt": "2023-06-25T14:21:00Z", "content": "kannada news, kannada newspaper, online kannada news, online kannada newspaper\r\nkannada news, kannada newspaper, online kannada news, online kannada newspaper"}, {"source": {"id": null, "name": "Science.org"}, "author": null, "title": "'Adversarial' search for neural basis of consciousness yields first results - Science", "description": "Two rival theories about the basis of perception went head-to-head in neuroscience experiments, but advocates of", "url": "https://www.science.org/content/article/search-neural-basis-consciousness-yields-first-results", "urlToImage": "https://www.science.org/do/10.1126/science.adj3877/abs/_20230623_on_consciousness_contest.jpg", "publishedAt": "2023-06-25T14:12:35Z", "content": "NEW YORK CITYAmidst rock music, a rap about consciousness, and the calling in of a 25-year-old drunken bet, camps backing two leading theories of how consciousness arises from the brain waited anxiou… [+9088 chars]"}, {"source": {"id": null, "name": "Explorersweb.com"}, "author": "Rebecca McPhee", "title": "Tonga Eruption Caused the Most Intense Lightning Storm Ever » Explorersweb - ExplorersWeb", "description": "The Hunga Tonga-Hunga Ha’api volcano produced the most powerful atmospheric explosion ever. Now we know it generated the most intense lightning storm too.", "url": "https://explorersweb.com/tonga-eruption-most-intense-lightning-storm-ever/", "urlToImage": "https://s3.amazonaws.com/www.explorersweb.com/wp-content/uploads/2023/06/24232004/122748966_volcano_noaav2-1.png-e1687648919952.webp", "publishedAt": "2023-06-25T11:13:10Z", "content": "On January 15, 2022, the Hunga Tonga-Hunga Haapi (HTHH) underwater volcano erupted, producing the most powerful atmospheric explosion ever recorded. Now, a new study has found that it also generated … [+2465 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Mane Kara-Yakoubian", "title": "New research links climate change to shrinking brain size in modern humans - PsyPost", "description": "A new study suggests that decreases in brain size in modern humans may be driven by natural selection in response to climate change and environmental stress, starting around 15,000 years ago. The research indicates that the human brain continues to evolve, an…", "url": "https://www.psypost.org/2023/06/new-research-links-climate-change-to-shrinking-brain-size-in-modern-humans-165988", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/06/nature-brain-leaves-blowing-away.jpg", "publishedAt": "2023-06-25T11:05:26Z", "content": "Prior work has linked decreases in the brain size of modern humans to increases in obesity. A new paper published in Brain, Behaviour, and Evolution considers climate change as a potential factor aff… [+3179 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "Space probe snaps phenomenal pictures of Mercury showing tectonic curiosities and a new crater - TweakTown", "description": "A European Space Agency-controlled space probe has snapped a collection of images of Mercury while it completed its third fly-by of the planet.", "url": "https://www.tweaktown.com/news/92076/space-probe-snaps-phenomenal-pictures-of-mercury-showing-tectonic-curiosities-and-new-crater/index.html", "urlToImage": "https://static.tweaktown.com/news/9/2/92076_645465456_space-probe1-snaps-phenomenal-pictures-of-mercury-showing-tectonic-curiosities-and-new-crater_full.png", "publishedAt": "2023-06-25T09:58:03Z", "content": "A space probe has made its way past Mercury for the third time has captured several incredible shots of the innermost planet.\r\nA mission that's a combined effort between the European Space Agency (ES… [+1442 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Digvijay", "title": "NASA's Latest Release: The Mesmerising Sound Of The Black Hole Sagittarius A* - Indiatimes.com", "description": "Space agency NASA has enthralled millions of people yet again with a mesmerising data sonification of a supermassive black hole. Watch the video here. NASA shares the sound of a black hole The sonification was shared on Instagram by the Space Agency, who desc…", "url": "https://www.indiatimes.com/trending/environment/nasa-releases-sound-of-a-black-hole-607043.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jun/Sagittarius-A_6497c57c9e3e9.png", "publishedAt": "2023-06-25T05:46:58Z", "content": "Space agency NASA has enthralled millions of people yet again with a mesmerising data sonification of a supermassive black hole. Watch the video here. \r\nThe sonification was shared on Instagram by th… [+1829 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Cambridge Study: Current Climate Projections Significantly Underestimate Impact of Volcanic Eruptions - SciTechDaily", "description": "Scientists have discovered that standard climate predictions may undervalue the surface temperature cooling effect of volcanic eruptions by a multiple of two, possibly even four. Despite this, the effect is not substantial enough to counterbalance the global …", "url": "https://scitechdaily.com/new-cambridge-study-current-climate-projections-significantly-underestimate-impact-of-volcanic-eruptions/", "urlToImage": "https://scitechdaily.com/images/Supervolcano-Eruption.gif", "publishedAt": "2023-06-25T05:11:23Z", "content": "A study led by the University of Cambridge suggests that the cooling effect of volcanic eruptions on Earths surface temperature is likely underestimated in standard climate projections, possibly by u… [+5443 chars]"}, {"source": {"id": null, "name": "SpaceCoastDaily.com"}, "author": "Zach Clark", "title": "NASA's Juno Mission Observes High-Altitude Hazes in Jupiter's Atmosphere - SpaceCoastDaily.com", "description": "As the spacecraft flew low over the giant planet's cloud tops, its JunoCam instrument captured this look at bands of high-altitude haze forming above cyclones in an area known at Jet N7.", "url": "https://spacecoastdaily.com/2023/06/nasas-juno-mission-observes-high-altitude-hazes-in-jupiters-atmosphere/", "urlToImage": "https://spacecoastdaily.com/wp-content/uploads/2023/06/jupiter_juno_600.jpg", "publishedAt": "2023-06-25T04:03:22Z", "content": "By Space Coast Daily  //  June 25, 2023 \r\nAt the time the image was taken, Juno was about 5,095 miles (8,200 kilometers) above Jupiter’s cloud tops, at a latitude of about 66 degrees. (NASA Image)\r\n(… [+844 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fusion, Recoil, Discovery: A New Type of Atomic Nucleus Discovered - SciTechDaily", "description": "In a remarkable scientific breakthrough researchers have discovered the lightest isotope of the rare and rapidly decaying element, astatine. The discovery of 190-Astatine was made by Master of Science graduate Henna Kokkonen as part of her thesis work, provid…", "url": "https://scitechdaily.com/fusion-recoil-discovery-a-new-type-of-atomic-nucleus-discovered/", "urlToImage": "https://scitechdaily.com/images/Atomic-Nucleus-Art-Concept.jpg", "publishedAt": "2023-06-25T01:30:26Z", "content": "Researchers at the Accelerator Laboratory of the University of Jyväskylä, Finland, have made a groundbreaking discovery of a new atomic nucleus, 190-Astatine, which is now the lightest known isotope … [+3083 chars]"}, {"source": {"id": null, "name": "Gearrice.com"}, "author": "Arthur Morgan", "title": "They create a robot inspired by a pangolin capable of performing medical procedures inside the human being - Gearrice", "description": "The small robot inspired by a pangolin that is capable of performing all kinds of operations inside the human being.", "url": "https://www.gearrice.com/update/they-create-a-robot-inspired-by-a-pangolin-capable-of-performing-medical-procedures-inside-the-human-being/", "urlToImage": "https://cdn.computerhoy.com/sites/navi.axelspringer.es/public/media/image/2023/06/crean-robot-inspirado-pangolin-capaz-realizar-procedimientos-medicos-interior-ser-humano-3066846.jpg", "publishedAt": "2023-06-24T22:34:50Z", "content": "We have seen a multitude of robots created by researchers, but now we have another one that is surprising since it is inspired by a small pangolin and is capable of entering areas of the human body t… [+1514 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Einstein And Euler Put To The Test At The Edge Of The Universe - Eurasia Review", "description": "The cosmos is a unique laboratory for testing the laws of physics, in particular those of Euler and Einstein. Euler described the movements of celestial objects, while Einstein described the way in…", "url": "https://www.eurasiareview.com/25062023-einstein-and-euler-put-to-the-test-at-the-edge-of-the-universe/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2018/07/a-314-e1682291330579.jpg?fit=800%2C450&ssl=1", "publishedAt": "2023-06-24T22:10:51Z", "content": "The cosmos is a unique laboratory for testing the laws of physics, in particular those of Euler and Einstein. Euler described the movements of celestial objects, while Einstein described the way in w… [+3861 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists are closer to unlocking the secrets of spider silk - Earth.com", "description": "Scientists are closer to unlocking the secrets of the strongest spider silk in the world • Earth.com", "url": "https://www.earth.com/news/scientists-are-closer-to-unlocking-the-secrets-of-spider-silk/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/24155134/spider-web_rainbow_1medium.jpg", "publishedAt": "2023-06-24T19:50:02Z", "content": "In the world of materials science, spider silk is fascinating. It’s a material that’s super strong, incredibly light, and remarkably flexible. Yet, despite the tireless efforts of many researchers, t… [+6374 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Matt Williams, Universe Today", "title": "Astronomers Spot the Same Supernova 4 Times Due to an Einsteinian Effect - Inverse", "description": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it — collectively referred to as the Cosmic Distance Ladder.", "url": "https://www.inverse.com/science/astronomers-see-the-same-supernova-four-times-thanks-to-a-gravitational-lens", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/6/20/41d7f1e2-d38c-443d-87ae-b37032e09f7a-einstein_cross-1915x1200.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-24T18:00:25Z", "content": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it collectively referred to as the Cosmic Distance Ladder. One particularly crucial tool is Type Ia… [+3845 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "Dolphin ancestors had super weird teeth: A new study on the 'grandparents of modern dolphins' - Salon", "description": "Salon spoke with the author of a paleontology study the hints at the evolution of echolocation in dolphins", "url": "https://www.salon.com/2023/06/24/dolphin-ancestors-had-super-weird-teeth-a-new-study-on-the-grandparents-of-modern-dolphins/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/06/life_reconstruction_of_olympicetus_thalassodon_01.jpg", "publishedAt": "2023-06-24T17:59:00Z", "content": null}, {"source": {"id": null, "name": "Famagusta Gazette"}, "author": "Famagusta Gazette", "title": "Eighth launch and landing for Falcon 9 – Famagusta Gazette - Famagusta Gazette", "description": "U.S. private space company SpaceX launched 56 more Starlink satellites into orbit on Friday.The satellites were launched on a Falcon 9 rocket from Space Launch Complex 40 at Cape Canaveral Space F", "url": "https://famagusta-gazette.com/2023/06/24/eighth-launch-and-landing-for-falcon-9/", "urlToImage": "https://famagusta-gazette.com/wp-content/uploads/2021/12/space.jpg", "publishedAt": "2023-06-24T17:42:28Z", "content": "U.S. private space company SpaceX launched 56 more Starlink satellites into orbit on Friday.\r\nThe satellites were launched on a Falcon 9 rocket from Space Launch Complex 40 at Cape Canaveral Space Fo… [+1202 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of Glasgow Expert Gear Up For Next Gravitational Wave Observing Run - India Education Diary", "description": "Researchers from the University of Glasgow’s School of Physics & Astronomy are preparing for the next observing run of the international LIGO–Virgo–KAGRA (LVK) network of gravitational-wave detectors. The LVK collaboration consists of scientists", "url": "https://indiaeducationdiary.in/university-of-glasgow-expert-gear-up-for-next-gravitational-wave-observing-run/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/Media_704774_smxx.jpg", "publishedAt": "2023-06-24T17:06:51Z", "content": "Researchers from the University of Glasgows School of Physics &amp; Astronomy are preparing for the next observing run of the international LIGOVirgoKAGRA (LVK) network of gravitational-wave detector… [+10237 chars]"}, {"source": {"id": null, "name": "Gearrice.com"}, "author": "Advay Hora", "title": "New Headless Dinosaur Fossils Reveal Long Necks Have Serious Disadvantages - Gearrice", "description": "join the conversation", "url": "https://www.gearrice.com/update/new-headless-dinosaur-fossils-reveal-long-necks-have-serious-disadvantages/", "urlToImage": "https://www.mundodeportivo.com/urbantecno/hero/2023/06/sauropodos.jpg", "publishedAt": "2023-06-24T16:45:01Z", "content": "Sauropods are terrestrial dinosaurs that stand out for having very long necks. Wikipedia\r\nLong-necked dinosaurs, both in the terrestrial and marine spheres, are considered to be some of the largest l… [+3104 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Scott Alan Johnston", "title": "Early Black Holes Were Bigger Than We Thought - Universe Today", "description": "Every large galaxy in the nearby universe contains a supermassive black hole at its core. The mass of those black holes seems to have a relationship to the mass of the host galaxies themselves. But estimating the masses of more distant supermassive black hole…", "url": "https://www.universetoday.com/162080/early-black-holes-were-bigger-than-we-thought/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/Black_Holes_-_Monsters_in_Space.jpg", "publishedAt": "2023-06-24T16:07:16Z", "content": "Every large galaxy in the nearby universe contains a supermassive black hole at its core. The mass of those black holes seems to have a relationship to the mass of the host galaxies themselves. But e… [+3908 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Perseverance and the science of obtaining results - HT Tech", "description": "The NASA Science Team is making a special effort to acquire a sample of a conglomerate rock unit located on Mars.", "url": "https://tech.hindustantimes.com/tech/news/perseverance-and-the-science-of-obtaining-results-71687619378198.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/301ECMUN0400132CA_1687619478401_1687619478609.jpg", "publishedAt": "2023-06-24T15:14:54Z", "content": "The NASA Science Team is making a special effort to acquire a sample of a conglomerate rock unit located on top of the fan in Jezero crater on Mars. Unfortunately, the initial attempt resulted in a s… [+1808 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study discovers secrets of high-elevation pregnancies - ThePrint", "description": "Washington [US], June 24 (ANI): Researchers discovered genetic foundations that allow certain populations of highland mice to protect growing foetuses at higher elevations. The findings were published in the journal ‘Proceedings of the National Academy of Sci…", "url": "https://theprint.in/health/study-discovers-secrets-of-high-elevation-pregnancies/1641151/", "urlToImage": null, "publishedAt": "2023-06-24T15:14:27Z", "content": "Washington [US], June 24 (ANI): Researchers discovered genetic foundations that allow certain populations of highland mice to protect growing foetuses at higher elevations.\r\nThe findings were publish… [+2423 chars]"}]}