{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA Briefing on Mid-point of Artemis I Moon Mission - NASA Video", "description": "NASA will host a news conference from NASA’s Johnson Space Center in Houston to discuss the status of the uncrewed Artemis I flight test as the Orion spacecr...", "url": "https://www.youtube.com/watch?v=3bZlfpSOHik", "urlToImage": "https://i.ytimg.com/vi/3bZlfpSOHik/maxresdefault_live.jpg", "publishedAt": "2022-11-28T22:03:27Z", "content": null}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "'Transformer' pinwheels offer new twist on nano-engineered materials - Nanowerk", "description": "Producing chirality, a property found throughout nature, through large-scale self-assembly could lead to applications in sensing, machine perception and more.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=61917.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id61917_2.jpg", "publishedAt": "2022-11-28T20:48:40Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Aaromal Maanas", "title": "6 Exercises You Should Do For Better Bone Health - Sportskeeda", "description": "Bone health and longevity are rising topics of importance in the medical realm.", "url": "https://www.sportskeeda.com/health-and-fitness/6-exercises-you-should-do-for-better-bone-health", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/3aed4-16696460427118-1920.jpg", "publishedAt": "2022-11-28T20:30:00Z", "content": "Bone health and longevity are rising topics of importance in the medical realm. Here are a few statistics to affirm the importance of skeletal health:\r\n<ul><li>One in two people over 50 years of age … [+4850 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Novel sex-determination mechanism revealed in mammals - Phys.org", "description": "In mammals, the distinction between male and female at the chromosomal level is due to the X and Y chromosomes. Typically, females have two X chromosomes (XX) while males have an X and a Y chromosome (XY). The Sry gene on the Y chromosome triggers the formati…", "url": "https://phys.org/news/2022-11-sex-determination-mechanism-revealed-mammals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/novel-sex-determinatio.jpg", "publishedAt": "2022-11-28T20:00:01Z", "content": "In mammals, the distinction between male and female at the chromosomal level is due to the X and Y chromosomes. Typically, females have two X chromosomes (XX) while males have an X and a Y chromosome… [+3586 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Fuel Ignition and Bottle Bubbles Snag Video Prize - Physics", "description": "An annual APS video prize went to supercomputer simulations, control of chaotic Faraday waves, and studies of a large bubble in a bottle.", "url": "https://physics.aps.org/articles/v15/185", "urlToImage": "https://physics.aps.org/assets/4c8728f0-130e-4e31-993d-abedeb5fd7b2/e185_1_thumb.png", "publishedAt": "2022-11-28T19:53:06Z", "content": "Researchers have been redesigning diesel engines to increase efficiency and reduce emissions. This work relies on supercomputers for modeling the turbulent flow of the fuel-air mixture and the thousa… [+2141 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Two minerals never before been seen on Earth found inside 17-ton meteorite - Livescience.com", "description": "The minerals were found inside a slice of the El Ali meteorite, which landed in Somalia in 2020", "url": "https://www.livescience.com/two-new-minerals-found-inside-meteorite", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RNpqdMchunRoNHiXv9uyFQ-1200-80.jpg", "publishedAt": "2022-11-28T19:34:01Z", "content": "Two minerals that have never been seen before on Earth have been discovered inside a massive meteorite in Somalia. They could hold important clues to how asteroids form.\r\nThe two brand new minerals w… [+2189 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The replication crisis: Researchers reveal a hidden universe of uncertainty - Phys.org", "description": "The University of Luxembourg's Department of Social Sciences contributed to a large-scale replication study that aimed to understand the role of decisions that scientists make during the research process. Published in the Proceedings of the National Academy o…", "url": "https://phys.org/news/2022-11-replication-crisis-reveal-hidden-universe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/researchers-reveal-a-h.jpg", "publishedAt": "2022-11-28T19:27:00Z", "content": "The University of Luxembourg's Department of Social Sciences contributed to a large-scale replication study that aimed to understand the role of decisions that scientists make during the research pro… [+2797 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Mapping the future of micromotors - Phys.org", "description": "It's the stuff of cartoons and movies: a team of scientists shrinks down and flies a ship the size of a blood vessel through tissue and sinew to the site of injury or disease. They directly repair or attack the site—whatever is needed—without disturbing surro…", "url": "https://phys.org/news/2022-11-future-micromotors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/mapping-the-future-of.jpg", "publishedAt": "2022-11-28T19:26:28Z", "content": "It's the stuff of cartoons and movies: a team of scientists shrinks down and flies a ship the size of a blood vessel through tissue and sinew to the site of injury or disease. They directly repair or… [+4548 chars]"}, {"source": {"id": null, "name": "Cool Hunting"}, "author": "Kelly Pau", "title": "World's Oldest Fossilized Brain Discovered – COOL HUNTING® - Cool Hunting", "description": "A 525-million-year-old fossil of an extinct worm-like animal known as the Cardiodictyon catenulum was first discovered in China in 1984, but only recently have scientists found that the barely half…", "url": "http://coolhunting.com/culture/worlds-oldest-fossilized-brain-discovered/", "urlToImage": "https://i0.wp.com/coolhunting.com/wp-content/uploads/2022/11/brain-fossil.jpg?fit=675%2C675&ssl=1", "publishedAt": "2022-11-28T19:24:53Z", "content": "A 525-million-year-old fossil of an extinct worm-like animal known as the Cardiodictyon catenulum was first discovered in China in 1984, but only recently have scientists found that the barely half-a… [+959 chars]"}, {"source": {"id": null, "name": "Muscle & Fitness"}, "author": "vkim", "title": "Top 4 Mobility Exercises For Healthy Aging - Muscle & Fitness", "description": "Did the chicken or the egg come first? Who cares? Both chicken and the egg are delicious—and you’re wondering what this has to do with mobility exercises. Stay with me for a moment. In the fitness universe, “experts” have often debated which exercise quality …", "url": "https://www.muscleandfitness.com/workouts/full-body-exercises/top-4-mobility-exercises-for-healthy-aging/#article", "urlToImage": "https://www.muscleandfitness.com/wp-content/uploads/2020/05/Man-Stretching-His-Hips-In-The-Gym.jpg?w=1109&h=614&crop=1&quality=86&strip=all", "publishedAt": "2022-11-28T18:46:27Z", "content": "Did the chicken or the egg come first? Who cares? Both chicken and the egg are deliciousand youre wondering what this has to do with mobility exercises.\r\nStay with me for a moment. In the fitness uni… [+2730 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Why steamed hay can lead to protein deficiency in horses - Phys.org", "description": "Hay treated with hot steam is safer for horses but provides them with less protein. The horse forage is treated with steam to rid it of potentially harmful microorganisms and to bind particles that could otherwise be inhaled. However, a team of scientists fro…", "url": "https://phys.org/news/2022-11-steamed-hay-protein-deficiency-horses.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/horse-eating-hay-1.jpg", "publishedAt": "2022-11-28T18:39:02Z", "content": "Hay treated with hot steam is safer for horses but provides them with less protein. The horse forage is treated with steam to rid it of potentially harmful microorganisms and to bind particles that c… [+3496 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Williams", "title": "What happened to those CubeSats that were launched with Artemis I? - Phys.org", "description": "NASA made history on November 16 when the Artemis I mission took off from Launch Complex 39B at Cape Canaveral, Florida, on its way to the moon. This uncrewed mission is testing the capabilities of the Space Launch System (SLS) and Orion spacecraft in prepara…", "url": "https://phys.org/news/2022-11-cubesats-artemis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/what-happened-to-those.jpg", "publishedAt": "2022-11-28T18:15:11Z", "content": "NASA made history on November 16 when the Artemis I mission took off from Launch Complex 39B at Cape Canaveral, Florida, on its way to the moon. This uncrewed mission is testing the capabilities of t… [+4863 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "How does NASA prepare for Artemis by using this fictitious Moon dirt. Details here - Economic Times", "description": "Lunar Regolith is an artificial soil that matches the moon's surface. NASA Artemis used this to practise landing on the moon's surface.", "url": "https://economictimes.indiatimes.com/news/international/us/how-does-nasa-prepare-for-artemis-by-using-this-fictitious-moon-dirt-details-here/articleshow/95836763.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95836762,width-1070,height-580,imgsize-47008,overlay-economictimes/photo.jpg", "publishedAt": "2022-11-28T18:09:00Z", "content": "Many companies in the market have expertise in making and selling fake Moon soil or dirt. Lunar Regolith is the fake moon dirt used by many space organisations for various purposes.\r\nThe Regolith was… [+1518 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "What's Common Between Human And Octopus Brains? Scientists Explore Reasons For Similarities - ABP Live", "description": "Special RNAs called miRNAs are found in the neural tissues of octopuses. This shows that developments that occurred in vertebrates also took place in octopuses.", "url": "https://news.abplive.com/science/what-s-common-between-human-and-octopus-brains-scientists-explore-reasons-for-similarities-1566158", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/28/e10816bebbe1bbe73bfca94110f44d871669654227550324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-11-28T18:03:14Z", "content": "Did you know that octopus and human brains have certain things in common? Cephalopods such as octopuses, squids and cuttlefish have complex nervous systems, and are highly intelligent animals. A team… [+5031 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers discover overlooked Jurassic Park of lizards - ANI News", "description": "New research published today in eLife by researchers from the Institut Catala de Paleontologia Miquel Crusafont (ICP) and the University of Bristol (UB) moves back the moment of the radiation of squamates the group of reptiles that includes lizards, snakes an…", "url": "https://www.aninews.in/news/science/researchers-discover-overlooked-jurassic-park-of-lizards20221128232255", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221128173425.jpg", "publishedAt": "2022-11-28T17:52:00Z", "content": "Washington [US], November 28 (ANI): New research published in eLife by researchers from the Institut Catala de Paleontologia Miquel Crusafont (ICP) and the University of Bristol (UB) moves back the m… [+3393 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Brandon Vigliarolo", "title": "ISS resupply drops off experiments for life in deep space - The Register", "description": "If we're going to go beyond the Moon, we'll need food, a way to build stuff, and health diagnostic technology", "url": "https://www.theregister.com/2022/11/28/spacex_iss_resupply/", "urlToImage": "https://regmedia.co.uk/2022/11/28/spacex-resupply-26.jpg", "publishedAt": "2022-11-28T17:30:00Z", "content": "SpaceX's 26th commercial resupply mission to the International Space Station arrived this weekend, bringing with it a bundle of scientific experiments to further prepare humans for life beyond Earth.… [+5411 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "'Frightful' never-before-seen tyrannosaur might be the 'missing link' in T. rex evolution - Livescience.com", "description": "Paleontologists have discovered fossils belonging to a newfound species of tyrannosaur, which could fill an important gap in the evolutionary history of T. rex.", "url": "https://www.livescience.com/new-tyrannosaur-species-discovered-montana", "urlToImage": "https://cdn.mos.cms.futurecdn.net/v4Zp7GfrbjeKQSkjynGRdm-1200-80.jpg", "publishedAt": "2022-11-28T17:27:19Z", "content": "A reconstruction of what the new tyrannosaur, Daspletosaurus wilsoni, may have looked like. Fossils suggest that it had unique arrangement of spiked hornlets surrounding its eyes. (Image credit: Andr… [+4131 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A structural model of the profilin–formin pacemaker system for actin filament elongation | Scientific Reports - Nature.com", "description": "Scientific Reports - A structural model of the profilin–formin pacemaker system for actin filament elongation", "url": "https://www.nature.com/articles/s41598-022-25011-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-25011-w/MediaObjects/41598_2022_25011_Fig1_HTML.png", "publishedAt": "2022-11-28T16:35:49Z", "content": "<li>Carlier, M. F. &amp; Shekhar, S. Global treadmilling coordinates actin turnover and controls the size of actin networks. Nat. Rev. Mol. Cell. Biol.18, 389401 (2017).\r\nCAS \r\n PubMed \r\nGoogle Schol… [+10934 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Physics - Predicting the Structures of Proteins - Physics", "description": "Kathryn Tunyasuvunakool fell in love with computer programming while studying roundworms. Today she uses that passion to help predict protein structures.", "url": "https://physics.aps.org/articles/v15/181", "urlToImage": "https://physics.aps.org/assets/7a6f7252-b2ad-44a0-ab18-5ac6bc940b96/e181_1_thumb.png", "publishedAt": "2022-11-28T16:03:04Z", "content": "Kathryn Tunyasuvunakool grew up surrounded by scientific activities carried out at home by her mother—who went to university a few years after Tunyasuvunakool was born. One day a pendulum hung from a… [+5807 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Physics - Machine-Learning Model Reveals Protein-Folding Physics - Physics", "description": "An algorithm that already predicts how proteins fold might also shed light on the physical principles that dictate this folding.", "url": "https://physics.aps.org/articles/v15/183", "urlToImage": "https://physics.aps.org/assets/1338c84a-78c2-4c1d-ae9c-edbf8fbdeb1f/e183_4_thumb.png", "publishedAt": "2022-11-28T16:03:04Z", "content": "Figure 1:Roney and Ovchinnikov have proposed a mechanism by which the machine-learning model AlphaFold predicts the 3D structure of a protein from a given amino-acid sequence [3]. AlphaFold uses info… [+7965 chars]"}, {"source": {"id": null, "name": "Pib.gov.in"}, "author": null, "title": "India's SARAS radio telescope provides astronomers clues to the nature of Universe's first stars and galaxies - PIB", "description": "Scientists have determined properties of radio luminous galaxies formed just 200 million years post", "url": "https://pib.gov.in/PressReleasePage.aspx?PRID=1879653", "urlToImage": "https://164.100.158.168/images/indian-emblem.png", "publishedAt": "2022-11-28T16:00:00Z", "content": "Ministry of Science &amp; Technology\r\nPosted On:\r\n 28 NOV 2022 9:30PM by PIB Delhi\r\nScientists have determined properties of radio luminous galaxies formed just 200 million years post the Big Bang, a… [+5275 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Adam Zewe | MIT News Office", "title": "New device can control light at unprecedented speeds - MIT News", "description": "Scientists have developed a programmable, wireless spatial light modulator that can manipulate light at the wavelength scale with orders-of-magnitude faster response than existing devices.", "url": "https://news.mit.edu/2022/control-light-beam-holograms-1128", "urlToImage": "https://news.mit.edu/sites/default/files/images/202211/MIT-CrystalModulator-01-press.jpg", "publishedAt": "2022-11-28T16:00:00Z", "content": "In a scene from Star Wars: Episode IV A New Hope, R2D2 projects a three-dimensional hologram of Princess Leia making a desperate plea for help. That scene, filmed more than 45 years ago, involved a b… [+7667 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Cell division enzyme earmarked as potential new cancer therapeutic target - Phys.org", "description": "To make new cells, we have to divide existing ones. This is a continuous, frequent and ubiquitous process which starts at conception and ends at death. There are an estimated 37 trillion cells in the tissues and organs of the human body, each of which origina…", "url": "https://phys.org/news/2022-11-cell-division-enzyme-earmarked-potential.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cell-division-enzyme-e.jpg", "publishedAt": "2022-11-28T15:59:03Z", "content": "To make new cells, we have to divide existing ones. This is a continuous, frequent and ubiquitous process which starts at conception and ends at death. There are an estimated 37 trillion cells in the… [+5126 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Brain Uses Calculus to Control Fast Movements - Quanta Magazine", "description": "Researchers discover that to sharpen its control over precise maneuvers, the brain uses comparisons between control signals — not the signals themselves.", "url": "https://www.quantamagazine.org/the-brain-uses-calculus-to-control-fast-movements-20221128/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/11/BrainCalculus-cr.KristinaArmitage-Social.webp", "publishedAt": "2022-11-28T15:51:10Z", "content": "A mouse is running on a treadmill embedded in a virtual reality corridor. In its minds eye, it sees itself scurrying down a tunnel with a distinctive pattern of lights ahead. Through training, the mo… [+5788 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "A scalable quantum memory with a lifetime over 2 seconds and integrated error detection - Phys.org", "description": "Quantum memory devices can store data as quantum states instead of binary states, as classical computer memories do. While some existing quantum memory technologies have achieved highly promising results, several challenges will need to be overcome before the…", "url": "https://phys.org/news/2022-11-scalable-quantum-memory-lifetime-seconds.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-scalable-quantum-mem-2.jpg", "publishedAt": "2022-11-28T14:50:01Z", "content": "Quantum memory devices can store data as quantum states instead of binary states, as classical computer memories do. While some existing quantum memory technologies have achieved highly promising res… [+6751 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How to fire projectiles through materials without breaking anything - Phys.org", "description": "When charged particles are shot through ultra-thin layers of material, sometimes spectacular micro-explosions occur, and sometimes the material remains almost intact. The reasons for this have now been explained by researchers at the TU Wien.", "url": "https://phys.org/news/2022-11-projectiles-materials.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/how-to-fire-projectile-2.jpg", "publishedAt": "2022-11-28T14:47:55Z", "content": "When charged particles are shot through ultra-thin layers of material, sometimes spectacular micro-explosions occur, and sometimes the material remains almost intact. The reasons for this have now be… [+5305 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Staff", "title": "NASA turns 'light echoes' from a black hole into 'music', HERE's how it sounds - Firstpost", "description": "NASA said that the black hole in the video - V404 Cygni - is 7,800 light years away from Earth", "url": "https://www.firstpost.com/world/nasa-turns-light-echoes-from-a-black-hole-into-music-heres-how-it-sounds-11713201.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/11/black-hole-sound.jpg", "publishedAt": "2022-11-28T14:44:51Z", "content": "New Delhi: Ever wondered how black hole sounds? NASA has now left space enthusiasts amazed by its latest sonification post in which the agency has converted the ‘light echoes’ from the black hole int… [+2206 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's Artemis I 'Passengers' - NASA", "description": "There may not be any humans traveling on Artemis I but that doesn't mean there aren’t any travelers aboard NASA’s Orion Spacecraft! Meet the three \"passenger...", "url": "https://www.youtube.com/watch?v=PIjZHWUMbo8", "urlToImage": "https://i.ytimg.com/vi/PIjZHWUMbo8/maxresdefault.jpg", "publishedAt": "2022-11-28T14:37:09Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Beware! 140-foot 'potentially hazardous' asteroid is rushing towards Earth | DNA India News - DNAIndiaNews", "description": "Beware! 140-foot 'potentially hazardous' asteroid is rushing towards Earth | DNA India NewsNASA confirmed that a 140-foot asteroid is on its way to Earth at ...", "url": "https://www.youtube.com/watch?v=WCBwlGuzWP4", "urlToImage": "https://i.ytimg.com/vi/WCBwlGuzWP4/maxresdefault.jpg", "publishedAt": "2022-11-28T14:32:11Z", "content": null}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Astrophysicists hunt for the second-closest supermassive black hole - Innovation News Network", "description": "The supermassive black hole is a behemoth that is three million times the mass of the Sun, hosted by the dwarf galaxy Leo I.", "url": "https://www.innovationnewsnetwork.com/astrophysicists-hunt-for-the-second-closest-supermassive-black-hole/27753/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2022/11/iStockbrightstars-509689300.jpg", "publishedAt": "2022-11-28T14:12:13Z", "content": "The supermassive black hole, labelled Leo I*, was first proposed by an independent team of astronomers in 2021. The team noticed stars picking up speed as they approached the centre of the galaxy evi… [+2882 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "50,000-year-old 'zombie virus' revived from Siberian permafrost - Moneycontrol", "description": "The amoeba virus was found beneath a lake. while other viruses estimated to be tens of thousands of years old have been located in mammoth wool and the intestines of a Siberian wolf.", "url": "https://www.moneycontrol.com/news/trends/50000-year-old-zombie-virus-revived-from-siberian-permafrost-9615601.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/11/Collage-Maker-28-Nov-2022-07.23-PM-770x435.jpg", "publishedAt": "2022-11-28T13:59:31Z", "content": "With global warming, vast tranches of permafrost are melting and releasing microbes that have been trapped in its icy grip, laying dormant for hundreds of millennia.\r\nTo study these emerging microbes… [+1358 chars]"}, {"source": {"id": null, "name": "FreshPlaza.com"}, "author": null, "title": "Elon Musk's SpaceX brings 'tomato seeds' to International Space Station - FreshPlaza.com", "description": "It seems that 'Cosmic Tomatoes' will be introduced into space. SpaceX is presently delivering new supplies to the International Space Station. The mission took off from NASA's Kennedy Space…", "url": "https://www.freshplaza.com/north-america/article/9482047/elon-musk-s-spacex-brings-tomato-seeds-to-international-space-station/", "urlToImage": "https://www.freshplaza.com/remote/https/agfstorage.blob.core.windows.net/misc/FP_com/2022/11/28/Addret.jpg?preset=OgImage", "publishedAt": "2022-11-28T13:06:04Z", "content": "It seems that 'Cosmic Tomatoes' will be introduced into space. SpaceX is presently delivering new supplies to the International Space Station. The mission took off from NASA's Kennedy Space Center in… [+461 chars]"}, {"source": {"id": null, "name": "GCR"}, "author": null, "title": "China mulls putting a reactor on the Moon - Global Construction Review", "description": "China’s Moon base, to be built at the satellite’s south pole by 2028, could be powered by nuclear energy, reports South China Morning Post.", "url": "https://www.globalconstructionreview.com/china-mulls-putting-a-reactor-on-the-moon/", "urlToImage": "https://www.globalconstructionreview.com/wp-content/uploads/2022/11/Chinese_EVA_spacesuit_2.jpeg", "publishedAt": "2022-11-28T13:01:23Z", "content": "The project was revealed by Wu Weiren, chief designer of the Chinese lunar exploration programme.\r\nWu told state broadcaster CCTV that China is developing a new system that uses nuclear energy to add… [+1591 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mars Once Had Ocean-Like Water On Its Surface, Claims Study - NDTV", "description": "A new study has claimed that Mars once had a global ocean up to 300 metres (almost 1,000 feet) deep, 4.5 billion years ago, if not more.", "url": "https://www.ndtv.com/world-news/mars-once-had-ocean-like-water-on-its-surface-claims-study-3560220", "urlToImage": "https://c.ndtvimg.com/2022-11/47csarng_mars-once-had-oceanlike-water-on-its-surface-claims-study_625x300_28_November_22.jpg", "publishedAt": "2022-11-28T12:37:40Z", "content": "The average temperature on Mars is minus 80 degrees Fahrenheit.\r\nMars, the Red Planet of our solar system, is popular for its rusty iron structure present on the ground. According to American space a… [+1845 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Red Planet Day 2022: Mind-blowing facts about Mars - HT Tech", "description": "Named after the Roman God of War, Mars, which even though it has a thin atmosphere composed primarily of carbon dioxide, still holds humanity's fascination centuries after its discovery.", "url": "https://tech.hindustantimes.com/tech/news/red-planet-day-2022-mind-blowing-facts-about-mars-71669624565068.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/28/1600x900/Untitled_design_-_2022-11-28T160157855_1669631605264_1669631605384_1669631605384.png", "publishedAt": "2022-11-28T12:25:15Z", "content": "Mars, also known as the Red Planet due to its soil's colour, is the fourth planet from the Sun and Earth's neighbour which holds the potential to possibly host the humankind some day.\r\nThe humans hav… [+2435 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "James Webb Telescope May Have Spotted Some Most Distant Galaxies Ever Seen - NewsClick", "description": "Researchers are still in the process of confirming the distances of these galaxies.", "url": "https://www.newsclick.in/james-webb-telescope-spotted-distant-galaxies-seen", "urlToImage": "https://www.newsclick.in/sites/default/files/2022-11/s50.PNG", "publishedAt": "2022-11-28T11:49:14Z", "content": "The James Webb Space Telescope (JWST), in space with its aim of discovering the early universe has recently reported to have spotted two objects that can be the most distant galaxies ever seen. The r… [+3254 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Can Quantum Dots Go Green? - AZoNano", "description": "Green nanotechnology is a relatively new area of research that promises the production of important nanoparticles, such as quantum dots (QDs), using green or eco-friendly processes.", "url": "https://www.azonano.com/article.aspx?ArticleID=6315", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6315_16696333432463352.jpg", "publishedAt": "2022-11-28T11:17:00Z", "content": "In the past two decades, nanotechnology has enabled the manipulation of nanoparticles for specific applications. Nevertheless, some of the methods used for nanoparticle synthesis are not classed as e… [+8266 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Paired electrons demonstrate spin correlation: Study - ANI News", "description": "Physicists have experimentally demonstrated for the first time that there is a negative correlation between the two spins of an entangled pair of electrons from a superconductor.", "url": "https://www.aninews.in/news/science/paired-electrons-demonstrate-spin-correlation-study20221128163513", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221128105636.jpg", "publishedAt": "2022-11-28T11:05:00Z", "content": "Washington [US], November 28 (ANI): Physicists from the University of Basel have experimentally demonstrated for the first time that there is a negative correlation between the two spins of an entang… [+3407 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers make major discovery about mammalian brains - Devdiscourse", "description": "In a new breakthrough to understanding more about the mammalian brain, University of Copenhagen researchers have made an incredible discovery.", "url": "https://www.devdiscourse.com/article/science-environment/2267600-researchers-make-major-discovery-about-mammalian-brains", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_11_2022_11_00_54_4802124.jpg?width=920&format=jpeg", "publishedAt": "2022-11-28T11:01:07Z", "content": "In a new breakthrough to understanding more about the mammalian brain, University of Copenhagen researchers have made an incredible discovery. Namely, a vital enzyme that enables brain signals is swi… [+4751 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Viltė Domkutė", "title": "Gravity-Pulling Facts About The Moon - Bored Panda", "description": "Look up at the sky, what do you see? Stars most likely, but what about the Moon? To some, seeing the moon in the sky has become a stale sight for the eyes. When you see it every day, it becomes rather boring to look at. All the focus is stolen by the bright d…", "url": "https://www.boredpanda.com/facts-about-the-moon/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2022/11/facts-about-the-moon-fb-1-1.png", "publishedAt": "2022-11-28T09:45:57Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Hubble Captures Breathtaking Image Of Two Galaxies Colliding - msnNOW", "description": "Hubble, despite its age, keeps surprising us with breathtaking imagery every now and then, and now in a recent image, it has captured two galaxies colliding around 670 million light years away.                        ESA/NASAThe image was of Arp-Madore 417-39…", "url": "https://www.indiatimes.com/technology/science-and-future/hubble-captures-breathtaking-image-of-two-galaxies-colliding-585948.html", "urlToImage": "https://im.indiatimes.in/content/2022/Nov/Facebook-Image---2022-11-28T144223367_63847c986c7ab.jpg", "publishedAt": "2022-11-28T09:15:52Z", "content": "Hubble, despite its age, keeps surprising us with breathtaking imagery every now and then, and now in a recent image, it has captured two galaxies colliding around 670 million light years away.\r\nESA/… [+1274 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Technology Maps Movement of Microscopic Algae - Technology Networks", "description": "The movement patterns of microscopic algae can be mapped in greater detail than ever before, giving new insights into ocean health, thanks to new technology developed at the University of Exeter.", "url": "https://www.technologynetworks.com/applied-sciences/news/new-technology-maps-movement-of-microscopic-algae-367900", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367900/new-technology-maps-movement-of-microscopic-algae-367900-640x360.jpg?cb=20221128", "publishedAt": "2022-11-28T08:57:58Z", "content": "The movement patterns of microscopic algae can be mapped in greater detail than ever before, giving new insights into ocean health, thanks to new technology developed at the University of Exeter.\r\nTh… [+2924 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Virginia: New UVA Tool Helps Doctors Better Detect Cancer Cells - India Education Diary", "description": "UVA Health researchers have developed an important new tool to help scientists sort signal from noise as they probe the genetic causes of cancer and other diseases. The tool also could help improve cancer diagnosis by making it easier for doctors to", "url": "https://indiaeducationdiary.in/university-of-virginia-new-uva-tool-helps-doctors-better-detect-cancer-cells/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/University-of-Virginia.jpg?fit=900%2C580&ssl=1", "publishedAt": "2022-11-28T08:29:38Z", "content": "UVA Health researchers have developed an important new tool to help scientists sort signal from noise as they probe the genetic causes of cancer and other diseases. The tool also could help improve c… [+3691 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New chemical probecan selectively inhibit human COQ8A protein in cells - News-Medical.Net", "description": "Inhibition of the COQ8 protein could be beneficial in the treatment of diseases such as cancer. COQ8 is needed for the biosynthesis of coenzyme Q, also known as ubiquinone.", "url": "https://www.news-medical.net/news/20221128/New-chemical-probecan-selectively-inhibit-human-COQ8A-protein-in-cells.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_-_molecules-Sebastian_Kaulitzki-2000_12b7886e43a74db8bd94fd774ce58a26-620x480.jpg", "publishedAt": "2022-11-28T08:17:00Z", "content": "Inhibition of the COQ8 protein could be beneficial in the treatment of diseases such as cancer. COQ8 is needed for the biosynthesis of coenzyme Q, also known as ubiquinone.\r\nA new collaborative study… [+3635 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Discovery Of 'World's Oldest Meal' Sheds Light On What Our Animal Ancestors Ate - msnNOW", "description": "According to the Australian National University (ANU), scientists have found fossils of some of the earliest-known animals - dating back 575-million-years ago.", "url": "https://www.indiatimes.com/technology/science-and-future/discovery-of-worlds-oldest-meal-585934.html?utm_source=msn.com", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14Dg3i.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-28T08:00:04Z", "content": "What if we told you that scientists have found the \"world's oldest meal\"? This significant discovery is helping scientists better understand our animal ancestors. According to the Australian National… [+3564 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Webb telescope reveals distant planet's atmosphere in unprecedented detail - The Indian Express", "description": "The James Webb Space Telescope has provided readings of “a full menu of atoms, molecules and even signs of active chemistry and clouds\" of the distant planet WASP-39 b.", "url": "https://indianexpress.com/article/technology/science/james-webb-space-telescope-wasp-39-b-8294039/", "urlToImage": "https://images.indianexpress.com/2022/11/James-webb-space-telescope-wasp-69-b-2-20221128.jpg", "publishedAt": "2022-11-28T07:40:09Z", "content": "The James Webb Space Telescopes (JWST) latest observations of WASP-39 b, a distant hot Saturn planet, has revealed the presence of sulphur dioxide on the planet, among other details.While JWST and ot… [+2066 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Graphene Oxide in Human Ovarian Cancer Cells | IJN - Dove Medical Press", "description": "Investigating the effects of graphene oxide (GO) on the biogenesis and release of exosomes in human ovarian cancer (SKOV3) cells. Click for more...", "url": "https://www.dovepress.com/graphene-oxide-enhances-biogenesis-and-release-of-exosomes-in-human-ov-peer-reviewed-fulltext-article-IJN", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-11-28T07:39:46Z", "content": "Introduction\r\nExtracellular vesicles (EVs) are nanosized membranous vesicles released from almost all cell types.1 The EVs can be classified into exosomes, microvesicles (MVs), and apoptotic bodies b… [+147773 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Earth can regulate its own temperature over millennia, new study finds - India Education Diary", "description": "The Earth’s climate has undergone some big changes, from global volcanism to planet-cooling ice ages and dramatic shifts in solar radiation. And yet life, for the last 3.7 billion years, has kept on beating.Now, a study by MIT researchers in Science", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-earth-can-regulate-its-own-temperature-over-millennia-new-study-finds/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg?fit=600%2C400&ssl=1", "publishedAt": "2022-11-28T06:42:54Z", "content": "The Earths climate has undergone some big changes, from global volcanism to planet-cooling ice ages and dramatic shifts in solar radiation. And yet life, for the last 3.7 billion years, has kept on b… [+6394 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Watch stunning top-down footage of Artemis 1 launch - The Indian Express", "description": "Watch a unique \"top-down\" view of the Artemis 1 launch taken from a camera aboard the Orion spacecraft.", "url": "https://indianexpress.com/article/technology/science/artemis-1-launch-top-down-footage-8293882/", "urlToImage": "https://images.indianexpress.com/2022/11/Artemis-1-launch-top-down-footage-20221128.jpg", "publishedAt": "2022-11-28T06:38:03Z", "content": "After the Orion spacecraft broke a world record set by the Apollo 13 mission, the European Space Agency (ESA) shared footage of the Artemis 1 launch taken from an unusual angle. The ESA footage of th… [+1807 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Scientists unveil the functional landscape of essential genes - India Education Diary", "description": "A team of scientists at the Whitehead Institute for Biomedical Research and the Broad Institute of MIT and Harvard has systematically evaluated the functions of over 5,000 essential human genes using a novel, pooled, imaged-based screening method. Th", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-scientists-unveil-the-functional-landscape-of-essential-genes/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg?fit=600%2C400&ssl=1", "publishedAt": "2022-11-28T06:29:59Z", "content": "A team of scientists at the Whitehead Institute for Biomedical Research and the Broad Institute of MIT and Harvard has systematically evaluated the functions of over 5,000 essential human genes using… [+5145 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: International team observes innermost structure of quasar jet - India Education Diary", "description": "At the heart of nearly every galaxy lurks a supermassive black hole. But not all supermassive black holes are alike: there are many types. Quasars, or quasi-stellar objects, are one of the brightest and most active types of supermassive black holes.A", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-international-team-observes-innermost-structure-of-quasar-jet/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg?fit=600%2C400&ssl=1", "publishedAt": "2022-11-28T06:29:27Z", "content": "At the heart of nearly every galaxy lurks a supermassive black hole. But not all supermassive black holes are alike: there are many types. Quasars, or quasi-stellar objects, are one of the brightest … [+5287 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Celestial Fireworks Display: Hubble Captures Shreds of Luridly Colored Supernova Remnant - SciTechDaily", "description": "In this image from the NASA/ESA Hubble Space Telescope, shreds of the luridly colored supernova remnant DEM L 190 seem to billow across the screen. The delicate sheets and intricate filaments are debris from the cataclysmic death of a massive star that once l…", "url": "https://scitechdaily.com/celestial-fireworks-display-hubble-captures-shreds-of-luridly-colored-supernova-remnant/", "urlToImage": "https://scitechdaily.com/images/Supernova-Remnant-DEM-L-190.jpg", "publishedAt": "2022-11-28T06:23:46Z", "content": "ByESA/HubbleNovember 27, 2022\r\nHubble Space Telescope image of supernova remnant DEM L 190. Credit: ESA/Hubble &amp; NASA, S. Kulkarni, Y. Chu\r\nIn this image from the NASA\r\nEstablished in 1958, the N… [+3971 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "Egg dropped from space didn't crack; Ex-NASA engineer's experiment goes viral - Times Now", "description": "Mark Rober is a YouTuber with over 22.9 million followers. He has worked for NASA and used to be an engineer at Apple.  In his latest experiment, he dropped an egg from space.", "url": "https://www.timesnownews.com/viral/egg-dropped-from-space-didnt-crack-ex-nasa-engineers-experiment-goes-viral-article-95817507", "urlToImage": "https://static.tnn.in/thumb/msid-95817507,imgsize-100,width-1280,height-720,resizemode-75/95817507.jpg", "publishedAt": "2022-11-28T05:46:04Z", "content": "UP Madrassa students no longer eligible for scholarship, Centre recalls scholarship for Classes 1 to 8"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Northwestern University: Short gamma-ray bursts traced farther into distant universe - India Education Diary", "description": "A Northwestern University-led team of astronomers has developed the most extensive inventory to date of the galaxies where short gamma-ray bursts (SGRBs) originate.Using several highly sensitive instruments and sophisticated galaxy modeling, the rese", "url": "https://indiaeducationdiary.in/northwestern-university-short-gamma-ray-bursts-traced-farther-into-distant-universe/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Northwestern-University.jpg?fit=400%2C210&ssl=1", "publishedAt": "2022-11-28T05:45:30Z", "content": "A Northwestern University-led team of astronomers has developed the most extensive inventory to date of the galaxies where short gamma-ray bursts (SGRBs) originate.\r\nUsing several highly sensitive in… [+6559 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Northwestern University: The Milky Way’s mysterious filaments have ‘older, distant cousins’ - India Education Diary", "description": "Northwestern University astrophysicist Farhad Zadeh has been fascinated and puzzled by a family of large-scale, highly organized magnetic filaments dangling in the center of the Milky Way ever since he first discovered them in the early 1980s. Now, 4", "url": "https://indiaeducationdiary.in/northwestern-university-the-milky-ways-mysterious-filaments-have-older-distant-cousins/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Northwestern-University.jpg?fit=400%2C210&ssl=1", "publishedAt": "2022-11-28T05:45:24Z", "content": "Northwestern University astrophysicist Farhad Zadeh has been fascinated and puzzled by a family of large-scale, highly organized magnetic filaments dangling in the center of the Milky Way ever since … [+6038 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "NASA Shares Close-Up Image of Pluto, Shows ‘True Colours’ of Dwarf Planet That Are Worth a Glance - News18", "description": "NASA shared Pluto's image that demonstrated its 'true colours'. The picture that was taken at a distance of 22,025 miles from Pluto showed its 'heart' - a massive glacier made of nitrogen and methane.", "url": "https://www.news18.com/buzz/nasa-shares-close-up-image-of-pluto-shows-true-colours-of-dwarf-planet-that-are-worth-a-glance-6485971.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/untitled-design-15-1-166961387116x9.jpg", "publishedAt": "2022-11-28T05:38:32Z", "content": "Remember Pluto? Yes, once identified as the ninth planet in the solar system, Pluto was demoted in 2006 to that of a dwarf planet as it didnt meet the criteria of a full-sized planet as considered by… [+1647 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Ashish kumar, Ashish kumar", "title": "Astronomers at Caltech Have Used a Machine Learning Algorithm to Classify 1000 Supernovae Completely Autonomously - MarkTechPost", "description": "Caltech research introduces 'SNIascore,' a method for spectroscopically classifying thermonuclear supernovae (SNe Ia) based on very low-resolution (R 100) data based on deep learning. The goal of SNIascore is to fully automate the classification of SNe Ia wit…", "url": "https://www.marktechpost.com/2022/11/27/astronomers-at-caltech-have-used-a-machine-learning-algorithm-to-classify-1000-supernovae-completely-autonomously/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2022/11/Blog-Banner-16.jpg", "publishedAt": "2022-11-27T20:11:08Z", "content": "Caltech research introduces ‘SNIascore,’ a method for spectroscopically classifying thermonuclear supernovae (SNe Ia) based on very low-resolution (R 100) data based on deep learning. The goal of SNI… [+4565 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Shaheer Shahzad", "title": "These Scientists Are Crowdfunding An Experiment To Check If We Live In A Simulation - Wonderful Engineering", "description": "Advertisement If we were in a hyper-realistic simulation, à la The Matrix, would it be possible to find out? A team of physicists believes so, and th", "url": "https://wonderfulengineering.com/these-scientists-are-crowdfunding-an-experiment-to-check-if-we-live-in-a-simulation/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/11/columbia-professor-50-percent-chance-simulation.jpg", "publishedAt": "2022-11-27T18:58:19Z", "content": "If we were in a hyper-realistic simulation, à la The Matrix, would it be possible to find out? A team of physicists believes so, and they are trying to fund their experiment with a Kickstarter campai… [+1891 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": "Rameesha Sajwar", "title": "This Scientist Has Published A Paper That Finally Solves The Mystery Of The Phenomenon Of Lightning - Wonderful Engineering", "description": "Advertisement It had been unclear until now why a lightning bolt comes in a zig-zag and how is it connected to the thundercloud.  A University of", "url": "https://wonderfulengineering.com/this-scientist-has-published-a-paper-that-finally-solves-the-mystery-of-the-phenomenon-of-lightning/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/11/lightning.jpg", "publishedAt": "2022-11-27T18:56:31Z", "content": "It had been unclear until now why a lightning bolt comes in a zig-zag and how is it connected to the thundercloud. \r\nA University of South Australia physicist just published a phenomenal paper that p… [+2178 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Scientists may have finally figured out why Venus is such a hellscape - BGR", "description": "New research may provide insight into what ancient Venus looked like and why the planet has become such a hellish wasteland.", "url": "https://bgr.com/science/scientists-may-have-finally-figured-out-why-venus-is-such-a-hellscape/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/09/bgrpic-copy-15.jpg?quality=82&strip=all", "publishedAt": "2022-11-27T18:55:00Z", "content": "Ancient Venus may have looked more like Earth than previously imagined. New research suggests that Earth’s neighbor may have once looked more like our own planet and less like the hellish landscape w… [+2256 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Rishabh Raj", "title": "5 mind-boggling theories about the universe - NewsBytes", "description": "The world of Astro science is full of surprises and it never ceases to amaze us with its mind-boggling theories", "url": "https://www.newsbytesapp.com/news/science/mind-boggling-theories-about-universe/story", "urlToImage": "https://i2.cdn.newsbytesapp.com/images/l46520221124161749.jpeg", "publishedAt": "2022-11-27T17:26:28Z", "content": "5 mind-boggling theories about the universe\r\nNov 27, 2022, 10:56 pm3 min read\r\nThe world of astro science is full of surprises and it never ceases to amaze us with the mind-boggling theories around i… [+2256 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "World's most unique birds are facing extinction - ANI News", "description": "A recent study found that bird species with uncommon or severe combinations of traits are more likely to become extinct.", "url": "https://www.aninews.in/news/science/worlds-most-unique-birds-are-facing-extinction20221127224258", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221127171235.jpg", "publishedAt": "2022-11-27T17:12:00Z", "content": "London [UK], November 27 (ANI): A recent study found that bird species with uncommon or severe combinations of traits are more likely to become extinct.The results are presented in the journal Functi… [+2709 chars]"}, {"source": {"id": null, "name": "Bizzbuzz.news"}, "author": "Dc Pathak", "title": "Beyond the universe - Bizz Buzz", "description": "In a sense, the entirety of time and space was equated by philosophy with an omnipresent God", "url": "https://www.bizzbuzz.news/markets/beyond-the-universe-1182218", "urlToImage": "https://www.bizzbuzz.news/h-upload/2022/11/27/1622309-u.jpg", "publishedAt": "2022-11-27T17:03:08Z", "content": "Science is always in search of an equation for confirming a proposition while Philosophy rises above the details and reaches an empirical deduction through imagination.Theories of universe combine sc… [+7080 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Universe Today, Allen Versfeld", "title": "This 239-year-old technology could revolutionize astronomy - Inverse", "description": "While most people may not be aware, astronomers have long used satellites to launch telescopes and other scientific equipment above Earth.", "url": "https://www.inverse.com/science/balloons-astronomy", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/11/23/28d05df2-1b3a-487e-805d-22a75c762ae0-ballooninflation_0_0.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-11-27T16:30:25Z", "content": "NASAs Balloon Program\r\n Analysis Group recently presented a roadmap to NASA to guide them on how to plan and fund future balloon astronomy programs. Balloons have been used for over a century to cond… [+7253 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ujwal Jain", "title": "When Neil deGrasse Tyson told Joe Rogan why Christopher Columbus was a \"d*ck\" - Sportskeeda", "description": "During episode #1159 of The Joe Rogan Experience (JRE), American astrophysicist Neil deGrasse Tyson explained why he thought the Italian explorer Christopher Columbus was far from the heroic figure hi", "url": "https://www.sportskeeda.com/mma/news-when-neil-degrasse-tyson-told-joe-rogan-christopher-columbus-d-ck", "urlToImage": "https://staticc.sportskeeda.com/editor/2022/11/83516-16695499981720-1920.jpg", "publishedAt": "2022-11-27T11:32:00Z", "content": "During episode #1159 of The Joe Rogan Experience (JRE), American astrophysicist Neil deGrasse Tyson explained why he thought the Italian explorer Christopher Columbus was far from the heroic figure h… [+2074 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "The Conversation", "title": "What if the dinosaurs continued evolving? How the giant creatures may have adapted - Interesting Engineering", "description": "Imagine the asteroid had missed, and dinosaurs survived. An article sheds light on how the giant creatures may have evolved impacted humans.", "url": "https://interestingengineering.com/science/dinosaurs-continued-evolving-how-adapted", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/11/26/image/png/rmdxigrZCUQd8bzHnZmhpbd2xGFC77e9jf54mdbD.png", "publishedAt": "2022-11-27T08:47:00Z", "content": "The common thread linking these animals was that they were sauropods. Something about sauropod anatomy lungs, hollow bones with a high strength-to-weight ratio, metabolism or all these things unlocke… [+2116 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Man Keeps Rock For Years In The Hopes Of Finding Gold But Instead Finds Something More Valuable - The Hans India", "description": "Since Maryborough is located in the Goldfields region, where the Australian gold rush peaked in the...", "url": "https://www.thehansindia.com/offbeat/man-keeps-rock-for-years-in-the-hopes-of-finding-gold-but-instead-finds-something-more-valuable-770910", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/11/27/1322362-rock.jpg", "publishedAt": "2022-11-27T08:00:52Z", "content": "David Hole was prospecting in 2015 in the Maryborough Regional Park, which is close to Melbourne, Australia. He used a metal detector to unearth something unusual: a large, reddish rock sitting on so… [+2698 chars]"}]}