{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA’s Artemis 1 Launch Live Updates: Liquid hydrogen fast-fill of core stage in progress - The Indian Express", "description": "NASA's Artemis 1 Moon Mission Live Updates, November 15, 2022: Get live updates of the Artemis 1 mission, which will act as a staging ground for missions that take humanity back to the Moon.", "url": "https://indianexpress.com/article/technology/science/nasa-artemis-1-launch-live-updates-8269515/", "urlToImage": "https://images.indianexpress.com/2022/11/NASA-Artemis-1-rocket-20221115.jpg", "publishedAt": "2022-11-15T22:28:38Z", "content": "NASA’s Artemis 1 mission was initially scheduled to launch on November 16 but the space agency had to postpone it due to tropical storm Nicole. But during the storm, the SLS rocket and the Orion spac… [+1034 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sean Liddick and Artemis Spyrou", "title": "Powerful linear accelerator begins smashing atoms—how it could reveal rare forms of matter - Phys.org", "description": "Just a few hundred feet from where we are sitting is a large metal chamber devoid of air and draped with the wires needed to control the instruments inside. A beam of particles passes through the interior of the chamber silently at around half the speed of li…", "url": "https://phys.org/news/2022-11-powerful-linear-atomshow-reveal-rare.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/powerful-linear-accele.jpg", "publishedAt": "2022-11-15T19:20:30Z", "content": "Just a few hundred feet from where we are sitting is a large metal chamber devoid of air and draped with the wires needed to control the instruments inside. A beam of particles passes through the int… [+7845 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Plans Coverage of Roscosmos Spacewalks at Space Station - NASA", "description": "NASA will provide coverage as two Roscosmos cosmonauts conduct a series of spacewalks in November and December outside the International Space Station to prepare hardware on the Rassvet module for installation on the Nauka multipurpose laboratory module.", "url": "https://www.nasa.gov/press-release/nasa-plans-coverage-of-roscosmos-spacewalks-at-space-station/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/eva_advisory_nov_15.jpg", "publishedAt": "2022-11-15T18:29:04Z", "content": null}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "A Moving Black Hole Might Have Triggered the \"Great Dimming\" of Betelgeuse — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: According to new research, a wandering black hole may have been a factor in the dimming of the red giant Betelgeuse. The intruder may have created a tidal bulge, dimming Betelgeuse’s surface, by swinging close to the massive star.  Researchers …", "url": "https://www.transcontinentaltimes.com/black-hole-might-trigger-betelgeuse/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/11/Betelgeuse.jpg", "publishedAt": "2022-11-15T17:58:57Z", "content": "UNITED STATES: According to new research, a wandering black hole may have been a factor in the dimming of the red giant Betelgeuse. The intruder may have created a tidal bulge, dimming Betelgeuse’s s… [+1744 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Corrie Pelc", "title": "Spinal cord injuries: New research finds way to reverse paralysis - Medical News Today", "description": "Researchers have managed to restore movement in volunteers with spine cord injury-related paralysis by reactivating a specific group of neurons.", "url": "https://www.medicalnewstoday.com/articles/how-researchers-are-restoring-movement-in-people-with-spinal-cord-injuries", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/11/neurons-paralysis-walking-dots-thumb.jpg", "publishedAt": "2022-11-15T17:48:36Z", "content": "<ul><li>As many as 500,000 people around the world injure their spinal cord each year. </li><li>Spinal cord injuries account for more than 27% of all paralysis cases in the United States each year. <… [+6888 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Cosmic chocolate pralines: General neutron star structure revealed: Physicists model more than one million equations of state - Science Daily", "description": "Through extensive model calculations, physicistshave reached general conclusions about the internal structure of neutron stars, where matter reaches enormous densities: depending on their mass, the stars can have a core that is either very stiff or very soft.", "url": "https://www.sciencedaily.com/releases/2022/11/221115114049.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-15T17:44:01Z", "content": "So far, little is known about the interior of neutron stars, those extremely compact objects that can form after the death of a star: the mass of our sun or even more is compressed into a sphere with… [+3031 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "James Webb Space Telescope suffers micrometeoroid strike that NASA didn't see coming - Republic World", "description": "James Webb Space Telescope took another micrometeoroid hit in May this year, but this time it was bigger than the observatory was tested for, says NASA.", "url": "https://www.republicworld.com/science/space/james-webb-space-telescope-suffers-micrometeoroid-strike-that-nasa-didnt-see-coming-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/had1emtjqrcopy24_1668528600.jpeg", "publishedAt": "2022-11-15T17:43:00Z", "content": "The primary mirror of the James Webb Space Telescope took another micrometeoroid hit in May this year, but this time it was bigger than the observatory was tested for. NASA says that Webbs primary mi… [+2696 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Next generation material that adapts to its history: Responsive material changes its behavior based on earlier conditions - Science Daily", "description": "Inspired by living systems, researchers have developed a new material that changes its electrical behavior based on previous experience, effectively giving it a basic form of adaptive memory. Such adaptive materials could play a vital role in the next generat…", "url": "https://www.sciencedaily.com/releases/2022/11/221115113930.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-15T17:39:09Z", "content": "Inspired by living systems, researchers at Aalto University have developed a new material that changes its electrical behaviour based on previous experience, effectively giving it a basic form of ada… [+3218 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rachel Fritts", "title": "Powerful impact provides insight into deep structure of Mars - Phys.org", "description": "NASA's InSight lander (Interior Exploration using Seismic Investigations, Geodesy and Heat Transport) launched in 2018 with the goal of peering deep into Mars's interior for the first time to gain important information about the planet's structure and formati…", "url": "https://phys.org/news/2022-11-powerful-impact-insight-deep-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/powerful-impact-provid.jpg", "publishedAt": "2022-11-15T17:05:03Z", "content": "NASA's InSight lander (Interior Exploration using Seismic Investigations, Geodesy and Heat Transport) launched in 2018 with the goal of peering deep into Mars's interior for the first time to gain im… [+2412 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Created a Black Hole in The Lab, And Then It Started to Glow - ScienceAlert", "description": "A new kind of black hole analog could tell us a thing or two about an elusive radiation theoretically emitted by the real thing.", "url": "https://www.sciencealert.com/scientists-created-a-black-hole-in-the-lab-and-then-it-started-to-glow", "urlToImage": "https://www.sciencealert.com/images/2022/11/black-hole-art.jpg", "publishedAt": "2022-11-15T17:01:52Z", "content": "A new kind of black hole analog could tell us a thing or two about an elusive radiation theoretically emitted by the real thing.\r\nUsing a chain of atoms in single-file to simulate the event horizon o… [+3360 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Direct Method of Catalyst-Coated Membranes Fabrication for AEM Electrolysis - AZoM", "description": "Scientists from Germany have reported the development of a novel direct-coating method for the fabrication of membrane-electrode assembly applications.", "url": "https://www.azom.com/news.aspx?newsID=60446", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/SocialSharingImage_60446_16685312686893564.jpg", "publishedAt": "2022-11-15T16:57:00Z", "content": "Scientists from Germany have reported the development of a novel direct-coating method for the fabrication of membrane-electrode assembly applications. Their findings have appeared in the journal Adv… [+5750 chars]"}, {"source": {"id": null, "name": "Explorersweb.com"}, "author": "Andrew McLemore", "title": "Did Tree Roots Trigger Ancient Extinctions? » Explorersweb - ExplorersWeb", "description": "New research on one of Earth's biggest extinction events provides deeper insight into natural history — and greater urgency for the need to fight climate change.", "url": "https://explorersweb.com/tree-roots-ancient-extinctions/", "urlToImage": "https://s3.amazonaws.com/www.explorersweb.com/wp-content/uploads/2022/11/11170653/algae-bloom.jpg", "publishedAt": "2022-11-15T16:02:55Z", "content": "In Earth’s Devonian Period, which lasted from 419 to 358 million years ago, the Earth experienced several mass extinctions. About 70 percent of all life on the planet died out.\r\nThe trigger for that … [+2636 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Synthetic hibernation could provide protection from cosmic radiation - ANI News", "description": "It is still a glimpse into the future: Astronauts could be put into artificial hibernation and in this state be better protected from cosmic radiation. At present, there are already promising approaches to follow up such considerations.", "url": "https://www.aninews.in/news/science/space/synthetic-hibernation-could-provide-protection-from-cosmic-radiation20221115211605", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221115152254.jpg", "publishedAt": "2022-11-15T15:46:05Z", "content": "Washington [US], November 15 (ANI): It is still a glimpse into the future: Astronauts could be put into artificial hibernation and in this state be better protected from cosmic-radiation\"&gt;cosmicra… [+4946 chars]"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Life on exoplanets and the origin of life on Earth - Innovation News Network", "description": "Read how ETH Zurich is pioneering research to uncover the origin of life in the Universe and identify extra-terrestrial life on exoplanets.", "url": "https://www.innovationnewsnetwork.com/life-on-exoplanets-and-the-origin-of-life-on-earth/27337/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2022/11/Image-1-montage-©-iStockkorionov-178058894.jpg", "publishedAt": "2022-11-15T15:40:40Z", "content": "Life is everywhere on Earth. It fills the air we breathe in the form of microorganisms and has spread into every corner and niche we can imagine, including deep inside Earths oceanic crust at the bot… [+9241 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New technique to create thermally stable, high-entropy alloys - Phys.org", "description": "Nanoparticles have been used to develop high-strength materials for structural applications. But these nanoparticles are often thermally unstable, leading to rapid coarsening in a high-temperature environment.", "url": "https://phys.org/news/2022-11-technique-thermally-stable-high-entropy-alloys.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cityu-materials-scient.jpg", "publishedAt": "2022-11-15T14:59:09Z", "content": "Enhanced thermal stability in the studied alloys with the addition of cobalt (0, 15, and 30atomic per cent (at.%)). ac Typical SEM micrographs of nanoparticles in the three chemically complex alloys … [+5559 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Manmath Nayak", "title": "NASA To Launch 'Artemis 1' Moon Mission Tomorrow: How To Watch Live - India.com", "description": "NASA To Launch 'Artemis 1' Moon Mission Tomorrow: How To Watch Live -  Explore latest photo galleries of  at India.com PhotoGallery.", "url": "https://www.india.com/webstories/technology/nasa-to-launch-artemis-1-moon-mission-tomorrow-how-to-watch-live-5745026/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/11/Artemis-2.png", "publishedAt": "2022-11-15T14:55:19Z", "content": "NASA is all set to launch ambitious Artemis-1 mission to the Moon on Wednesday from Florida, less than a week after the massive machine withstood a hurricane.\r\n15 Nov, 2022\r\nManmath Nayak"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Rolling dice to gain insights into planets and stars - Nanowerk", "description": "Using a simulation method based on random numbers scientists were able to describe the properties of warm dense hydrogen as accurately as never before.", "url": "https://www.nanowerk.com/news2/space/newsid=61842.php", "urlToImage": "https://www.nanowerk.com/news2/space/id61842_1.jpg", "publishedAt": "2022-11-15T14:49:16Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Exploring the mystery of neutrino mass using cryogenics deep under a mountain – Physics World - physicsworld.com", "description": "Laura Marini speaks to the challenges of cooling a huge underground detector to cryogenic temperatures", "url": "https://physicsworld.com/a/exploring-the-mystery-of-neutrino-mass-using-cryogenics-deep-under-a-mountain/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/11/Laura-Marini-of-CUORE.jpg", "publishedAt": "2022-11-15T14:46:50Z", "content": "Physicist Laura Marini is run co-ordinator and site manager of the Cryogenic Underground Observatory for Rare Events (CUORE). Operated by an international collaboration, the experiment is situated de… [+6128 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "A Martian sunset as seen by NASA's Phoenix Mars lander - Devdiscourse", "description": "Read more about A Martian sunset as seen by NASA's Phoenix Mars lander on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2252461-a-martian-sunset-as-seen-by-nasas-phoenix-mars-lander", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/15_11_2022_19_45_17_1112705.jfif?width=920&format=jpeg", "publishedAt": "2022-11-15T14:15:38Z", "content": "NASA has shared a throwback picture of the Martian sunset captured by Phoenix, a lander sent to the surface of Mars to search for evidence of past or present microbial life.\r\nThis image was taken by … [+1311 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Mars orbiter notches 1st sighting of simultaneous auroras with different causes - Space.com", "description": "The auroras were spotted on both the day and night sides of the Red Planet.", "url": "https://www.space.com/mars-maven-two-aurora-types-simultaneously", "urlToImage": "https://cdn.mos.cms.futurecdn.net/a6DmJuECVjoTTXs4Xm4u9k-1200-80.jpg", "publishedAt": "2022-11-15T14:00:28Z", "content": "NASA's MAVEN mission to Mars captured a rare event when it spotted two different types of aurora in the sky over the Red Planet at the same time as Mars was being buffeted by a tumultuous solar storm… [+4221 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Genetic differences can affect the swimming behavior of sperm cells, study shows - News-Medical.Net", "description": "The behavior of sperm cells is due, in part, to the individual DNA make-up of these cells, rather than only to the genetics of males, finds a team of scientists.", "url": "https://www.news-medical.net/news/20221115/Genetic-differences-can-affect-the-swimming-behavior-of-sperm-cells-study-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Sperm-620x480.jpg", "publishedAt": "2022-11-15T13:58:00Z", "content": "The behavior of sperm cells is due, in part, to the individual DNA make-up of these cells, rather than only to the genetics of males, finds a team of scientists. Its results, which provide a new unde… [+2380 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Research on 'polluted' dwarf stars suggests stars and planets may have 'grown' together - The Indian Express", "description": "It is believed that planets in a system are formed from leftover star formation material millions of years after the star starts forming. But a growing body of evidence suggests that stars and planets form concurrently.", "url": "https://indianexpress.com/article/technology/science/polluted-dwarf-stars-planetary-formation-8270066/", "urlToImage": "https://images.indianexpress.com/2022/11/Polluted-white-dwarf-star-20221115.jpg", "publishedAt": "2022-11-15T13:12:42Z", "content": "It is generally believed that stars form millions of years before the planets that orbit them, with the leftover material from star formation accumulating to form planets. But new research on pollute… [+2691 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kazuya Koyama, Levon Pogosian", "title": "We tested Einstein’s theory of gravity on the scale of the universe – here’s what we found - Livescience.com", "description": "Albert Einstein’s theory of general relativity has been remarkably successful in describing the gravity of stars and planets, but it doesn’t seem to apply perfectly on all scales.", "url": "https://www.livescience.com/we-tested-einsteins-theory-of-gravity-on-the-scale-of-the-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MasLwKqNAKxkhDabw82cub-1200-80.jpg", "publishedAt": "2022-11-15T13:00:15Z", "content": "Everything in the universe has gravity – and feels it too. Yet this most common of all fundamental forces is also the one that presents the biggest challenges to physicists. Albert Einstein’s theory … [+6474 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "NASA's Revolutionary LOFTID Heat Shield Completes Successful Splashdown - msnNOW", "description": "NASA have successfully conducted a test of its LOFTID heat shield while launching the third in a series of polar-orbiting weather satellites on 10 November 2022. The launch was undertaken via a United Launch Alliance Atlas V rocket from Vandenberg Space Force…", "url": "https://www.msn.com/en-in/news/newsindia/nasas-revolutionary-loftid-heat-shield-completes-successful-splashdown/vi-AA148hGX", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA147SDr.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-15T13:00:00Z", "content": "Like us on Facebook to see similar stories\r\nI am already a fan, don't show this again"}, {"source": {"id": null, "name": "Engineerine.com"}, "author": "simonkaranja", "title": "11 World Changer Accomplishments By Albert Einstein – Engineerine - Engineerine", "description": "Albert Einstein, an astrophysicist and philosopher, is a German physicist who is widely considered to be one of the most influential scientists of the 20th century. His theoretical work has had a profound and lasting impact on scientific history. What did Ein…", "url": "https://engineerine.com/einstein-accomplishments/", "urlToImage": "https://engineerine.com/wp-content/uploads/2022/11/Albert.jpg", "publishedAt": "2022-11-15T12:10:07Z", "content": "Albert Einstein, an astrophysicist and philosopher, is a German physicist who is widely considered to be one of the most influential scientists of the 20th century. His theoretical work has had a pro… [+9724 chars]"}, {"source": {"id": null, "name": "SpaceWatch.Global"}, "author": "Viktoria Urban", "title": "CAPSTONE successfully enters NRHO around the Moon - SpaceWatch.Global", "description": "Edinburgh / Boca Raton, Florida, 15 November 2022. - The Terran Orbital-developed CAPSTONE (Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment) spacecraft successfu", "url": "https://spacewatch.global/2022/11/capstone-successfully-enters-nrho-around-the-moon/", "urlToImage": "https://spacewatch.global/wp-content/uploads/2022/10/capstone-879x485-1.jpeg", "publishedAt": "2022-11-15T11:46:21Z", "content": "Credit: Terran Orbital\r\nEdinburgh / Boca Raton, Florida, 15 November 2022. – TheTerran Orbital-developed CAPSTONE (Cislunar Autonomous Positioning System Technology Operations and Navigation Experime… [+1236 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "A Minimally Invasive Surgical Technique for Hallux Valgus Deformity Correction Using an Ultrasonic Bone Scalpel (All India Institute of Medical Sciences Technique) - Cureus", "description": "Hallux valgus is a common forefoot deformity characterized by medial deviation of the first metatarsal and lateral deviation of the hallux. More than 150 procedures have been described for the hallux valgus deformity with no proven superiority of one over the…", "url": "https://www.cureus.com/articles/123860-a-minimally-invasive-surgical-technique-for-hallux-valgus-deformity-correction-using-an-ultrasonic-bone-scalpel-all-india-institute-of-medical-sciences-technique", "urlToImage": "https://assets.cureus.com/uploads/figure/file/486442/article_river_090b2c3057f311edbeb6077f0d19938b-Figure-1.png", "publishedAt": "2022-11-15T11:46:20Z", "content": "Hallux valgus is a common forefoot deformity characterized by medial deviation of the first metatarsal and lateral deviation of the hallux. More than 150 procedures have been described for the hallux… [+10170 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Wormholes May Be Hiding In Plain Sight, Says Study, Demonstrates How - NDTV", "description": "Predictions suggest that wormholes and black holes may have almost identical polarised light spectra, making it challenging to discern between these astronomical objects.", "url": "https://www.ndtv.com/world-news/wormholes-may-be-hiding-in-plain-sight-says-study-demonstrates-how-3522350", "urlToImage": "https://c.ndtvimg.com/2022-11/h4foiauo_wormholes_625x300_15_November_22.jpg", "publishedAt": "2022-11-15T11:45:54Z", "content": "These weird tunnels through space-time are still hypothetical.\r\nWormholes have been mathematically predicted, even in Albert Einstein's general theory of relativity, but for many years, these space-t… [+1848 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": null, "title": "How black hole thought experiments help explain the Universe - Aeon", "description": "The Universe cannot always be understood through observation. Instead, physicists explore by devising thought experiments", "url": "https://aeon.co/essays/how-black-hole-thought-experiments-help-explain-the-universe", "urlToImage": "https://epsilon.aeon.co/images/78ba87e7-7198-4468-81b5-500c505d5bc8/header_essay-gettyimages-1237093074.jpg", "publishedAt": "2022-11-15T11:30:15Z", "content": "Albert Einsteins theory of gravitation, known as general relativity, is intimidating, even for highly trained theoretical physicists. In his theory, matter and energy cause space-time to curve. In mo… [+19207 chars]"}, {"source": {"id": null, "name": "Nippon.com"}, "author": null, "title": "Japan to send 1st moon lander, world's smallest, to space on Wed. - Nippon.com", "description": "The world's smallest moon lander OMOTENASHI will be launched Wednesday afternoon by a U.S. rocket, Japan's spa…", "url": "https://www.nippon.com/en/news/kd965200335908634624/", "urlToImage": "https://www.nippon.com/en/ncommon/contents/news/2085685/2085685.jpg", "publishedAt": "2022-11-15T10:39:30Z", "content": "<ul><li>Home</li><li>News</li><li>Japan to send 1st moon lander, world's smallest, to space on Wed.</li></ul>Newsfrom Japan\r\nEconomyNov 15, 2022 19:39; updated Nov 15, 2022 19:47 (JST)\r\nThe world's s… [+617 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "ESA’s Solar Orbiter Captures a ‘Snake’ Slithering Across the Sun’s Surface - The Weather Channel", "description": "The journey of this slithery snake took over 3 hours to complete, with the plasma travelling at a speed of about 170 kilometres per second.", "url": "https://weather.com/en-IN/india/news/news/2022-11-15-snake-spotted-slithering-across-solar-surface", "urlToImage": "https://s.w-x.co/in-sun_snake_0.gif", "publishedAt": "2022-11-15T10:22:38Z", "content": "Having been lent a bad rep owing to their problematic biblical history, snakes are often accompanied by a sense of foreboding. And the recent activity on the Sun has us wondering if their reputation … [+1889 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Hubble Space Telescope captures dense core in constellation of Serpens - News9 LIVE", "description": "The dense cores are accumulations of gas and dust where stars are born", "url": "https://www.news9live.com/science/hubble-space-telescope-captures-dense-core-in-constellation-of-serpens-208021", "urlToImage": "https://media.news9live.com/h-upload/2022/11/15/581623-potw2246acropped.jpg", "publishedAt": "2022-11-15T10:06:47Z", "content": "The Hubble Space Telescope has captured an image of a dense core designated as CB 130-3. A dense core is a celestial dark cloud, an compact agglomeration of gas and dust, within which new forms can b… [+1713 chars]"}, {"source": {"id": null, "name": "Graphene-Info"}, "author": null, "title": "Researchers use graphene to measure the properties of a material's surface layer - Graphene-Info", "description": "Researchers from Northeastern University in Boston and University of Texas at Arlington (UTA) have used a process called auger-mediated positron sticking (AMPS) to  develop a new technique that can measure the properties of the topmost atomic layer of materia…", "url": "https://www.graphene-info.com/researchers-use-graphene-measure-properties-material-s-surface-layer", "urlToImage": null, "publishedAt": "2022-11-15T08:11:39Z", "content": "Researchers from Northeastern University in Boston and University of Texas at Arlington (UTA) have used a process called auger-mediated positron sticking (AMPS) to  develop a new technique that can m… [+2308 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Flinders University: New lead on Great Barrier Reef’s origin - India Education Diary", "description": "Researchers have discovered that K’gari (Fraser Island) and the nearby Cooloola Sand Mass in southeastern Queensland formed 1.2 and 0.7 million years ago and their formation allowed the development of the southern and central Great Barrier Reef.Scien", "url": "https://indiaeducationdiary.in/flinders-university-new-lead-on-great-barrier-reefs-origin/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/04/Flinders-University.jpg?fit=1024%2C576&ssl=1", "publishedAt": "2022-11-15T06:52:28Z", "content": "Researchers have discovered that Kgari (Fraser Island) and the nearby Cooloola Sand Mass in southeastern Queensland formed 1.2 and 0.7 million years ago and their formation allowed the development of… [+2608 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "p-Terphenyl glucosides from the culture broth of Phlebiopsis castanea | The Journal of Antibiotics - Nature.com", "description": "The Journal of Antibiotics - p-Terphenyl glucosides from the culture broth of Phlebiopsis castanea", "url": "https://www.nature.com/articles/s41429-022-00579-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41429-022-00579-7/MediaObjects/41429_2022_579_Fig1_HTML.png", "publishedAt": "2022-11-15T06:40:29Z", "content": "<li>Wang D, Wang Y, Ouyang Y, Fu P, Zhu W. Cytotoxic p-terphenyls from a marine-derived Nocardiopsis species. J Nat Prod. 2019;82:35048.\r\nArticle \r\n PubMed \r\nGoogle Scholar \r\n</li><li>Lu DD, Ren JW, … [+4702 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm WARNING! Fast moving solar winds zooming towards Earth; Know when it will strike - HT Tech", "description": "According to reports, a solar storm is set to strike the Earth over the weekend of November 19-20. Know the dangers from the impact of this solar disturbance.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-warning-fast-moving-solar-winds-zooming-towards-earth-know-when-it-will-strike-71668492862876.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/15/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1668492901495_1668492901495.jpg", "publishedAt": "2022-11-15T06:25:03Z", "content": "The Earth is constantly battling the radiation and the attacks on its magnetic field coming from the Sun, but lately it has turned from bad to quite worse. After escaping from a potential G5-class so… [+2014 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA and SpaceX prep for next resupply mission to space station - Devdiscourse", "description": "Read more about NASA and SpaceX prep for next resupply mission to space station on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2251627-nasa-and-spacex-prep-for-next-resupply-mission-to-space-station", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/26_03_2022_13_17_33_690102.jpg?width=920&format=jpeg", "publishedAt": "2022-11-15T05:20:49Z", "content": "NASA and SpaceX are gearing up for the launch of the 26th commercial resupply mission to the International Space Station, which is scheduled for Monday, November 21.\r\nThe SpaceX Dragon cargo spacecra… [+1342 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "How long can exotic nuclei survive at the edge of stability? - Science Daily", "description": "A new study has measured how long it takes for several kinds of exotic nuclei to decay. The paper marks the first experimental result from the Facility for Rare Isotope Beams. It is just a small taste of what's to come at the facility, which will become 400 t…", "url": "https://www.sciencedaily.com/releases/2022/11/221114190619.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-15T02:36:32Z", "content": "A new study led by the Department of Energy's Lawrence Berkeley National Laboratory (Berkeley Lab) has measured how long it takes for several kinds of exotic nuclei to decay. The paper, published tod… [+4578 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Lightsail 2 spacecraft to end extended mission by burning up in atmosphere - News9 LIVE", "description": "Lightsail 2 was the first small spacecraft to demonstrate controlled solar sailing", "url": "https://www.news9live.com/science/lightsail-2-spacecraft-to-end-extended-mission-by-burning-up-in-atmosphere-207920", "urlToImage": "https://media.news9live.com/h-upload/2022/11/15/581398-lightsail-2c.jpg", "publishedAt": "2022-11-15T01:21:38Z", "content": "The Lightsail programme by the Planetary Society was envisioned to demonstrate the feasibility of using solar sails for propulsion of spacecraft. Lightsail 1, launched in June 1915 demonstrated the t… [+1855 chars]"}, {"source": {"id": null, "name": "Westernu.ca"}, "author": null, "title": "Western planetary geologist to lead science for Canada's lunar rover - NASA", "description": "Western planetary geologist Gordon “Oz” Osinski will serve as principal investigator and scientific lead on the project on Canada's first lunar rover.", "url": "https://news.westernu.ca/2022/11/lunar-rover/", "urlToImage": "https://news.westernu.ca/wp-content/uploads/sites/2/2022/11/Photo-Nov-10-11-40-16-AM_FINAL-1-e1668443857181.jpg", "publishedAt": "2022-11-15T00:33:21Z", "content": "The Government of Canada announced today that Canadensys Aerospace has received a contract to design and build Canadas first lunar rover, which will be sent to the Moons south pole region as early as… [+2815 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "New Observations Confirm That a Magnetar has a Solid Surface and No Atmosphere - Universe Today", "description": "Plot twist: Magnetars might have solid surfaces according to data from the Imaging X-ray Polarimetry Explorer (IXPE.)", "url": "https://www.universetoday.com/158556/new-observations-confirm-that-a-magnetar-has-a-solid-surface-and-no-atmosphere/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2014/05/eso1415a.jpg", "publishedAt": "2022-11-14T23:26:02Z", "content": "Can a star have a solid surface? It might sound counterintuitive. But human intuition is a response to our evolution on Earth, where up is up, down is down, and there are three states of matter. Intu… [+8605 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "What is the CAMS project and how did machine learning help? - SETI Institute", "description": "What is the Cameras for Allsky Meteor Surveillance project? SETI Institute's Peter Jenniskens answers three questions about the project, machine learning, an...", "url": "https://www.youtube.com/watch?v=OKe6-9jkx68", "urlToImage": "https://i.ytimg.com/vi/OKe6-9jkx68/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGEIgRyhyMA8=&rs=AOn4CLC5qwVbODR23WnBHv3OSiv_wR0OIg", "publishedAt": "2022-11-14T22:58:40Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Shaping bacterial gene expression by physiological and proteome allocation constraints - Nature.com", "description": "In this Review, Scott and Hwa describe how physiological constraints are sensed through metabolic fluxes and how flux-controlled regulation gives rise to simple empirical relations between protein levels and the rate of cell growth.", "url": "https://www.nature.com/articles/s41579-022-00818-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41579-022-00818-6/MediaObjects/41579_2022_818_Fig1_HTML.png", "publishedAt": "2022-11-14T22:27:59Z", "content": "<li>Neidhardt, F. C., Ingraham, J. L. &amp; Schaechter, M. Physiology of the Bacterial Cell: A Molecular Approach (Sinauer Associates, 1990).\r\n</li><li>Bervoets, I. &amp; Charlier, D. Diversity, vers… [+27863 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s Starship briefly becomes the most powerful active rocket in the world - TESLARATI", "description": "A SpaceX Starship booster has successfully fired up 14 of its 33 Raptor engines, likely becoming the most powerful active rocket in the world. Throughout the history of spaceflight, only three or four other rockets have produced as much or more thrust than Su…", "url": "https://www.teslarati.com/spacex-starship-booster-most-powerful-rocket-in-the-world/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/11/Starbase-111422-NASASpaceflight-B7-14-Raptor-static-fire-panel-3-c.jpg", "publishedAt": "2022-11-14T22:25:27Z", "content": "A SpaceX Starship booster has successfully fired up 14 of its 33 Raptor engines, likely becoming the most powerful active rocket in the world. \r\nThroughout the history of spaceflight, only three or f… [+4085 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "High-speed imaging captures viruses as they creep up to cells - Nature.com", "description": "Microscopic methods show engineered viral particles zooming around cell surfaces.", "url": "https://www.nature.com/articles/d41586-022-03690-9", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-03690-9/d41586-022-03690-9_23709620.jpg", "publishedAt": "2022-11-14T21:59:44Z", "content": "Johnson, C., Exell, J., Lin, Y., Aguilar, J. &amp; Welsher, K. D. Nature Methods https://doi.org/10.1038/s41592-022-01672-3 (2022).\r\nArticle \r\nGoogle Scholar"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Chinese rocket body breaks up in orbit after successful satellite launch - Space.com", "description": "The rocket stage is thought to have fragmented into a cloud of more than 50 pieces of debris.", "url": "https://www.space.com/chinese-rocket-body-breaks-up-after-satellite-launch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FgqXGnfXare2GQr5GdMJqU-1200-80.jpg", "publishedAt": "2022-11-14T20:56:51Z", "content": "China sent the Yunhai 3 environmental monitoring satellite into orbit on Friday (Nov. 11), on the second launch of the nation's new Long March 6A rocket. \r\nThe Long March 6A lifted off from the hilly… [+4621 chars]"}, {"source": {"id": null, "name": "Carnegiescience.edu"}, "author": null, "title": "Astronomy and Cosmology | Carnegie Science - Carnegie Institution for Science", "description": null, "url": "https://carnegiescience.edu/research-areas/astronomy-and-cosmology", "urlToImage": "https://carnegiescience.edu/sites/default/files/styles/medium/public/2022-08/Beletsky%20Panorama.jpg?itok=pTjgtv8D", "publishedAt": "2022-11-14T19:53:16Z", "content": null}, {"source": {"id": null, "name": "Samaaenglish.tv"}, "author": null, "title": "‘Like the Moon’: Astronauts flock to Spanish isle to train - SAMAA English", "description": "Find latest breaking, trending, viral news from Pakistan and information on top stories, weather, business, entertainment, politics, sports and more. For in-depth coverage, Samaa English provides special reports, video, audio, photo galleries, and interactive…", "url": "https://www.samaaenglish.tv/", "urlToImage": "http://www.samaaenglish.tv/_img/social-default.jpg", "publishedAt": "2022-11-14T17:48:45Z", "content": "Subscribe to notifications\r\nGet the latest news and updates from Samaa TV"}, {"source": {"id": null, "name": "NASA"}, "author": "Bob Balaram, Chief Engineer for the Mars Helicopter Project at NASA’s Jet Propulsion Laboratory", "title": "Mars Helicopters - The 4R's - NASA Mars - NASA Mars Exploration", "description": "Eighteen months ago, on April 19th 2021, on a cold spring day on Mars, Ingenuity took to the Martian skies for the first ever controlled flight of an aircraft on another planet.", "url": "https://mars.nasa.gov/technology/helicopter/status/417/mars-helicopters-the-4rs/", "urlToImage": "https://mars.nasa.gov/system/resources/detail_files/27130_PIA25338-web.jpg", "publishedAt": "2022-11-14T17:31:55Z", "content": "NASA's Mars Helicopters: Present, Future, and Proposed: A family portrait of Mars helicopters - Ingenuity, Sample Recovery Helicopter, and a future Mars Science Helicopter concept. Credits: NASA/JPL-… [+5606 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "A small space probe can report the results of our first defense test against asteroids. - BollyInside", "description": "Are MINIATURE PROBES the future of space exploration? As school bus-sized flagship missions orbit the solar system from Mars to Jupiter, they are", "url": "https://www.bollyinside.com/news/a-small-space-probe-can-report-the-results-of-our-first-defense-test-against-asteroids", "urlToImage": "https://cdn-photos.itemsb.com/wp-content/uploads/2022/11/Web-capture_14-11-2022_222040_www.bing_.com_.jpeg", "publishedAt": "2022-11-14T17:05:59Z", "content": "Are MINIATURE PROBES the future of space exploration? As school bus-sized flagship missions orbit the solar system from Mars to Jupiter, they are increasingly accompanied by tiny CubeSats with specia… [+3314 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Don Lincoln", "title": "Astronomers discover closest known black hole to Earth, Gaia BH1 - Big Think", "description": "At 1,600 light years away, the black hole is practically in our cosmic backyard.", "url": "https://bigthink.com/hard-science/closest-black-hole-earth/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/11/AdobeStock_147461738.jpg?resize=1200,630", "publishedAt": "2022-11-14T16:18:32Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "3280-foot monster asteroid heading towards Earth; Check out this terrifying planet-killer - msnNOW", "description": "Asteroid 2022 AP7, which measures 1-2 km (3280.84 feet is equal to 1 km) in diameter poses a huge threat to Earth. Is there a chance this terrifying asteroid will hit?", "url": "https://tech.hindustantimes.com/tech/news/3280foot-monster-asteroid-heading-towards-earth-check-out-this-terrifying-planetkiller-71668442272537.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/14/1600x900/asteroid-g5603adab3_1920_1647078503425_1668442335525_1668442335525.jpg", "publishedAt": "2022-11-14T16:13:00Z", "content": "In a critically important development, the constant quest to detect dangerous asteroids that are heading towards Earth has just borne fruit. A terrifying asteroid has been found. Scientists have enco… [+2224 chars]"}, {"source": {"id": null, "name": "DIYphotography"}, "author": "Dunja Djudjic", "title": "Hubble captures rare photo of evolving supernova in early universe - DIYphotography", "description": "NASA’s Hubble Space Telescope brings us a pretty incredible and rare “blast from the past.” In a recent photo, the telescope captured three different moments in a supernova explosion that happened more than 11 billion years ago. In “universe years,” that’s me…", "url": "https://www.diyphotography.net/hubble-captures-rare-photo-of-evolving-supernova-in-early-universe/", "urlToImage": "https://www.diyphotography.net/wp-content/uploads/2022/11/hubble-supernova.jpg", "publishedAt": "2022-11-14T15:00:00Z", "content": "NASAs Hubble Space Telescope brings us a pretty incredible and rare blast from the past. In a recent photo, the telescope captured three different moments in a supernova explosion that happened more … [+3539 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "China's ring of telescopes ready to unravel Sun from Tibetan Plateau - India Today", "description": "China's ring of the telescope is ready to explore the secrets of the Sun.", "url": "https://www.indiatoday.in/science/story/chinas-ring-of-telescopes-ready-to-unravel-sun-from-tibetan-plateau-2297143-2022-11-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/daocheng_telescope-sixteen_nine.jpg?VersionId=aA4Axun4nobtibKvk1QEAvl8XdzCUtAZ", "publishedAt": "2022-11-14T11:41:12Z", "content": "By India Today Web Desk: With plans to venture deep into space from the permanently shadowed regions of the moon to the flying objects in the asteroid, China is smoothly progressing when it comes to … [+2432 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Kilonova: One of the Rarest Astronomical Phenomena — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: If you are a science enthusiast, you may have heard of a Supernova, but many people are unaware of what a Kilonova is. NASA explains that, Kilonova is a merger between two neutron stars or a neutron star and a black hole that results in an expl…", "url": "https://www.transcontinentaltimes.com/kilonova-one-of-the-rarest-astronomical-phenomena/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/11/Kilonova-NASA.jpg", "publishedAt": "2022-11-14T11:14:48Z", "content": "UNITED STATES: If you are a science enthusiast, you may have heard of a Supernova, but many people are unaware of what a Kilonova is.\r\nNASA explains that, Kilonova is a merger between two neutron sta… [+2220 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Do all solar activities like solar storms, CME, impact Earth? This is what NASA says - HT Tech", "description": "Do solar activities like solar flares, CME, among others have an impact on Earth? NASA has an answer. Check it out here.", "url": "https://tech.hindustantimes.com/photos/do-all-solar-activities-like-solar-storms-cme-impact-earth-this-is-what-nasa-says-71668423970299.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/14/1600x900/Untitled_design_-_2022-10-12T100358594_1665549284754_1668424144280_1668424144280.jpg", "publishedAt": "2022-11-14T11:14:45Z", "content": "Top SectionsExplore Tech\r\nCopyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Missing planets twice Earth's size may point to migrating worlds - Space.com", "description": "The dichotomy arises during the first 50 million years of planetary history.", "url": "https://www.space.com/exoplanet-size-gap-from-planetary-migrations", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pJDtktsNzin7UXtu9FcuSU-1200-80.jpg", "publishedAt": "2022-11-14T11:00:18Z", "content": "Supercomputer simulations have provided an explanation as to why so many exoplanets are either super-Earths or mini-Neptunes, with few planets in between.\r\nExoplanets\r\n can come in a variety of sizes… [+3810 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Australian Rocks May Hold Clues For Mission Searching For Life On Mars - NDTV", "description": "The rocks in question are stromatolites situated in the Pilbara Craton of the region.", "url": "https://www.ndtv.com/world-news/australian-rocks-may-hold-clues-for-mission-searching-for-life-on-mars-3518538", "urlToImage": "https://c.ndtvimg.com/2022-11/igjljvjo_australian-rocks-may-hold-clues-for-mission-searching-for-life-on-mars_625x300_14_November_22.jpg", "publishedAt": "2022-11-14T10:22:22Z", "content": "Stromatolites form distinctive structures that can be recognised in the rock.\r\nScientists have recently discovered that the layered rocks found in Western Australia have been formed by some of Earth'… [+2506 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Sibu Tripathi", "title": "Henry Gee tells the origin story we all need to know | Book Review - India Today", "description": "Henry Gee's ‘A (Very) Short History of Life on Earth’ is like taking an aerial view of the planet where nature survives and evolution thrives.", "url": "https://www.indiatoday.in/lifestyle/books/story/henry-gee-tells-the-origin-story-we-all-need-to-know-book-review-2297063-2022-11-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/kioa-sixteen_nine.jpg?VersionId=R9KVE4_baBus0tyqUKG9f94YgC1Wjh.b", "publishedAt": "2022-11-14T09:03:25Z", "content": "By Sibu Tripathi: Physicist Carl Sagan, after seeing the 'Pale Blue Dot' image of Earth captured by Voyager-1 from the edge of the solar system, said Look again at that dot. That's here. That's home.… [+2997 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Find Hidden Galaxy Cluster In \"Phantom Zone\" Of Universe - NDTV", "description": "Since the time it has been launched, the James Webb telescope has captured stunning images of the universe.", "url": "https://www.ndtv.com/science/scientists-find-hidden-galaxy-cluster-in-phantom-zone-of-universe-3517816", "urlToImage": "https://i.ndtvimg.com/i/2017-03/universe-650_650x400_61488483525.jpg", "publishedAt": "2022-11-14T06:57:22Z", "content": "The galaxy cluster is hidden behind our Milky Way. (Representational Image)\r\nSpace scientists have discovered a galaxy cluster far beyond the centre of our Milky way, in an uncharted region known as … [+1596 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Camille Fine, USA TODAY", "title": "Extremely rare pink auroras 'a blessing' witnessed in Norway - USA TODAY", "description": "A rare explosion of vivid pink auroras filled Norway's night sky earlier in November.", "url": "https://www.usatoday.com/story/news/world/2022/11/13/rare-pink-auroras-norway-night-sky/8315879001/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/11/13/USAT/db0bb9f6-0b39-49cf-ad2b-f0bfd7b036ff-Markus-Varik-Greenlander.no-6912_1667437668.jpg?auto=webp&crop=2047,1152,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-11-13T22:04:37Z", "content": "Want to know what the night sky looks like after a solar storm smashes into earth and rips a hole into the planet’s magnetic field? \r\nThe combination of cosmic events led to a rare explosion of strik… [+1910 chars]"}, {"source": {"id": null, "name": "Cosmos"}, "author": "Imma Perfetto", "title": "Cone Nebula, rapid rain bursts, Sumatran rhino mini-brain - Cosmos", "description": "New image of the Cone Nebula, First steps towards a second chance for the Sumatran rhino, & device that decodes brain activity to spell sentence.", "url": "https://cosmosmagazine.com/space/cone-nebula-rapid-rain-burst/", "urlToImage": "https://cosmosmagazine.com/wp-content/uploads/2022/11/The-Cone-Nebula-is-part-of-a-star-forming-region-of-space...-Cropped-1200.jpg", "publishedAt": "2022-11-13T17:30:00Z", "content": null}]}