{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "Astronomers Find No Signs Of Planet Nine | Science & Tech - Ommcom News", "description": "New York:  A team of astronomers who scammed about 87 per cent of the southern sky have found no trace of Planet Nine in our solar system yet.Pluto, discovered in January 1930, was earlier known as the Planet Nine. However in 2006, astronomers reclas", "url": "https://ommcomnews.com/science-tech/astronomers-find-no-signs-of-planet-nine", "urlToImage": "https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/03/20184408/6922b25dbabefc82d16621a36eda2562.jpg", "publishedAt": "2022-03-20T13:14:19Z", "content": "New York:  A team of astronomers who scammed about 87 per cent of the southern sky have found no trace of Planet Nine in our solar system yet.\r\nPluto, discovered in January 1930, was earlier known as… [+2218 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: New Russian cosmonaut team welcomed aboard International Space Station; Fish waste become octopus food as farms expand amid captivity concerns and more - Devdiscourse", "description": "The arrival of the latest cosmonaut team - warmly welcomed by four Americans, two Russians and a German crewmate already aboard - came a day after the European Space Agency (ESA) announced it had suspended a joint robotic rover mission to Mars with Russia due…", "url": "https://www.devdiscourse.com/article/science-environment/1969319-science-news-roundup-new-russian-cosmonaut-team-welcomed-aboard-international-space-station-fish-waste-become-octopus-food", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_04_2019_20_24_27_6022733.jpg?width=920&format=jpeg", "publishedAt": "2022-03-20T12:57:47Z", "content": "Following is a summary of current science news briefs.\r\nNew Russian cosmonaut team welcomed aboard International Space Station\r\nThree Russian cosmonauts arrived safely at the International Space Stat… [+2552 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Massive asteroid larger than the pyramids heads closest to Earth this week - DNA India", "description": "NASA has issued a warning about another giant rock, named 2013 BO76, fast approaching the Earth on March 24.", "url": "https://www.dnaindia.com/science/report-massive-asteroid-larger-than-the-pyramids-heads-closest-to-earth-this-week-2941058", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/03/20/1133834-1019634-asteroid-earth-reuters.jpg", "publishedAt": "2022-03-20T11:34:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Mar 20, 2022, 05:10 PM ISTThe universe is an amalgamation of mysterious rocks. Some of these are hazardous objects, others are no… [+1786 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Raven Weber", "title": "The sky is not the limit Solar storms, diamonds on Mercury and more - Sprout Wired", "description": "Last week a solar storm and an asteroid measuring about 3 meters hit our planet, but none of the events...", "url": "https://www.sproutwired.com/the-sky-is-not-the-limit-solar-storms-diamonds-on-mercury-and-more/", "urlToImage": "https://www.sproutwired.com/wp-content/uploads/2022/03/The-sky-is-not-the-limit-Solar-storms-diamonds-on.png", "publishedAt": "2022-03-20T09:37:29Z", "content": "Last week a solar storm and an asteroid measuring about 3 meters hit our planet, but none of the events posed any risk to people. Meanwhile, new discoveries about the universe were announced.\r\nIf you… [+6704 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "Stephen Hawkings Black Hole Paradox May Finally Have Been Solved - Wonderful Engineering", "description": "Advertisement Black holes are known to have the potential to annihilate planets whenever they choose and leave nothing behind. It had focused its attention this time on the universe of physics itself. Stephen Hawking’s hypothesis about black holes had the pot…", "url": "https://wonderfulengineering.com/stephen-hawkings-black-hole-paradox-may-finally-have-been-solved/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/03/black-hole-1.jpg", "publishedAt": "2022-03-20T08:56:40Z", "content": "Black holes are known to have the potential to annihilate planets whenever they choose and leave nothing behind. It had focused its attention this time on the universe of physics itself. Stephen Hawk… [+2459 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "ESA scratches ExoMars 2022 launch for this year after suspending cooperation with Russia Roscosmos - The Indian Express", "description": "Russia's attack on Ukraine makes the EU-Russia joint effort to discover life on Mars impossible to realize at this time, says the European Space Agency.", "url": "https://indianexpress.com/article/technology/science/esa-stops-exomars-2022-roscosmos-russia-ukraine-7827880/", "urlToImage": "https://images.indianexpress.com/2022/03/ESAExoMarsScratched.jpg", "publishedAt": "2022-03-20T07:57:22Z", "content": "The European Space Agency’s ExoMars 2022 mission won’t launch in September as planned after the agency suspended all cooperation with Russia’s space program Roscosmos.\r\nLed collaboratively by Roscosm… [+3716 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Ingenuity Mars Helicopter faces toughest challenge yet as it helps look for traces of life on Mars - The Indian Express", "description": "The ancient river delta in the Jezero Crater, where Ingenuity is headed, is filled with jagged cliffs, angled surfaces, projecting boulders, and sand-filled-pockets that could stop a rover in its tracks or even upend a helicopter upon landing.", "url": "https://indianexpress.com/article/technology/science/ingenuity-river-delta-jezero-crater-life-mars-7827848/", "urlToImage": "https://images.indianexpress.com/2022/03/IngenuityCrater-Delta.jpg", "publishedAt": "2022-03-20T07:37:39Z", "content": "NASA has extended flight operations for the first aircraft to operate on the surface of another planet through September. The helicopter will soon accompany the Perseverance rover and support its upc… [+2606 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Planet Venus at its 'greatest elongation' from the sun tonight - Space.com", "description": "Venus has had a busy March! Now, the bright planet will be at its greatest distance from the sun tonight (March 20).", "url": "https://www.space.com/venus-reaches-greatest-elongation-march-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qU4ChzKqSgWSkdYv3DJiz8-1200-80.jpg", "publishedAt": "2022-03-20T06:30:50Z", "content": "With a magnitude of -4.4, Venus\r\n should be fairly easy to spot in the eastern sky, despite its low pre-sunrise altitude. While the planet will reach its greatest western elongation at 5:35 p.m. EDT … [+1981 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "SpaceX launches 53 Starlink satellites into space from Florida - Economic Times", "description": "SpaceX launched another batch of Starlink satellites into space on Saturday. The Falcon 9 carried 53 Starlink satellites to low Earth orbit from Space Launch Complex 40 at Cape Canaveral Space Force Station in Cape Canaveral, Florida. Starlink provides high-s…", "url": "https://economictimes.indiatimes.com/news/international/world-news/spacex-launches-53-starlink-satellites-into-space-from-florida/videoshow/90331779.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90331779,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-20T05:08:00Z", "content": "SpaceX launched another batch of Starlink satellites into space on Saturday. The Falcon 9 carried 53 Starlink satellites to low Earth orbit from Space Launch Complex 40 at Cape Canaveral Space Force … [+184 chars]"}, {"source": {"id": null, "name": "Techstory.in"}, "author": null, "title": "NASA's Mega Moon rocket arrives at launchpad preparing for final test - Techstory", "description": "NASA's Space Launch System (SLS) has arrived at Launch Pad 39B at Kennedy Space Center in Florida, getting ready for the tests.", "url": "https://techstory.in/nasas-mega-moon-rocket-arrives-at-launchpad-preparing-for-final-test/", "urlToImage": "https://techstory.in/wp-content/uploads/2022/03/1803_MOON-ROCKET-seo.jpg", "publishedAt": "2022-03-20T04:11:29Z", "content": "NASA’s Space Launch System (SLS) has arrived at Launch Pad 39B at Kennedy Space Center in Florida. It is being prepared for a final test before the mission starts. This mission will pave the path for… [+2399 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "UT Dallas researchers explore origins of chronic pain and the potential for better treatments - News-Medical.Net", "description": "An investigation into how human nerve cells differ from animal cells has provided researchers from The University of Texas at Dallas' Center for Advanced Pain Studies with important clues in the pursuit of more effective treatments for chronic pain.", "url": "https://www.news-medical.net/news/20220319/UT-Dallas-researchers-explore-origins-of-chronic-pain-and-the-potential-for-better-treatments.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Neuroscience-620x480.jpg", "publishedAt": "2022-03-20T03:56:00Z", "content": "An investigation into how human nerve cells differ from animal cells has provided researchers from The University of Texas at Dallas' Center for Advanced Pain Studies (CAPS) with important clues in t… [+4079 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Perseverance Rover's Self-Driving Capabilities Put to the Test in Rush to Martian Delta - SciTechDaily", "description": "The rover’s self-driving capabilities will be put to the test this month as it begins a record-breaking series of sprints to its next sampling location. NASA’s Perseverance Mars rover is trying to cover more distance in a single month than any rover before it…", "url": "https://scitechdaily.com/nasa-perseverance-rovers-self-driving-capabilities-put-to-the-test-in-rush-to-martian-delta/", "urlToImage": "https://scitechdaily.com/images/Perseverance-Mars-Rover-Route-to-Jezero-Crater-Delta.gif", "publishedAt": "2022-03-20T03:19:49Z", "content": "NASA’s Perseverance Mars rover looks back at its wheel tracks on March 17, 2022, the 381st Martian day, or sol, of the mission. Credit: NASA/JPL-Caltech\r\nThe rover’s self-driving capabilities will be… [+6681 chars]"}, {"source": {"id": null, "name": "3lmnews.com"}, "author": "Kevin Robin", "title": "NASA sent a spacecraft to push the asteroid away - 3LM News", "description": "Dart (double asteroid redirection test) aboard SpaceX's Falcon 9 rocket took off from Vandenberg Space Force Base in California on Wednesday. According to the BBC, the mission will be carried out on a", "url": "https://3lmnews.com/nasa-sent-a-spacecraft-to-push-the-asteroid-away/", "urlToImage": "https://3lmnews.com/wp-content/uploads/2022/03/dart-spacecraft-241121-01.jpg", "publishedAt": "2022-03-20T00:34:12Z", "content": "Dart (double asteroid redirection test) aboard SpaceX’s Falcon 9 rocket took off from Vandenberg Space Force Base in California on Wednesday.\r\nAccording to the BBC, the mission will be carried out on… [+1048 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Scientists Created Self-Evolving RNA, Demonstrating How Life Began On Earth - Indiatimes.com", "description": "Did life on Earth evolve from RNA? Scientists have found evidence that all life on Earth may have started with RNA after Japanese scientists created RNA that copies, multiplies, diversifies, and becomes a complex entity on its own.                        iSto…", "url": "https://www.indiatimes.com/technology/news/self-evolving-rna-life-on-earth-564867.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage16-copy_6235c8f2d1714.jpg", "publishedAt": "2022-03-19T21:05:34Z", "content": "Did life on Earth evolve from RNA? Scientists have found evidence that all life on Earth may have started with RNA after Japanese scientists created RNA that copies, multiplies, diversifies, and beco… [+2395 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Our Universe Probably Has A Twin Where Time Runs Backwards, Say Scientists - Indiatimes.com", "description": "What if our universe had a twin that runs backward in time? As absurd as this sounds, scientists believe the existence of such a universe could explain a lot of mysteries about the universe.The theory of an \"anti-universe\" assumes that the earliest universe w…", "url": "https://www.indiatimes.com/technology/science-and-future/universe-twin-time-backwards-theory-564677.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage11-copy-1_6232e2c3b413a.jpg", "publishedAt": "2022-03-19T21:05:34Z", "content": "What if our universe had a twin that runs backward in time? As absurd as this sounds, scientists believe the existence of such a universe could explain a lot of mysteries about the universe.\r\nThe the… [+2054 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Andy Tomaswick", "title": "Why the $4.1 billion launch cost of NASA’s Moon rocket could destroy it - Inverse", "description": "NASA's Space Launch System is supposed to ferry astronauts to the Moon, but at an estimated $4.1 billion per launch, it may be doomed before it ever gets off the ground.", "url": "https://www.inverse.com/science/nasa-sls-launch-cost", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/3/14/9b4b7ea8-e4cb-41b2-b23c-acb9cecbbcdb-6428-1280x720.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-03-19T21:00:25Z", "content": "This will likely\r\n come as a surprise to no one who has closely watched the development of NASAs next giant rocket, the Space Launch System (SLS), but its going to be expensive to use. Like, really e… [+4285 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Spots Gigantic Debris Cloud Created by Clashing Celestial Bodies - SciTechDaily", "description": "Major smashups between rocky bodies shaped our solar system. Observations of a similar crash give clues about how frequent these events are around other stars. Most of the rocky planets and satellites in our solar system, including Earth and the Moon, were fo…", "url": "https://scitechdaily.com/nasa-spots-gigantic-debris-cloud-created-by-clashing-celestial-bodies/", "urlToImage": "https://scitechdaily.com/images/Two-Asteroids-Colliding.gif", "publishedAt": "2022-03-19T19:47:10Z", "content": "Major smashups between rocky bodies shaped our solar system. Observations of a similar crash give clues about how frequent these events are around other stars.\r\nMost of the rocky planets and satellit… [+5570 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Use of 'acoustic fabric' could allow you to answer the phone while wearing your shirt - BollyInside", "description": "Apple Watches and FitBits are only the tip of the iceberg when it comes to wearable technology. Scientists have created a “acoustic fabric” that can", "url": "https://www.bollyinside.com/news/technology/use-of-acoustic-fabric-could-allow-you-to-answer-the-phone-while-wearing-your-shirt-2", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/Use-of-acoustic-fabric-could-allow-you-to-answer-the.webp_.webp.webp", "publishedAt": "2022-03-19T18:16:25Z", "content": "Apple Watches and FitBits are only the tip of the iceberg when it comes to wearable technology. Scientists have created a acoustic fabric that can detect and emit sound, reimagining jeans, T-shirts, … [+2134 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Image of James Webb snapped by the Gaia observatory - Digital Trends", "description": "The Gaia observatory was recently able to snap a picture of the James Webb observatory in its orbit at L2.", "url": "https://www.digitaltrends.com/news/james-webb-gaia-observatory/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/gaia_snaps_photo_of_webb_pillars1.jpg", "publishedAt": "2022-03-19T17:59:44Z", "content": "The James Webb Space Telescope doesn’t orbit the Earth as the Hubble Space Telescope does. Instead, it orbits the sun in a position called the second Sun-Earth Lagrange point, or L2, where it can rem… [+2085 chars]"}, {"source": {"id": null, "name": "Themiracletech.com"}, "author": "cassie ventura", "title": "Global warming like the one we are experiencing has already happened in the past! - The Miracle Tech", "description": "56 million years ago, our Earth experienced quite exceptional natural global warming. In question, greenhouse gas emissions linked to volcanism. And researchers are now confirming that this warming was preceded by changes that are reminiscent of those we are …", "url": "https://themiracletech.com/latest/global-warming-like-the-one-we-are-experiencing-has-already-happened-in-the-past/", "urlToImage": "https://themiracletech.com/wp-content/uploads/2022/03/d29f6198af_50187556_rechauffement-climatique-volcans-1000x600.jpg", "publishedAt": "2022-03-19T14:48:45Z", "content": "56 million years ago, our Earth experienced quite exceptional natural global warming. In question, greenhouse gas emissions linked to volcanism. And researchers are now confirming that this warming w… [+3278 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Moon’s orbit proposed as gravitational wave detector: Research - The Siasat Daily", "description": "Barcelona: A new research has proposed using the variations in distance between the Earth and the Moon, which can be measured with a precision of less than a centimetre, as a new gravitational wave detector within a frequency range that current devices cannot…", "url": "https://www.siasat.com/moons-orbit-proposed-as-gravitational-wave-detector-research-2293264/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/01/Moon.jpg", "publishedAt": "2022-03-19T13:55:00Z", "content": "Barcelona: A new research has proposed using the variations in distance between the Earth and the Moon, which can be measured with a precision of less than a centimetre, as a new gravitational wave d… [+4077 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "New asteroid spotted just before impact with Earth - Freethink", "description": "NASA successfully pinpointed almost exactly where and when a new asteroid would hit Earth’s atmosphere, before it made contact.", "url": "https://www.freethink.com/space/new-asteroid", "urlToImage": "https://www.freethink.com/wp-content/uploads/2022/03/new-Asteroid_Web.jpg?resize=1200,630", "publishedAt": "2022-03-19T13:00:00Z", "content": "Skip to content\r\nNASA was able to accurately predict its impact location and time.\r\nOn March 11, astronomers at NASA were able to pinpoint almost exactly where and when a new asteroid would hit Earth… [+4064 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Reasons Why We Are Seeing the Northern Lights More Frequently - Galaxy Reporters", "description": "The cycling activity of our sun increases the sighting of light in northern and southern lights. The solar cycle 25 is kicking off style, and this is what will happen in the upcoming winter. Our sun has an expanding atmosphere, so there are changes in particl…", "url": "https://galaxyreporters.com/reasons-why-we-are-seeing-the-northern-lights-more-frequently/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/03/shutterstock_1549558463-1024x683.jpg", "publishedAt": "2022-03-19T12:27:23Z", "content": "The cycling activity of our sun increases the sighting of light in northern and southern lights.\r\nThe solar cycle 25 is kicking off style, and this is what will happen in the upcoming winter.\r\nOur su… [+1483 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "New data shows that what scientists had thought were planets are actually stars - Space.com", "description": "The identity of three, possibly four, stars has been brought into question, as researchers re-evaluate the objects' size, revealing they are far too big to be exoplanets.", "url": "https://www.space.com/stars-found-masquerading-as-exoplanets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Qek6YeU5P9NWnpeh8oNqNF-1200-80.jpeg", "publishedAt": "2022-03-19T11:46:37Z", "content": "Astronomers have detected at least three small stars masquerading as exoplanets, new research shows. \r\nThe three, possibly four, stars were originally discovered by NASA's Kepler Space Telescope\r\n. A… [+4364 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "A new form of ice discovered - Tech Explorist", "description": "Findings could have implications for our understanding of distant, water-rich planets.", "url": "https://www.techexplorist.com/new-form-ice-discovered/45426/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/03/new-laser-heating-technique.jpg", "publishedAt": "2022-03-19T10:53:37Z", "content": "There are at least 20 solid forms of ice known to us. Recently, UNLV scientists have discovered a new form of ice, redefining the properties of water at high pressures.\r\nScientists devised a new meth… [+2528 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Kate Baggaley", "title": "The controversial search for a genius in the remains of Einstein’s brain - Inverse", "description": "Researchers studying Einstein's brain intended to discover the key to what had made the man a genius. They did not succeed.", "url": "https://www.inverse.com/science/controversial-search-for-genius-in-einstein-brain", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/3/18/aa369112-20ec-40d1-865d-c1cce416894c-2_final.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-03-19T10:00:25Z", "content": "Albert Einstein didnt plan to donate his brain to science. In fact, he requested his entire body be cremated and the ashes scattered secretly. But when the theoretical physicist died on April 18, 195… [+14947 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Russian astronauts wear suits matching Ukraine flag colours - Moneycontrol", "description": "Latest News. Get all the latest India news, ipo, bse, business news, commodity only on Moneycontrol.", "url": "https://www.moneycontrol.com/news", "urlToImage": "", "publishedAt": "2022-03-19T07:35:52Z", "content": null}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telanganatoday", "title": "Watch skies as ‘Worm Moon’ reaches peak on Friday - Telangana Today", "description": "The full Moon of March will reach its peak on Friday, just two days before the arrival of spring in the Northern Hemisphere, Space.com reported. There are a plethora of other possible monikers in the US, among them the Storm or Hunger Moon, according to Alman…", "url": "https://telanganatoday.com/watch-skies-as-worm-moon-reaches-peak-on-friday", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/03/Watch-skies-as-Worm-Moon-reaches-peak-on-Friday.jpg", "publishedAt": "2022-03-19T05:00:43Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "China's FAST telescope observes the origin of fast radio bursts - CGTN", "description": "", "url": "https://news.cgtn.com/news/2022-03-19/China-s-FAST-telescope-observes-the-origin-of-fast-radio-bursts-18wnjTVIFAk/index.html", "urlToImage": "https://news.cgtn.com/news/2022-03-19/China-s-FAST-telescope-observes-the-origin-of-fast-radio-bursts-18wnjTVIFAk/img/6eb8b7cfa6484c699f97e4b7dfbe9faf/6eb8b7cfa6484c699f97e4b7dfbe9faf-750.jpeg", "publishedAt": "2022-03-19T02:33:03Z", "content": "In physics, simplicity is beauty. Chinese astronomers, using devices including the world's most sensitive radio telescope, identified a single parameter to describe the mysterious repeating fast radi… [+2149 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Wildfires devastate the land they burn, and they are also warming the planet - EurekAlert", "description": "The 2021 wildfire season broke records globally, leaving land charred from California to Siberia. The risk of fire is growing, and a report published by the UN last month warned that wildfires are on track to increase 50% by 2050. These fires destroy homes, p…", "url": "https://www.eurekalert.org/news-releases/945967", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-03-19T02:02:04Z", "content": "The 2021 wildfire season broke records globally, leaving land charred from California to Siberia. The risk of fire is growing, and a report published by the UN last month warned that wildfires are on… [+3937 chars]"}, {"source": {"id": null, "name": "Lankatimes.com"}, "author": "Izer", "title": "New types of armored dinosaurs discovered in China - Lanka Times", "description": "This is the oldest armored dinosaur found in all of Asia, and it helps us understand when and where these animals first appeared. Credit: © Yu Chen A new", "url": "https://www.lankatimes.com/new-types-of-armored-dinosaurs-discovered-in-china/", "urlToImage": "https://www.lankatimes.com/wp-content/uploads/2022/03/New-types-of-armored-dinosaurs-discovered-in-China.jpg", "publishedAt": "2022-03-18T19:25:26Z", "content": "This is the oldest armored dinosaur found in all of Asia, and it helps us understand when and where these animals first appeared. Credit: © Yu Chen\r\nA new type of armored dinosaur from China has been… [+6219 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "NASA Spots China Mars Rover and Its Impressive Wheel Tracks From Orbit - CNET", "description": "The charismatic Zhurong rover has left its mark on Mars.", "url": "https://www.cnet.com/science/space/nasa-spots-china-mars-rover-and-its-impressive-wheel-tracks-from-orbit/", "urlToImage": "https://www.cnet.com/a/img/resize/4af85d5910d39d43119cf7cdf462001d88b607c0/2022/03/18/82a3399e-3813-4826-9819-fc5fd5378599/mro-zhurongmarch2022.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-03-18T18:48:00Z", "content": "NASA's MRO spacecraft spotted China's Zhurong rover and its wheels tracks on March 11, 2022. The dark object is the rover.\r\nNASA/JPL/UArizona\r\nThis story is part of Welcome to Mars, our series explor… [+1529 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "John Wenz", "title": "Look: Jaw-dropping Jupiter NASA image reveals two cosmic Easter eggs - Inverse", "description": "Io and Europa creep into a shot from the Juno probe.", "url": "https://www.inverse.com/science/io-europa-juno", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/3/18/07ab8f9a-4fd2-4e03-b125-e37b12a0c957-jupiter.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-03-18T18:42:41Z", "content": "A beautiful new\r\n shot of Jupiter reveals two interlopers faintly creeping into the frame. The image, taken during a January 12 flyby of the giant planet by NASAs intrepid Juno probe features a cameo… [+3676 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Preparing the Space Station for Solar Array Upgrades on This Week @NASA – March 18, 2022 - NASA", "description": "Preparing the space station for solar array upgrades, rolling out the spacecraft for our Artemis I mission, and the Webb Space Telescope team reaches another...", "url": "https://www.youtube.com/watch?v=NDmFz_Qe5A0", "urlToImage": "https://i.ytimg.com/vi/NDmFz_Qe5A0/hqdefault.jpg", "publishedAt": "2022-03-18T18:33:49Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious Signal Coming From Our Galaxy Could Be One of The Rarest Known Objects - ScienceAlert", "description": "A mysterious, repeating radio signal in the Milky Way that baffled astronomers could be an object so rare, only one other has ever been tentatively identified.", "url": "https://www.sciencealert.com/weird-repeating-signal-from-the-galactic-center-could-be-an-ultra-rare-white-dwarf-pulsar", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/mysterious-ultra-slow-repeating-signal_1024.jpg", "publishedAt": "2022-03-18T18:01:44Z", "content": "A mysterious, repeating radio signal in the Milky Way that baffled astronomers could be an object so rare, only one other has ever been tentatively identified.\r\nAccording to a paper by astrophysicist… [+4549 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Ancient ancestors evolved to be strong and snappy, study finds - Phys.org", "description": "Researchers led by the University of Bristol show that the earliest jaws in the fossil record were caught in a trade-off between maximizing their strength and their speed.", "url": "https://phys.org/news/2022-03-ancient-ancestors-evolved-strong-snappy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/ancient-ancestors-evol.jpg", "publishedAt": "2022-03-18T18:00:10Z", "content": "Researchers led by the University of Bristol show that the earliest jaws in the fossil record were caught in a trade-off between maximizing their strength and their speed.\r\nAlmost all vertebrates are… [+3630 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Leah Burrows", "title": "Turning any camera into a polarization camera - Phys.org", "description": "Polarization, the direction in which light vibrates, provides a lot of information about the objects with which it interacts, from aerosols in the atmosphere to the magnetic field of stars.  However, because this quality of light is invisible to human eyes, r…", "url": "https://phys.org/news/2022-03-camera-polarization.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/turning-any-camera-int.jpg", "publishedAt": "2022-03-18T15:36:44Z", "content": "Polarization, the direction in which light vibrates, provides a lot of information about the objects with which it interacts, from aerosols in the atmosphere to the magnetic field of stars.  However,… [+3137 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Electron powers a weak but significant bond for building complex structures: Chemists use elementary particle to catalyze molecular recognition - Science Daily", "description": "How do you bring together two molecules that positively repel each other? A research team has developed a simple and versatile solution: Introduce an electron with a jolt of electricity, and resistance between the two is reduced and a bond formed. This fundam…", "url": "https://www.sciencedaily.com/releases/2022/03/220318092136.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-18T15:01:34Z", "content": "How do you bring together two molecules that positively repel each other? A Northwestern University-led research team has developed a simple and versatile solution: Introduce an electron with a jolt … [+4346 chars]"}]}