{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "NASA capsule flies over Apollo landing sites, heads home - HT Tech", "description": "NASA’s Orion capsule and its test dummies swooped one last time around the moon Monday, flying over a couple Apollo landing sites before heading home.", "url": "https://tech.hindustantimes.com/tech/news/nasa-capsule-flies-over-apollo-landing-sites-heads-home-71670312006987.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/06/1600x900/NASA-Moonshot-0_1670314358991_1670314358991_1670314375153_1670314375153.jpg", "publishedAt": "2022-12-06T19:16:22Z", "content": "NASA's Orion capsule and its test dummies swooped one last time around the moon Monday, flying over a couple Apollo landing sites before heading home. \r\n Orion will aim for a Pacific splashdown Sunda… [+2083 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Queensland Fossil Hunters Discover Remains Of 100-Million-Year-Old Plesiosaur In Australia: Report - ABP Live", "description": "The plesiosaur fossil is believed to have the potential to unlock the discovery of several new species of prehistoric marine animals.", "url": "https://news.abplive.com/science/queensland-fossil-hunters-discover-remains-of-100-million-year-old-plesiosaur-in-australia-report-1567838", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/06/5b495bc7ce9500d33250e52d2fdc42fd1670343660196324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-12-06T17:39:24Z", "content": "A group of female fossil hunters in Queensland, Australia have discovered the fossilised remains of a 100-million-year-old plesiosaur in a cattle station. Palaeontologists are likening the remains to… [+2317 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Unwinding' chromosomes: A unique perspective on determinants of chromosomal width - Science Daily", "description": "Mitotic chromosomes are pivotal for the inheritance of genetic material. Now, it is already known that chromosomes vary in dimensions among organisms. But what governs mitotic chromosomal size and degree of DNA compaction? Scientists investigated mitotic chro…", "url": "https://www.sciencedaily.com/releases/2022/12/221206115734.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-06T17:20:38Z", "content": "Chromosomes are a highly condensed form of DNA and are crucial for cell division. During mitosis, chromosomes ensure that the genetic material is equally divided among the daughter cells. Interesting… [+3454 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Proposing a new idea for spacecraft propulsion that involves dynamic soaring - Phys.org", "description": "A team of researchers from McGill University and the Tau Zero Foundation is proposing a new idea for faster spacecraft propulsion that involves dynamic soaring. In their paper published in the journal Frontiers in Space Technology, the group outlines the idea…", "url": "https://phys.org/news/2022-12-idea-spacecraft-propulsion-involves-dynamic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/proposing-a-new-idea-f-1.jpg", "publishedAt": "2022-12-06T16:30:03Z", "content": "A team of researchers from McGill University and the Tau Zero Foundation is proposing a new idea for faster spacecraft propulsion that involves dynamic soaring. In their paper published in the journa… [+2547 chars]"}, {"source": {"id": null, "name": "Natureasia.com"}, "author": null, "title": "Evolution: Ruminant ears help trace 35 million years of evolution | Nature Communications - Nature Middle East", "description": "The shapes of ruminant inner ears are used to examine millions of years of evolution in herbivorous mammals, described in a paper published in Nature Communications. The findings link inner ear shape", "url": "https://www.natureasia.com/en/research/highlight/14314", "urlToImage": "http://www.natureasia.com/static/common/img/logos/journals/ncomms-logo-sq.png", "publishedAt": "2022-12-06T15:28:10Z", "content": "The shapes of ruminant inner ears are used to examine millions of years of evolution in herbivorous mammals, described in a paper published in Nature Communications. The findings link inner ear shape… [+1460 chars]"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Active mantle plume indicates Mars is more active than previously thought - Innovation News Network", "description": "An enormous mantle plume beneath Mars' surface is thought to be the cause of intense volcanic and seismic activity.", "url": "https://www.innovationnewsnetwork.com/active-mantle-plume-indicates-mars-more-active-previously-thought/28083/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2022/12/iStockAlexLMX-1199314454-1024x576.jpg", "publishedAt": "2022-12-06T15:08:19Z", "content": "Many have thought that Mars has been a dead planet for at least three billion years due to the apparent absence of shifting tectonic plates on the planets surface. However, scientists from the Univer… [+5958 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X staff", "title": "Researchers use ultrasound waves to move objects hands-free - Tech Xplore", "description": "University of Minnesota Twin Cities researchers have discovered a new method to move objects using ultrasound waves. The research opens the door for using contactless manipulation in industries such as manufacturing and robotics, where devices wouldn't need a…", "url": "https://techxplore.com/news/2022-12-ultrasound-hands-free.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-use-ultras-2.jpg", "publishedAt": "2022-12-06T14:54:57Z", "content": "University of Minnesota Twin Cities researchers have discovered a new method to move objects using ultrasound waves. The research opens the door for using contactless manipulation in industries such … [+3630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "'The extraterrestrials are back': Fireball spotted in skies in parts of US, netizens stunned - The Indian Express", "description": "Citing American Meteor Society, Foxweather report said there were nearly 700 reports from people who spotted the meteor shooting across 12 states and Ontario, Canada.", "url": "https://indianexpress.com/article/trending/trending-globally/fireball-spotted-across-sky-in-us-8309395/", "urlToImage": "https://images.indianexpress.com/2022/12/NowThis@nowthisnewsTwitter-15.jpg", "publishedAt": "2022-12-06T13:50:04Z", "content": "Doorbell cameras have caught what appears to be a meteor blazing across the night sky in US East Coast last week. The clips shared online showed a fireball passing across the sky quickly and netizens… [+1507 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Jagran Josh", "title": "Measurement Of The Movement Of Electrons. Find Out How They Did It And More! - Jagran Josh", "description": "This novel interferometric technique can be used by scientists to measure the time delay between extreme ultraviolet light pulses emitted by two isotopes of hydrogen molecules – H2 and D2 – interacting with intense infrared laser pulses which is less than thr…", "url": "https://www.jagranjosh.com/general-knowledge/measurement-of-the-movement-of-electrons-1670333719-1", "urlToImage": "https://img.jagranjosh.com/images/2022/December/6122022/movement-of-electrons.jpg", "publishedAt": "2022-12-06T13:32:00Z", "content": "Electrons take only attoseconds to move and the process is so fast for an atom to jump from one place to another that it is very difficult to measure. Thanks to the novel technique developed by scien… [+4474 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "This is where the old Satellites go to Die; NASA points to shocking deaths - HT Tech", "description": "We often read about Satellites flying up there in the sky and their functions, but ever thought about them getting old and where they go to die? NASA points to shocking deaths for its top tech and the dreaded Spacecraft Cemetery.", "url": "https://tech.hindustantimes.com/web-stories/this-is-where-the-old-satellites-go-to-die-nasa-points-to-shocking-deaths-71670331221413.html", "urlToImage": null, "publishedAt": "2022-12-06T13:06:55Z", "content": "Like every living or non-living thing, a Satellite also goes through the process of birth and death. Just like any other human or a peace of machinery, satellites also do not last forever."}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "Watch video: NASA releases stunning footage of spacewalk carried out by its astronauts - msnNOW", "description": "It took 7 hours to complete the installation of solar arrays as stated in the video.", "url": "https://www.firstpost.com/world/watch-video-nasa-releases-stunning-footage-of-spacewalk-carried-out-by-its-astronauts-11762491.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/11/AP22320344772106.jpg", "publishedAt": "2022-12-06T12:54:14Z", "content": "Space has always fascinated humankind. The human curiosity to explore this universe prompted our scientists to develop the technology capable of carrying human beings to Earths orbit and the Moon. Wi… [+1990 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "A black hole jet aimed at Earth - EarthSky", "description": null, "url": "https://earthsky.org/space/black-hole-tidal-disruption-event-at-2022cmc/", "urlToImage": "https://earthsky.org/upl/2022/12/star-black-hole-tidal-disruption-event-artist-concept-ESO.jpg", "publishedAt": "2022-12-06T12:39:23Z", "content": "View larger. | Artist’s concept of a supermassive black hole shredding and devouring a star. Astronomers call this a tidal disruption event. An international team of astronomers says it has detected … [+6718 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Paurush Omar", "title": "Stunning pics captured by NASA's James Webb telescope so far | Mint - Mint", "description": "Launched in late January this year, James Webb Space Telescope has sent back many breathtaking images back to the earth. Here are some of most spectacular images captured by NASA's most powerful eye in space", "url": "https://www.livemint.com/science/news/stunning-pics-captured-by-nasa-s-james-webb-telescope-so-far-11670324664898.html", "urlToImage": "https://images.livemint.com/img/2022/12/06/600x338/James_Webb_Space_Telescope_1670326770255_1670326770549_1670326770549.jpg", "publishedAt": "2022-12-06T11:59:09Z", "content": "On January 24, 2022, nearly a million miles from Earth, NASA's James Webb Space Telescope reached its gravitational parking spot in orbit around the sun. The telescope intended to provide the world w… [+2436 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Simon Morden", "title": "What dangers must we overcome before we can live on Mars? - Aeon", "description": "Dust storms, long distances and freezing temperatures make living on Mars magnificently challenging. How will we do it?", "url": "https://aeon.co/essays/what-dangers-must-we-overcome-before-we-can-live-on-mars", "urlToImage": "https://nu.aeon.co/images/36ae0114-67ac-480a-a4d2-8f33ee8f0508/header_essay-pia24937.jpg", "publishedAt": "2022-12-06T11:12:51Z", "content": "Can humans live on Mars? The answer is startlingly simple. Can humans live in Antarctica, where the temperatures regularly fall below -50ºC (-60ºF) and its dark for six months of the year? Can humans… [+17766 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "'New to Science': Two Never-Seen-Before Minerals Discovered in a Meteorite in East Africa's Somalia - News18", "description": "Researchers in Canada have discovered two new minerals in a meteorite that landed in east Africa’s Somalia in 2020.", "url": "https://www.news18.com/buzz/new-to-science-two-never-seen-before-minerals-discovered-in-a-meteorite-in-east-africas-somalia-6506779.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/meteroids-167032446116x9.png", "publishedAt": "2022-12-06T11:03:16Z", "content": "Researchers in Canada have discovered two new minerals in a meteorite that landed in east Africas Somalia in 2020. The 15-tonne El Ali meteorite is the ninth largest celestial rock found on Earth and… [+1743 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Million years old lizard specimen found in Natural History Museum cupboard pushes origin of reptiles by 35 million years - The Tribune India", "description": "A specimen retrieved from a cupboard of the Natural History Museum in London has shown that modern lizards originated in the Late Triassic and not the Middle Jurassic as previously thought.", "url": "https://www.tribuneindia.com/news/science-technology/million-years-old-lizard-specimen-found-in-natural-history-museum-cupboard-pushes-origin-of-reptiles-by-35-million-years-458342", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_373459221.JPG", "publishedAt": "2022-12-06T10:24:00Z", "content": "ANI\r\nWashington, December 6\r\nA specimen retrieved from a cupboard of the Natural History Museum in London has shown that modern lizards originated in the Late Triassic and not the Middle Jurassic as … [+4444 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research: Space atomic clocks could help uncover nature of dark matter - ANI News", "description": "Studying an atomic clock on-board a spacecraft inside the orbit of Mercury and very near to the Sun might be the trick to uncovering the nature of dark matter, suggests a new study published in Nature Astronomy.", "url": "https://www.aninews.in/news/science/research-space-atomic-clocks-could-help-uncover-nature-of-dark-matter20221206152423", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221206095354.jpg", "publishedAt": "2022-12-06T09:54:00Z", "content": "Washington [US] December 6 (ANI): Studying an atomic clock on-board a spacecraft inside the orbit of Mercury and very near to the Sun might be the trick to uncovering the nature of dark matter, sugge… [+3457 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's Hubble Telescope captures amazing picture of open star cluster | DNA India | #StarrySights - DNAIndiaNews", "description": "NASA's Hubble Telescope captures amazing picture of open star cluster | DNA India News | Space American space agency NASA's Hubble Space Telescope recently c...", "url": "https://www.youtube.com/watch?v=g43uyX4gEDo", "urlToImage": "https://i.ytimg.com/vi/g43uyX4gEDo/maxresdefault.jpg", "publishedAt": "2022-12-06T09:30:05Z", "content": null}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "NASA's Perseverance Rover collects Martian regolith, its third sample type - NewsBytes", "description": "This time NASA's Mars Perseverance Rover has picked up regolith, which is basically Martian dust, from a large sand ripple called Observation Mountain", "url": "https://www.newsbytesapp.com/news/science/nasa-s-mars-perseverance-rover-collects-regolith-sample/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l61420221206132304.jpeg", "publishedAt": "2022-12-06T09:15:49Z", "content": "NASA's Perseverance Rover collects Martian regolith, its third sample type\r\nWritten bySanjana Shankar\r\nDec 06, 2022, 02:45 pm2 min read\r\nNASA's Mars Perseverance Rover has picked up regolith, which i… [+1727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Hubble revisits ‘celestial fireworks’ of supernova remnant - msnNOW", "description": "The Space Telescope Science Institute revisited an old image captured by the Hubble Space Telescope and improved it with added imaging data and better image processing techniques.", "url": "https://indianexpress.com/article/technology/science/nasa-hubble-supernova-remnant-image-8308854/?utm_source=msn&amp;utm_medium=Referral", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14XBAE.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-12-06T08:15:47Z", "content": "© Provided by The Indian ExpressIn this image from NASAs Hubble Space Telescope, the delicate filaments of a supernova remnant can be seen burning brightly against the dark backdrop of deep space. Th… [+1322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "ISS astronauts will soon munch on tomatoes grown in space - The Indian Express", "description": "International Space Station astronauts are working on the Veg-05 science experiment, which will grow dwarf tomatoes in the confined environment of the space station.", "url": "https://indianexpress.com/article/technology/science/international-space-station-space-crops-tomato-8308455/", "urlToImage": "https://images.indianexpress.com/2022/12/Space-tomatoes-international-space-station-20221206.jpg", "publishedAt": "2022-12-06T06:58:46Z", "content": "Apart from installing two roll-out solar arrays to the International Space Station (ISS), astronauts on board are also installing the Veg-05 science experiment, which will attempt to grow dwarf tomat… [+2109 chars]"}, {"source": {"id": null, "name": "Stardate.org"}, "author": null, "title": "Mars Impacts - Stardate.org", "description": "Mars takes a pounding. The asteroid belt is just beyond it, so the planet gets hit by big space rocks that are kicked out of the belt and toward the Sun. We see the results of those impacts — big holes in the Martian landscape. Mars rovers have seen debris fr…", "url": "https://stardate.org/radio/program/2022-12-06", "urlToImage": null, "publishedAt": "2022-12-06T06:29:02Z", "content": "Mars takes a pounding. The asteroid belt is just beyond it, so the planet gets hit by big space rocks that are kicked out of the belt and toward the Sun. We see the results of those impacts big holes… [+1198 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Mars 'Forest Bubble': 50 Acre Dome Proposed as Red Planet Nature Reserve - CNET", "description": "The proposal suggests the structure would support species of value if humans were to colonize the red planet.", "url": "https://www.cnet.com/science/space/mars-forest-bubble-50-acre-dome-proposed-as-red-planet-nature-reserve/", "urlToImage": "https://www.cnet.com/a/img/resize/e8cfb1015b3e8e1f8c9ef7dd8ea712bb2636f2ae/hub/2022/12/02/050360e3-8a92-48c2-b8f1-a90b43d750d9/marsingenuitylandscape.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-12-06T03:13:39Z", "content": "Science fiction has a long history of imagining off-world environments packed with plants and animals, often living under a transparent structure. Essentially, Earth in a bubble. Now a botanist and e… [+2547 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Small glowing protein allows researchers to peer deeper into living tissues: Proteins that emit longer wavelengths of near-infrared light help create detailed, hi-res biomedical images - Science Daily", "description": "Biomedical and genetic engineers have designed a small fluorescent protein that emits and absorbs light that penetrates deep into biological tissue. Tailored to wavelengths in the near-infrared (NIR) spectrum, this protein can help researchers capture deeper,…", "url": "https://www.sciencedaily.com/releases/2022/12/221205163641.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-06T01:42:55Z", "content": "Biomedical and genetic engineers at Duke University and the Albert Einstein College of Medicine have designed a small fluorescent protein that emits and absorbs light that penetrates deep into biolog… [+5197 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New quantum dots study uncovers implications for biological imaging - Science Daily", "description": "Researchers report the synthesis of semiconductor 'giant' core-shell quantum dots with record-breaking emissive lifetimes. In addition, the lifetimes can be tuned by making a simple alteration to the material's internal structure.", "url": "https://www.sciencedaily.com/releases/2022/12/221205153755.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-06T01:32:17Z", "content": "A new study involving researchers at the University of Illinois Chicago achieved a milestone in the synthesis of multifunctional photonic nanomaterials.In a paper published in the American Chemical S… [+3253 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Paola Rosa-Aquino", "title": "These Depressing Images Show What We're Not Seeing in The Night Sky - ScienceAlert", "description": "In order to describe how much light pollution there is at a particular location, astronomers classify night skies based on the Bortle Scale.", "url": "https://www.businessinsider.com/what-dark-skies-look-like-how-many-more-stars-than-cities-suburbs", "urlToImage": "https://i.insider.com/638e0ec454ac0f001950eb20?width=1200&format=jpeg", "publishedAt": "2022-12-06T00:11:15Z", "content": "If you were to look up at the night sky, it could range from a dusty glow to an inky black expanse with thousands of sparkling stars, depending on where you are.\r\nOn a clear night, estimates suggest … [+5208 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A journey across generations: Inheritance of the plant microbiome via seed - Phys.org", "description": "What defines us and other living organisms more strongly, genes or the environment? Only recently, researchers were able to prove experimentally that even microorganisms can be inherited from one plant generation to the next via the seed.", "url": "https://phys.org/news/2022-12-journey-generations-inheritance-microbiome-seed.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-journey-across-gener.jpg", "publishedAt": "2022-12-05T22:13:34Z", "content": "by Leibniz-Institut für Agrartechnik und Bioökonomie e.V.What defines us and other living organisms more strongly, genes or the environment? Only recently, researchers were able to prove experimental… [+3481 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "See Mars at opposition pass behind the moon this week for free online - Space.com", "description": "This week offers multiple opportunities to get a great look at Mars thanks to several livestreams of Red Planet astronomical events.", "url": "https://www.space.com/mars-opposition-lunar-occultation-watch-online-dec-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jY7RtiXd7UNPssvFqTiQdd-1200-80.jpg", "publishedAt": "2022-12-05T22:00:32Z", "content": "This week offers multiple opportunities to get a great look at the Red Planet.\r\nOn Wednesday (Dec. 7), the full moon will be in close proximity to a bright Mars during an event known as a lunar occul… [+5629 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X staff", "title": "Robot helps researchers achieve a new record at the world's deepest cave pit - Tech Xplore", "description": "A small city in the east of Czechia called Hranice harbors a unique natural wonder that is not (yet) trending on Instagram. The Hranice Abyss is the deepest underwater cave pit in the world, and a team of researchers recently beat a record by revealing more a…", "url": "https://techxplore.com/news/2022-12-robot-world-deepest-cave-pit.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/a-new-world-record-was.jpg", "publishedAt": "2022-12-05T21:06:04Z", "content": "A small city in the east of Czechia called Hranice harbors a unique natural wonder that is not (yet) trending on Instagram. The Hranice Abyss is the deepest underwater cave pit in the world, and a te… [+4825 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Chinese astronauts return to earth after 'successful' six-month mission; Prehistoric 'wonderfully weird beast' Whatcheeria grew big quickly and more - Devdiscourse", "description": "The construction launch outside the remote town of Carnarvon, Northern Cape, marks the next phase of developing a complex instrument aimed at revealing events since the cosmic dawn, when the first stars and galaxies were formed.  Japanese billionaire to make …", "url": "https://www.devdiscourse.com/article/technology/2276377-science-news-roundup-chinese-astronauts-return-to-earth-after-successful-six-month-mission-prehistoric-wonderfully-weird-b", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_09_2022_10_47_57_2075443.jpg?width=920&format=jpeg", "publishedAt": "2022-12-05T20:58:00Z", "content": "Following is a summary of current science news briefs.\r\nMysteries of universe in focus for South African mega telescope\r\nSouth African officials and scientists on Monday celebrated a milestone toward… [+2097 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "NASA's COLDArm at Lunar Regolith Simulant Test Bed - NASA Jet Propulsion Laboratory", "description": "NASA's COLDArm combines several new technologies that allow it to operate in temperatures as cold as minus 280 degrees Fahrenheit (minus 173 degrees Celsius) without the use of energy-consuming heaters required by robotic arms on current spacecraft.", "url": "https://www.jpl.nasa.gov/images/pia25317-nasas-coldarm-at-lunar-regolith-simulant-test-bed", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/images/jpegPIA25317.width-1024.jpg", "publishedAt": "2022-12-05T19:14:25Z", "content": "The 3D-printed titanium scoop of the Cold Operable Lunar Deployable Arm (COLDArm) robotic arm system is poised above a test bed filled with material to simulate lunar regolith (broken rocks and dust)… [+1456 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Father-of-three captures images of Mars and moon using home telescope - Daily Mail", "description": "Father-of-three James Flanagan has taken a series of spectacular photos of the surface of the moon and nebulas thousands of light years away, all from his garden in Tankerton, Whitstable.", "url": "https://www.dailymail.co.uk/sciencetech/article-11504431/Father-three-captures-spectacular-images-Mars-moon-using-telescope-garden.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/05/17/65263357-0-image-a-101_1670261649843.jpg", "publishedAt": "2022-12-05T18:36:12Z", "content": "When you look up at the night sky from your garden, you might catch a glimpse of a few stars if you're lucky.\r\nBut father-of-three James Flanagan wanted a better view, and pointed his 'middle of the … [+6584 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Ayesha Gulzar", "title": "The world's smallest life form can now move, thanks to genetic engineering - Interesting Engineering", "description": "Researchers engineered the smallest motile life form ever by introducing seven bacterial proteins into a synthetic bacterium.", "url": "https://interestingengineering.com/science/worlds-smallest-life-form-move-thanks-genetic-engineering", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/12/05/image/png/zMFZOlIlNLTJlKpUKjKm9a19RCcdCiAwI0XyxFfA.png", "publishedAt": "2022-12-05T17:54:00Z", "content": "The team experimented with syn-3 by introducing seven genes that code for proteins that are likely involved in the swimming motion of Spiroplasma bacteria. Spiroplasma is a small natural bacterium wi… [+1126 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "Free public event at UCLan on the history of the James Webb Space Telescope - BollyInside", "description": "The James Webb Space Telescope (JWST), which was launched on Christmas Day 2021 from the Guiana Space Center, has astonished the world with its", "url": "https://www.bollyinside.com/news/free-public-event-at-uclan-on-the-history-of-the-james-webb-space-telescope", "urlToImage": "https://cdn-photos.itemsb.com/wp-content/uploads/2022/12/Web-capture_5-12-2022_225051_www.bing_.com_.jpeg", "publishedAt": "2022-12-05T17:35:19Z", "content": "The James Webb Space Telescope (JWST), which was launched on Christmas Day 2021 from the Guiana Space Center, has astonished the world with its technological prowess and ground-breaking scientific di… [+805 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Research inspects a distant gamma-ray emitting blazar - Phys.org", "description": "An international team of astronomers has performed a long-term multiwavelength study of a distant gamma-ray emitting blazar known as 1ES 0647+250. Results of the research, published November 23 on arXiv.org, yield important insights into the long-term variabi…", "url": "https://phys.org/news/2022-12-distant-gamma-ray-emitting-blazar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/research-inspects-a-di.jpg", "publishedAt": "2022-12-05T17:20:01Z", "content": "An international team of astronomers has performed a long-term multiwavelength study of a distant gamma-ray emitting blazar known as 1ES 0647+250. Results of the research, published November 23 on ar… [+3497 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Quantum light source could pave the way to a quantum internet - Phys.org", "description": "The ability to integrate fiber-based quantum information technology into existing optical networks would be a significant step toward applications in quantum communication. To achieve this, quantum light sources must be able to emit single photons with contro…", "url": "https://phys.org/news/2022-12-quantum-source-pave-internet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-quantum-light-sour.jpg", "publishedAt": "2022-12-05T17:07:50Z", "content": "The ability to integrate fiber-based quantum information technology into existing optical networks would be a significant step toward applications in quantum communication. To achieve this, quantum l… [+3462 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Jason Goodyer", "title": "Like modern humans, Homo Naledi harnessed fire for light, warmth and cooking - BBC Science Focus Magazine", "description": "Researchers excavating South Africa’s Rising Star Cave system have unearthed evidence that homo naeldi, an extinct species of hominid first discovered in 2013, built fires in underground chambers.", "url": "https://www.sciencefocus.com/news/like-modern-humans-homo-naledi-harnessed-fire-for-light-warmth-and-cooking/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2022/12/Homonaledihero-620f071.jpg?resize=960,413", "publishedAt": "2022-12-05T16:58:07Z", "content": "It is often said the ability to make fire is one of the key skills that defines humans it allowed our ancestors to cook food, keep warm and eventually become the most dominant species on the planet.\r… [+3291 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A new milestone for laser technology: Seeded free-electron lasers - Phys.org", "description": "Extremely intense light pulses generated by free-electron lasers (FELs) are versatile tools in research. Particularly in the X-ray range, they can be deployed to analyze the details of atomic structures of a wide variety of materials and to follow fundamental…", "url": "https://phys.org/news/2022-12-milestone-laser-technology-seeded-free-electron.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/milestone-for-laser-te.jpg", "publishedAt": "2022-12-05T16:44:04Z", "content": "Extremely intense light pulses generated by free-electron lasers (FELs) are versatile tools in research. Particularly in the X-ray range, they can be deployed to analyze the details of atomic structu… [+6506 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Matthew Cobb", "title": "A zoologist explains why the project to resurrect the wooly mammoth should go extinct - Big Think", "description": "De-extinction, if it is ever possible, will not be simple.", "url": "https://bigthink.com/the-future/deextinction-as-gods/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/12/AdobeStock_247807710.jpg?resize=1200,630", "publishedAt": "2022-12-05T16:15:25Z", "content": null}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Tim McMillan, Tim McMillan", "title": "A “Quantum Brain” Could Solve The Hard Problem of Consciousness, New Research Suggests - The Debrief", "description": "New research points to quantum entanglement in the brain, suggesting that a \"quantum brain\" might solve the hard problem of consciousness.", "url": "https://thedebrief.org/a-quantum-brain-could-solve-the-hard-problem-of-consciousness-new-research-suggests/", "urlToImage": "https://thedebrief.org/wp-content/uploads/2022/12/quantum-brain-1-scaled.jpg", "publishedAt": "2022-12-05T16:01:24Z", "content": "One of the most enduring human mysteries is why we possess sentient awareness, a paradox known to science as the “hard problem of consciousness.”\r\nAt the physiological level, we have a good understan… [+8000 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Asymmetry Detected in the Distribution of Galaxies - Quanta Magazine", "description": "Two new studies suggest that certain tetrahedral arrangements of galaxies outnumber their mirror images, potentially reflecting details of the universe’s birth. But confirmation is needed.", "url": "https://www.quantamagazine.org/asymmetry-detected-in-the-distribution-of-galaxies-20221205/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/12/TetrahedraInTheSky-byMyriamWares-Social.webp", "publishedAt": "2022-12-05T15:17:43Z", "content": "Physicists believe they have detected a striking asymmetry in the arrangements of galaxies in the sky. If confirmed, the finding would point to features of the unknown fundamental laws that operated … [+4594 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Machine learning method can accurately predict VO2max levels without exercise - News9 LIVE", "description": "VO2max levels is a measure of the maximum amount of oxygen the body can utilise during intense activities", "url": "https://www.news9live.com/science/machine-learning-method-can-accurately-predict-vo2max-levels-without-exercise-212082", "urlToImage": "https://media.news9live.com/h-upload/2022/12/05/588918-fitness-monitorcropped.jpg", "publishedAt": "2022-12-05T15:17:02Z", "content": "A team of researchers have developed a new method that uses machine learning algorithms to accurately predict VO2max levelsof individuals, without the need for exercise. The measurement can be conduc… [+1730 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Peer into the exposed heart of a galaxy in mesmerizing new image - Space.com", "description": "A new image shows the exposed heart of a distant galaxy in stunning detail, demonstrating the promise of a recent addition to the Very Large Telescope.", "url": "https://www.space.com/vlt-eris-image-exposed-heart-of-galaxy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eMX6zf38AcPEkEi4Ws6Tcn-1200-80.jpg", "publishedAt": "2022-12-05T15:00:27Z", "content": "A new image shows the exposed heart of a distant galaxy in stunning detail, demonstrating the promise of a recent addition to the Very Large Telescope. \r\nThe image shows the galaxy\r\n NGC 1097, which … [+4129 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Raphael Sarfati", "title": "Blinking Lights of a Firefly Swarm Embody in Nature What Mathematics Predicted – The Wire Science - The Wire Science", "description": "Synchrony is ubiquitous throughout the universe, from electron clouds to biological cycles and planetary orbits. But synchrony is a complex concept with many ramifications.", "url": "https://science.thewire.in/the-sciences/blinking-lights-firefly-swarm-synchrony/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/12/05185706/cf249e52e978e37c31cf53a1afc08369.jpeg", "publishedAt": "2022-12-05T13:35:39Z", "content": "Fireflies synchronized light shows have fascinated observers for ages. Photo: Raphael Sarfati, CC BY-ND 4.0\r\n<ul><li>Synchrony is ubiquitous throughout the universe, from electron clouds to biologica… [+8431 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "An egg dropped from space didn't break. Viral video has over 24 million views - Moneycontrol", "description": "Ex NASA engineer Mark Rober’s initial plan failed and after several attempts, he, with the help of his friend and NASA engineer Adam Stelzner, managed to drop the egg successfully without breaking it.", "url": "https://www.moneycontrol.com/news/trends/egg-dropped-from-space-didnt-break-viral-experiment-video-has-over-24-million-views-9653581.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/12/Collage-Maker-05-Dec-2022-06.31-PM-770x435.jpg", "publishedAt": "2022-12-05T13:04:05Z", "content": "A former NASA engineer took an egg drop experiment, popular in schools in many parts of the world, to space. The goal was to protect a raw egg from breaking when dropped from the tallest height possi… [+1245 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "I lure tarantulas from their burrows (for science) - Nature.com", "description": "Entomologist Jackie Billotte reconstructs the burrows and housekeeping habits of tarantulas, which help to keep insect and rodent populations under control in southeastern Colorado.", "url": "https://www.nature.com/articles/d41586-022-04335-7", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-04335-7/d41586-022-04335-7_23778806.jpg", "publishedAt": "2022-12-05T12:28:15Z", "content": "As part of my PhD thesis at Colorado State University in Fort Collins, I study the Texas brown tarantula (Aphonopelma hentzi) in the short-grass prairie. My colleagues and I work on the Southern Plai… [+1673 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Laura Geggel", "title": "Monstrous 'gorgons' survived a mass extinction, but they were a 'dead clade walking' - Livescience.com", "description": "About 90% of all species went extinct during the \"Great Dying\" around 252 million years ago, but in the case of one paleo-beast — the so-called gorgon — reports of its death were greatly exaggerated, new research finds.", "url": "https://www.livescience.com/gorgonopsians-survived-mass-extinction", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uz7Ws2chHHG4nwyHCPR8qY-1200-80.jpg", "publishedAt": "2022-12-05T12:00:00Z", "content": "Reports of a \"gorgon\" mass extinction at the end of the Permian period were greatly exaggerated, new research finds. These bizarre paleo-beasts were thought to have died out along with most other lif… [+4303 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Tübingen: International research team identifies new dinosaur species - India Education Diary", "description": "An international team of researchers has discovered a previously unknown species of dinosaur in western Romania and named it after the place where it was found, Transylvania: Transylvanosaurus platycephalus lived around 70 million years ago and was a", "url": "https://indiaeducationdiary.in/university-of-tubingen-international-research-team-identifies-new-dinosaur-species/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/01/Library-University-of-Tubingen-Germany.jpg?fit=1024%2C768&ssl=1", "publishedAt": "2022-12-05T11:51:22Z", "content": "An international team of researchers has discovered a previously unknown species of dinosaur in western Romania and named it after the place where it was found, Transylvania: Transylvanosaurus platyc… [+4237 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Siberian Federal University: SibFU scientists help trace germanium to collect itself - India Education Diary", "description": "SibFU scientists have obtained sorbents based on silicon and aluminum oxides, layered with reagents with functional groups of tiron, for extraction, concentration and determination of germanium (IV) out of complex systems. The obtained sorbents will", "url": "https://indiaeducationdiary.in/siberian-federal-university-sibfu-scientists-help-trace-germanium-to-collect-itself/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/highlight-campus-lib.jpg?fit=970%2C440&ssl=1", "publishedAt": "2022-12-05T11:33:57Z", "content": "SibFU scientists have obtained sorbents based on silicon and aluminum oxides, layered with reagents with functional groups of tiron, for extraction, concentration and determination of germanium (IV) … [+2128 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The biomass of bloom-forming colonial Microcystis affects its response to aeration disturbance | Scientific Reports - Nature.com", "description": "Scientific Reports - The biomass of bloom-forming colonial Microcystis affects its response to aeration disturbance", "url": "https://www.nature.com/articles/s41598-022-25017-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-25017-4/MediaObjects/41598_2022_25017_Fig1_HTML.png", "publishedAt": "2022-12-05T11:22:23Z", "content": "The experiment results showed that the algal community response depended on the initial Microcystis biomass (Figs. 1, 2, 3, Tables 2, 3, 4, 5), and a number of green algae and a few diatom species gr… [+12886 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "ITMO: ITMO Scientists Suggest Cheap Way to Control Optical Signals With Halide Perovskites - India Education Diary", "description": "Halide perovskites are a relatively new group of materials that are used in solar cells, diodes, scintillators, and other devices. One of their main advantages is their availability and ease of production. They are also characterized by the stable bo", "url": "https://indiaeducationdiary.in/itmo-itmo-scientists-suggest-cheap-way-to-control-optical-signals-with-halide-perovskites/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/ITMO_University-1.png?fit=1024%2C724&ssl=1", "publishedAt": "2022-12-05T10:59:53Z", "content": "Halide perovskites are a relatively new group of materials that are used in solar cells, diodes, scintillators, and other devices. One of their main advantages is their availability and ease of produ… [+5904 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Molly Campbell", "title": "Coral's Microbiome “Reshuffles” During Hibernation - Technology Networks", "description": "A new study has analyzed the microbiome of a species of coral before, during and after a period of “dormancy” during cold temperatures. The research found that <i>Astrangia poculata</i>'s microbiome \"reshuffles\" during a period of quiescence.", "url": "https://www.technologynetworks.com/immunology/news/corals-microbiome-reshuffles-during-hibernation-368152", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/368152/corals-microbiome-reshuffles-during-hibernation-368152-640x360.jpg?cb=20221205", "publishedAt": "2022-12-05T10:59:13Z", "content": "A new study has analyzed the microbiome of a species of coral before, during and after a period of dormancy during cold temperatures. The research is published in Applied and Environmental Microbiolo… [+3196 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "All-atmospheric fabrication of Ag–Cu core–shell nanowire transparent electrodes with Haacke figure of merit >600 × 10–3 Ω−1 | Scientific Reports - Nature.com", "description": "Scientific Reports - All-atmospheric fabrication of Ag–Cu core–shell nanowire transparent electrodes with Haacke figure of merit &gt;600 × 10–3...", "url": "https://www.nature.com/articles/s41598-022-25080-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-25080-x/MediaObjects/41598_2022_25080_Fig1_HTML.png", "publishedAt": "2022-12-05T10:31:11Z", "content": "<li>Haacke, G. New figure of merit for transparent conductors. J. Appl. Phys.47, 40864089 (1976).\r\nArticle \r\nGoogle Scholar \r\n</li><li>De, S. &amp; Coleman, J. N. Are there fundamental limitations on… [+16231 chars]"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Characterising the earliest galaxies in the Universe - Innovation News Network", "description": "A team of astrophysicists have used the presence of hydrogen to detect the formation of the Universe's earliest galaxies.", "url": "https://www.innovationnewsnetwork.com/characterising-the-earliest-galaxies-in-the-universe/28010/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2022/12/iStockkevron2001-540717412.jpg", "publishedAt": "2022-12-05T10:21:35Z", "content": "Led by Professor Rennan Barkana from the Sackler School of Physics and Astronomy at Tel Aviv University, the team discovered that early galaxies were relatively small and dim compared to their modern… [+3856 chars]"}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "Ashwini Sakharkar", "title": "Microrobots can restructure materials on a microscopic level - Inceptive Mind", "description": "The researchers' microrobots use physical intelligence to exert control over nearby objects.", "url": "https://www.inceptivemind.com/microrobots-restructure-materials-microscopic-level/28634/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2022/12/microrobot-banner.jpg", "publishedAt": "2022-12-05T10:12:14Z", "content": "Controlling microscopic processes is inherently challenging. The everyday tool used to manipulate matter on the macroscale can’t simply be shrunk down to the size of the cell, and even if they could,… [+2561 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Water that simply will not freeze, no matter how cold it gets - Tech Explorist", "description": "An exotic interplay of electrons.", "url": "https://www.techexplorist.com/water-simply-not-freeze-no-matter-how-cold-gets/55222/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/12/Cryostat-scaled.jpg", "publishedAt": "2022-12-05T10:11:20Z", "content": "An international research team- including the Helmholtz-Zentrum Dresden-Rossendorf (HZDR)- has discovered a quantum state that could be described in this way. Scientists managed to cool a special mat… [+3851 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Sinead Butler", "title": "Scientists created a mini black hole and it started radiating - indy100", "description": "Scientists have managed to simulate their very own black hole in their lab and witnessed how it began to glow.The black hole event horizon was created by a team of physicists from the University of Amsterdam, who used a chain of atoms in a single file to gain…", "url": "https://www.indy100.com/science-tech/scientists-created-mini-black-hole-2658837224", "urlToImage": "https://www.indy100.com/media-library/astronomers-detect-mysterious-star-that-defies-black-hole-theory.jpg?id=32126757&width=1200&height=600&coordinates=0%2C95%2C0%2C259", "publishedAt": "2022-12-05T10:09:55Z", "content": "Scientists have managed to simulate their very own black hole in their lab and witnessed how it began to glow.\r\nThe black hole event horizon was created by a team of physicists from the University of… [+2240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "New NASA image tells story of birth, death and dust in Orion Nebula - The Indian Express", "description": "NASA released an image of the Orion Nebula that combines data from the Spitzer Space Telescope, the Herschel Space Telescope and the Wide-Field Infrared Survey Explorer (WISE).", "url": "https://indianexpress.com/article/technology/science/nasa-image-orion-nebula-8306982/", "urlToImage": "https://images.indianexpress.com/2022/12/Orion-nebula-20221205.jpg", "publishedAt": "2022-12-05T09:28:30Z", "content": "NASA shared an image of a region that includes the Orion nebula, made by combining previously released data from three regions. The nebula and the constellation it can be found in are named after Ori… [+1556 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Much More Liquid Magma is Stored in the Yellowstone Supervolcano - The Hans India", "description": "There is significantly more magma under Yellowstone than was previously believed, by an...", "url": "https://www.thehansindia.com/offbeat/much-more-liquid-magma-is-stored-in-the-yellowstone-supervolcano-771966", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/12/05/1323409-yellow.jpg", "publishedAt": "2022-12-05T07:38:08Z", "content": "According to a recent study, there is significantly more magma under Yellowstone than was previously believed, by an international team of experts, providing crucial insights to models that could be … [+2059 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "'Infant stars' grow rapidly during frequent feeding frenzies: Research - The Indian Express", "description": "New research suggests that stars younger than 100,000 years old, the cosmic equivalent of a 7-hour-old infant, grow by devouring material during frequent feeding frenzies.", "url": "https://indianexpress.com/article/technology/science/infant-star-formaton-growth-research-8306656/", "urlToImage": "https://images.indianexpress.com/2022/12/Star-feeding-frenzy-20221205.jpg", "publishedAt": "2022-12-05T07:31:14Z", "content": "Newly born stars have surprisingly frequent feeding frenzies where they consume material at a furious rate and grow larger, according to new research published in the journal Astrophysical Journal Le… [+2153 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Age of the Sun revealed; here is how old it is - HT Tech", "description": "Often our mind takes us to mysterious questions which leads us to ponder about things beyond the earth in our solar system. This especially  applies to our Sun, especially about how old it is. Well, here is all you need to know about the age of the Sun.", "url": "https://tech.hindustantimes.com/web-stories/age-of-the-sun-revealed-here-is-how-old-it-is-71670222137527.html", "urlToImage": null, "publishedAt": "2022-12-05T07:05:10Z", "content": "Along with the Sun there are countless otyher objects that formed, such as asteroids, meteors, and planetesimals, which have remained unchanged for billions of years. It is these ojects that help sci… [+215 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Scientists Build 'Baby' Wormhole as Science Fiction Turned into Real Life - News18", "description": "A wormhole - a rupture in space and time - is considered a bridge between two remote regions in the universe. Scientists refer to them as Einstein–Rosen bridges after the two physicists who described them - Albert Einstein and Nathan Rosen.", "url": "https://www.news18.com/buzz/scientists-build-baby-wormhole-as-science-fiction-turned-into-real-life-6537523.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/wormhole-167021735016x9.png", "publishedAt": "2022-12-05T05:19:19Z", "content": "In science fiction - think films and TV like Interstellar\" and Star Trek\" - wormholes in the cosmos serve as portals through space and time for spacecraft to traverse unimaginable distances with ease… [+3013 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Erman Akdogan", "title": "Silicon-based lifeforms: the key to unlocking a new frontier? - Medium", "description": "Carbon is the building block of life on earth because of its ability to readily form bonds with other atoms and itself. This gives flexibility to the form and function that biomolecules can take…", "url": "https://medium.com/predict/silicon-based-lifeforms-the-key-to-unlocking-a-new-frontier-8e7769c12a41", "urlToImage": "https://miro.medium.com/max/1200/1*7GRq-O8AC1OQoT3I4_7r5w.png", "publishedAt": "2022-12-04T23:50:03Z", "content": "Carbon is the building block of life on earth because of its ability to readily form bonds with other atoms and itself. This gives flexibility to the form and function that biomolecules can take, suc… [+307 chars]"}]}