{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "NASA Psyche asteroid mission suffers massive setback - HT Tech", "description": "NASA put Psyche asteroid mission on hold Friday, blaming the late delivery of its own navigation software.", "url": "https://tech.hindustantimes.com/tech/news/nasa-asteroid-mission-on-hold-due-to-late-software-delivery-71656145647525.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/pia24471-3-1041_1650699181614_1656149571811.jpg", "publishedAt": "2022-06-26T04:17:50Z", "content": "NASA put Psyche asteroid mission on hold Friday, blaming the late delivery of its own navigation software. The Psyche mission to a strange metal asteroid of the same name was supposed to launch this … [+2028 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Massive Sunspot Twice the Size of Earth is Facing Our Home Planet - News18", "description": "The sunspot has reportedly doubled its diameter in 24 hours, and it is pointed right at our planet. The magnetic field surrounding sunspot AR3038 has the potential to blast M-class solar flares toward our planet.", "url": "https://www.news18.com/news/buzz/massive-sunspot-twice-the-size-of-earth-is-facing-our-home-planet-5439205.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/solar-flares-165615765116x9.png", "publishedAt": "2022-06-26T02:30:39Z", "content": "Celestial events are always interesting to witness and most recently we are witnessing a gigantic sunspot that has grown equal to twice the size of Earth. The sunspot has reportedly doubled its diame… [+1949 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Photosynthesis Can Produce Food in Complete Darkness - SciTechDaily", "description": "Artificial photosynthesis is being developed by researchers to help make food production more energy-efficient on Earth, and maybe one day on Mars. For millions of years, photosynthesis has evolved in plants to turn water, carbon dioxide, and the energy from …", "url": "https://scitechdaily.com/artificial-photosynthesis-can-produce-food-in-complete-darkness/", "urlToImage": "https://scitechdaily.com/images/Plants-Growing-in-Complete-Darkness.jpg", "publishedAt": "2022-06-26T01:21:33Z", "content": "ByUniversity of California RiversideJune 25, 2022\r\nPlants are growing in complete darkness in an acetate medium that replaces biological photosynthesis. Credit: Marcus Harland-Dunaway/UCR\r\nArtificial… [+5242 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A space traveler offers advice to aspiring astronauts - BollyInside", "description": "More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an", "url": "https://www.bollyinside.com/news/a-space-traveler-offers-advice-to-aspiring-astronauts", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/A-space-traveler-offers-advice-to-aspiring-astronauts.jpeg", "publishedAt": "2022-06-26T00:08:37Z", "content": "More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an astronaut.\r\nFor most people, working in space m… [+2485 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Despite its draining power, NASA's InSight Mars lander is determined to squeeze as much science as it can until the very last moment - Universe Today", "description": "Its solar panels are caked with dust and the batteries are running out of juice, but NASA’s InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very last beep. To conserve energy, InSight was projected to shut…", "url": "https://www.universetoday.com/156454/despite-its-draining-power-nasas-insight-mars-lander-is-determined-to-squeeze-as-much-science-as-it-can-until-the-very-last-moment/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/06/FEATURED-IMAGE-7.jpg", "publishedAt": "2022-06-25T21:57:07Z", "content": "Its solar panels are caked with dust and the batteries are running out of juice, but NASAs InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very l… [+3906 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA thinks Voyager space probes will run out of power soon - BollyInside", "description": "The NASA Voyager Mission was launched in 1977 with a five-year design lifetime. The spacecraft has travelled 14.5 billion miles from Earth since then,", "url": "https://www.bollyinside.com/news/nasa-thinks-voyager-space-probes-will-run-out-of-power-soon", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/NASA-thinks-Voyager-space-probes-will-run-out-of-power.jpeg", "publishedAt": "2022-06-25T20:08:37Z", "content": "The NASA Voyager Mission was launched in 1977 with a five-year design lifetime. The spacecraft has travelled 14.5 billion miles from Earth since then, researching interstellar space and making numero… [+1077 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The Andromeda Galaxy shows the wounds of a disastrous collision - BollyInside", "description": "Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic", "url": "https://www.bollyinside.com/news/the-andromeda-galaxy-shows-the-wounds-of-a-disastrous-collision", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/The-Andromeda-Galaxy-shows-the-wounds-of-a-disastrous-collision.jpeg", "publishedAt": "2022-06-25T19:44:18Z", "content": "Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic evolution.\r\nAndromeda, located 2.5 million ligh… [+1461 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "ISS Booster Engine Firing on Cygnus Freighter Comes to an Early End - BollyInside", "description": "A scheduled reboost manoeuvre of the International Space Station was aborted after only 5 seconds for unknown reasons. Cargo spacecraft moored to the", "url": "https://www.bollyinside.com/news/iss-booster-engine-firing-on-cygnus-freighter-comes-to-an-early-end", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/ISS-Booster-Engine-Firing-on-Cygnus-Freighter-Comes-to-an.jpeg", "publishedAt": "2022-06-25T19:33:38Z", "content": "A scheduled reboost manoeuvre of the International Space Station was aborted after only 5 seconds for unknown reasons.\r\nCargo spacecraft moored to the International Space Station fire their thrusters… [+2076 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Climate change: a ‘space bubble’ shield can block solar radiation - BollyInside", "description": "MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the sun’s rays, dubbed ‘Space", "url": "https://www.bollyinside.com/news/climate-change-a-space-bubble-shield-can-block-solar-radiation", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Climate-change-a-space-bubble-shield-can-block-solar-radiation.jpeg", "publishedAt": "2022-06-25T19:32:44Z", "content": "MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the suns rays, dubbed Space Bubbles.\r\nThis is a variation on the common geoenginee… [+3673 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Tetraneutron – An Exotic State of Matter discovered - Tech Explorist", "description": "It could lead to a better understanding of how the universe is put together.", "url": "https://www.techexplorist.com/tetraneutron-exotic-state-of-matter-discovered/52105/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/Andrey-Shirokov.jpg", "publishedAt": "2022-06-25T19:31:06Z", "content": "A long-standing question in nuclear physics is whether chargeless nuclear systems can exist. Only neutron stars represent near-pure neutron systems, where neutrons are squeezed together by the gravit… [+6222 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Emerging Super Crab The Most Post Pulsar to Be Discovered - Galaxy Reporters", "description": "Astronomers have found out what might be the most effective pulsar ever identified. They assume that the newfound object, VT 1137-0337, is a pulsar wind nebula and a neutron star that stimulates nearby charged particles at close to the velocity of light. The …", "url": "https://galaxyreporters.com/emerging-super-crab-the-most-post-pulsar-to-be-discovered/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/Pulsar-1.webp", "publishedAt": "2022-06-25T19:14:19Z", "content": "Astronomers have found out what might be the most effective pulsar ever identified.\r\nThey assume that the newfound object, VT 1137-0337, is a pulsar wind nebula and a neutron star that stimulates nea… [+1389 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Early Sound Exposure in Womb Identified as Necessary for Auditory Development - Galaxy Reporters", "description": "Model research suggests that the abnormal location in the uterus improves the brain’s ability to interpret specific types of sound. Inside the uterus, the fetuses may begin to hear some sounds at about 20 weeks of gestation. However, due to the moving effect …", "url": "https://galaxyreporters.com/early-sound-exposure-in-womb-identified-as-necessary-for-auditory-development/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/shutterstock_633509993-scaled.jpg", "publishedAt": "2022-06-25T19:13:58Z", "content": "Model research suggests that the abnormal location in the uterus improves the brain’s ability to interpret specific types of sound.\r\nInside the uterus, the fetuses may begin to hear some sounds at ab… [+3252 chars]"}, {"source": {"id": null, "name": "Newsazi.com"}, "author": "Eli Pacheco", "title": "How Astronomers Are Investigating This Nebula Where Stars Are Being Born - News Azi", "description": "Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses under its own gravity and gets hot, b", "url": "https://newsazi.com/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/", "urlToImage": "https://www.slashgear.com/img/gallery/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/l-intro-1656091252.jpg", "publishedAt": "2022-06-25T19:12:26Z", "content": "Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses u… [+1081 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Astronomers Searching for Cosmic X-Ray Signposts of Gravitational Waves - Galaxy Reporters", "description": "Over the past few years, astronomers have reached a remarkable milestone: the discovery of gravitational waves, the disappearance of weak waves in space, and the timing of some of the worst events in the universe, including the collision between black holes a…", "url": "https://galaxyreporters.com/astronomers-searching-for-cosmic-x-ray-signposts-of-gravitational-waves/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/gravitational-waves.png", "publishedAt": "2022-06-25T19:12:12Z", "content": "Over the past few years, astronomers have reached a remarkable milestone: the discovery of gravitational waves, the disappearance of weak waves in space, and the timing of some of the worst events in… [+2922 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "See the crater left by a space junk impact on the moon - Digital Trends", "description": "NASA's Lunar Reconnaissance Orbiter snapped an image showing the crater created by a Chinese rocket booster which crashed into the moon earlier this year.", "url": "https://www.digitaltrends.com/space/moon-debris-impact-lro/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/06/booster_0805_m1407760984r.map_.str01.enlarge3x.1100crop1.jpg?p=1", "publishedAt": "2022-06-25T16:45:37Z", "content": "Earlier this year, a Chinese rocket booster crashed into the lunar surface in a rare example of a piece of human-made debris colliding with the moon. Now, the site of this crash has been imaged by NA… [+2506 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Mars spacecraft gets Windows 98 update in 2022 to boost performance! Yes, you read it right - HT Tech", "description": "Mars spacecraft from ESA is getting a Windows 98 update to boost its performance for improving its mission capabilities. Check details.", "url": "https://tech.hindustantimes.com/tech/news/mars-spacecraft-gets-windows-98-update-in-2022-to-boost-performance-yes-you-read-it-right-71656167870785.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/Mars_Express_1656168025957_1656168036725.jpg", "publishedAt": "2022-06-25T14:41:44Z", "content": "Yes, you read that right. A spacecraft orbiting around Mars is finally getting a Windows 98 update to boost its performance. Sounds weird, right? Many of you reading this might now even know about Wi… [+2612 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "IANS", "title": "NASA ready with Artemis 1 moon mission test launch - Gadgets Now", "description": "The US space agency has determined that its Space Launch System (SLS) megarocket is ready for the Artemis 1 flight test.The agency will now roll SLS and Orion back to the Vehicle Assembly Building (VAB) at Kennedy next week to prepare the rocket and spacecraf…", "url": "https://www.gadgetsnow.com/tech-news/nasa-ready-with-artemis-1-moon-mission-test-launch/articleshow/92459370.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-92459370,imgsize-173156,width-800/92459370.jpg", "publishedAt": "2022-06-25T13:41:00Z", "content": "The US space agency has determined that its Space Launch System (SLS) megarocket is ready for the Artemis 1 flight test.The agency will now roll SLS and Orion back to the Vehicle Assembly Building (V… [+1809 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Astronaut shows what happens when you wring wet cloth in space - WION", "description": "Now, if we do this on Earth, the water will come out of the wash cloth and drip to the ground. But in space, where there is no gravity, something strange happens", "url": "https://www.wionews.com/science/astronaut-shows-what-happens-when-you-wring-wet-cloth-in-space-491755", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274061-astronaut.jpg", "publishedAt": "2022-06-25T13:11:21Z", "content": "It's real fun to observe astronauts in space bouncing around in zero gravity. Though we theoretically know that space does not have gravity, actually seeing zero gravity in action is amusing nonethel… [+1171 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Hubble Telescope clicks crisp image of a sparkling galaxy - WION", "description": "Hubble has been sending us mesmerising images for years. Another image has joined the long list. The space telescope has clicked a crisp photo of a sparkling galaxy. NASA has shared the image on Instagram and other social media feeds", "url": "https://www.wionews.com/science/nasa-hubble-telescope-clicks-crisp-image-of-a-sparkling-galaxy-491728", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274032-nasa.jpg", "publishedAt": "2022-06-25T12:24:23Z", "content": "The night sky is a sparkle to start with. The countless stars are just there for us to unravel their mystery. But just sometimes, when we are in the mood for some dreamy stargazing, weather plays a s… [+1202 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists claim Jupiter became big after eating small planets - WION", "description": "A recent study has found out that there is a reason why Jupiter is dubbed the biggest planet in our solar system. Turns out it achieved this gigantic size (300 times bigger than Earth) by consuming small planets", "url": "https://www.wionews.com/science/scientists-claim-jupiter-became-big-after-eating-small-planets-491720", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274028-nasa.jpg", "publishedAt": "2022-06-25T12:02:03Z", "content": "There have been several space missions to study how Moon, Marth, Sun and our galaxy were formed, but seldom there are any that have unravelled the mysteries on the origin of the giant planet.\r\nA rece… [+1758 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Star burns brighter even after supernova explosion - WION", "description": "After a supernova, almost nothing of the star stuff remains behind. Therefore it is logical that brightness of the star decreases after supernova.", "url": "https://www.wionews.com/science/star-burns-brighter-even-after-supernova-explosion-491718", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274020-supernova.jpg", "publishedAt": "2022-06-25T12:02:03Z", "content": "Supernovas are some of the biggest explosions in the Universe. These supergiant blasts represent death of a star. Very small percentage of stars in the Universe sign off in this spectacular way.\r\nAft… [+1091 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "One Of The Largest Stars In Milky Way Galaxy Captured Dying By Astronomers - Indiatimes.com", "description": "Scientists have got their hands on one of the most detailed images of a dying star, that too of probably the largest one in our galaxy -- VY Canis Majoris, as per a report by The Independent.                        NASA/ESA/HubbleAlso read: Watch James Webb T…", "url": "https://www.indiatimes.com/technology/science-and-future/one-of-the-largest-stars-in-milky-way-galaxy-captured-dying-by-astronomers-573096.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/Facebook-Image-91_62b5c040a763e.jpg", "publishedAt": "2022-06-25T11:42:41Z", "content": "Scientists have got their hands on one of the most detailed images of a dying star, that too of probably the largest one in our galaxy -- VY Canis Majoris, as per a report by The Independent.\r\nNASA/E… [+2145 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Hubble Space Telescope images massive galaxy cluster Abell 1351 - News9 LIVE", "description": "The Wide Field Camera 3 and the Advanced Camera for Surveys were used to capture the image", "url": "https://www.news9live.com/science/hubble-space-telescope-images-massive-galaxy-cluster-abell-1351-178634", "urlToImage": "https://media.news9live.com/h-upload/2022/06/25/437949-hubbleabell1351potw2225acropped1.jpg", "publishedAt": "2022-06-25T11:24:57Z", "content": "The Hubble Space Telescope has captured an image of the Abell 1351 galaxy cluster, one of the largest such clusters known to exist. The image was captured using the Wide Field Camera 3 as well as the… [+1771 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "A Comet Twice The Size Of Mount Everest Will Fly Past Earth Next Month - Indiatimes.com", "description": "A massive comet -- nearly twice as large as the tallest mountain on the planet, Mount Everest -- is on its way towards Earth and the inner solar system, according to a report by BGR.                        Lev Savitskiy/PR3T3ND3RThe comet has been named C/201…", "url": "https://www.indiatimes.com/technology/science-and-future/a-comet-twice-the-size-of-mount-everest-will-fly-past-earth-next-month-573092.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/Facebook-Image-90_62b5b669b74e4.jpg", "publishedAt": "2022-06-25T11:18:43Z", "content": "A massive comet -- nearly twice as large as the tallest mountain on the planet, Mount Everest -- is on its way towards Earth and the inner solar system, according to a report by BGR.\r\nLev Savitskiy/P… [+1747 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "NASAs Mars Reconnaissance Orbiter to release one last rainbow map - News9 LIVE", "description": "The colourful maps reveal the minerals found in the surface of the Red Planet", "url": "https://www.news9live.com/science/nasas-mars-reconnaissance-orbiter-to-release-one-last-rainbow-map-178630", "urlToImage": "https://media.news9live.com/h-upload/2022/06/25/437954-image2022-06-25160524491cropped.jpg", "publishedAt": "2022-06-25T11:11:25Z", "content": "NASA's Mars Reconnaissance Orbiter (MRO) is set to release a rainbow coloured map of the Red Planet, over the next six months. The 5.6 gigapixel map will cover the 86 per cent of the planet, allowing… [+2494 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "South African robotic telescope to begin search for the afterglow of cosmic events – Physics World - physicsworld.com", "description": "The BOOTES6 optical telescope will measure the brightness of transient sources when it starts up in mid-July", "url": "https://physicsworld.com/a/south-african-robotic-telescope-to-begin-search-for-the-afterglow-of-cosmic-events/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/06/News-South-Africa-new-robotic-telescope.jpg", "publishedAt": "2022-06-25T10:11:41Z", "content": "Eye on the sky The BOOTES 6 telescope at the Boyden Observatory in Bloemfontein will search for transient events. (Courtesy: Emilio Jesus Carcia)\"\r\nwidth=\"635\"\r\nheight=\"423\"\r\n/&gt;\r\nEye on the sky Th… [+2539 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Electrospun Nanofibers in Beverage Filtration Applications - AZoNano", "description": "In this article, the role of electrospun nanofibers in beverage filtration applications is discussed in detail, along with fabrication methods and relevant examples from research.", "url": "https://www.azonano.com/article.aspx?ArticleID=6180", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6180_16558154071715207.jpg", "publishedAt": "2022-06-25T10:02:21Z", "content": "In this article, the role of electrospun nanofibers in beverage filtration applications is discussed in detail, along with fabrication methods and relevant examples from research. \r\nImage Credit: Amo… [+6801 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Vienna: \"Hot\" graphene reveals migration of carbon atoms - India Education Diary", "description": "The migration of carbon atoms on the surface of the nanomaterial graphene was recently measured for the first time. Although the atoms move too swiftly to be directly observed with an electron microscope, their effect on the stability of the material", "url": "https://indiaeducationdiary.in/university-of-vienna-hot-graphene-reveals-migration-of-carbon-atoms/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/vienna-vv.jpg", "publishedAt": "2022-06-25T09:43:05Z", "content": "The migration of carbon atoms on the surface of the nanomaterial graphene was recently measured for the first time. Although the atoms move too swiftly to be directly observed with an electron micros… [+3071 chars]"}, {"source": {"id": null, "name": "Thenewstack.io"}, "author": "Rachel Brooks", "title": "Battlefield Moon: What Space Exploration Means For Developers - thenewstack.io", "description": "Developers must meet the demands of technology to reach the stars. Meanwhile, if history is enough for us to speculate from, governments will continue to clash over resource management.", "url": "https://thenewstack.io/battlefield-moon-what-space-exploration-means-for-developers/", "urlToImage": "https://cdn.thenewstack.io/media/2022/06/f56cf6b9-scifi-3617337_640.jpg", "publishedAt": "2022-06-25T09:04:42Z", "content": "The Final Frontier has opened the door to technology prospectors. Engineers have advanced developments on earth that will have significant use in the heavens. As this happens, the moon comes into cen… [+12883 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Southampton: Stretching of the continents drove ancient global warming event, say scientists - India Education Diary", "description": "Scientists at the University of Southampton have discovered that stretching of the continents is likely to have caused one of the most extreme and abrupt episodes of global warming in Earth history.The researchers, working with colleagues at the Univ", "url": "https://indiaeducationdiary.in/university-of-southampton-stretching-of-the-continents-drove-ancient-global-warming-event-say-scientists/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/University-of-Southampton1.jpg", "publishedAt": "2022-06-25T08:20:17Z", "content": "Scientists at the University of Southampton have discovered that stretching of the continents is likely to have caused one of the most extreme and abrupt episodes of global warming in Earth history.\r… [+4270 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This Mars meteorite that fell to Earth may reveal big secrets about the birth of our planet - HT Tech", "description": "Studying the Mars meteorite, Chassigny, scientists have found some strange occurrences that can change the present theories around the birth of planet Earth.", "url": "https://tech.hindustantimes.com/tech/news/this-mars-meteorite-that-fell-to-earth-may-reveal-big-secrets-about-the-birth-of-our-planet-71656138959854.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/meteorite-6059746_1920_1651229787922_1656139068914.jpg", "publishedAt": "2022-06-25T06:39:45Z", "content": "A little space rock from Mars, which fell to Earth in 1815, can change what we thought we knew about the birth of our planet. Known as the Chassigny meteorite, it is a small chunk of rock which is be… [+2011 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "New technology helps reveal inner workings of human genome - Nanowerk", "description": "Scientists have developed a new method to assess on a large scale the three-dimensional structure of the human genome, or how the genome folds.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60946.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60946.jpg", "publishedAt": "2022-06-25T06:26:03Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "The #US Space Agency Has Determined That Its Space Launch System Megarocket is Ready for ... - Latest Tweet - LatestLY", "description": "The latest Tweet by IANS India states, 'The #US space agency has determined that its Space Launch System megarocket is ready for the #Artemis1 flight test. The agency will now roll SLS and Orion back to the Vehicle Assembly Building at Kennedy next week to pr…", "url": "https://www.latestly.com/socially/india/news/the-us-space-agency-has-determined-that-its-space-launch-system-megarocket-is-ready-for-latest-tweet-by-ians-india-3869920.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/TW-IANS-India-4-784x441.png", "publishedAt": "2022-06-25T05:51:53Z", "content": "The #US space agency has determined that its Space Launch System megarocket is ready for the #Artemis1 flight test.\r\nThe agency will now roll SLS and Orion back to the Vehicle Assembly Building at Ke… [+647 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Rare planetary conjunction: Five planets of solar system line up in `special` order - Zee News", "description": "Five major planets -- Mercury, Venus, Mars, Jupiter, and Saturn -- in our solar system are lined up in a row for rare planetary conjunction visible to the naked eye. In a clear sky, the planets can be seen shining before dawn.", "url": "https://zeenews.india.com/world/rare-planetary-conjunction-five-planets-of-solar-system-line-up-in-special-order-2477666.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/25/1057610-untitled-design-2022-06-25t111532.754.jpg", "publishedAt": "2022-06-25T05:45:57Z", "content": "New York: Five major planets -- Mercury, Venus, Mars, Jupiter, and Saturn -- in our solar system are lined up in a row for rare planetary conjunction visible to the naked eye. In a clear sky, the pla… [+1202 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Vineeth Venugopal", "title": "Guess what this? - Vineeth Venugopal - Medium", "description": "", "url": "https://medium.com/@vinven7/guess-what-this-2f90ba5610c4", "urlToImage": "https://miro.medium.com/max/401/1*6RPSAck9stjBXyLDeAoFwA.jpeg", "publishedAt": "2022-06-25T05:21:53Z", "content": "credit: Nature\r\nThis is an image of a rat embryos dorsal root ganglion, a group of sensory nerve cells that detect pain, among other things.\r\nThe shot won fourth place in the 2021 Nikon Small World P… [+216 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Suicide Attempt by Glass Shard Ingestion: A Case Report - Cureus", "description": "A 42-year-old man with schizophrenia and human immunodeficiency syndrome swallowed several glass shards in an attempted suicide. Two days later, he was admitted to the ER of the Florianópolis Hospital with a complaint of upper abdominal pain. The patient show…", "url": "https://www.cureus.com/articles/80035-suicide-attempt-by-glass-shard-ingestion-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/295735/article_river_1b5a98f0569911ec9da907c0f91ee110-Figure-1.png", "publishedAt": "2022-06-25T05:01:04Z", "content": "A 42-year-old man with schizophrenia and human immunodeficiency syndrome swallowed several glass shards in an attempted suicide. Two days later, he was admitted to the ER of the Florianópolis Hospita… [+8258 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/TechExplorist/", "title": "Understanding changes in Earth’s outer core with the help of seismic waves - Tech Explorist", "description": "The composition of the bulk, the outer core of the Earth, is not pure iron but has a density deficit of about 5–10%, indicating the existence of a", "url": "https://www.techexplorist.com/understanding-changes-earths-outer-core-help-seismic-waves/52094/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/globe-illustration-zhou.jpg", "publishedAt": "2022-06-25T04:28:32Z", "content": "The composition of the bulk, the outer core of the Earth, is not pure iron but has a density deficit of about 510%, indicating the existence of a considerable amount of light elements in the outer co… [+6681 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study: Elliptical Craters Shed Light on Age of Saturn's Moons - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A new study describes how unique populations of craters on two of Saturn's moons could help indicate the satellites' age and the conditions of their formation. Using data from NASA's Cassini mission, res…", "url": "https://www.latestly.com/agency-news/science-news-study-elliptical-craters-shed-light-on-age-of-saturns-moons-3869279.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/06/space-54999_128020220624172826-588x441.jpg", "publishedAt": "2022-06-25T00:04:24Z", "content": "Washington [US], June 25 (ANI): A new study describes how unique populations of craters on two of Saturn's moons could help indicate the satellites' age and the conditions of their formation. Using d… [+3713 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Microscopy technique enables 3D super-resolution nanometer-scale imaging - Science Daily", "description": "Over the last two decades, microscopy has seen unprecedented advances in speed and resolution. However, cellular structures are essentially three-dimensional, and conventional super-resolution techniques often lack the necessary resolution in all three direct…", "url": "https://www.sciencedaily.com/releases/2022/06/220624160656.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-06-24T20:43:29Z", "content": "Over the last two decades, microscopy has seen unprecedented advances in speed and resolution. However, cellular structures are essentially three-dimensional, and conventional super-resolution techni… [+2545 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Star gazers in New Zealand describe being “a little freaked out” by spirals of blue light in the night sky. - BollyInside", "description": "On Sunday night, weird, spiralling light patterns in the night sky mystified and amazed New Zealand astronomers. Alasdair Burns, a stargazing guide on", "url": "https://www.bollyinside.com/news/star-gazers-in-new-zealand-describe-being-a-little-freaked-out-by-spirals-of-blue-light-in-the-night-sky", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Star-gazers-in-New-Zealand-describe-being-a-little-freaked.jpeg", "publishedAt": "2022-06-24T20:08:30Z", "content": "On Sunday night, weird, spiralling light patterns in the night sky mystified and amazed New Zealand astronomers.\r\nAlasdair Burns, a stargazing guide on Stewart Island/Rakiura, received a text message… [+2385 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Space Junk Removal Test Mission Set to Take Place in 2024 - Galaxy Reporters", "description": "After an undertaking last month at catching a fake piece of garbage in orbit, Astroscale says “it’s ready to launch a ‘space junk servicer’ test in late 2024.” The Tokyo-based company is collaborating with broadband satellite provider OneWeb to undertake the …", "url": "https://galaxyreporters.com/space-junk-removal-test-mission-set-to-take-place-in-2024/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/Astroscale-to-launch-space-junk.webp", "publishedAt": "2022-06-24T18:15:27Z", "content": "After an undertaking last month at catching a fake piece of garbage in orbit, Astroscale says “it’s ready to launch a ‘space junk servicer’ test in late 2024.”\r\nThe Tokyo-based company is collaborati… [+1322 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Christopher Carbone", "title": "Stunning Jupiter storm photographs can be analyzed by citizens in new scientific project - Daily Mail", "description": "Citizens can now help scientists identify the composition of Jupiter's massive and eye-catching storms", "url": "https://www.dailymail.co.uk/sciencetech/article-10949863/Stunning-Jupiter-storm-photographs-analyzed-citizens-new-scientific-project.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/24/14/59479279-0-image-a-2_1656079051228.jpg", "publishedAt": "2022-06-24T18:15:19Z", "content": "Jupiter is famous for its massive, eye-catching storms. \r\nNow, citizens will be able to help scientists uncover the mysteries of the gigantic planet's storms.\r\nThe project is hosted on Zooniverse and… [+2101 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "NASA Draws Influence From Disney's Buzz Lightyear With Its Z-1 Spacesuit Concept - Galaxy Reporters", "description": "NASA’s Z-1 spacesuit model released a decade ago seems like the iconic space ranger’s extraterrestrial duds in the Toy Story franchise. While the project is no longer happening, contractors do have permission to its advancement history to develop their future…", "url": "https://galaxyreporters.com/nasa-draws-influence-from-disneys-buzz-lightyear-with-its-z-1-spacesuit-concept/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/03/Lightyear-New-Trailer.webp", "publishedAt": "2022-06-24T18:11:48Z", "content": "NASA’s Z-1 spacesuit model released a decade ago seems like the iconic space ranger’s extraterrestrial duds in the Toy Story franchise. While the project is no longer happening, contractors do have p… [+1211 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Scientists Studying NASA Data Think They'll Identified the Source of Charon's Red Cap - Galaxy Reporters", "description": "Southwest Research Institute scientists assembled data from NASA’s New Horizons mission with novel laboratory tests and exospheric modeling to disclose the likely configuration of the red cap on Pluto’s moon Charon and how it may have been created. This first…", "url": "https://galaxyreporters.com/scientists-studying-nasa-data-think-theyll-identified-the-source-of-charons-red-cap/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/Plutos-Moon-Charon.webp", "publishedAt": "2022-06-24T18:10:14Z", "content": "Southwest Research Institute scientists assembled data from NASA’s New Horizons mission with novel laboratory tests and exospheric modeling to disclose the likely configuration of the red cap on Plut… [+1575 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "New Research Proposes Electrolyte Transport May Be Possible in Water-Rich Exoplanets - Galaxy Reporters", "description": "The water bodies on water-rich exoplanets may be endowed with electrolytes containing salts such as sodium chloride, which indicates a modeling study published in Nature Communications. The research proposes electrolytes can be transferred from the rocky core…", "url": "https://galaxyreporters.com/new-research-proposes-electrolyte-transport-may-be-possible-in-water-rich-exoplanets/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_709173697-scaled.jpg", "publishedAt": "2022-06-24T18:07:21Z", "content": "The water bodies on water-rich exoplanets may be endowed with electrolytes containing salts such as sodium chloride, which indicates a modeling study published in Nature Communications. The research … [+1206 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Young Pulsar Burning Through the Milky Way at Over 1 Million Miles an Hour Detected By NASA's Chandra X-Ray Observatory - Galaxy Reporters", "description": "A young pulsar was burning on the Milky Way at more than a million miles an hour. This astronomical speed, proven by NASA’s Chandra X-ray Observatory, is one of the fastest of its kind ever. This fantastic result teaches astronomers more about how some big st…", "url": "https://galaxyreporters.com/young-pulsar-burning-through-the-milky-way-at-over-1-million-miles-an-hour-detected-by-nasas-chandra-x-ray-observatory/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_701221588-scaled.jpg", "publishedAt": "2022-06-24T17:56:37Z", "content": "A young pulsar was burning on the Milky Way at more than a million miles an hour. This astronomical speed, proven by NASA’s Chandra X-ray Observatory, is one of the fastest of its kind ever. This fan… [+2443 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "How Scientists Hope to Unravel the Milky Ways Evolution By Using Big-Data Astronomy - Galaxy Reporters", "description": "According to the European Space Agency (ESA), unraveling the evolution of the Milky Way is a complicated task; similar to mapping the human genome, ESA’s galaxy mapper, Gaia, takes up trillions of measurements of 2 billion of the brightest stars in the sky. I…", "url": "https://galaxyreporters.com/how-scientists-hope-to-unravel-the-milky-ways-evolution-by-using-big-data-astronomy/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_738535111-scaled.jpg", "publishedAt": "2022-06-24T17:54:44Z", "content": "According to the European Space Agency (ESA), unraveling the evolution of the Milky Way is a complicated task; similar to mapping the human genome, ESA’s galaxy mapper, Gaia, takes up trillions of me… [+1201 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Rosario Tejeda", "title": "NASA's Curiosity Probe Unearths Previous Evidence of Ancient Water - Balkan Travellers", "description": "Over the past ten years, the Curiosity probe has traveled across the terrain of Mars in search of evidence of it The past of the potentially habitable", "url": "https://www.balkantravellers.com/nasas-curiosity-probe-unearths-previous-evidence-of-ancient-water/", "urlToImage": null, "publishedAt": "2022-06-24T16:25:59Z", "content": "Over the past ten years, the Curiosity probe has traveled across the terrain of Mars in search of evidence of it The past of the potentially habitable planet. Recently, the car-sized robot moved thro… [+3120 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science@NASA", "title": "Making the invisible visible: The remarkable journey of a powerhouse space microscope - Phys.org", "description": "Colloids are mixtures of microscopic particles suspended in fluids—substances that are part solid, part liquid. Colloids are found in products including toothpaste, ketchup, paint and liquid hand soap, and are part of a field of study known as soft matter.", "url": "https://phys.org/news/2022-06-invisible-visible-remarkable-journey-powerhouse.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/making-the-invisible-v-3.jpg", "publishedAt": "2022-06-24T15:26:09Z", "content": "Colloids are mixtures of microscopic particles suspended in fluidssubstances that are part solid, part liquid. Colloids are found in products including toothpaste, ketchup, paint and liquid hand soap… [+4830 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "SNS", "title": "China aims to beat NASA, ESA in returning Mars samples to Earth: Report - The Statesman", "description": "Landing on Mars would take place around September 2029. Sampling techniques will include surface sampling, drilling and mobile intelligent sampling, potentially using a four-legged robot.", "url": "https://www.thestatesman.com/supplements/science_supplements/china-aims-beat-nasa-esa-returning-mars-samples-earth-report-1503084072.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/06/8639843af12ab4efcf6f9b178fdc8c12.jpg", "publishedAt": "2022-06-24T15:12:09Z", "content": "China’s Mars sample return mission aims to collect samples from the Red Planet and deliver them to Earth in 2031, or two years ahead of a NASA and ESA joint mission, said a media report.\r\nAccording t… [+1505 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kshitij Aggarwal", "title": "Newly discovered fast radio burst challenges what astronomers know - Space.com", "description": "What can astronomers learn from this fast radio burst?", "url": "https://www.space.com/fast-radio-burst-challenges-astronomers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pEBXF57G8WXMRtigSccp4G-1200-80.jpg", "publishedAt": "2022-06-24T15:00:48Z", "content": "This article was originally published at The Conversation (opens in new tab). The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nKshitij Aggarwal (opens in n… [+5781 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "For the Boeing Starliner flight to the space station, NASA chooses two astronaut test pilots - BollyInside", "description": "Two astronaut test pilots will go to the International Space Station on NASA’s Boeing Crew Flight Test (CFT) mission, where they will spend around two", "url": "https://www.bollyinside.com/news/for-the-boeing-starliner-flight-to-the-space-station-nasa-chooses-two-astronaut-test-pilots", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/For-the-Boeing-Starliner-flight-to-the-space-station-NASA.jpeg", "publishedAt": "2022-06-24T14:20:45Z", "content": "Two astronaut test pilots will go to the International Space Station on NASAs Boeing Crew Flight Test (CFT) mission, where they will spend around two weeks living and working in space.\r\nIn October 20… [+4586 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/andrew-tarantola", "title": "How NASA might protect tomorrow's astronauts from deep space radiation - Engadget", "description": "Putting people on the surface of Mars is going to expose them to a whole bunch of deadly space radiation.", "url": "https://www.engadget.com/how-nasa-might-protect-tomorrows-astronauts-from-deep-space-radiation-140018131.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-06/600a8c30-ecc1-11ec-bb7f-a97a8c5900a9", "publishedAt": "2022-06-24T14:02:10Z", "content": "There are a million and one ways to die in space\r\n, whether its from micrometeoroid impacts shredding your ship\r\n or solar flares frying its electronics\r\n, drowning in your own sweat during a spacewa… [+14018 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essential: One word a day- BepiColombo | UPSC Current Affairs News - The Indian Express", "description": "What is BepiColombo? Questions around key terms of science and technology are very common in UPSC-CSE especially when they are in news. Solve the MCQ given below after reading this article.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essential-one-word-a-day-bepicolombo-7989277/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-35-1.jpg", "publishedAt": "2022-06-24T14:01:28Z", "content": "Take a look at the essential concepts, terms, and phenomena from the static and current parts of the UPSC-CSE.Word: BepiColombo\r\nSubject: Science (space)\r\nWhy in news?\r\n The BepiColombo mission captu… [+1652 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Controlling non-classical mechanical states in a phononic waveguide architecture - Phys.org", "description": "Most quantum computing technologies rely on the ability to produce, manipulate and detect non-classical states of light. Non-classical states are quantum states that cannot directly be produced using conventional sources of light, such as lamps and lasers, an…", "url": "https://phys.org/news/2022-06-non-classical-mechanical-states-phononic-waveguide.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/controlling-non-classi.jpg", "publishedAt": "2022-06-24T13:30:01Z", "content": "Most quantum computing technologies rely on the ability to produce, manipulate and detect non-classical states of light. Non-classical states are quantum states that cannot directly be produced using… [+4814 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Robo-Fish And Plastic-Eating Bacteria: 6 New Ways To Reduce Plastic Waste In Oceans - Indiatimes.com", "description": "Plastic waste in the seas and oceans is one of the biggest threats to our planet that is sadly showing no signs of stopping.                        UnsplashHowever, researchers around the world are working in numerous ways to not just clear the plastic waste …", "url": "https://www.indiatimes.com/technology/science-and-future/robo-fish-and-plastic-eating-bacteria-6-new-ways-to-reduce-plastic-waste-in-oceans-573078.html", "urlToImage": "https://im.indiatimes.in/content/2022/May/Facebook-Image---2022-05-25T161250555_628e08f269bbf.jpg", "publishedAt": "2022-06-24T12:16:30Z", "content": "Plastic waste in the seas and oceans is one of the biggest threats to our planet that is sadly showing no signs of stopping.\r\nUnsplash\r\nHowever, researchers around the world are working in numerous w… [+4118 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "South Korea cancels plans to visit asteroid Apophis coming close to Earth - India Today", "description": "The mission was called off following a preliminary feasibility study conducted by the Ministry of Science and Technology terming the possibility of success to be uncertain.", "url": "https://www.indiatoday.in/science/story/south-korea-cancels-plans-to-visit-asteroid-apophis-coming-close-to-earth-1966352-2022-06-24", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Apophis-647x363.jpeg?LTkSlAuM8JPGETUxxqoeVM5v8k0Frfbf", "publishedAt": "2022-06-24T10:35:59Z", "content": "South Korea has for now called off its plan to visit Apophis, an asteroid that is expected to come close to Earth in 2029. The mission was likely canceled on the grounds of the agency's lack of techn… [+2536 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "Jupiter is hit; impact is equivalent to 154 atomic bombs - The Goa Spotlight", "description": "Jupiter is hit by rock and impact is equivalent to the explosion of 154 atomic bombs (Photo: Getty I", "url": "https://thegoaspotlight.com/2022/06/24/jupiter-is-hit-impact-is-equivalent-to-154-atomic-bombs/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/4AqrRMfe02dTAmzSYJS0Dg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://s.yimg.com/os/creatr-uploaded-images/2022-06/ab19d760-f330-11ec-acf7-c9c801f81cf5", "publishedAt": "2022-06-24T09:02:34Z", "content": "Jupiter is hit by rock and impact is equivalent to the explosion of 154 atomic bombs (Photo: Getty Images)\r\n<ul><li>The impact was so strong that observers on Earth were able to capture the event;\r\n<… [+2070 chars]"}]}