{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘Potentially hazardous’ asteroid, twice Burj Khalifa’s size, to fly past Earth on May 27 - The Indian Express", "description": "Asteroid Twice Size of Burj Khalifa to Fly Past Earth on May 27 : 1989 JA will be 40,24,182 kilometres away, the closest it gets to the planet for the next 172 years.", "url": "https://indianexpress.com/article/technology/science/potentially-hazardous-asteroid-twice-burj-khalifas-size-to-fly-past-earth-on-friday-7937003/", "urlToImage": "https://images.indianexpress.com/2022/05/asteroid-fb.jpg", "publishedAt": "2022-05-27T02:35:11Z", "content": "A ‘potentially hazardous’ asteroid, which is twice the size of the Burj Khalifa and four times the Empire State Building will zip past Earth on Friday, according to NASA’s Centre for Near Earth Objec… [+1394 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Man Regrets Missing Call from 'Space', Finds Support in Internet - News18", "description": "A person did something similar and tried avoiding a call from the US government. But little did the person know, it was a call from outer space and now, all there is left is regret.", "url": "https://www.news18.com/news/buzz/man-regrets-missing-call-from-space-finds-support-in-internet-5252125.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/missed-call-165356853216x9.png", "publishedAt": "2022-05-27T02:30:59Z", "content": "It is quite common for people to miss calls. While some miss calls by mistake, some do it purposely. People purposefully do it when they are not ready for a conversation or are averting something. A … [+1841 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NuSTAR – Studying the Universe in X-Ray (Live Public Talk) - NASA Jet Propulsion Laboratory", "description": "The Nuclear Spectroscopic Telescope Array, or NuSTAR, is the first space telescope capable of taking focused high-energy X-ray observations of the cosmos, pr...", "url": "https://www.youtube.com/watch?v=HkfD6mi-ego", "urlToImage": "https://i.ytimg.com/vi/HkfD6mi-ego/maxresdefault.jpg", "publishedAt": "2022-05-27T01:55:06Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA to Pick Next Generation Spacesuits for Moonwalking, Spacewalking - NASA", "description": "NASA will announce at 2 p.m. EDT (1 p.m. CDT) Wednesday, June 1, the company, or companies, selected to move forward in developing the next generation of spacesuits for Artemis missions at the Moon and the International Space Station during an event at the ag…", "url": "https://www.nasa.gov/press-release/nasa-to-pick-next-generation-spacesuits-for-moonwalking-spacewalking/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/spacesuit_release.png", "publishedAt": "2022-05-26T22:30:54Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "The Building Blocks for Supermassive Black Holes are Found in Dwarf Galaxies - Universe Today", "description": "New research into growing black holes in dwarf galaxies may explain how supermassive black holes inside bigger galaxies could have formed.", "url": "https://www.universetoday.com/156060/the-building-blocks-for-supermassive-black-holes-are-found-in-dwarf-galaxies/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/05/embed_blackhole.jpg", "publishedAt": "2022-05-26T20:11:30Z", "content": "We all know that a humongous black hole exists at the center of our galaxy. It’s called Sagittarius A* (Sgr A* for short) and it has the mass of 4 million suns. We’ve got to see a radio image of it a… [+6886 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jordan Mendoza, USA TODAY", "title": "Underwater eruption of 'Sharkcano' captured by NASA satellites - USA TODAY", "description": "The underwater volcano near the Solomon Islands is known for being the home of sharks and other marine life despite having acidic, warm water.", "url": "https://www.usatoday.com/story/news/world/2022/05/26/sharkcano-eruption-nasa-pacific-ocean/9943385002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/05/26/USAT/9acb8c33-8140-4631-b216-1286f907d4b4-kavachi_oli2_2022134.jpg?auto=webp&crop=719,405,x0,y36&format=pjpg&width=1200", "publishedAt": "2022-05-26T19:26:17Z", "content": "An underwater volcano in the Pacific Ocean has begun to erupt, NASA images show. Living there: Sharks that can withstand extreme temperatures. \r\nOff the coast of the Solomon Islands, about 950 northe… [+2149 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "No SpaceX Falcon Heavy payload is safe as NASA Psyche mission announces delay - Teslarati", "description": "SpaceX’s first dedicated Falcon Heavy launch for NASA has been hit by a seven-week delay after spacecraft engineers discovered a software anomaly during preflight processing. Named after the exotic metallic asteroid it’s designed to explore, NASA’s Psyche spa…", "url": "https://www.teslarati.com/spacex-falcon-heavy-nasa-psyche-launch-delay/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/05/Falcon-Heavy-Flight-3-STP-2-B1052-B1053-B1057-horizontal-integration-SpaceX-1-edit-2-c-1000x600-1.jpg", "publishedAt": "2022-05-26T18:33:45Z", "content": "SpaceX’s first dedicated Falcon Heavy launch for NASA has been hit by a seven-week delay after spacecraft engineers discovered a software anomaly during preflight processing.\r\nNamed after the exotic … [+3768 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Boeing capsule returns to Earth from space station - Times of India", "description": "Boeing's crew taxi returned to Earth from the International Space Station on Wednesday, completing a repeat test flight before NASA astronauts climb aboard. It was a quick trip back: The Starliner capsule parachuted into the New Mexico desert just four hours …", "url": "https://timesofindia.indiatimes.com/videos/international/boeing-capsule-returns-to-earth-from-space-station/videoshow/91820492.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-91820492,imgsize-22160.cms", "publishedAt": "2022-05-26T18:05:14Z", "content": "May 26, 2022, 11:35PM ISTSource: APBoeing's crew taxi returned to Earth from the International Space Station on Wednesday, completing a repeat test flight before NASA astronauts climb aboard. It was … [+441 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Magma beneath tectonic collision zones is wetter than previously thought - India Education Diary", "description": "A new study by geologists at the Woods Hole Oceanographic Institution (WHOI), MIT, and elsewhere has found that colliding continental plates may draw down more water than previously thought. The results could help to explain the explosiveness of some", "url": "https://indiaeducationdiary.in/magma-beneath-tectonic-collision-zones-is-wetter-than-previously-thought/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2022-05-26T17:25:51Z", "content": "A new study by geologists at the Woods Hole Oceanographic Institution (WHOI), MIT, and elsewhere has found that colliding continental plates may draw down more water than previously thought. The resu… [+5235 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA scientists to test James Webb Space Telescope on planet with lava-spewing clouds - Republic World", "description": "NASA says that the James Webb Space Telescope has locked its sight on two exoplanets- the lava-covered 55 Cancri e and the airless LHS 3844 b.", "url": "https://www.republicworld.com/science/space/nasa-scientists-to-test-james-webb-space-telescope-on-planet-with-lava-spewing-clouds-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/8iq84x8srprduuce_1653581765.jpeg", "publishedAt": "2022-05-26T16:33:00Z", "content": "Imagine a planet where a year lasts just 18 hours. This weird characteristic signifies that the planet is orbiting extremely close to its star and is tidally locked as a result. When a planet is tida… [+2931 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Laurence Malcom", "title": "The stars are heavier than previously thought - Persia Digest", "description": "light analysis 140,000 galaxies have revealed that their stars are heavier than previously thoughtwhich may change understanding of a wide range of astronomical phenomena. This is the conclusion of a study published in The Astrophysical Journal by a team of r…", "url": "https://persiadigest.com/the-stars-are-heavier-than-previously-thought/", "urlToImage": null, "publishedAt": "2022-05-26T16:02:36Z", "content": "light analysis 140,000 galaxies have revealed that their stars are heavier than previously thoughtwhich may change understanding of a wide range of astronomical phenomena.\r\nThis is the conclusion of … [+2523 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Dietmar Müller Et Al", "title": "How plate tectonics, mountains and deep-sea sediments have maintained Earth's 'Goldilocks' climate - Phys.org", "description": "For hundreds of millions of years, Earth's climate has warmed and cooled with natural fluctuations in the level of carbon dioxide (CO₂) in the atmosphere. Over the past century, humans have pushed CO₂ levels to their highest in 2 million years—overtaking natu…", "url": "https://phys.org/news/2022-05-plate-tectonics-mountains-deep-sea-sediments.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/how-plate-tectonics-mo.jpg", "publishedAt": "2022-05-26T15:18:06Z", "content": "For hundreds of millions of years, Earth's climate has warmed and cooled with natural fluctuations in the level of carbon dioxide (CO) in the atmosphere. Over the past century, humans have pushed CO … [+5842 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "Solar Orbiter's pictures of the sun are every bit as dramatic as you were hoping - Phys.org", "description": "On March 26, the ESA's Solar Orbiter made its closest approach to the sun so far. It ventured inside Mercury's orbit and was about one-third the distance from Earth to the sun. It was hot but worth it.", "url": "https://phys.org/news/2022-05-solar-orbiter-pictures-sun-bit.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/solar-orbiters-picture.jpg", "publishedAt": "2022-05-26T15:17:01Z", "content": "On March 26, the ESA's Solar Orbiter made its closest approach to the sun so far. It ventured inside Mercury's orbit and was about one-third the distance from Earth to the sun. It was hot but worth i… [+5001 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Edward Huchingson", "title": "What the Voyager space probes can teach humanity about immortality and legacy - Phys.org", "description": "Voyager 1 is the farthest human-made object from Earth. After sweeping by Jupiter, Saturn, Uranus and Neptune, it is now almost 15 billion miles (24 billion kilometers) from Earth in interstellar space. Both Voyager 1 and its twin, Voyager 2, carry little pie…", "url": "https://phys.org/news/2022-05-voyager-space-probes-humanity-immortality.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/what-the-voyager-space.jpg", "publishedAt": "2022-05-26T15:15:11Z", "content": "Voyager 1 is the farthest human-made object from Earth. After sweeping by Jupiter, Saturn, Uranus and Neptune, it is now almost 15 billion miles (24 billion kilometers) from Earth in interstellar spa… [+5819 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Deena Theresa", "title": "The first Australians ate the giant eggs of huge flightless birds, researchers confirm - Interesting Engineering", "description": "The first Australians ate the giant eggs of huge flightless birds, according to a research conducted by the universities of Cambridge and Turin.", "url": "https://interestingengineering.com/australians-ate-giant-eggs-birds", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/jvwvrRyXwx/sizes/egg-bird_md.jpeg", "publishedAt": "2022-05-26T15:13:09Z", "content": "Centuries ago, the Demon Ducks of Doom roamed the Earth.\r\nTrue to their name, they were giant flightless birds - two-meter tall, weighing 200 kg - with massive beaks. \r\nNow imagine sharing your neigh… [+4447 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "What are Venus, Pluto, Mars like? We found some clues - HT Tech", "description": "What is it like to be on the surface of Mars or Venus? Or even further afield, such as on Pluto, or Saturn’s moon Titan?", "url": "https://tech.hindustantimes.com/tech/news/what-are-venus-pluto-mars-like-we-found-some-clues-71653404835605.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/25/1600x900/SPACE-EXPLORATION-PLUTO-0_1653454571527_1653454588685.JPG", "publishedAt": "2022-05-26T14:44:46Z", "content": "What is it like to be on the surface of Mars or Venus? Or even further afield, such as on Pluto, or Saturns moon Titan?\r\nThis curiosity has driven advances in space exploration since Sputnik 1 was la… [+4934 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA achieves major milestone in its quest to land Artemis III astronauts on the Moon - Republic World", "description": "NASA recently achieved a major milestone with the Interim Cryogenic Propulsion Stage (ICPS) that would power the rocket carrying astronauts to the Moon.", "url": "https://www.republicworld.com/science/space/nasa-achieves-major-milestone-in-its-quest-to-land-artemis-iii-astronauts-on-the-moon-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/i19lhhsqlonhv8bm_1653573012.jpeg", "publishedAt": "2022-05-26T14:06:00Z", "content": "NASAs preparations for landing astronauts on the Moon are ramping up. The agency announced that it achieved a major milestone with the interim cryogenic propulsion stage (ICPS) that would power the r… [+2497 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Researchers reveal decline of diatoms due to ocean acidification - The Siasat Daily", "description": "Kiel: A new study shows an unexpected negative impact of Carbon Dioxide (CO2) on important plankton groups. The findings of the research were published in the journal 'Nature'. While calcifying organisms like oysters and corals have difficulty forming their s…", "url": "https://www.siasat.com/researchers-reveal-decline-of-diatoms-due-to-ocean-acidification-2335149/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/05/diatoms_MAY26.jpg", "publishedAt": "2022-05-26T13:47:00Z", "content": "Kiel: A new study shows an unexpected negative impact of Carbon Dioxide (CO2) on important plankton groups.\r\nThe findings of the research were published in the journal ‘Nature’.\r\nWhile calcifying org… [+5200 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Explainers", "title": "Quantum internet gets one step closer: What it is, what you need to know - Firstpost", "description": "Quantum internet is a computer network that can send quantum information between distant machines. Quantum teleportation can transfer information between locations without actually moving the physical matter that holds it", "url": "https://www.firstpost.com/world/quantum-internet-gets-one-step-closer-what-is-it-10723931.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/05/2022-05-26_185915.jpg", "publishedAt": "2022-05-26T13:29:48Z", "content": "Quantum internet is a computer network that can send quantum information between distant machines. Quantum teleportation can transfer information between locations without actually moving the physica… [+2880 chars]"}, {"source": {"id": null, "name": "Eletimes.com"}, "author": "https://www.facebook.com/eletimes", "title": "Impeccable Quantum Computing in Computers gets Real - ELE Times", "description": "In modern computers, errors during the processing and storage of information have become a rarity due to high-quality fabrication.", "url": "https://www.eletimes.com/impeccable-quantum-computing-in-computers-gets-real", "urlToImage": "https://www.eletimes.com/wp-content/uploads/2022/05/error-free-quantum-com-1-e1653567749368.jpg", "publishedAt": "2022-05-26T12:34:34Z", "content": "In modern computers, errors during the processing and storage of information have become a rarity due to high-quality fabrication. However, for critical applications, where even single errors can hav… [+3588 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Louise Lerner", "title": "Why did Mars dry out? New study points to unusual answers - Phys.org", "description": "Mars once ran red with rivers. The telltale tracks of past rivers, streams and lakes are visible today all over the planet. But about three billion years ago, they all dried up—and no one knows why.", "url": "https://phys.org/news/2022-05-mars-unusual.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/why-did-mars-dry-out-n.jpg", "publishedAt": "2022-05-26T12:19:22Z", "content": "Mars once ran red with rivers. The telltale tracks of past rivers, streams and lakes are visible today all over the planet. But about three billion years ago, they all dried upand no one knows why.\r\n… [+5618 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "SpaceX Falcon 9 lifts off with cremated remains of 47 people in memorial spaceflight - Republic World", "description": "SpaceX launched its Transporter-5 mission in its Falcon 9 rocket from the Cape Canaveral Space Force Station in Florida at 12:05 am (IST) on May 26.", "url": "https://www.republicworld.com/science/space/spacex-falcon-9-lifts-off-with-cremated-remains-of-47-people-in-memorial-spaceflight-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/v9ojmvxwgca2dfb3_1653561046.jpeg", "publishedAt": "2022-05-26T10:43:00Z", "content": "SpaceX launched its Transporter-5 mission in its Falcon 9 rocket from the Cape Canaveral Space Force Station in Florida at 12:05 am (IST) on May 26. Meant to be a ride-share mission, but it is also b… [+1860 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "'Dragon of Death': Giant Flying Dinosaur with 30-foot Wingspan Dug up in Argentina - News18", "description": "Present during the Cretaceous period, Pterosaurs were known for their very large skulls, hyper-elongated necks, and robust yet short bodies.", "url": "https://www.news18.com/news/buzz/dragon-of-death-giant-flying-dinosaur-with-30-foot-wingspan-dug-up-in-argentina-5250817.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/pterosaur-165356080716x9.png", "publishedAt": "2022-05-26T10:27:13Z", "content": "A team of researchers in Argentina has discovered the largest flying vertebrates ever found. The species found by the researchers is called Pterosaur, which used to roam around the skies approximatel… [+2189 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Florida: Sea turtle conservation gets boost from new DNA detection method - India Education Diary", "description": "DNA “fingerprints” left behind by sea turtles offer scientists a simple, powerful way of tracking the health and whereabouts of these endangered animals, a key step forward in their conservation.A study led by University of Florida researchers is the", "url": "https://indiaeducationdiary.in/university-of-florida-sea-turtle-conservation-gets-boost-from-new-dna-detection-method/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/University-of-Florida.png", "publishedAt": "2022-05-26T10:23:07Z", "content": "DNA fingerprints left behind by sea turtles offer scientists a simple, powerful way of tracking the health and whereabouts of these endangered animals, a key step forward in their conservation.\r\nA st… [+5962 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA InSight Mars Lander set to DIE, takes LAST selfie - HT Tech", "description": "The selfie captured by NASA InSight Mars lander on April 24 was declared as the last selfie ever clicked by it. This picture describes every bit of Mars lander’s hardships.", "url": "https://tech.hindustantimes.com/tech/news/nasa-insight-mars-lander-set-to-die-takes-last-selfie-71653557450369.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/26/1600x900/3bJuDPq6oyCE6A9jz4jS8W-1024-80.jpg_1653557530614_1653557544560.webp", "publishedAt": "2022-05-26T09:34:03Z", "content": "This selfie captured by the NASA InSight Mars Lander on April 24 has already become iconic after it was declared that it will be the last selfie ever taken by the lander. The picture encapsulates the… [+2129 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Tau Herculids meteor shower 2022: May 30-31 could see 1,000 shooting stars per hour - WION", "description": "The Tau Herculids, a potentially new — and brief — meteor shower that could appear before the end of the month. This meteor shower will either go down in history or wont appear at all, which is a fascinating duality for a science like astronomy, which is norm…", "url": "https://www.wionews.com/world/tau-herculids-meteor-shower-2022-may-30-31-could-see-1000-shooting-stars-per-hour-482286", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/01/04/122305-0001bm1vq.jpg", "publishedAt": "2022-05-26T09:05:14Z", "content": "While the term \"shooting star\" is a misnomer, seeing a bright object arc across the night sky is a sight to behold. We witness shooting stars when tiny particles collide with Earth's atmosphere and b… [+1639 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chinese Zhurong rover attacked by the notorious Mars DUST: Will it DIE? - HT Tech", "description": "Chinese Mars rover, the Zhurong, is expected to last until the end of 2022 after the rover is being covered by the destructive Martian dust.", "url": "https://tech.hindustantimes.com/tech/news/chinese-zhurong-rover-attacked-by-the-notorious-mars-dust-will-it-die-71653554729589.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/26/1600x900/FRANCE-SCIENCE-SPACE-2_1653554834130_1653554857679.jpg", "publishedAt": "2022-05-26T08:48:07Z", "content": "Mars is one of the most active planets in the solar system for the space research - be it NASA or CNSA, both have sent their robots there to dig out information and research facts about Mars. But the… [+1732 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Toward customizable timber, grown in a lab - India Education Diary", "description": "Each year, the world loses about 10 million hectares of forest — an area about the size of Iceland — because of deforestation. At that rate, some scientists predict the world’s forests could disappear in 100 to 200 years.In an effort to provide an en", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-toward-customizable-timber-grown-in-a-lab/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg", "publishedAt": "2022-05-26T08:46:40Z", "content": "Each year, the world loses about 10 million hectares of forest an area about the size of Iceland because of deforestation. At that rate, some scientists predict the worlds forests could disappear in … [+6222 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Russian, NASA Astronauts ‘Fight It Out’ At International Space Station; US Crew Says Wanted To ‘Poke Holes’ In His Logic - EurAsian Times", "description": "The repercussions of Russia’s invasion of Ukraine appear to be extending into space as well, with a NASA astronaut revealing rising tensions with Russian cosmonauts aboard the International Space Station (ISS). NASA astronaut Mark Vande Hei who returned to Ea…", "url": "https://eurasiantimes.com/russian-nasa-astronauts-fight-it-out-at-international-space-station/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/05/Russia-e1653551849487.jpg", "publishedAt": "2022-05-26T08:01:00Z", "content": "The repercussions of Russia’s invasion of Ukraine appear to be extending into space as well, with a NASA astronaut revealing rising tensions with Russian cosmonauts aboard the International Space Sta… [+4184 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "IANS", "title": "NASA's new solar sail project aims to see 'Sun as never before' - IBTimes India", "description": "US space agency NASA is planning to invest about $2 million over two years to develop a new solar sail concept that could propel a mission to the Sun.", "url": "https://www.ibtimes.co.in/nasas-new-solar-sail-project-aims-see-sun-never-before-848841", "urlToImage": "https://data1.ibtimes.co.in/en/full/772449/nasa.jpg", "publishedAt": "2022-05-26T07:49:00Z", "content": "Not 500, Mars travel is now possible in 45 days, experts claim\r\nUS space agency NASA is planning to invest about $2 million over two years to develop a new solar sail concept that could propel a miss… [+1866 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Is Earth's core rusting? Research hints at catastrophic changes under the surface - India Today", "description": "Earth's core made up of molten iron has been a key player in the evolution of the planet and researchers are looking at a common phenomenon feared by metalworkers the world over - rusting.", "url": "https://www.indiatoday.in/science/story/is-earth-s-core-rusting-research-hints-at-catastrophic-changes-under-the-surface-1954295-2022-05-26", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/Earth_w-647x363.jpeg?xyibaMwg9_jJLZku3GE8fuH.R_wqmAgb", "publishedAt": "2022-05-26T05:52:06Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Specific neural circuit in mice can help detect the dimmest shadows possible - News-Medical.Net", "description": "Mice use a specific neural pathway to detect shadows, and it can detect just about the dimmest shadows possible, according to new research from Aalto University and the University of Helsinki. The human eye has the same neural circuit, which researchers think…", "url": "https://www.news-medical.net/news/20220526/Specific-neural-circuit-in-mice-can-help-detect-the-dimmest-shadows-possible.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_714912_16535394215721114.png", "publishedAt": "2022-05-26T04:33:00Z", "content": "Mice use a specific neural pathway to detect shadows, and it can detect just about the dimmest shadows possible, according to new research from Aalto University and the University of Helsinki. The hu… [+4041 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Not just pollen in the spring: Wild grass releases a variety of particles into the air - EurekAlert", "description": "The aboveground portions of plants release particles such as fungal spores, pollen, bacteria, viruses, algae, and cell debris that can act as the nuclei of cloud droplets and ice crystals. A multi-institutional team of researchers has reported the first chara…", "url": "https://www.eurekalert.org/news-releases/953863", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/06753268-7408-4ca1-8925-7b509da40af2/Rendition/thumbnail/Content/Public", "publishedAt": "2022-05-26T02:00:45Z", "content": "The Science\r\nLiving organisms release particles such as fungal spores, pollen, bacteria, viruses, algae, and cell debris. In the atmosphere, these particles can act as the nuclei for cloud droplets a… [+3395 chars]"}, {"source": {"id": null, "name": "Hardwoodparoxysm.com"}, "author": "Shannon Bailey", "title": "\"I photographed the black hole, science brings peace\" - Il Golfo 24 - Hardwood Paroxysm", "description": "“Science bears a great responsibility and we have seen it above all in the years of the epidemic: it must know how to disseminate without belittling it.", "url": "https://hardwoodparoxysm.com/i-photographed-the-black-hole-science-brings-peace-il-golfo-24/", "urlToImage": "https://www.ilgolfo24.it/wp-content/uploads/2022/05/1.jpg", "publishedAt": "2022-05-26T01:59:35Z", "content": "Science bears a great responsibility and we have seen it above all in the years of the epidemic: it must know how to disseminate without belittling it. It does not admit that one suddenly becomes an … [+2375 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A nascent black hole was 'kicked' through space by gravitational waves - BollyInside", "description": "One particular black hole understands how to unwind. It was created when two others spiralled and collided. This new black hole received a “kick” during", "url": "https://www.bollyinside.com/news/a-nascent-black-hole-was-kicked-through-space-by-gravitational-waves", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/A-nascent-black-hole-was-kicked-through-space-by-gravitational.jpeg", "publishedAt": "2022-05-26T00:01:43Z", "content": "One particular black hole understands how to unwind.\r\nIt was created when two others spiralled and collided. This new black hole received a kick during its development, which threw it away from its b… [+4253 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX Falcon 9 rocket launch of the Transporter 5 mission - First Coast News", "description": "A rideshare flight to a sun-synchronous orbit with numerous small microsatellites and nanosatellites for commercial and government customers.", "url": "https://www.youtube.com/watch?v=iPmqSeSnR9g", "urlToImage": "https://i.ytimg.com/vi/iPmqSeSnR9g/hqdefault.jpg", "publishedAt": "2022-05-25T23:36:23Z", "content": null}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "President Biden says Japan will send an astronaut to the moon along with NASA - BollyInside", "description": "In an interagency attempt to increase lunar exploration, Japanese astronauts will fly on NASA Artemis missions to the moon, possibly even reaching the", "url": "https://www.bollyinside.com/news/president-biden-says-japan-will-send-an-astronaut-to-the-moon-along-with-nasa", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/05/President-Biden-says-Japan-will-send-an-astronaut-to-the.jpg", "publishedAt": "2022-05-25T22:37:33Z", "content": "In an interagency attempt to increase lunar exploration, Japanese astronauts will fly on NASA Artemis missions to the moon, possibly even reaching the surface.\r\nPresident Joe Biden and Japanese Prime… [+5980 chars]"}, {"source": {"id": null, "name": "Westsidepeoplemag.com"}, "author": "Izer", "title": "NASA Says 'Something Strange Is Happening' With The Universe - Westside People", "description": "at recent days press release The National Aeronautics and Space Administration has new images taken by the Hubble Space Telescope, and said that something", "url": "https://westsidepeoplemag.com/nasa-says-something-strange-is-happening-with-the-universe/", "urlToImage": null, "publishedAt": "2022-05-25T20:16:09Z", "content": "at recent days press release The National Aeronautics and Space Administration has new images taken by the Hubble Space Telescope, and said that something strange was going on in outer space. No, tha… [+1816 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "390 million-year-old fish-like creature revealed to be one of our earliest ancestors - Daily Mail", "description": "A new stud led by scientists at the RIKEN Cluster for Pioneering Research in Japan shows that the creature, called Palaeospondylus gunni, could be one of our earliest ancestors.", "url": "https://www.dailymail.co.uk/sciencetech/article-10853801/390-million-year-old-fish-like-creature-revealed-one-earliest-ancestors.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/25/16/58272693-0-image-a-115_1653491376389.jpg", "publishedAt": "2022-05-25T16:59:51Z", "content": "A 390 million-year-old, fish-like creature with four limbs is probably not who you'd expect to find in your family tree. \r\nBut a new study has shown that the creature, called Palaeospondylus gunni, c… [+6877 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Marcelo Gleiser", "title": "Can science explain the beginning of the Universe? - Big Think", "description": "Everyone loves a good origins story.", "url": "https://bigthink.com/13-8/origin-universe/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/05/13-8_Origin_Lead.jpg", "publishedAt": "2022-05-25T16:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Scott Alan Johnston", "title": "Spacesuits are leaking water and NASA is holding off any spacewalks until they can solve the problem - Phys.org", "description": "NASA's spacesuits are getting old. The extra-vehicular mobility units—EMUs for short—were designed and built for spacewalks outside NASA's space shuttles, which flew for the last time in 2011. Nowadays, the EMUs are an integral part of maintaining and upgradi…", "url": "https://phys.org/news/2022-05-spacesuits-leaking-nasa-spacewalks-problem.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/spacesuits-are-leaking.jpg", "publishedAt": "2022-05-25T14:32:11Z", "content": "NASA's spacesuits are getting old. The extra-vehicular mobility unitsEMUs for shortwere designed and built for spacewalks outside NASA's space shuttles, which flew for the last time in 2011. Nowadays… [+4557 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESO shares 'blood red' image of Super Flower Blood Moon spotted during Lunar eclipse - Republic World", "description": "The super flower blood Moon's photograph was taken by the European Southern Observatory's Paranal Observatory in Chile on the night of May 15.", "url": "https://www.republicworld.com/india-news/general-news/eso-shares-blood-red-image-of-super-flower-blood-moon-spotted-during-lunar-eclipse-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/09jixwhjhvuksk3w_1653483286.jpeg", "publishedAt": "2022-05-25T14:19:00Z", "content": "The European Southern Observatory (ESO), which unveiled the first image of the Milky Way galaxys supermassive black hole earlier this month, has shared a new picture. This time, it shared the image o… [+1809 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Astronomers Find Likely Source Of \"Wow Signal\" Received In 1977 - NDTV", "description": "Fifty years since a mysterious radio signal was received by a radio telescope on Earth, astronomers have claimed that they have found its source.", "url": "https://www.ndtv.com/world-news/astronomers-find-likely-source-of-wow-signal-received-in-1977-3008156", "urlToImage": "https://c.ndtvimg.com/2022-05/2ushhm5_wow-signal-240_625x300_25_May_22.jpg", "publishedAt": "2022-05-25T10:56:11Z", "content": "The signal was named \"Wow\" by astronomer Jerry Ehman.\r\nFifty years since a mysterious radio signal was received by a radio telescope on Earth, astronomers have claimed that they have found its source… [+1497 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Are Ancient Remains Of Mercury Hiding On Earth? Here's Why Scientists Think So - Indiatimes.com", "description": "Are shards of planet Mercury hiding on Earth? Scientists think that Mercury, the closest planet to our Sun was once a much larger cosmic body, until it collided with another space object and got ripped of its mantle. What remains of it now is the core, and sc…", "url": "https://www.indiatimes.com/technology/science-and-future/are-ancient-remains-of-mercury-hiding-on-earth-heres-why-scientists-think-so-570505.html", "urlToImage": "https://im.indiatimes.in/content/2022/May/FBImage15-copy_628e0ae75d70b.jpg", "publishedAt": "2022-05-25T10:53:32Z", "content": "Are shards of planet Mercury hiding on Earth? Scientists think that Mercury, the closest planet to our Sun was once a much larger cosmic body, until it collided with another space object and got ripp… [+3229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA announces early plan to send astronauts to Mars; Solicits feedback - The Indian Express", "description": "NASAis calling on industry, academia, international communities and other stakeholders to provide input on its early plan for a mission to Mars.", "url": "https://indianexpress.com/article/technology/science/nasa-announces-early-plan-to-send-astronauts-to-mars-solicits-feedback-7935625/", "urlToImage": "https://images.indianexpress.com/2022/05/NASA-Mars-mission-plan-released-featured-May-2022.jpg", "publishedAt": "2022-05-25T10:23:05Z", "content": "NASA has shared its early plans to send astronauts to Mars for 30 days. The space agency had released a draft set of high-level objectives earlier this year. These identify 50 points falling under fo… [+1843 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Orin Basu", "title": "Coral reefs may have key to cancer cure: Study - Zee News", "description": "For decades, scientists have been looking for that elusive cure to cancer. Though humankind has made several strides in this direction, cancer still accounts for nearly 10 million or one in six deaths globally every year, according to the World Health Organiz…", "url": "https://zeenews.india.com/world/coral-reefs-may-have-key-to-cancer-cure-study-2467129.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/05/25/1046459-corals.jpg", "publishedAt": "2022-05-25T10:07:23Z", "content": "New Delhi: For decades, scientists have been looking for that elusive cure to cancer. Though humankind has made several strides in this direction, cancer still accounts for nearly 10 million or one i… [+2668 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Blackhole bonanza: AstroSat witnesses birth for 500th time - Ahmedabad Mirror", "description": "By&nbsp;Manasi Saraf Joshi\n\nThe mystery around the black holes, cosmic enigmas where strong gravitational pull does not even allow light to escape, still attracts scientists globally. Indian scientists have made a breakthrough in the field, with their space t…", "url": "https://www.ahmedabadmirror.com/blackhole-bonanza-astrosat-witnesses-birth-for-500th-time/81833231.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1653417907977.jpg-org", "publishedAt": "2022-05-25T10:04:20Z", "content": "By Manasi Saraf Joshi\r\nThe mystery around the black holes, cosmic enigmas where strong gravitational pull does not even allow light to escape, still attracts scientists globally. Indian scientists ha… [+2072 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "A completely new type of magnetic wave discovered deep down - Tech Explorist", "description": "There are also other, more elusive, dynamic processes happening deep down below our feet.", "url": "https://www.techexplorist.com/completely-new-type-magnetic-wave-discovered-outermost-part-earth-outer-core/47557/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/05/Earths-outer-core.jpg", "publishedAt": "2022-05-25T08:22:46Z", "content": "Understanding the origin of the magnetic field, why it constantly fluctuates, how it interacts with the solar wind, and, indeed, why it is currently weakening- all these questions are topics of inter… [+2844 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Texas at Austin: Low-Cost Gel Film Can Pluck Drinking Water From Desert Air - India Education Diary", "description": "More than a third of the world’s population lives in drylands, areas that experience significant water shortages. Scientists and engineers at The University of Texas at Austin have developed a solution that could help people in these areas access cle", "url": "https://indiaeducationdiary.in/university-of-texas-at-austin-low-cost-gel-film-can-pluck-drinking-water-from-desert-air/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-4-1.jpg", "publishedAt": "2022-05-25T07:12:47Z", "content": "More than a third of the worlds population lives in drylands, areas that experience significant water shortages. Scientists and engineers at The University of Texas at Austin have developed a solutio… [+3339 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: One word a day- CAPSTONE - The Indian Express", "description": "What is CAPSTONE and its objectives? Space missions like CAPSTONE are popular topics for the UPSC CSE and the aspirants cannot afford to ignore them in both prelims and GS III mains.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-one-word-a-day-capstone-7934912/", "urlToImage": "https://images.indianexpress.com/2022/05/upsc-essential-1.jpg", "publishedAt": "2022-05-25T06:53:06Z", "content": "Word: CAPSTONE\r\nSubject: Science and Technology, Space\r\nWhat is CAPSTONE?\r\nThe Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE), is a CubeSat Mission … [+3178 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Hypnotic! Hubble captures massive star cluster in spiral Whirlpool Galaxy - India Today", "description": "Messier 51 or the M51 galaxy was discovered by Charles Messier in 1773 and is located 31 million light-years away from Earth.", "url": "https://www.indiatoday.in/science/story/hypnotic-hubble-captures-massive-star-cluster-in-spiral-whirlpool-galaxy-1953803-2022-05-25", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/M51-647x363.jpeg?vndtQgpGzGuhk76f4H9lBAazfiCslEaN", "publishedAt": "2022-05-25T05:37:56Z", "content": null}, {"source": {"id": null, "name": "Chemie.de"}, "author": null, "title": "Long-hypothesized 'next generation wonder material' created for first time - Chemie.de", "description": "For over a decade, scientists have attempted to synthesize a new form of carbon called graphyne with limited success. That endeavor is now at an end, though, thanks to new research from the Univer ...", "url": "https://www.chemeurope.com/en/news/1176225/long-hypothesized-next-generation-wonder-material-created-for-first-time.html", "urlToImage": "https://rs1.chemie.de/images//171913-75.jpg", "publishedAt": "2022-05-25T03:54:24Z", "content": "For over a decade, scientists have attempted to synthesize a new form of carbon called graphyne with limited success. That endeavor is now at an end, though, thanks to new research from the Universit… [+4170 chars]"}]}