{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "NASA Halts Psyche Mission To Unexplored Metal World | Science & Tech - Ommcom News", "description": "Washington:  NASA has cancelled its planned 2022 launch attempt of the Psyche asteroid mission -- the agency's first mission designed to study a metal-rich asteroid.The halt is \"due to the late delivery of the spacecraft's flight software and testing", "url": "https://ommcomnews.com/science-tech/nasa-halts-psyche-mission-to-unexplored-metal-world", "urlToImage": "https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/06/26185033/6933470b4d7b2c5d153db295a70c457f-e1656249664837.jpg", "publishedAt": "2022-06-26T13:21:14Z", "content": "Washington:  NASA has cancelled its planned 2022 launch attempt of the Psyche asteroid mission — the agency’s first mission designed to study a metal-rich asteroid.\r\nThe halt is “due to the late deli… [+2554 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Roscosmos executes an unscheduled maneuver to protect the International Space Station from Russian space debris - BollyInside", "description": "Since Putin’s order to invade Ukraine in late February 2022, tensions between Russia and the West have spilled over into their respective space programs.", "url": "https://www.bollyinside.com/news/roscosmos-executes-an-unscheduled-maneuver-to-protect-the-international-space-station-from-russian-space-debris", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Roscosmos-executes-an-unscheduled-maneuver-to-protect-the-International-Space.jpeg", "publishedAt": "2022-06-26T12:56:37Z", "content": "Since Putins order to invade Ukraine in late February 2022, tensions between Russia and the West have spilled over into their respective space programs.\r\nGiven that Russia was an active participant i… [+2736 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The world's largest liquid mirror telescope is now ready for stargazing. The four-meter International Liquid Mirror Telescope (ILMT), located in the - BollyInside", "description": "The world’s largest liquid mirror telescope is now ready for stargazing. The four-meter International Liquid Mirror Telescope (ILMT), located in the", "url": "https://www.bollyinside.com/news/the-worlds-largest-liquid-mirror-telescope-is-now-operational", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/The-worlds-largest-liquid-mirror-telescope-is-now-operational.jpeg", "publishedAt": "2022-06-26T12:08:26Z", "content": "The worlds largest liquid mirror telescope is now ready for stargazing.\r\nThe four-meter International Liquid Mirror Telescope (ILMT), located in the Devasthal Observatory in Indias Himalayas at an el… [+1912 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA targets launch of CAPSTONE mission to Moon on June 27; here's how to watch live - Republic World", "description": "NASA's CAPSTONE will liftoff for the Moon at 3:20 pm IST in Rocket Lab's Electron rocket from the company's launch site in New Zealand's Mahia.", "url": "https://www.republicworld.com/science/space/nasa-targets-launch-of-capstone-mission-to-moon-on-june-27-heres-how-to-watch-live-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/zzjqnmsqzq6o6ota_1656244811.jpeg", "publishedAt": "2022-06-26T12:02:00Z", "content": "NASA's Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE) mission is ready to launch to the Moon on June 27. The launch will be conducted using Rocket L… [+2014 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "These Physicists Have Created An Atom Laser That Can Stay On Forever - Wonderful Engineering", "description": "Advertisement According to quantum mechanics, particles like atoms are also considered to behave like waves and we can build ‘atom lasers’ containing coherent waves of matter. However, it is an issue to make these matter waves last, so that they may be used i…", "url": "https://wonderfulengineering.com/these-physicists-have-created-an-atom-laser-that-can-stay-on-forever/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/06/imgonline-com-ua-resize-Qcty2ttzumCflld.jpg", "publishedAt": "2022-06-26T11:09:05Z", "content": "According to quantum mechanics, particles like atoms are also considered to behave like waves and we can build atom lasers containing coherent waves of matter. However, it is an issue to make these m… [+2239 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mars Orbiter Running On Windows 98 Gets Software Upgrade 19 Years After Launch - NDTV", "description": "The Mars Express project, one of the most successful missions launched by the European Space Agency (ESA), is getting a software update.", "url": "https://www.ndtv.com/world-news/mars-spacecraft-is-getting-a-windows-98-upgrade-19-years-after-its-launch-3101853", "urlToImage": "https://c.ndtvimg.com/2022-06/vva3phoc_mars-orbiter_625x300_26_June_22.jpg", "publishedAt": "2022-06-26T10:57:56Z", "content": "Mars Express was the first mission by the European Space Agency to the Red Planet\r\nNew Delhi: The Mars Express project, one of the most successful missions launched by the European Space Agency (ESA)… [+2288 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Matt Williams, Universe Today", "title": "New molecules found on a nearby asteroid could reveal the origins of life - Inverse", "description": "Japanese researchers recently announced that Ryugu carries strains of no less than 20 different amino acids — the building blocks of life itself!", "url": "https://www.inverse.com/science/ryugu-asteroid-amino-acids-life-on-earth", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2022/6/24/64d22431-5a94-43c8-8fe5-e20f7d770cb9-shutterstock-2106080663.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-06-26T10:30:25Z", "content": "In 2014, \r\nthe Japan Aerospace Exploration Agency (JAXA) dispatched its Hayabusa2 spacecraft to rendezvous with 162173 Ryugu, a Near-Earth Asteroid (NEA) that periodically passes close to Earth. In 2… [+4661 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Kumar Natasha", "title": "Astronomers have shown the most detailed picture of the cosmic Crab Nebula (PHOTO) - The Times Hub", "description": "Nebula first observed by John Bevis in 1731. Located at a distance of about 6500 light years from Earth, the nebula has a diameter of", "url": "https://thetimeshub.in/astronomers-have-shown-the-most-detailed-picture-of-the-cosmic-crab-nebula-photo/4565/", "urlToImage": null, "publishedAt": "2022-06-26T09:19:10Z", "content": "Nebula first observed by John Bevis in 1731. Located at a distance of about 6500 light years from Earth, the nebula has a diameter of 11 light years.\r\nScientists have shown a detailed image of the Cr… [+1247 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Arfa Javaid", "title": "Anand Mahindra shares video of an astronaut experimenting with wet towel. Watch - Hindustan Times", "description": "The video shared by Anand Mahindra on Twitter was originally uploaded on YouTube by Canadian Space Agency a few years ago. It has gone viral again.  | Trending", "url": "https://www.hindustantimes.com/trending/anand-mahindra-shares-video-of-an-astronaut-experimenting-with-wet-towel-watch-101656230727270.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/26/1600x900/anand-mahindra-shared-video-of-an-astronaut-wringing-out-water-of-a-wet-towel-ISS_1656231655638_1656231669692.jpg", "publishedAt": "2022-06-26T08:45:21Z", "content": "Industrialist Anand Mahindra is an avid social media user, and he often tweets images or videos that create a buzz online. Just like this video that Anand Mahindra posted on Twitter that shows what h… [+2045 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Andrea Hargraves", "title": "Why does Pluto have a heart of ice? Knowledge has the answer - 26/6/2022 - brytfmonline.com", "description": "Scientists have already noticed that Pluto has a heart-shaped region made up of ice. But...", "url": "https://www.brytfmonline.com/why-does-pluto-have-a-heart-of-ice-knowledge-has-the-answer-26-6-2022/", "urlToImage": "https://www.brytfmonline.com/wp-content/uploads/2022/06/Why-does-Pluto-have-a-heart-of-ice-Knowledge-has.jpg", "publishedAt": "2022-06-26T08:20:33Z", "content": "Scientists have already noticed that Pluto has a heart-shaped region made up of ice. But how did this happen?\r\nAccording to research by the French scientists Tanguy Bertrand and François Forget, the … [+2562 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Massive Sunspot Twice the Size of Earth is Facing Our Home Planet - News18", "description": "The sunspot has reportedly doubled its diameter in 24 hours, and it is pointed right at our planet. The magnetic field surrounding sunspot AR3038 has the potential to blast M-class solar flares toward our planet.", "url": "https://www.news18.com/news/buzz/massive-sunspot-twice-the-size-of-earth-is-facing-our-home-planet-5439205.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/solar-flares-165615765116x9.png", "publishedAt": "2022-06-26T02:30:39Z", "content": "Celestial events are always interesting to witness and most recently we are witnessing a gigantic sunspot that has grown equal to twice the size of Earth. The sunspot has reportedly doubled its diame… [+1949 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Photosynthesis Can Produce Food in Complete Darkness - SciTechDaily", "description": "Artificial photosynthesis is being developed by researchers to help make food production more energy-efficient on Earth, and maybe one day on Mars. For millions of years, photosynthesis has evolved in plants to turn water, carbon dioxide, and the energy from …", "url": "https://scitechdaily.com/artificial-photosynthesis-can-produce-food-in-complete-darkness/", "urlToImage": "https://scitechdaily.com/images/Plants-Growing-in-Complete-Darkness.jpg", "publishedAt": "2022-06-26T01:21:33Z", "content": "ByUniversity of California RiversideJune 25, 2022\r\nPlants are growing in complete darkness in an acetate medium that replaces biological photosynthesis. Credit: Marcus Harland-Dunaway/UCR\r\nArtificial… [+5242 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Signs in Martian Soil Point to Habitable Conditions For Life Over a Long Period - ScienceAlert", "description": "Is there life on Mars? Has there ever been? It's one of the biggest questions we have about our planetary neighbor; now, research points to one particular part of the red planet that could have been able to harbor life several times across billions o", "url": "https://www.sciencealert.com/this-part-of-mars-may-have-been-repeatedly-habitable-over-the-planet-s-history", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/MarsWater_1024.jpg", "publishedAt": "2022-06-26T01:04:54Z", "content": "Is there life on Mars? Has there ever been? It's one of the biggest questions we have about our planetary neighbor; now, research points to one particular part of the red planet that could have been … [+3014 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "A space traveler offers advice to aspiring astronauts - BollyInside", "description": "More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an", "url": "https://www.bollyinside.com/news/a-space-traveler-offers-advice-to-aspiring-astronauts", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/A-space-traveler-offers-advice-to-aspiring-astronauts.jpeg", "publishedAt": "2022-06-26T00:08:37Z", "content": "More crewed lunar missions are just a few years away, and the first human expeditions to Mars are on the horizon, making this an exciting time to be an astronaut.\r\nFor most people, working in space m… [+2485 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Origins of Our Blood May Not Be What We Thought - SciTechDaily", "description": "Groundbreaking New Research Upends Understanding of How Blood Is Formed ‘Barcoding’ studies discovered two independent sources for blood cells in mice. If confirmed in humans, our understanding of blood cancers, bone marrow transplants, and the aging immune s…", "url": "https://scitechdaily.com/the-origins-of-our-blood-may-not-be-what-we-thought/", "urlToImage": "https://scitechdaily.com/images/Birth-of-Blood-Forming-Cells.jpg", "publishedAt": "2022-06-25T22:12:13Z", "content": "Clusters of the earliest hematopoietic cells being born in the walls of the umbilical artery of a mouse embryo. The cells colored in red represent embryonic multipotent progenitor cells (eMPPs). Cred… [+5311 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Despite its draining power, NASA's InSight Mars lander is determined to squeeze as much science as it can until the very last moment - Universe Today", "description": "Its solar panels are caked with dust and the batteries are running out of juice, but NASA’s InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very last beep. To conserve energy, InSight was projected to shut…", "url": "https://www.universetoday.com/156454/despite-its-draining-power-nasas-insight-mars-lander-is-determined-to-squeeze-as-much-science-as-it-can-until-the-very-last-moment/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/06/FEATURED-IMAGE-7.jpg", "publishedAt": "2022-06-25T21:57:07Z", "content": "Its solar panels are caked with dust and the batteries are running out of juice, but NASAs InSight Mars lander continues to soldier forth collecting more science about the Red Planet until its very l… [+3906 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Strange signals from space are captured by the world’s largest radio telescope - BollyInside", "description": "The largest radio telescope dish in the world has apparently detected odd radio signals coming from space, although the specifics of the reports are", "url": "https://www.bollyinside.com/news/strange-signals-from-space-are-captured-by-the-worlds-largest-radio-telescope", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Strange-signals-from-space-are-captured-by-the-worlds-largest.jpeg", "publishedAt": "2022-06-25T20:32:36Z", "content": "The largest radio telescope dish in the world has apparently detected odd radio signals coming from space, although the specifics of the reports are unclear.\r\nFAST, whose name translates to heavens e… [+1122 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Lonnie Lee Hood", "title": "Scientists Say the Sun Is Acting Up and Causing Satellites to Fall Back to Earth - Futurism", "description": "ESA scientists had to raise the Swarm constellation satellites, which measure Earth's magnetic field, because they were sinking in chaotic space weather.", "url": "https://futurism.com/the-byte/sun-satellites-earth-fall-space", "urlToImage": "https://wp-assets.futurism.com/2022/06/sun-satellites-earth-fall-space.png", "publishedAt": "2022-06-25T20:11:13Z", "content": "Space weather is weird.\r\nDown, Down Down\r\nMost folks probably don't think of satellites as capable of sinking, but according to the European Space Agency they can and do.\r\nSpace news site Space.com r… [+1364 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Brian Koberlein, Universe Today", "title": "Astronomers Have Identified The Most Powerful Pulsar Yet in a Distant Galaxy - ScienceAlert", "description": "Neutron stars are dense remnants of large stars. They are the collapsed cores of stars formed during a supernova explosion.", "url": "https://www.sciencealert.com/astronomers-have-identified-the-most-powerful-pulsar-yet-in-a-distant-galaxy", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/IllustrationOfPulsarWindNebula_1024.jpg", "publishedAt": "2022-06-25T20:10:21Z", "content": "Neutron stars are dense remnants of large stars. They are the collapsed cores of stars formed during a supernova explosion.\r\nWhile we know generally how they form, we are still learning how they evol… [+2723 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The Andromeda Galaxy shows the wounds of a disastrous collision - BollyInside", "description": "Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic", "url": "https://www.bollyinside.com/news/the-andromeda-galaxy-shows-the-wounds-of-a-disastrous-collision", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/The-Andromeda-Galaxy-shows-the-wounds-of-a-disastrous-collision.jpeg", "publishedAt": "2022-06-25T19:44:18Z", "content": "Astronomers have studied the makeup and velocity of more than 500 stars in Andromeda, our nearest galactic neighbour, to track its turbulent and tragic evolution.\r\nAndromeda, located 2.5 million ligh… [+1461 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Climate change: a ‘space bubble’ shield can block solar radiation - BollyInside", "description": "MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the sun’s rays, dubbed ‘Space", "url": "https://www.bollyinside.com/news/climate-change-a-space-bubble-shield-can-block-solar-radiation", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Climate-change-a-space-bubble-shield-can-block-solar-radiation.jpeg", "publishedAt": "2022-06-25T19:32:44Z", "content": "MIT scientists are investigating the idea of floating frozen bubbles comprised of a thin film above Earth to reflect the suns rays, dubbed Space Bubbles.\r\nThis is a variation on the common geoenginee… [+3673 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Tetraneutron – An Exotic State of Matter discovered - Tech Explorist", "description": "It could lead to a better understanding of how the universe is put together.", "url": "https://www.techexplorist.com/tetraneutron-exotic-state-of-matter-discovered/52105/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/Andrey-Shirokov.jpg", "publishedAt": "2022-06-25T19:31:06Z", "content": "A long-standing question in nuclear physics is whether chargeless nuclear systems can exist. Only neutron stars represent near-pure neutron systems, where neutrons are squeezed together by the gravit… [+6222 chars]"}, {"source": {"id": null, "name": "Newsazi.com"}, "author": "Eli Pacheco", "title": "How Astronomers Are Investigating This Nebula Where Stars Are Being Born - News Azi", "description": "Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses under its own gravity and gets hot, b", "url": "https://newsazi.com/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/", "urlToImage": "https://www.slashgear.com/img/gallery/how-astronomers-are-investigating-this-nebula-where-stars-are-being-born/l-intro-1656091252.jpg", "publishedAt": "2022-06-25T19:12:26Z", "content": "Stars are born when clouds of dust and gas form into clumps, and these clumps attract more material because of their gravity. Eventually, when enough material has fused together, the knot collapses u… [+1081 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "See the crater left by a space junk impact on the moon - Digital Trends", "description": "NASA's Lunar Reconnaissance Orbiter snapped an image showing the crater created by a Chinese rocket booster which crashed into the moon earlier this year.", "url": "https://www.digitaltrends.com/space/moon-debris-impact-lro/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/06/booster_0805_m1407760984r.map_.str01.enlarge3x.1100crop1.jpg?p=1", "publishedAt": "2022-06-25T16:45:37Z", "content": "Earlier this year, a Chinese rocket booster crashed into the lunar surface in a rare example of a piece of human-made debris colliding with the moon. Now, the site of this crash has been imaged by NA… [+2506 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Doris Elín Urrutia", "title": "NASA’s Voyager engineers are devising clever ways to preserve our farthest mission - Inverse", "description": "Voyager will soon power down the heat to some instruments to buy the craft a bit more time as its nuclear battery powers dwindle.", "url": "https://www.inverse.com/science/voyager-update", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/6/24/99b6f4d0-bd4d-45bb-9d69-3c8fef965cf5-getty-164430708.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-06-25T13:30:25Z", "content": "Despite recent headlines,\r\n NASAs venerable Voyager craft isnt shutting down quite yet but in two months, the team that manages the iconic mission will make decisions about what to do with dwindling … [+4410 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Don't miss Venus meet the moon before dawn on Sunday in gorgeous photo opportunity - Space.com", "description": "The spectacle will be visible to the naked eye or with a pair of binoculars.", "url": "https://www.space.com/venus-moon-approach-night-sky-june-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iVWtzSmMDhBBeVvzSevfoF-1200-80.jpg", "publishedAt": "2022-06-25T13:23:22Z", "content": "Early risers will be rewarded with an exquisite photo opportunity Sunday (June 26) morning when the slim crescent moon shines close to Venus. \r\nSet your alarm and get your camera ready as a charming … [+2161 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists claim Jupiter became big after eating small planets - WION", "description": "A recent study has found out that there is a reason why Jupiter is dubbed the biggest planet in our solar system. Turns out it achieved this gigantic size (300 times bigger than Earth) by consuming small planets", "url": "https://www.wionews.com/science/scientists-claim-jupiter-became-big-after-eating-small-planets-491720", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274028-nasa.jpg", "publishedAt": "2022-06-25T12:02:03Z", "content": "There have been several space missions to study how Moon, Marth, Sun and our galaxy were formed, but seldom there are any that have unravelled the mysteries on the origin of the giant planet.\r\nA rece… [+1758 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Star burns brighter even after supernova explosion - WION", "description": "After a supernova, almost nothing of the star stuff remains behind. Therefore it is logical that brightness of the star decreases after supernova.", "url": "https://www.wionews.com/science/star-burns-brighter-even-after-supernova-explosion-491718", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/25/274020-supernova.jpg", "publishedAt": "2022-06-25T12:01:17Z", "content": "Supernovas are some of the biggest explosions in the Universe. These supergiant blasts represent death of a star. Very small percentage of stars in the Universe sign off in this spectacular way.\r\nAft… [+1226 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Extreme microbes in salty Arctic water could aid search for life on Mars - Space.com", "description": "This harsh environment is one of Earth's closest analogues to Mars.", "url": "https://www.space.com/mars-life-blueprint-arctic-extreme-microbes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vkwHjGn5nfKop329N7BQu9-1200-80.jpg", "publishedAt": "2022-06-25T11:51:36Z", "content": "Never-before-seen microbes living deep beneath the permafrost at one of the coldest and saltiest water springs on Earth could provide a blueprint for life on Mars.\r\nAt Lost Hammer Spring, which lies … [+3859 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "One Of The Largest Stars In Milky Way Galaxy Captured Dying By Astronomers - Indiatimes.com", "description": "Scientists have got their hands on one of the most detailed images of a dying star, that too of probably the largest one in our galaxy -- VY Canis Majoris, as per a report by The Independent.                        NASA/ESA/HubbleAlso read: Watch James Webb T…", "url": "https://www.indiatimes.com/technology/science-and-future/one-of-the-largest-stars-in-milky-way-galaxy-captured-dying-by-astronomers-573096.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/Facebook-Image-91_62b5c040a763e.jpg", "publishedAt": "2022-06-25T11:42:41Z", "content": "Scientists have got their hands on one of the most detailed images of a dying star, that too of probably the largest one in our galaxy -- VY Canis Majoris, as per a report by The Independent.\r\nNASA/E… [+2145 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "LightSail 2 marks 3rd anniversary as end of mission approaches - Space.com", "description": "The mission, far beyond its design lifetime, may fall into the atmosphere in a few months.", "url": "https://www.space.com/lightsail-2-third-anniversary-end-approaching", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kfZZ5xB8djNDqL3rr7jShS-1200-80.jpg", "publishedAt": "2022-06-25T11:31:14Z", "content": "A solar-sailing mission is now marking three years of spaceflight, but is unlikely to celebrate a fourth anniversary.\r\nThe Planetary Society's LightSail 2 is a crowdfunded solar sail that launched Ju… [+3161 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Hubble Space Telescope images massive galaxy cluster Abell 1351 - News9 LIVE", "description": "The Wide Field Camera 3 and the Advanced Camera for Surveys were used to capture the image", "url": "https://www.news9live.com/science/hubble-space-telescope-images-massive-galaxy-cluster-abell-1351-178634", "urlToImage": "https://media.news9live.com/h-upload/2022/06/25/437949-hubbleabell1351potw2225acropped1.jpg", "publishedAt": "2022-06-25T11:24:57Z", "content": "The Hubble Space Telescope has captured an image of the Abell 1351 galaxy cluster, one of the largest such clusters known to exist. The image was captured using the Wide Field Camera 3 as well as the… [+1771 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "A Comet Twice The Size Of Mount Everest Will Fly Past Earth Next Month - Indiatimes.com", "description": "A massive comet -- nearly twice as large as the tallest mountain on the planet, Mount Everest -- is on its way towards Earth and the inner solar system, according to a report by BGR.                        Lev Savitskiy/PR3T3ND3RThe comet has been named C/201…", "url": "https://www.indiatimes.com/technology/science-and-future/a-comet-twice-the-size-of-mount-everest-will-fly-past-earth-next-month-573092.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/Facebook-Image-90_62b5b669b74e4.jpg", "publishedAt": "2022-06-25T11:18:43Z", "content": "A massive comet -- nearly twice as large as the tallest mountain on the planet, Mount Everest -- is on its way towards Earth and the inner solar system, according to a report by BGR.\r\nLev Savitskiy/P… [+1747 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "NASAs Mars Reconnaissance Orbiter to release one last rainbow map - News9 LIVE", "description": "The colourful maps reveal the minerals found in the surface of the Red Planet", "url": "https://www.news9live.com/science/nasas-mars-reconnaissance-orbiter-to-release-one-last-rainbow-map-178630", "urlToImage": "https://media.news9live.com/h-upload/2022/06/25/437954-image2022-06-25160524491cropped.jpg", "publishedAt": "2022-06-25T11:11:25Z", "content": "NASA's Mars Reconnaissance Orbiter (MRO) is set to release a rainbow coloured map of the Red Planet, over the next six months. The 5.6 gigapixel map will cover the 86 per cent of the planet, allowing… [+2494 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "South African robotic telescope to begin search for the afterglow of cosmic events – Physics World - physicsworld.com", "description": "The BOOTES6 optical telescope will measure the brightness of transient sources when it starts up in mid-July", "url": "https://physicsworld.com/a/south-african-robotic-telescope-to-begin-search-for-the-afterglow-of-cosmic-events/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/06/News-South-Africa-new-robotic-telescope.jpg", "publishedAt": "2022-06-25T10:11:41Z", "content": "Eye on the sky The BOOTES 6 telescope at the Boyden Observatory in Bloemfontein will search for transient events. (Courtesy: Emilio Jesus Carcia)\"\r\nwidth=\"635\"\r\nheight=\"423\"\r\n/&gt;\r\nEye on the sky Th… [+2539 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Electrospun Nanofibers in Beverage Filtration Applications - AZoNano", "description": "In this article, the role of electrospun nanofibers in beverage filtration applications is discussed in detail, along with fabrication methods and relevant examples from research.", "url": "https://www.azonano.com/article.aspx?ArticleID=6180", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6180_16558154071715207.jpg", "publishedAt": "2022-06-25T10:02:21Z", "content": "In this article, the role of electrospun nanofibers in beverage filtration applications is discussed in detail, along with fabrication methods and relevant examples from research. \r\nImage Credit: Amo… [+6801 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Vienna: \"Hot\" graphene reveals migration of carbon atoms - India Education Diary", "description": "The migration of carbon atoms on the surface of the nanomaterial graphene was recently measured for the first time. Although the atoms move too swiftly to be directly observed with an electron microscope, their effect on the stability of the material", "url": "https://indiaeducationdiary.in/university-of-vienna-hot-graphene-reveals-migration-of-carbon-atoms/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/vienna-vv.jpg", "publishedAt": "2022-06-25T09:43:05Z", "content": "The migration of carbon atoms on the surface of the nanomaterial graphene was recently measured for the first time. Although the atoms move too swiftly to be directly observed with an electron micros… [+3071 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "Yes, there are 100 million rogue black holes wandering our galaxy - Mashable", "description": "The Milky Way is teeming with black holes.", "url": "https://mashable.com/article/black-holes-rogue-discovery-space", "urlToImage": "https://helios-i.mashable.com/imagery/articles/03TbKWtkYZTnFQQ30BbI8nd/hero-image.fill.size_1200x675.v1655990477.png", "publishedAt": "2022-06-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Thenewstack.io"}, "author": "Rachel Brooks", "title": "Battlefield Moon: What Space Exploration Means For Developers - thenewstack.io", "description": "Developers must meet the demands of technology to reach the stars. Meanwhile, if history is enough for us to speculate from, governments will continue to clash over resource management.", "url": "https://thenewstack.io/battlefield-moon-what-space-exploration-means-for-developers/", "urlToImage": "https://cdn.thenewstack.io/media/2022/06/f56cf6b9-scifi-3617337_640.jpg", "publishedAt": "2022-06-25T09:04:42Z", "content": "The Final Frontier has opened the door to technology prospectors. Engineers have advanced developments on earth that will have significant use in the heavens. As this happens, the moon comes into cen… [+12883 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Chris Skeldon", "title": "A mysterious spiral object has been found swirling in the Milky Way - brytfmonline.com", "description": "Shaw Illustration of a mysterious spiral object Astronomers peered into the center of the Milky...", "url": "https://www.brytfmonline.com/a-mysterious-spiral-object-has-been-found-swirling-in-the-milky-way/", "urlToImage": "https://www.brytfmonline.com/wp-content/uploads/2022/06/A-mysterious-spiral-object-has-been-found-swirling-in-the.png", "publishedAt": "2022-06-25T08:35:08Z", "content": "Shaw\r\nIllustration of a mysterious spiral object\r\nAstronomers peered into the center of the Milky Way and discovered what appears to be a miniature spiral galaxy orbiting a star.\r\nThe star – which li… [+2268 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Southampton: Stretching of the continents drove ancient global warming event, say scientists - India Education Diary", "description": "Scientists at the University of Southampton have discovered that stretching of the continents is likely to have caused one of the most extreme and abrupt episodes of global warming in Earth history.The researchers, working with colleagues at the Univ", "url": "https://indiaeducationdiary.in/university-of-southampton-stretching-of-the-continents-drove-ancient-global-warming-event-say-scientists/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/University-of-Southampton1.jpg", "publishedAt": "2022-06-25T08:20:17Z", "content": "Scientists at the University of Southampton have discovered that stretching of the continents is likely to have caused one of the most extreme and abrupt episodes of global warming in Earth history.\r… [+4270 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronaut Crew Studies Aging in Space, Harvests Edible Plants Before Cygnus Reboost - SciTechDaily", "description": "Human research and space botany were the main research activities aboard the International Space Station yesterday, with a goal of helping NASA and its international partners keep astronauts healthy on long-term missions. The seven Expedition 67 crew members …", "url": "https://scitechdaily.com/astronaut-crew-studies-aging-in-space-harvests-edible-plants-before-cygnus-reboost/", "urlToImage": "https://scitechdaily.com/images/Cygnus-Space-Freighter-From-Northrop-Grumman-scaled.jpg", "publishedAt": "2022-06-25T08:02:22Z", "content": "ByNASAJune 25, 2022\r\nThe Cygnus space freighter from Northrop Grumman, with its prominent cymbal-shaped solar arrays, is pictured attached to the International Space Stations Unity module as the orbi… [+3733 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This Mars meteorite that fell to Earth may reveal big secrets about the birth of our planet - HT Tech", "description": "Studying the Mars meteorite, Chassigny, scientists have found some strange occurrences that can change the present theories around the birth of planet Earth.", "url": "https://tech.hindustantimes.com/tech/news/this-mars-meteorite-that-fell-to-earth-may-reveal-big-secrets-about-the-birth-of-our-planet-71656138959854.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/25/1600x900/meteorite-6059746_1920_1651229787922_1656139068914.jpg", "publishedAt": "2022-06-25T06:39:45Z", "content": "A little space rock from Mars, which fell to Earth in 1815, can change what we thought we knew about the birth of our planet. Known as the Chassigny meteorite, it is a small chunk of rock which is be… [+2011 chars]"}, {"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "NASA Is Actually Afraid SpaceX Will Infect The Earth With Dangerous Pathogens From Mars - Wonderful Engineering", "description": "Advertisement Space scientists are making efforts to gather insights regarding the exploration of Mars. Countries like China and the U.S. are taking a keen interest in Mars exploration programs as they aim to reserve the rocky samples obtained from Mars in th…", "url": "https://wonderfulengineering.com/nasa-is-actually-afraid-spacex-will-infect-the-earth-with-dangerous-pathogens-from-mars/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/06/ezgif-5-7f18942e03.jpg", "publishedAt": "2022-06-25T06:30:06Z", "content": "Space scientists are making efforts to gather insights regarding the exploration of Mars. Countries like China and the U.S. are taking a keen interest in Mars exploration programs as they aim to rese… [+2295 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "New technology helps reveal inner workings of human genome - Nanowerk", "description": "Scientists have developed a new method to assess on a large scale the three-dimensional structure of the human genome, or how the genome folds.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60946.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60946.jpg", "publishedAt": "2022-06-25T06:26:03Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "The #US Space Agency Has Determined That Its Space Launch System Megarocket is Ready for ... - Latest Tweet - LatestLY", "description": "The latest Tweet by IANS India states, 'The #US space agency has determined that its Space Launch System megarocket is ready for the #Artemis1 flight test. The agency will now roll SLS and Orion back to the Vehicle Assembly Building at Kennedy next week to pr…", "url": "https://www.latestly.com/socially/india/news/the-us-space-agency-has-determined-that-its-space-launch-system-megarocket-is-ready-for-latest-tweet-by-ians-india-3869920.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/TW-IANS-India-4-784x441.png", "publishedAt": "2022-06-25T05:51:53Z", "content": "The #US space agency has determined that its Space Launch System megarocket is ready for the #Artemis1 flight test.\r\nThe agency will now roll SLS and Orion back to the Vehicle Assembly Building at Ke… [+647 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Suicide Attempt by Glass Shard Ingestion: A Case Report - Cureus", "description": "A 42-year-old man with schizophrenia and human immunodeficiency syndrome swallowed several glass shards in an attempted suicide. Two days later, he was admitted to the ER of the Florianópolis Hospital with a complaint of upper abdominal pain. The patient show…", "url": "https://www.cureus.com/articles/80035-suicide-attempt-by-glass-shard-ingestion-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/295735/article_river_1b5a98f0569911ec9da907c0f91ee110-Figure-1.png", "publishedAt": "2022-06-25T05:01:04Z", "content": "A 42-year-old man with schizophrenia and human immunodeficiency syndrome swallowed several glass shards in an attempted suicide. Two days later, he was admitted to the ER of the Florianópolis Hospita… [+8258 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/TechExplorist/", "title": "Understanding changes in Earth’s outer core with the help of seismic waves - Tech Explorist", "description": "The composition of the bulk, the outer core of the Earth, is not pure iron but has a density deficit of about 5–10%, indicating the existence of a", "url": "https://www.techexplorist.com/understanding-changes-earths-outer-core-help-seismic-waves/52094/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/globe-illustration-zhou.jpg", "publishedAt": "2022-06-25T04:28:32Z", "content": "The composition of the bulk, the outer core of the Earth, is not pure iron but has a density deficit of about 510%, indicating the existence of a considerable amount of light elements in the outer co… [+6681 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study: Elliptical Craters Shed Light on Age of Saturn's Moons - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A new study describes how unique populations of craters on two of Saturn's moons could help indicate the satellites' age and the conditions of their formation. Using data from NASA's Cassini mission, res…", "url": "https://www.latestly.com/agency-news/science-news-study-elliptical-craters-shed-light-on-age-of-saturns-moons-3869279.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/06/space-54999_128020220624172826-588x441.jpg", "publishedAt": "2022-06-25T00:04:24Z", "content": "Washington [US], June 25 (ANI): A new study describes how unique populations of craters on two of Saturn's moons could help indicate the satellites' age and the conditions of their formation. Using d… [+3713 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Found: Two New Rocky, Earth-Sized Planets In Our Cosmic Backyard—And There Could Be More - Forbes", "description": "At just 33 light years from Earth it’s one of the closest multi-planet star systems found so far.", "url": "https://www.forbes.com/sites/jamiecartereurope/2022/06/24/found-two-new-rocky-earth-sized-planets-in-our-cosmic-backyard-and-there-could-be-more/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve//62adf971e80bd8531c0ae0ff/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-06-25T00:00:00Z", "content": "Super Earth exoplanet orbiting a red dwarf star.\r\ngetty\r\nThirty-three light years. Thats nothing. Sure, its going to be impossible to ever actually visit the two new planets discovered around the sta… [+3127 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "UC San Diego scientists report on the molecular impact of life indoors - News-Medical.Net", "description": "Within and upon every human being reside countless microorganisms -; the microbiota that help shape and direct the lives of their hosts. A similar phenomenon occurs between people, microbes and the homes they share.", "url": "https://www.news-medical.net/news/20220624/UC-San-Diego-scientists-report-on-the-molecular-impact-of-life-indoors.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/4/Petry_dishes_on_laboratory_table-nazarovsergey_1379beb14e8d4ec0b19989144e064b61-620x480.jpg", "publishedAt": "2022-06-24T22:52:00Z", "content": "Within and upon every human being reside countless microorganisms -; the microbiota that help shape and direct the lives of their hosts. A similar phenomenon occurs between people, microbes and the h… [+5842 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Scientists study fast radio bursts in space - BollyInside", "description": "The first unusually powerful burst of radio waves from space was discovered in 2007 by researchers at West Virginia University. Astronomers have since", "url": "https://www.bollyinside.com/news/scientists-study-fast-radio-bursts-in-space", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Scientists-study-fast-radio-bursts-in-space.jpeg", "publishedAt": "2022-06-24T20:56:38Z", "content": "The first unusually powerful burst of radio waves from space was discovered in 2007 by researchers at West Virginia University. Astronomers have since been baffled by these fast radio bursts, or FRBs… [+2701 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Microscopy technique enables 3D super-resolution nanometer-scale imaging - Science Daily", "description": "Over the last two decades, microscopy has seen unprecedented advances in speed and resolution. However, cellular structures are essentially three-dimensional, and conventional super-resolution techniques often lack the necessary resolution in all three direct…", "url": "https://www.sciencedaily.com/releases/2022/06/220624160656.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-06-24T20:43:29Z", "content": "Over the last two decades, microscopy has seen unprecedented advances in speed and resolution. However, cellular structures are essentially three-dimensional, and conventional super-resolution techni… [+2545 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Star gazers in New Zealand describe being “a little freaked out” by spirals of blue light in the night sky. - BollyInside", "description": "On Sunday night, weird, spiralling light patterns in the night sky mystified and amazed New Zealand astronomers. Alasdair Burns, a stargazing guide on", "url": "https://www.bollyinside.com/news/star-gazers-in-new-zealand-describe-being-a-little-freaked-out-by-spirals-of-blue-light-in-the-night-sky", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Star-gazers-in-New-Zealand-describe-being-a-little-freaked.jpeg", "publishedAt": "2022-06-24T20:08:30Z", "content": "On Sunday night, weird, spiralling light patterns in the night sky mystified and amazed New Zealand astronomers.\r\nAlasdair Burns, a stargazing guide on Stewart Island/Rakiura, received a text message… [+2385 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "NASA worries that Elon Musk’s rocket explosion will block the way to the International Space Station - BollyInside", "description": "NASA is concerned that if Elon Musk’s rocket bursts during launch once more, it may damage the agency’s only access to space. The SpaceX corporation,", "url": "https://www.bollyinside.com/news/nasa-worries-that-elon-musks-rocket-explosion-will-block-the-way-to-the-international-space-station", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/NASA-worries-that-Elon-Musks-rocket-explosion-will-block-the.jpeg", "publishedAt": "2022-06-24T18:56:17Z", "content": "NASA is concerned that if Elon Musks rocket bursts during launch once more, it may damage the agencys only access to space.\r\nThe SpaceX corporation, owned by the billionaire entrepreneur, is prepared… [+3167 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Two years after NASA and ESA missions, China plans to transport samples from Mars to Earth - BollyInside", "description": "Two years before a NASA and ESA combined effort, China’s Mars sample return mission seeks to gather samples from the Red Planet and return them to Earth", "url": "https://www.bollyinside.com/news/two-years-after-nasa-and-esa-missions-china-plans-to-transport-samples-from-mars-to-earth", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/Two-years-after-NASA-and-ESA-missions-China-plans-to.jpeg", "publishedAt": "2022-06-24T18:32:31Z", "content": "Two years before a NASA and ESA combined effort, Chinas Mars sample return mission seeks to gather samples from the Red Planet and return them to Earth in 2031.\r\nThe Tianwen-1 Mars orbiter and rover … [+3532 chars]"}, {"source": {"id": null, "name": "Newsupdate.uk"}, "author": "Andrew McCollum", "title": "The octopus’ brain and the human brain share the same ‘jumping genes’: A new study has identified an important molecular analogy that could explain the remarkable intelligence of these invertebrates - News Update", "description": "The octopus is an exceptional organism with an extremely complex brain and cognitive abilities that are unique among invertebrates. So much so that in some ways it has more in common with vertebrates than with invertebrates. The neural and cognitive", "url": "https://newsupdate.uk/the-octopus-brain-and-the-human-brain-share-the-same-jumping-genes-a-new-study-has-identified-an-important-molecular-analogy-that-could-explain-the-remarkable-intelligence-of-these-invertebrates/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-06-24T16:47:24Z", "content": "The octopus is an exceptional organism with an extremely complex brain and cognitive abilities that are unique among invertebrates. So much so that in some ways it has more in common with vertebrates… [+4484 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Caltech: Methods from Weather Forecasting Can Be Adapted to Assess Risk of COVID-19 Exposure - India Education Diary", "description": "Techniques used in weather forecasting can be repurposed to provide individuals with a personalized assessment of their risk of exposure to COVID-19 or other viruses, according to new research published by Caltech scientists.The technique has the pot", "url": "https://indiaeducationdiary.in/caltech-methods-from-weather-forecasting-can-be-adapted-to-assess-risk-of-covid-19-exposure/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/12/caltech-campus-entrance-sign.jpg", "publishedAt": "2022-06-24T15:43:21Z", "content": "Techniques used in weather forecasting can be repurposed to provide individuals with a personalized assessment of their risk of exposure to COVID-19 or other viruses, according to new research publis… [+7192 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Mercury shows off craters in amazing pictures from BepiColombo flyby - Space.com", "description": "The mission was examining cratered and volcanic regions of the closest planet to the sun.", "url": "https://www.space.com/mercury-bepicolombo-2nd-flyby-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AFBxWV53ZfVQ5yZPEUKK3g-1200-80.png", "publishedAt": "2022-06-24T15:00:05Z", "content": "A spacecraft's second close flyby of Mercury Thursday (June 23) gave a stunning set of close-ups of the planet's craters and volcanic regions.\r\nThe BepiColombo mission, a joint project by the Europea… [+3046 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "Photographer Captures the ISS Crossing the Sun From His Backyard - PetaPixel", "description": "Blink and you'll miss it.", "url": "https://petapixel.com/2022/06/24/photographer-captures-the-iss-crossing-the-sun-from-his-backyard/", "urlToImage": "https://petapixel.com/assets/uploads/2022/06/iss-over-the-sun.jpg", "publishedAt": "2022-06-24T14:27:44Z", "content": "Astrophotographer Jamie Cooper captured an incredible photograph of the International Space Station passing in front of the sun from his backyard garden.\r\nSpeaking to PetaPixel, Cooper says he had le… [+2315 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "For the Boeing Starliner flight to the space station, NASA chooses two astronaut test pilots - BollyInside", "description": "Two astronaut test pilots will go to the International Space Station on NASA’s Boeing Crew Flight Test (CFT) mission, where they will spend around two", "url": "https://www.bollyinside.com/news/for-the-boeing-starliner-flight-to-the-space-station-nasa-chooses-two-astronaut-test-pilots", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/For-the-Boeing-Starliner-flight-to-the-space-station-NASA.jpeg", "publishedAt": "2022-06-24T14:20:45Z", "content": "Two astronaut test pilots will go to the International Space Station on NASAs Boeing Crew Flight Test (CFT) mission, where they will spend around two weeks living and working in space.\r\nIn October 20… [+4586 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/andrew-tarantola", "title": "How NASA might protect tomorrow's astronauts from deep space radiation - Engadget", "description": "Putting people on the surface of Mars is going to expose them to a whole bunch of deadly space radiation.", "url": "https://www.engadget.com/how-nasa-might-protect-tomorrows-astronauts-from-deep-space-radiation-140018131.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-06/600a8c30-ecc1-11ec-bb7f-a97a8c5900a9", "publishedAt": "2022-06-24T14:02:10Z", "content": "There are a million and one ways to die in space\r\n, whether its from micrometeoroid impacts shredding your ship\r\n or solar flares frying its electronics\r\n, drowning in your own sweat during a spacewa… [+14018 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Controlling non-classical mechanical states in a phononic waveguide architecture - Phys.org", "description": "Most quantum computing technologies rely on the ability to produce, manipulate and detect non-classical states of light. Non-classical states are quantum states that cannot directly be produced using conventional sources of light, such as lamps and lasers, an…", "url": "https://phys.org/news/2022-06-non-classical-mechanical-states-phononic-waveguide.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/controlling-non-classi.jpg", "publishedAt": "2022-06-24T13:30:01Z", "content": "Most quantum computing technologies rely on the ability to produce, manipulate and detect non-classical states of light. Non-classical states are quantum states that cannot directly be produced using… [+4814 chars]"}]}