{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Physicists In Collaboration Develop Nanoscopic Advance Of Colossal Significance - India Education Diary", "description": "In a new breakthrough, researchers at the University of Copenhagen, in collaboration with Ruhr University Bochum, have solved a problem that has caused quantum researchers headaches for years. The researchers can now control two quantum light sources", "url": "https://indiaeducationdiary.in/physicists-in-collaboration-develop-nanoscopic-advance-of-colossal-significance/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/Kvantepunkter.jpg?fit=835%2C470&ssl=1", "publishedAt": "2023-01-30T06:34:10Z", "content": "In a new breakthrough, researchers at the University of Copenhagen, in collaboration with Ruhr University Bochum, have solved a problem that has caused quantum researchers headaches for years. The re… [+4579 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Space rocks reveal surprising origin of Earth's life ingredients - Devdiscourse", "description": "Read more about Space rocks reveal surprising origin of Earth's life ingredients on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2335567-space-rocks-reveal-surprising-origin-of-earths-life-ingredients", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_06_2019_19_09_41_5510995.jpg?width=920&format=jpeg", "publishedAt": "2023-01-30T06:17:21Z", "content": "Researchers from the Imperial College London have found Earth's volatile chemicals, some of which form the building blocks of life, came from the outer Solar System - part beyond the asteroid belt, w… [+1955 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Rare Green comet looks heavenly from Ladakh. It will next return after 50,000 years - India Today", "description": "The comet has been captured in the skies above the Indian Astronomical Observatory in Hanle as it continues to leave behind a bright tail.", "url": "https://www.indiatoday.in/science/story/rare-green-comet-looks-heavenly-from-ladakh-it-will-next-be-seen-only-after-50000-years-2328064-2023-01-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202301/comet_c2022_e3_c_0-sixteen_nine.jpg?VersionId=M7M2NhALX_LfA5Ay7P6OSz1nXbMJEBA1", "publishedAt": "2023-01-30T05:47:37Z", "content": "By India Today Web Desk: After successfully surviving its orbit around the Sun, the rare green comet is trudging through the skies above Earth and India. Astrophotographers have captured the comet in… [+2215 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Space Junk Will Block Out Stars And Prevent Detection Of Alien Life, Experts Warn - NDTV", "description": "Experts have recently warned that an abundance of satellites is threatening to \"clog up\" the night skies, blocking out stars and leaving astronomers unable to make observations or detect alien life.", "url": "https://www.ndtv.com/feature/space-junk-will-block-out-stars-and-prevent-detection-of-alien-life-experts-warn-3735148", "urlToImage": "https://c.ndtvimg.com/2023-01/6ma5prno_space-generic_625x300_30_January_23.jpg", "publishedAt": "2023-01-30T05:24:40Z", "content": "There has been \"a paradigm shift\" in how we view space, said UK space agency.\r\nExperts have recently warned that an abundance of satellites is threatening to \"clog up\" the night skies, blocking out s… [+3536 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Physicists observed global spin alignment signal in heavy-ion collisions - Tech Explorist", "description": "A potential new avenue for understanding the strong interaction at work at the sub-nucleon level.", "url": "https://www.techexplorist.com/physicists-observed-global-spin-alignment-signal-in-heavy-ion-collisions/56486/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/01/phi-meson.jpg", "publishedAt": "2023-01-30T05:17:22Z", "content": "Despite decades of advancement since Yukawa originally described the force between nucleons in terms of meson exchange, a comprehensive comprehension of the strong interaction still poses a significa… [+2873 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Magnetic microrobot probe can quantify the stiffness and traction forces of cell colonies and embryos in vivo - News-Medical.Net", "description": "In a recent study published in the journal Science Robotics, a team of researchers created a magnetic microrobot probe that can quantify the stiffness and traction force of tumor cell colonies and developing vertebrate embryos.", "url": "https://www.news-medical.net/news/20230129/Magnetic-microrobot-probe-can-quantify-the-stiffness-and-traction-forces-of-cell-colonies-and-embryos-in-vivo.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_737209_16750504768761256.png", "publishedAt": "2023-01-30T03:48:00Z", "content": "In a recent study published in the journal Science Robotics, a team of researchers created a magnetic microrobot probe that can quantify the stiffness and traction force of tumor cell colonies and de… [+5412 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physicists Discover a New Approach for Solving the Bizarre Dark Energy Mystery - SciTechDaily", "description": "What is behind dark energy — and what connects it to the cosmological constant introduced by Albert Einstein? Two physicists from the University of Luxembourg point the way to answering these open questions of physics. The universe has a number of bizarre pro…", "url": "https://scitechdaily.com/physicists-discover-a-new-approach-for-solving-the-bizarre-dark-energy-mystery/", "urlToImage": "https://scitechdaily.com/images/Dark-Energy-Big-Bang-Expansion-Concept.jpg", "publishedAt": "2023-01-30T03:19:17Z", "content": "Physicists have proposed a new interpretation of dark energy. It could shed insight on the interconnection between quantum field theory and general relativity theory, as two perspectives on the unive… [+7145 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Adult brain contains millions of silent synapses: Study - Times of India", "description": "The adult brain contains millions of silent synapses, which are immature connections between neurons that remain inactive until they are recruited to help form new memories, according to MIT neuroscientists.Until now, it was thought that silent synapses exist…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/adult-brain-contains-millions-of-silent-synapses-study/videoshow/97430522.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/97430522/size-61072/97430522.jpg", "publishedAt": "2023-01-30T03:09:18Z", "content": "The adult brain\r\n contains millions of \"silent synapses,\" which are immature connections between neurons\r\n that remain inactive until they are recruited to help form new memories, according to MIT\r\n … [+744 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "Astronomers Find 25 Fast Radio Bursts That Repeat on a Regular Basis - Universe Today", "description": "Researchers with the CHIME/FRB Collaboration have announced the discovery of 25 new repeating FRBs, almost doubling the number of known events!", "url": "https://www.universetoday.com/159813/astronomers-find-25-fast-radio-bursts-that-repeat-on-a-regular-basis/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2019/01/CHIME_Renard_1500x1000px.jpg", "publishedAt": "2023-01-30T03:03:03Z", "content": "Like Gravitational Waves (GWs) and Gamma-Ray Bursts (GRBs), Fast Radio Bursts (FRBs) are one of the most powerful and mysterious astronomical phenomena today. These transient events consist of bursts… [+6454 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "SpaceX targeting Monday for launch of 49 Starlink satellites: Watch live - Devdiscourse", "description": "Read more about SpaceX targeting Monday for launch of 49 Starlink satellites: Watch live on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2335442-spacex-targeting-monday-for-launch-of-49-starlink-satellites-watch-live", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_05_2022_10_26_20_6709552.jpg?width=920&format=jpeg", "publishedAt": "2023-01-30T02:39:55Z", "content": "SpaceX is gearing up for another Falcon 9 launch on Monday, January 30th. The rocket carrying 49 Starlink internet satellites and D-Orbit's ION SCV009 Eclectic Elena will lift off at 8:34 AM PT (16:3… [+940 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Researchers find new way to improve storage time of quantum information - Devdiscourse", "description": "An international team of scientists have demonstrated a leap in preserving the quantum coherence of quantum dot spin qubits as part of the global push for practical quantum networks and quantum computers.", "url": "https://www.devdiscourse.com/article/science-environment/2335433-researchers-find-new-way-to-improve-storage-time-of-quantum-information", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_01_2023_02_37_05_7794915.jpg?width=920&format=jpeg", "publishedAt": "2023-01-30T02:37:08Z", "content": "As part of the global push for practical quantum networks and quantum computers, an international team of scientists has made a breakthrough in retaining the quantum coherence of quantum dot spin qub… [+4786 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul M. Sutter", "title": "Molecular Clouds Have Long Lives By Constantly Reassemble Themselves - Universe Today", "description": "Astronomers have recently discovered that giant clouds of molecular hydrogen can live for tens of millions of years.", "url": "https://www.universetoday.com/159804/molecular-clouds-have-long-lives-by-constantly-reassemble-themselves/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/01/adamblock_taurus_gmc.jpg", "publishedAt": "2023-01-30T02:08:40Z", "content": "Astronomers have recently discovered that giant clouds of molecular hydrogen, the birthplace of stars, can live for tens of millions of years despite the facts that individual molecules are constantl… [+2359 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Intriguing Meteorite From Mars Reveals 'Huge Organic Diversity', Scientists Say - ScienceAlert", "description": "In a recent study published in Sciences Advances, an international team of scientists led by the Technical University of Munich examined the Martian meteorite Tissint, which fell near the village of Tissint, Morocco, on 18 July 2011, with pieces of...", "url": "https://www.sciencealert.com/intriguing-meteorite-from-mars-reveals-huge-organic-diversity-scientists-say", "urlToImage": "https://www.sciencealert.com/images/2023/01/GreenishGreyTissintMeteoriteFromMars.jpg", "publishedAt": "2023-01-30T01:37:45Z", "content": "In a recent study published in Sciences Advances, an international team of scientists led by the Technical University of Munich examined the Martian meteorite Tissint, which fell near the village of … [+4291 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Physicists Used Sound Waves to Give a Tiny Sun Its Own Kind of Gravity - ScienceAlert", "description": "Scientists have a problem when it comes to modeling space events inside laboratories: Earth's gravity tends to get in the way, making it difficult to replicate environments away from our planet.", "url": "https://www.sciencealert.com/physicists-used-sound-waves-to-give-a-tiny-sun-its-own-kind-of-gravity", "urlToImage": "https://www.sciencealert.com/images/2023/01/SphereBall.jpg", "publishedAt": "2023-01-30T01:02:47Z", "content": "Scientists have a problem when it comes to modeling space events inside laboratories: Earth's gravity tends to get in the way, making it difficult to replicate environments away from our planet.\r\nA r… [+3272 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Links: January 29, 2023 | Hackaday - Hackaday", "description": "We’ve been told for ages that “the robots are coming for our jobs!” It’s true that we’ve seen robots capable of everything from bugger flipping to bricklaying being de…", "url": "https://hackaday.com/2023/01/29/hackaday-links-january-29-2023/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2023-01-30T00:00:00Z", "content": "We’ve been told for ages that “the robots are coming for our jobs!” It’s true that we’ve seen robots capable of everything from bugger flipping to bricklaying being demonstrated, and that’s certainly… [+4183 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA has tested a rocket engine that can revolutionise space travel; why is it a big deal? - Republic World", "description": "NASA has tested and validated an entirely new class of rotating detonation rocket engine which could revolutionise deep space missions to Moon & Mars.", "url": "https://www.republicworld.com/science/space/nasa-has-tested-a-rocket-engine-that-can-revolutionise-space-travel-why-is-it-a-big-deal-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/2d9ufhcfckmlsaqb_1675013923.jpeg", "publishedAt": "2023-01-29T20:22:00Z", "content": "NASA has tested and validated an entirely new class of rocket engines, which it claims could bring revolution in sustainable interplanetary travel. This new engine is the first full-scale rotating de… [+2155 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "JPL and the Space Age: The Changing Face of Mars (NASA Documentary) - SciTechDaily", "description": "Other than Earth, no planet in the solar system has been so thoroughly or long examined as Mars. For more than two decades now NASA’s Jet Propulsion Laboratory has continuously explored the Red Planet with an array of orbiters, landers, and rovers. What laid …", "url": "https://scitechdaily.com/?p=246826", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-of-Mariner-4-at-Mars.jpg", "publishedAt": "2023-01-29T20:05:29Z", "content": "ByNASAs Jet Propulsion LaboratoryJanuary 29, 2023\r\nThis image of Mariner 4 superimposed on an image of Mars was used to advertise the Mariner 4 mission. Credit: NASA\r\nOther than Earth, no planet in t… [+3931 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "It Isn't What You Know, It's What You Think You Know – Why Science Can Evoke Strong and Opposing Attitudes - SciTechDaily", "description": "Survey of over 2,000 adults in the UK identifies potential pitfalls of science communication. Why do people hold highly variable attitudes towards well-evidenced science? For many years researchers focused on what people know about science, thinking that “to …", "url": "https://scitechdaily.com/it-isnt-what-you-know-its-what-you-think-you-know-why-science-can-evoke-strong-and-opposing-attitudes/", "urlToImage": "https://scitechdaily.com/images/Intense-Debate-Concept.jpg", "publishedAt": "2023-01-29T19:15:25Z", "content": "ByPLOSJanuary 29, 2023\r\nResearchers survey why some people hold strong attitudes to science whilst others are more neutral.\r\nSurvey of over 2,000 adults in the UK identifies potential pitfalls of sci… [+4872 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "China’s aerospace development boosted by excellent young team - Global Times", "description": "A team of top young scientific and technological graduates at the Beijing Aerospace Flight Control Center have played a key role in supporting China’s major space programs in recent years, such as the Tiangong Space Station, the Chang’e lunar probes and the T…", "url": "https://www.globaltimes.cn/page/202301/1284448.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2023/2023-01-05/29f1e94c-9da9-42de-9378-750aea35621c_s.jpeg", "publishedAt": "2023-01-29T19:11:00Z", "content": "Photo: Deng Xiaoci/GT\r\nA team of top young scientific and technological graduates at the Beijing Aerospace Flight Control Center have played a key role in supporting Chinas major space programs in re… [+7329 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "A bear on Mars? This satellite image of Mars surface stuns netizens - WION", "description": "A bear on Mars? This satellite image of Mars surface stuns netizens", "url": "https://www.wionews.com/science/a-bear-on-mars-this-satellite-image-of-mars-surface-stuns-netizens-557102", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/01/29/328879-bear.png", "publishedAt": "2023-01-29T18:56:19Z", "content": "Is that the face of a bear on Mars? \r\nA satellite image of the surface of Mars has baffled Twitterati after the National Aeronautics and Space Administration (NASA) posted a picture of a fragment of … [+1676 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Camera atop Hawaii's tallest mountain captures sky spiral after rocket launch | ABC News - ABC News", "description": "A camera atop Hawaii’s tallest mountain has captured what looks like a spiral swirling through the night sky. Researchers believe it was from the launch of a...", "url": "https://www.youtube.com/watch?v=fakcDEAaVR0", "urlToImage": "https://i.ytimg.com/vi/fakcDEAaVR0/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYaCBoKGgwDw==&rs=AOn4CLB7ksVdyE-UXtLqJKn48i8cX9qv8Q", "publishedAt": "2023-01-29T18:39:15Z", "content": null}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Hubble Space Telescope Captures Stunning Image of the \"Soul Nebula\" — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: Scientists have released a breathtaking image of the “Soul Nebula” that the Hubble Space Telescope captured. The “Heart and Soul” nebula complex forms a 300-light-years wide star-forming region The small region of Westerhout 5, also known as th…", "url": "https://www.transcontinentaltimes.com/hubble-space-telescope-soul-nebula/", "urlToImage": "https://media.transcontinentaltimes.com/2023/01/FATOsUaUcAAVeVf-Aditya-S-1-300x169.jpg", "publishedAt": "2023-01-29T17:28:54Z", "content": "UNITED STATES: Scientists have released a breathtaking image of the “Soul Nebula” that the Hubble Space Telescope captured.\r\nThe “Heart and Soul” nebula complex forms a 300-light-years wide star-form… [+1959 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Startups led by MIT mechanical engineers offer health care solutions - India Education Diary", "description": "Health care has always been ripe for innovation. Whether it’s increasing safety in operating rooms, developing systems to reduce patient wait times, or improving drug delivery, there are endless opportunities to improve the efficacy and efficiency of", "url": "https://indiaeducationdiary.in/startups-led-by-mit-mechanical-engineers-offer-health-care-solutions/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png?fit=534%2C462&ssl=1", "publishedAt": "2023-01-29T16:52:35Z", "content": "Health care has always been ripe for innovation. Whether its increasing safety in operating rooms, developing systems to reduce patient wait times, or improving drug delivery, there are endless oppor… [+6915 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Bilge Yildiz wins Rahmi M. Koç Medal of Science - India Education Diary", "description": "Before being awarded the Koç University Rahmi M. Koç Medal of Science in her native Turkey, Bilge Yildiz was nervous. But it wasn’t standing in front of an audience of hundreds that stressed the Breene M. Kerr Professor in the departments of Nuclear", "url": "https://indiaeducationdiary.in/bilge-yildiz-wins-rahmi-m-koc-medal-of-science/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png?fit=534%2C462&ssl=1", "publishedAt": "2023-01-29T16:52:35Z", "content": "Before being awarded the Koç University Rahmi M. Koç Medal of Science in her native Turkey, Bilge Yildiz was nervous. But it wasnt standing in front of an audience of hundreds that stressed the Breen… [+6465 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study shows triassic fossils that reveal origins of living amphibians - Devdiscourse", "description": "The smallest of newly found fossils can upend what palaeontologists know about our history.", "url": "https://www.devdiscourse.com/article/science-environment/2335228-study-shows-triassic-fossils-that-reveal-origins-of-living-amphibians", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/29_01_2023_16_18_13_9209446.jpg?width=920&format=jpeg", "publishedAt": "2023-01-29T16:18:16Z", "content": "The smallest of newly found fossils can upend what palaeontologists know about our history. A team of paleontologists from Virginia Tech and the U.S. Petrified Forest National Park, among others, hav… [+4550 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "Dean Howell", "title": "Scientists at Salesforce develop proteins with AI that can eat trash - Neowin", "description": "Salesforce has developed their own AI that can create millions of proteins in a flash that can be used in all sorts of different types of applications from medicine to... eating trash?", "url": "https://www.neowin.net/news/scientists-at-salesforce-develop-proteins-with-ai-that-can-eat-trash/", "urlToImage": "https://cdn.neowin.com/news/images/uploaded/2023/01/1675005211_progen_story.jpg", "publishedAt": "2023-01-29T16:16:00Z", "content": "What do you get when the world's largest CRM breaks into the research industry and leverages AI to build their products? You get ProGen, a new AI system that can make artificial enzymes from scratch … [+2158 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Easily Recyclable and Compostable – A New Plastic With Excellent Mechanical Stability - SciTechDaily", "description": "How can plastics be designed so that they maintain their useful properties while also being more easily recyclable? Chemist Stefan Mecking and his research group at the University of Konstanz are focused on studying eco-friendly solutions for plastics. In the…", "url": "https://scitechdaily.com/easily-recyclable-and-compostable-a-new-plastic-with-excellent-mechanical-stability/", "urlToImage": "https://scitechdaily.com/images/Plastic-Recycling-Concept.jpg", "publishedAt": "2023-01-29T15:31:40Z", "content": "ByUniversity of KonstanzJanuary 29, 2023\r\nResearchers at the University of Konstanz have developed a new plastic that is highly stable, biodegradable, and readily recyclable.\r\nHow can plastics be des… [+4213 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "James Webb Discovers Coldest Ice in Known Universe, Harboring Molecules Essential For Life - Futurism", "description": "The James Webb was able to spot the coldest ice on record that may hold clues to the formation of organic molecules across the universe.", "url": "https://futurism.com/the-byte/james-webb-coldest-ice-in-universe", "urlToImage": "https://wp-assets.futurism.com/2023/01/james-webb-discovers-coldest-ice.jpg", "publishedAt": "2023-01-29T15:23:54Z", "content": "\"These observations open a new window on the formation pathways for the simple and complex molecules that are needed to make the building blocks of life.\"\r\nCatch Em Cold\r\nThe James Webb Space Telesco… [+2960 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "European Space Agency Shows Off Concept for Martian Sample Picker-Upper - Futurism", "description": "The European Space Agency has shown off a concept for a giant eight-feet-long robotic arm that is designed to pick up samples of Martian soil.", "url": "https://futurism.com/the-byte/european-space-agency-martian-sample-picker-upper", "urlToImage": "https://wp-assets.futurism.com/2023/01/european-space-agency-mars-sample-robot-arm.jpg", "publishedAt": "2023-01-29T15:16:50Z", "content": "It's literally picking up where Perseverance left off.\r\nEarthbound\r\nThe European Space Agency has shown off a concept for an eight-foot robotic arm, designed to pick up samples of Martian soil small … [+1877 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sara HUSSEIN", "title": "How three dust specks reveal an asteroid's secrets - Phys.org", "description": "The specks are tiny. No, really tiny. Smaller than the diameter of a hair. But they hold billions of years of history that reveal some of the secrets of asteroids.", "url": "https://phys.org/news/2023-01-specks-reveal-asteroid-secrets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/samples-from-itokawa-a.jpg", "publishedAt": "2023-01-29T14:20:01Z", "content": "The specks are tiny. No, really tiny. Smaller than the diameter of a hair. But they hold billions of years of history that reveal some of the secrets of asteroids.\r\nThe three minute particles from an… [+3574 chars]"}, {"source": {"id": null, "name": "WUWM"}, "author": "Ayesha Rascoe", "title": "The rotation of Earth's inner core may be slowing down - WUWM", "description": "NPR's Ayesha Rascoe talks to John Vidale, professor of earth sciences at the University of Southern California, about new research suggesting the rotation of Earth's inner core may be slowing down.", "url": "https://www.wuwm.com/health-science/health-science/2023-01-29/the-rotation-of-earths-inner-core-may-be-slowing-down", "urlToImage": null, "publishedAt": "2023-01-29T13:03:16Z", "content": "NPR's Ayesha Rascoe talks to John Vidale, professor of earth sciences at the University of Southern California, about new research suggesting the rotation of Earth's inner core may be slowing down.\r\n… [+17 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Is oxytocin a 'love hormone'? Indian-origin researchers raise questions - Morung Express", "description": "New Delhi, January 29 (IANS) Turning a decades-old dogma on its head, Indian-origin scientists at University of California-San Francisco and Stanford Medicine shows that the receptor for oxytocin, a hormone considered essential to forming social bonds, ma", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2023/01/51155788_1674993426_a4ef9fff19a827ee1f677460233d812e.jpg", "publishedAt": "2023-01-29T11:57:49Z", "content": "New Delhi, January 29 (IANS) Turning a decades-old dogma on its head, Indian-origin scientists at University of California-San Francisco and Stanford Medicine shows that the receptor for oxytocin, a … [+3139 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Webb observes Chariklo’s rings during occultation - EarthSky", "description": null, "url": "https://earthsky.org/space/chariklos-rings-webb-telescope-stellar-occultation/", "urlToImage": "https://earthsky.org/upl/2023/01/Chariklo-Webb-stellar-occultation-October-18-2022.gif", "publishedAt": "2023-01-29T11:36:41Z", "content": "Click to animate. | This video, composed of 63 individual observations by Webb on October 18, 2022, shows the asteroid Chariklo passing in front of a background star, in an event called a stellar occ… [+6508 chars]"}, {"source": {"id": null, "name": "Robohub.org"}, "author": "MIT News", "title": "Sensing with purpose - Robohub", "description": "", "url": "https://robohub.org/sensing-with-purpose/", "urlToImage": "https://robohub.org/wp-content/uploads/2023/01/MIT-Fadel-Adib-01-PRESS_0-425x283.jpg", "publishedAt": "2023-01-29T09:30:05Z", "content": "Fadel Adib, associate professor in the Department of Electrical Engineering and Computer Science and the Media Lab, seeks to develop wireless technology that can sense the physical world in ways that… [+8576 chars]"}, {"source": {"id": null, "name": "Deeperblue.com"}, "author": null, "title": "Local Climate Changes Can Reduce Antarctic Ice Sheet Loss - DeeperBlue.com - DeeperBlue.com", "description": "A new study has revealed that the loss of the West Antarctic Ice Sheet is not a foregone conclusion, and local environmental conditions can slow it.", "url": "https://www.deeperblue.com/local-climate-changes-can-reduce-antarctic-ice-sheet-loss/", "urlToImage": "https://www.deeperblue.com/wp-content/uploads/2023/01/Antarctic-Ice-Sheet-Adobe-Stock.jpg", "publishedAt": "2023-01-29T06:00:50Z", "content": "A new study has revealed that the loss of the West Antarctic Ice Sheet is not a foregone conclusion, and local environmental conditions can slow it.\r\nThe researchers studying the sheet found that the… [+2289 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": null, "title": "Why Don't Fish Sink In Water? - Science ABC", "description": "Cartilaginous fishes do not have swim bladders. Instead they have enlarged and oily livers to help keep them afloat.", "url": "https://www.scienceabc.com/nature/animals/why-dont-fish-sink-in-water.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2022/12/The-eagle-rays-are-a-group-of-cartilaginous-fishes-in-the-family-Myliobatidae.jpg", "publishedAt": "2023-01-29T05:42:33Z", "content": "Bony fish possess a structure called a swim bladder filled with air that allows the fish to remain floating within the water. Cartilaginous fishes, such as sharks, don’t have a swim bladder. In addit… [+6551 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "A Recent Detection by @iiscbangalore Opens Up New Possibilities to Explore the Cosmic ... - Latest Tweet by - LatestLY", "description": "The latest Tweet by Prasar Bharati News Services states, 'A recent detection by @iiscbangalore opens up new possibilities to explore the cosmic evolution of neutral gas... Do you know how stars are formed in a Galaxy? Read: ...'", "url": "https://www.latestly.com/socially/india/news/a-recent-detection-by-iiscbangalore-opens-up-new-possibilities-to-explore-the-cosmic-latest-tweet-by-prasar-bharati-news-services-4769207.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/TW-PBNS-INDIA-2-784x441.png", "publishedAt": "2023-01-29T04:07:41Z", "content": "A recent detection by @iiscbangalore opens up new possibilities to explore the cosmic evolution of neutral gas...\r\nDo you know how stars are formed in a Galaxy?\r\nRead: https://t.co/5ycpOMtrm8— Prasar… [+537 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "New Milky Way Survey Reveals 3.3 Billion Cosmic Objects In Our Home Galaxy - Indiatimes.com", "description": "A new survey of the Milky Way galaxy has revealed 3.32 billion objects in our home galaxy. The survey, perhaps the largest of its kind, was created using data from the Dark Energy Camera at the Cerro Tololo Inter-American Observatory in Chile.\"Imagine a group…", "url": "https://www.indiatimes.com/technology/science-and-future/new-milky-way-survey-reveals-33-billion-cosmic-objects-590756.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jan/2_63c93892db43a.PNG", "publishedAt": "2023-01-29T04:00:28Z", "content": "A new survey of the Milky Way galaxy has revealed 3.32 billion objects in our home galaxy. The survey, perhaps the largest of its kind, was created using data from the Dark Energy Camera at the Cerro… [+2569 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Mohana Basu", "title": "A tiny beetle-inspired robot for big tasks & how ancient meteorites delivered potassium to Earth - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/a-tiny-beetle-inspired-robot-for-big-tasks-how-ancient-meteorites-delivered-potassium-to-earth/1340205/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/01/Beetle-robot.jpg", "publishedAt": "2023-01-29T03:06:04Z", "content": "New Delhi: Scientists have created beetle-sized jumping robots capable of performing tasks in small spaces and that are powerful enough to manoeuvre over obstacles.\r\nThe team at the University of Ill… [+5264 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Shyla Jovitha Abraham", "title": "Digital pacifiers may impact children's emotional development - The Week", "description": "MOST PARENTS TRY to calm a cranky child by letting her use electronic devices. While", "url": "https://www.theweek.in/health/quickscan/2023/01/28/digital-pacifiers-may-impact-childrens-emotional-development.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/quickscan/images/2023/1/28/8-Digital-pacifiers-may-impact.jpg", "publishedAt": "2023-01-29T02:14:00Z", "content": "MOST PARENTS TRY to calm a cranky child by letting her use electronic devices. While it may calm them, doing so too often could hinder the childs ability to regulate emotions properly. According to a… [+13690 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Five traces of ancestor species that are still seen in all human bodies today - The Federal", "description": "Five traces of ancestor species that are still seen in all human bodies today We all share ancestors if we go far enough back in time", "url": "https://thefederal.com/science/five-traces-of-ancestor-species-that-are-still-seen-in-all-human-bodies-today/", "urlToImage": "https://thefederal.com/file/2022/07/Thyroid-iStock.jpg", "publishedAt": "2023-01-29T01:02:16Z", "content": "Many of us are returning to work or school after spending time with relatives over the summer period. Sometimes we can be left wondering how on earth we are related to some of these people with whom … [+7367 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Simulations Reproduce Complex Fluctuations In Soft X-Ray Signal Detected By Satellites - Eurasia Review", "description": "Researchers from Tokyo Metropolitan University have used numerical methods to model the variations observed in soft X-ray signals detected by X-ray satellites. They analyzed data from the Suzaku te…", "url": "https://www.eurasiareview.com/29012023-simulations-reproduce-complex-fluctuations-in-soft-x-ray-signal-detected-by-satellites/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2023/01/a-294.png?fit=800%2C450&ssl=1", "publishedAt": "2023-01-28T23:15:15Z", "content": "Researchers from Tokyo Metropolitan University have used numerical methods to model the variations observed in soft X-ray signals detected by X-ray satellites. They analyzed data from the Suzaku tele… [+2606 chars]"}, {"source": {"id": null, "name": "Financial Express"}, "author": null, "title": "Spectacular comets of recent times - msnNOW", "description": "Comet Holmes is a periodic comet in the Solar System, discovered by the British amateur astronomer Edwin Holmes on November 6, 1892.", "url": "https://www.financialexpress.com/lifestyle/science/spectacular-comets-of-recent-times/2962822/?utm_source=msn&amp;utm_medium=Referral", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA16Qyv9.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-01-28T23:09:10Z", "content": "© Provided by The Financial Express\r\n Comet Lovejoy, formally designated C/2011 W3, is a long-period comet and Kreutz sungrazer. (Image: Reuters)\r\nAstronomers recently discovered a green comet approa… [+4443 chars]"}, {"source": {"id": null, "name": "Hackster.io"}, "author": "Nick Bild", "title": "Robo-Dog Seeks Partner for Long Walks on the Beach - Hackster.io", "description": "An adaptive control architecture that senses the terrain and a reinforcement learning approach have taught a robo-dog to run at the beach.", "url": "https://www.hackster.io/news/robo-dog-seeks-partner-for-long-walks-on-the-beach-d834f2b98a64", "urlToImage": "https://hackster.imgix.net/uploads/attachments/1550320/_kaQGrkcwER.blob?auto=compress%2Cformat&w=600&h=450&fit=min", "publishedAt": "2023-01-28T22:11:37Z", "content": "Quadrupedal robots are becoming an ever more common sight in a variety of industries because of their unique capabilities. These robots are designed to mimic the movement and stability of animals, ma… [+3453 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study: Light Pollution Continues to Dim Stars - VOA Learning English", "description": "A new study has found that every year, the night sky grows brighter and the stars look dimmer.", "url": "https://learningenglish.voanews.com/a/study-light-pollution-continues-to-dim-stars/6930040.html", "urlToImage": "https://gdb.voanews.com/800f0000-c0a8-0242-6888-08dafd526c6c_cx0_cy6_cw0_w1200_r1.jpg", "publishedAt": "2023-01-28T21:56:04Z", "content": "A new study has found that light pollution is making the night sky brighter and the stars dimmer.\r\nThe study examined data from more than 50,000 citizen star watchers across the world. It found that … [+4076 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "China could claim resource-rich regions of moon: Report - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "BEIJING [China], Jan 28: NASA Administrator Bill Nelson has warned that China could claim resource-rich regions of the moon as its own as the country intends to gain economic benefits through space exploration, the Indo-Pacific Center for Strategic Communicat…", "url": "https://www.dailyexcelsior.com/china-could-claim-resource-rich-regions-of-moon-report/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2023/01/download-4-24.jpg", "publishedAt": "2023-01-28T19:08:46Z", "content": "BEIJING [China], Jan 28: NASA Administrator Bill Nelson has warned that China could claim resource-rich regions of the moon as its own as the country intends to gain economic benefits through space e… [+2879 chars]"}, {"source": {"id": null, "name": "Europeantimes.news"}, "author": "SciTech Daily", "title": "Decades-Old Mystery Solved? Astronomers May Have Uncovered How Galaxies Change Their Shape - The European Times", "description": "A study led by astronomers at the International Centre for Radio Astronomy Research (ICRAR) may have discovered the explanation for variations in the shapes", "url": "https://www.europeantimes.news/2023/01/decades-old-mystery-solved-astronomers-may-have-uncovered-how-galaxies-change-their-shape/", "urlToImage": "https://i2.wp.com/scitechdaily.com/images/Mysterious-Spiral-Galaxy-Concept.jpg", "publishedAt": "2023-01-28T18:55:43Z", "content": "A study led by astronomers at the International Centre for Radio Astronomy Research (ICRAR) may have discovered the explanation for variations in the shapes of galaxies.\r\nBy using artificial intellig… [+3687 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "NASA’s Lucy spacecraft to visit a bonus asteroid later this year - Digital Trends", "description": "NASA's Lucy spacecraft was to make its first close approach to an asteroid in 2025, but a new plan will see a flyby of a bonus asteroid later this year.", "url": "https://www.digitaltrends.com/space/nasa-lucy-extra-asteroid/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/01/final_lucy_high-end-render_pira-21.jpg?resize=1200%2C630&p=1", "publishedAt": "2023-01-28T18:45:13Z", "content": "NASA’s Lucy spacecraft is currently traveling through the solar system on its way to study the Trojan asteroids in the orbit of Jupiter. The original plan was for the mission to make its first close … [+2507 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Video Team", "title": "Supernova, the largest explosion, takes place in space - WION", "description": "Astronomers revealed images of star graveyard in the Milky Way Galaxy. Supernova, the largest explosions takes place in space. Watch further to know more.", "url": "https://www.wionews.com/videos/supernova-the-largest-explosions-takes-place-in-space-556889", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/01/28/2801_WOYB_SUPERNOVA_9M-1674926713-00000003.jpg", "publishedAt": "2023-01-28T17:25:03Z", "content": "Astronomers revealed images of star graveyard in the Milky Way Galaxy. Supernova, the largest explosions takes place in space. Watch further to know more."}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveal new way to find stress in complex fluids - ThePrint", "description": "Indiana [US], January 28 (ANI): Researchers studying fluid dynamics employ a variety of methods to examine turbulent flows, such as ocean currents or the turbulent atmosphere of other planets. The research team led by Arezoo Adrekani has found that a mathemat…", "url": "https://theprint.in/science/study-reveal-new-way-to-find-stress-in-complex-fluids/1340599/", "urlToImage": null, "publishedAt": "2023-01-28T17:15:36Z", "content": "Indiana [US], January 28 (ANI): Researchers studying fluid dynamics employ a variety of methods to examine turbulent flows, such as ocean currents or the turbulent atmosphere of other planets. The re… [+3878 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": "Keith Cowing", "title": "Mercury Helps to Detail Earth's Most Massive Extinction Event - Astrobiology - Astrobiology News", "description": "The Latest Permian Mass Extinction (LPME) was the largest extinction in Earth’s history to date, killing between 80-90% of life on the planet, though finding definitive evidence for what caused the dramatic changes in climate has eluded experts.", "url": "https://astrobiology.com/2023/01/mercury-helps-to-detail-earths-most-massive-extinction-event.html", "urlToImage": "https://astrobiology.com/wp-content/uploads/2023/01/Screen-Shot-2023-01-28-at-12.01.38-PM.png", "publishedAt": "2023-01-28T17:03:45Z", "content": "The Latest Permian Mass Extinction (LPME) was the largest extinction in Earths history to date, killing between 80-90% of life on the planet, though finding definitive evidence for what caused the dr… [+6156 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's Hubble Telescope Discovers Black Hole Twisting A Star Into Donut Shape - NDTV", "description": "NASA stated that in a galaxy with a dormant black hole at its core, such an event only occurs a few times in 1,00,000 years.", "url": "https://www.ndtv.com/feature/nasas-hubble-telescope-discovers-black-hole-twisting-a-star-into-donut-shape-3732102", "urlToImage": "https://c.ndtvimg.com/2023-01/3iplbbc_black-hole_625x300_28_January_23.jpg", "publishedAt": "2023-01-28T14:58:37Z", "content": "Tidal disruption events constitute the entire process, according to NASA.\r\nMost stars die with a bang, exploding in a massive supernova. However, some stars observe a different death and are consumed… [+2665 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Why Is Venus The \"evil Twin\" Of Earth? - Nation World News", "description": "Venus is second in the planetary organization of the Solar System. And it gets its unique name from the Roman goddess of love and beauty. It is estimated to", "url": "https://nationworldnews.com/why-is-venus-the-evil-twin-of-earth/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/Why-is-Venus-the-evil-twin-of-Earth.jpg", "publishedAt": "2023-01-28T14:16:28Z", "content": "Venus is second in the planetary organization of the Solar System. And it gets its unique name from the Roman goddess of love and beauty. It is estimated to be about 4,500 million years old and is on… [+3361 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "AFP", "title": "Phew! Truck-sized asteroid misses Earth - The News International", "description": "A truck-sized asteroid that suddenly loomed out of the darkness a few days ago — with the Earth in its sights — sailed harmlessly past us on Thursday, space scientists...", "url": "https://www.thenews.com.pk/latest/1035168-phew-truck-sized-asteroid-misses-earth", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-01-28/1035168_063412_updates.jpg", "publishedAt": "2023-01-28T14:15:00Z", "content": "A truck-sized asteroid that suddenly loomed out of the darkness a few days ago  with the Earth in its sights  sailed harmlessly past us on Thursday, space scientists said.\r\nDespite what we've seen in… [+2188 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Starry tail tells tale of dwarf galaxy evolution: Research - ANI News", "description": "A giant diffuse tail of stars has been discovered emanating from a large, faint dwarf galaxy. The presence of a tail indicates that the galaxy has experienced recent interaction with another galaxy. This is an important clue for understanding how so-called \"u…", "url": "https://www.aninews.in/news/science/starry-tail-tells-tale-of-dwarf-galaxy-evolution-research20230128190728", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230128132430.jpg", "publishedAt": "2023-01-28T13:44:21Z", "content": "Washington [US], January 28 (ANI): A giant diffuse tail of stars has been discovered emanating from a large, faint dwarf galaxy. A tail indicates that the galaxy has experienced recent interaction wi… [+1220 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "A new analysis of Tonga eruption's seismic activity - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/a-new-analysis-of-tonga-eruptions-seismic-activity/502759.html", "urlToImage": "", "publishedAt": "2023-01-28T12:42:47Z", "content": "Tokyo, Jan 28 (PTI) A new analysis of seismic data recorded after the massively violent eruption of the underwater volcano Hunga Tonga-Hunga Ha'apai, on January 15, 2022, consisted of two distinct se… [+524 chars]"}, {"source": {"id": null, "name": "Adda247.com"}, "author": "priyankadasgupta", "title": "European Space Mission JUICE to be Launched in April 2023 - Adda247", "description": "The European Space Agency’s Jupiter Icy Moons Explorer or JUICE is the next venture of humanity into the outer Solar System. It will be conducted thorough examinations of Jupiter, the largest planet in our solar system, and its three moons with oceans includi…", "url": "https://currentaffairs.adda247.com/european-space-mission-juice-to-be-launched-in-april-2023/", "urlToImage": "https://wpassets.adda247.com/wp-content/uploads/multisite/sites/5/2023/01/28164912/JUICE-Space-Mission-of-Europe-to-be-launched-in-April-2023.png", "publishedAt": "2023-01-28T11:26:26Z", "content": "The European Space Agency’s Jupiter Icy Moons Explorer or JUICE is the next venture of humanity into the outer Solar System. It will be conducted thorough examinations of Jupiter, the largest planet … [+1655 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustan Times", "title": "Beginners Guide To Triathlon - Hindustan Times", "description": "Participating in Triathlon for the first time can be a challenging task. Here are some useful tips for beginners for a Triathlon", "url": "https://www.hindustantimes.com/web-stories/beginners-guide-to-triathlon-_NMqiqHgu8K6yrzDmcuE", "urlToImage": null, "publishedAt": "2023-01-28T11:02:34Z", "content": "Triathlon is a multi-sport race involving cycling, swimming, and running. It requires vigorous body movement and agility"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Sade Agard", "title": "Launched by a diamond? Unveiling Davemaoite's deep Earth mysteries - Interesting Engineering", "description": "An interview with the mineralogist who discovered the never-before-seen lower mantle mineral, Davemaoite, reveals more about Earth's mantle.", "url": "https://interestingengineering.com/science/unveiling-davemaoites-deep-earth-mysteries", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/01/24/image/png/M9dAurZrIZ57BzVsEEKTEgmh3INMdvClwhDFPW78.png", "publishedAt": "2023-01-28T09:38:00Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Navigational Skills For Underwater Robots Can Be Enhanced With Fish Sensory Organ- Study - India Education Diary", "description": "Scientists, led by University of Bristol, have been studying a fish sensory organ to understand cues for collective behaviour which could be employed on underwater robots.This work was centred around the lateral line sensing organ in African cichlid", "url": "https://indiaeducationdiary.in/navigational-skills-for-underwater-robots-can-be-enhanced-with-fish-sensory-organ-study/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/Cichlid-article.jpg?fit=500%2C333&ssl=1", "publishedAt": "2023-01-28T09:24:46Z", "content": "Scientists, led by University of Bristol, have been studying a fish sensory organ to understand cues for collective behaviour which could be employed on underwater robots.\r\nThis work was centred arou… [+2452 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": "More from this author", "title": "Can Exoplanets Have Their Own Moons? » Science ABC - Science ABC", "description": "While researchers have made strides in astronomy, finding exomoons have been difficult. But they seem to be making progress in recent times.", "url": "https://www.scienceabc.com/nature/universe/can-exoplanets-have-their-own-moons.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2023/01/beautiful-exoplanet-with-exo-moons-orbiting-an-alien-binary-star-system.jpg", "publishedAt": "2023-01-28T08:00:00Z", "content": "While researchers have made strides in astronomy, finding exomoons has been difficult, but they seem to be making more progress in recent years.\r\nOne of the most exciting and sought-after fields in m… [+8354 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists realized an effective curved spacetime in the lab - Tech Explorist", "description": "Scientists simulated an entire family of universes with curvature in ultracold quantum gases.", "url": "https://www.techexplorist.com/effective-curved-spacetime-lab/56467/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/01/curved-space.jpg", "publishedAt": "2023-01-28T06:52:03Z", "content": "The description of subsequent dynamics and related questions in cosmology requires an understanding of the quantum fields of the standard model and dark matter in curved spacetime. Even the reduced p… [+3197 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Mukesh Bansal", "title": "Why leading athletes invest in ice baths, saunas, red light therapy - ThePrint", "description": "In 'Hacking Health', Mukesh Bansal suggests recovery techniques well-suited to specific stressors or matched to specific health goals.", "url": "https://theprint.in/pageturner/why-leading-athletes-invest-in-ice-baths-saunas-red-light-therapy/1339679/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/09/Feature-Image-33-1.jpg", "publishedAt": "2023-01-28T06:31:49Z", "content": "The human body is pretty amazing and is able to repair itself from wear and tear in almost magical ways, from the way a cut scabs over until it seems as though the wound never existed, to the way you… [+7511 chars]"}]}