{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Another Bright Comet Is Heading to Earth - Gizmodo", "description": "An icy space rock will shine brighter than the recent Green Comet—if it survives a close encounter with the Sun.", "url": "https://gizmodo.com/comet-c-2023-a3-close-approach-earth-2024-brightness-1850193235", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/90141f27d1a717761dbc23a3236c8799.jpg", "publishedAt": "2023-03-06T19:40:00Z", "content": "An incoming comet recently spotted by telescopes in China and South Africa could be as bright as a planet in the night sky next year, according to astronomers who studied the object.\r\nThe cometan acc… [+1630 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Laura Dobberstein", "title": "The cause of last December's failed satellite launch? Nozzle material, says ESA - The Register", "description": "Arianespace Vega-C rocket failure sent two Airbus satellites into the Atlantic Ocean", "url": "https://www.theregister.com/2023/03/06/nozzle_material_determined_cause_of/", "urlToImage": "https://regmedia.co.uk/2023/03/06/vv22_launch_image.jpg", "publishedAt": "2023-03-06T15:33:00Z", "content": "In December of last year, two of Airbus Pléiades Neo Earth-imaging satellites intended for a polar Sun-synchronous orbit aboard an Arianespace Vega C rocket ended up in the Atlantic Ocean instead.\r\nT… [+2834 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Thamarasee Jeewandara", "title": "Single-pulse real-time billion-frames-per-second planar imaging of ultrafast nanoparticle-laser dynamics - Phys.org", "description": "The soot produced by unburnt hydrocarbon flames is the second largest contributor to global warming, while also harming human health. Researchers have developed state-of-the-art, high-speed imaging techniques to study turbulent flames, yet they are limited to…", "url": "https://phys.org/news/2023-03-single-pulse-real-time-billion-frames-per-second-planar-imaging.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/single-pulse-real-time.jpg", "publishedAt": "2023-03-06T14:45:03Z", "content": "LS-CUP for time-resolved 2D imaging of laser-induced flame signals. (a) Photograph of the studied flame. The regions of investigation at heights h1 and h2 are labeled. (b) Illustrations of four optic… [+9643 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New magnetic cataclysmic variable detected - Phys.org", "description": "By analyzing the data from the Spektr-RG (SRG) spacecraft and the Transiting Exoplanet Survey Satellite (TESS), astronomers have detected a new magnetic cataclysmic variable. The new object, designated SRGE J075818-612027, is most likely of the polar subtype.…", "url": "https://phys.org/news/2023-03-magnetic-cataclysmic-variable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-magnetic-cataclysm.jpg", "publishedAt": "2023-03-06T14:43:16Z", "content": "By analyzing the data from the Spektr-RG (SRG) spacecraft and the Transiting Exoplanet Survey Satellite (TESS), astronomers have detected a new magnetic cataclysmic variable. The new object, designat… [+3558 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Nasa's new science chief says 'it's the best job on the planet' - BBC", "description": "Dr Nicola Fox, originally from Hertfordshire, is the first woman to become Nasa's head of science.", "url": "https://www.bbc.com/news/uk-england-beds-bucks-herts-64855011", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2FF3/production/_128857221_nicola_fox.jpg", "publishedAt": "2023-03-06T06:05:53Z", "content": "The first woman to become Nasa's head of science has said \"it's the best job on the planet\". \r\nDr Nicola Fox, Nasa's former director of Heliophysics, comes from Hertfordshire and now works in Washing… [+2166 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Odds Of A Quantum Tunnelling Event Are One In A Hundred Billion - IFLScience", "description": "Quantum tunnelling is a rare event that should be impossible under classical physics, but it is only now we are learning just how rare real-world examples are.", "url": "https://www.iflscience.com/odds-of-a-quantum-tunneling-event-are-one-in-a-hundred-billion-67820", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67820/aImg/66190/quantum-wall-meta.png", "publishedAt": "2023-03-06T04:25:00Z", "content": "The rate at which the rare but crucial quantum phenomenon known as tunneling occurs has been measured experimentally for the first time, and found to match theoretical calculations. The theoretical e… [+3357 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Time Is It on the Moon? Advancing a New Lunar Timezone - SciTechDaily", "description": "A new era of lunar exploration is on the rise, with dozens of Moon missions planned for the coming decade. Europe is in the forefront here, contributing to building the Gateway lunar station and the Orion spacecraft – set to return humans to our natural satel…", "url": "https://scitechdaily.com/what-time-is-it-on-the-moon-advancing-a-new-lunar-timezone/", "urlToImage": "https://scitechdaily.com/images/Moon-Surface-Scenario-scaled.jpg", "publishedAt": "2023-03-06T03:30:25Z", "content": "ByEuropean Space Agency (ESA)March 5, 2023\r\nA high-definition image of Earth taken by Japans Kaguya lunar orbiter in November 2007. Credit: JAXA/NHK\r\nA new era of lunar exploration is on the rise, wi… [+11936 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Supermassive Black Hole Lurking at Edge of the Universe is One of Biggest Ever Detected–and 'Completely Unexpected' - Good News Network", "description": "A supermassive black hole discovered at the edge of the universe is one of the biggest ever detected, containing over a billion solar masses", "url": "https://www.goodnewsnetwork.org/supermassive-black-hole-at-edge-of-universe-is-one-of-biggest-ever-detected/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/03/supermassive-black-hole-SWNS.jpeg", "publishedAt": "2023-03-05T22:13:34Z", "content": "This system consists of a pair of galaxies, dubbed IC 694 and NGC 3690, which made a close pass some 700 million years ago. As a result of this interaction, the system underwent a fierce burst of sta… [+3538 chars]"}, {"source": {"id": null, "name": "Thenewstack.io"}, "author": "David Cassel", "title": "NASA's Thirst for Open Source Software — and for Open Science - The New Stack", "description": "Naturally, NASA's need for high-quality scientific software has led it to open source, and now to an ambitious new program based on the larger principles of \"open science.\"", "url": "https://thenewstack.io/nasas-thirst-for-open-source-software-and-for-open-science/", "urlToImage": "https://cdn.thenewstack.io/media/2023/03/7b0a9b3a-badbc2a1-open-source-software-used-by-nasa-screenshot-from-steve-crawford-fosdem-talk-nasa-and-open-source-2023.jpg", "publishedAt": "2023-03-05T18:08:39Z", "content": "NASA's Thirst for Open Source Software and for Open Science\r\nNaturally, NASA's need for high-quality scientific software has led it to open source, and now to an ambitious new program based on the la… [+33 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Cosmic Model To Reveal What's Inside Colliding Black Holes - SciTechDaily", "description": "A research paper uses new methods to analyze the waves that black holes emit when they collide. In 2015, scientists for the first time detected gravitational waves, ripples in space-time that occur when major cosmic events—like the collision and merging of tw…", "url": "https://scitechdaily.com/a-new-cosmic-model-to-reveal-whats-inside-colliding-black-holes/", "urlToImage": "https://scitechdaily.com/images/Two-Black-Holes-Collide-Merge.jpg", "publishedAt": "2023-03-05T03:17:00Z", "content": "ByColumbia UniversityMarch 4, 2023\r\nAn artists impression of two black holes about to collide and merge. New research has led to the development of a more sophisticated model for modeling cosmic even… [+2466 chars]"}]}