{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Silver nanoparticles show promise in fighting antibiotic-resistant bacteria - Science Daily", "description": "A new study found that small amounts of silver nanoparticles combined with a low dose of a common antibiotic inhibited the growth of resistant bacteria.", "url": "https://www.sciencedaily.com/releases/2023/01/230131183142.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-02-01T00:24:18Z", "content": "In a new study, scientists with the University of Florida found that a combination of silver nanoparticles and antibiotics was effective against antibiotic-resistant bacteria.The researchers hope to … [+3043 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A new catalyst that transforms carbon dioxide into added-value chemical products - Phys.org", "description": "Global warming is an increasingly worrying problem. Although the greenhouse effect is a necessary process to maintain living conditions on Earth, our current societies are increasing the emission of greenhouse gases into the atmosphere and increasing its temp…", "url": "https://phys.org/news/2023-01-catalyst-carbon-dioxide-added-value-chemical.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/a-new-catalyst-that-tr.jpg", "publishedAt": "2023-01-31T22:18:31Z", "content": "Global warming is an increasingly worrying problem. Although the greenhouse effect is a necessary process to maintain living conditions on Earth, our current societies are increasing the emission of … [+2930 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Researchers uncover the diversity of viroids and viroid-like agents - Phys.org", "description": "A team of researchers from the National Library of Medicine (NLM) and collaborating academic research institutions have developed a computational pipeline to identify and better understand viroids and viroid-like covalently closed circular RNAs (cccRNAs, also…", "url": "https://phys.org/news/2023-01-uncover-diversity-viroids-viroid-like-agents.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-uncover-th.jpg", "publishedAt": "2023-01-31T22:05:16Z", "content": "A team of researchers from the National Library of Medicine (NLM) and collaborating academic research institutions have developed a computational pipeline to identify and better understand viroids an… [+2374 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Recreating the natural light-harvesting nanorings in photosynthetic bacteria - Phys.org", "description": "Nearly all the chemical energy available to Earth's lifeforms can be traced back to the sun. This is because light-harvesting (LH) supramolecules (two or more molecules held together by intermolecular forces) enable plants and some types of bacteria (typicall…", "url": "https://phys.org/news/2023-01-recreating-natural-light-harvesting-nanorings-photosynthetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/recreating-the-natural.jpg", "publishedAt": "2023-01-31T21:21:03Z", "content": "Nearly all the chemical energy available to Earth's lifeforms can be traced back to the sun. This is because light-harvesting (LH) supramolecules (two or more molecules held together by intermolecula… [+3866 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Scientists release new accurate map of all matter in universe - ThePrint", "description": "Chicago [US], February 1 (ANI): Sometimes you need to first locate the issue in order to identify it. The planets, stars, and galaxies that we know and love today were created throughout time as a result of stuff being thrown outward at the beginning of the u…", "url": "https://theprint.in/science/scientists-release-new-accurate-map-of-all-matter-in-universe/1346403/", "urlToImage": null, "publishedAt": "2023-01-31T21:13:39Z", "content": "Chicago [US], February 1 (ANI): Sometimes you need to first locate the issue in order to identify it.\r\nThe planets, stars, and galaxies that we know and love today were created throughout time as a r… [+4598 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Researchers take a step toward novel quantum simulators - Nanowerk", "description": "If scaled up successfully, the team's new system could help answer questions about certain kinds of superconductors and other unusual states of matter.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=62283.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id62283_1.jpg", "publishedAt": "2023-01-31T21:08:21Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "SpaceX’s Falcon 9 rocket launches 50 satellites. See details - Economic Times", "description": "SpaceXs Falcon 9 rocket, which is carrying 49 Starlink spacecraft and a rideshare payload from an Italy-based company D-Orbit, lifted off from California's Vandenberg Space Force Base on Tuesday.", "url": "https://economictimes.indiatimes.com/news/international/us/spacexs-falcon-9-rocket-launches-50-satellites-see-details/articleshow/97503112.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97503117,width-1070,height-580,imgsize-4678,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-31T19:04:00Z", "content": "SpaceX launched around 50 satellites towards orbit with the help of its Falcon 9 rocket on Tuesday (January 31). The rocket then returned down to Earth in what can be called a pinpoint landing on a s… [+1595 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "James Webb Space Telescope recovers from 2nd instrument glitch - Space.com", "description": "The famed telescope resumed full science operations on Monday (Jan. 30).", "url": "https://www.space.com/james-webb-space-telescope-niriss-glitch-recovery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ryN3xsShU5Jo779xP5NAWT-1200-80.jpg", "publishedAt": "2023-01-31T18:13:48Z", "content": "NASA's powerful $10 billion space telescope is firing on all cylinders again.\r\nThe James Webb Space Telescope (JWST or Webb) returned to full science operations on Monday (Jan. 30), recovering from a… [+2532 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Webb telescope catches early galaxy formation in action - Phys.org", "description": "Astronomers from the Cosmic Dawn Center have unveiled the nature of the densest region of galaxies seen with the James Webb Space telescope in the early universe. They find it to be likely the progenitor of a massive, Milky Way-like galaxy, seen at a time whe…", "url": "https://phys.org/news/2023-01-webb-telescope-early-galaxy-formation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/early-galaxy-formation.jpg", "publishedAt": "2023-01-31T17:58:42Z", "content": "Astronomers from the Cosmic Dawn Center have unveiled the nature of the densest region of galaxies seen with the James Webb Space telescope in the early universe. They find it to be likely the progen… [+4795 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Time Lapse Video Of 12-Years Shows Planets Dancing Around A Star - NDTV", "description": "Mr Wang utilised a technique known as \"adaptive optics\" to create the clip and removed visual blurring brought on by the Earth's atmosphere. I", "url": "https://www.ndtv.com/feature/time-lapse-video-of-12-years-shows-planets-dancing-around-a-star-3741057", "urlToImage": "https://c.ndtvimg.com/2023-01/0r25gpvo_star_625x300_31_January_23.jpg", "publishedAt": "2023-01-31T17:26:56Z", "content": "The clip was formed after time lapses were assembled from 12 years of observations.\r\nA new video released by Northwestern University shows four bright dots of light moving around a central black disc… [+2176 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "An illuminated water droplet creates an 'optical atom' - Science Daily", "description": "Shining light on a water droplet creates effects analogous to what happens in an atom. This can help us understand how atoms work, write researchers.", "url": "https://www.sciencedaily.com/releases/2023/01/230131101920.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-31T17:12:31Z", "content": "Shining light on a water droplet creates effects analogous to what happens in an atom. This can help us understand how atoms work, write researchers from the University of Gothenburg in a new journal… [+2993 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Biological patterns: Directed by intracellular flows - Science Daily", "description": "Physicists have shown how fluid flows influence the formation of complex patterns.", "url": "https://www.sciencedaily.com/releases/2023/01/230131101904.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-31T17:10:46Z", "content": "The formation of patterns is a universal phenomenon that underlies fundamental processes in biology. An example are the concentration patterns of proteins, which direct vital cellular processes, incl… [+2076 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "A Spiral Amongst Thousands - HubbleWebbESA", "description": "This video highlights the field of stars and galaxies surrounding the spiral galaxy LEDA 2046648. Webb’s NIRCam instrument has picked out a profusion of smal...", "url": "https://www.youtube.com/watch?v=7P-hCmjCPcQ", "urlToImage": "https://i.ytimg.com/vi/7P-hCmjCPcQ/hqdefault.jpg", "publishedAt": "2023-01-31T16:47:38Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Earth's inner core may have temporarily stopped turning, could reverse - FOX 13 Tampa Bay", "description": "New research is suggesting that the rotation of Earth's inner core may have paused and it could even go into reverse. Every 7 decades the inner core slows do...", "url": "https://www.youtube.com/watch?v=y2WJJCz4qAc", "urlToImage": "https://i.ytimg.com/vi/y2WJJCz4qAc/hqdefault.jpg", "publishedAt": "2023-01-31T16:44:49Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "GrrlScientist", "title": "Why Did These Carnivorous Plants Switch Their Diet From Bugs To Poop? - Forbes", "description": "Insect-eating carnivorous plants that evolved to feed on animal droppings have a more nutritious diet than their carnivorous cousins", "url": "https://www.forbes.com/sites/grrlscientist/2023/01/31/why-did-these-carnivorous-plants-switch-their-diet-from-bugs-to-poop/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63d90a095dd82247ff2e8c62/0x0.jpg?format=jpg&crop=2301,1295,x0,y27,safe&width=1200", "publishedAt": "2023-01-31T16:29:43Z", "content": "Carnivorous plants that evolved to feed on animal droppings have a more nutritious diet than their insect-eating cousins\r\n© Copyright by GrrlScientist | hosted by Forbes\r\nA carnivorous pitcher plant … [+7239 chars]"}, {"source": {"id": null, "name": "TechHQ"}, "author": "James Tyrrell", "title": "Jump to it: insect robots spring into action - TechHQ", "description": "Jumping insect robots could provide remote imaging on the ground to complement agricultural drones monitoring crops from the air.", "url": "https://techhq.com/2023/01/jump-to-it-insect-robots-spring-into-action/", "urlToImage": "https://cdn1.techhq.com/wp-content/uploads/2023/01/insect-robot-v2-1080px.jpg", "publishedAt": "2023-01-31T15:30:30Z", "content": "Agriculture is a fast-growing sector when it comes to robotics and automation. Drones are taking off in a big way, helping farmers to not just rapidly monitor acres of crops from the air, but also ap… [+4891 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists couple terahertz radiation with spin waves - Phys.org", "description": "An international research team led by the Helmholtz-Zentrum Dresden-Rossendorf (HZDR) has developed a new method for the efficient coupling of terahertz waves with much shorter wavelengths, so-called spin waves. As the experts report in the journal Nature Phy…", "url": "https://phys.org/news/2023-01-scientists-couple-terahertz.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/magnetic-sandwich-medi.jpg", "publishedAt": "2023-01-31T15:17:27Z", "content": "An international research team led by the Helmholtz-Zentrum Dresden-Rossendorf (HZDR) has developed a new method for the efficient coupling of terahertz waves with much shorter wavelengths, so-called… [+6174 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Amanda Morris", "title": "Biorefinery uses microbial fuel cell to upcycle resistant plant waste - Tech Xplore", "description": "When nature designed lignin—the fibrous, woody material that gives plants their rigid structure—it didn't cut any corners. Incredibly slow to break down, lignin is so sturdy and long lasting that it is resistant to bacteria and rot.", "url": "https://techxplore.com/news/2023-01-biorefinery-microbial-fuel-cell-upcycle.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/biorefinery-uses-micro.jpg", "publishedAt": "2023-01-31T14:59:01Z", "content": "When nature designed ligninthe fibrous, woody material that gives plants their rigid structureit didn't cut any corners. Incredibly slow to break down, lignin is so sturdy and long lasting that it is… [+7479 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Understanding the Impact of Tipping Behavior Across Ecosystems - AZoCleantech", "description": "The tipping of one element of the Earth’s system has been speculated to catalyze the tipping of others in a cascade. A study provides an example of an alternative option in which the breakdown of one component may reduce the likelihood of another system tippi…", "url": "https://www.azocleantech.com/news.aspx?newsID=32878", "urlToImage": "https://www.azocleantech.com/themes/Standard/images/full_site_logo.png", "publishedAt": "2023-01-31T14:40:00Z", "content": "The tipping of one element of the Earth’s system has been speculated to catalyze the tipping of others in a cascade. A new study provides an example of an alternative option in which the breakdown of… [+3292 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Mie Voids Could Manipulate and Control Light in Air - AZoOptics", "description": "Resonant optical phenomena in dielectrics and metals have boundless applications in numerous fields. The nanoscale confinement enables unmatched control of light–matter interaction at interfaces and surfaces, exploiting and governing the light flow.", "url": "https://www.azooptics.com/News.aspx?newsID=28174", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/SocialSharingImage_28174_16751753705622198.png", "publishedAt": "2023-01-31T14:30:00Z", "content": "Resonant optical phenomena in dielectrics and metals have boundless applications in numerous fields. The nanoscale confinement enables unmatched control of light–matter interaction at interfaces and … [+4297 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Is artificial intelligence faster than brain learning? Study finds - Hindustan Times", "description": "Can the brain, with its limited realization of precise mathematical operations, compete with advanced artificial intelligence systems implemented on fast and parallel computers? From our daily experience we know that for many tasks the answer is yes!", "url": "https://www.hindustantimes.com/science/is-artificial-intelligence-faster-than-brain-learning-study-finds-101675168281058.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/31/1600x900/_2e92b2f8-647d-11e7-89bd-50891d422d4c_1675172069114_1675172069114.jpg", "publishedAt": "2023-01-31T13:47:23Z", "content": "Artificial intelligence has traditionally been derived from human brain dynamics. However, as compared to deep learning, brain learning has several important limitations (DL). First, efficient DL wir… [+2906 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Laurence Tognetti", "title": "South Korea's Danuri Mission Sends Home Pictures of the Earth and Moon - Universe Today", "description": "The Korea Aerospace Research Institute (KARI) both ended 2022 and started 2023 on a very high note as its first-ever lunar orbiter, Danuri, sent back black-and-white images of the Earth with the Moon’s surface in the foreground that were photographed between …", "url": "https://www.universetoday.com/159869/south-koreas-danuri-mission-sends-home-pictures-of-the-earth-and-moon/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/01/south-koreas-first-eve.jpg", "publishedAt": "2023-01-31T13:25:24Z", "content": "The Korea Aerospace Research Institute (KARI) both ended 2022 and started 2023 on a very high note as its first-ever lunar orbiter, Danuri, sent back black-and-white images of the Earth with the Moon… [+2039 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Can AI listen to signals sent by Aliens? Here's what study shows | Mint - Mint", "description": "It is a new era for SETI research that is opening up thanks to machine-learning technology, expert said", "url": "https://www.livemint.com/news/world/can-ai-listen-to-signals-sent-by-aliens-here-s-what-study-shows-11675168167727.html", "urlToImage": "https://images.livemint.com/img/2023/01/31/600x338/Alien_1675171134324_1675171134605_1675171134605.jpg", "publishedAt": "2023-01-31T13:20:17Z", "content": "The existence of aliens has always intrigued us and for decades, humans have put a lot of research into the topic. And in such an endavour, artificial intelligence (AI) is being used to find whether … [+2214 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Saumya joshi", "title": "'Mysterious' flying spiral appears among stars above Hawaii's Mauna Kea volcano - Republic World", "description": "A Japanese telescope, Subaru Telescope, spotted a mysterious spiral-like formation spinning through the night sky just above Hawaii's volcano Mauna Kea.", "url": "https://www.republicworld.com/science/space/mysterious-flying-spiral-appears-among-stars-above-hawaiis-mauna-kea-volcano-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/u2rx2zyoqiqulbws_1675160171.jpeg", "publishedAt": "2023-01-31T12:52:00Z", "content": "A Japanese telescope, Subaru Telescope, spotted a mysterious spiral-like formation spinning through the night sky just above Hawaii's volcano Mauna Kea, reported Washington Post. The formation was vi… [+2212 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "See the Mars sample transfer robotic arm in action - Animation - VideoFromSpace", "description": "See how the Sample Transfer Arm for the Mars Sample Return mission will work in this animation. Credit: ESA/NASA", "url": "https://www.youtube.com/watch?v=nh4de-u7lmY", "urlToImage": "https://i.ytimg.com/vi/nh4de-u7lmY/maxresdefault.jpg", "publishedAt": "2023-01-31T12:30:20Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute Of Technology Experts Develop Cap To Measure Cognition With Pulsed Laser Light - India Education Diary", "description": "Measuring activity in the human brain remains one of the greatest challenges in science and medicine. Despite recent technological advances in areas such as imaging and nanoscience, researchers still struggle to accurately detect cognition. Currently", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-experts-develop-cap-to-measure-cognition-with-pulsed-laser-light/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/Portable-cap.jpg?fit=900%2C600&ssl=1", "publishedAt": "2023-01-31T12:26:45Z", "content": "Measuring activity in the human brain remains one of the greatest challenges in science and medicine. Despite recent technological advances in areas such as imaging and nanoscience, researchers still… [+4875 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Michigan experts develop new model for dark matter - India Education Diary", "description": "Dark matter remains one of the greatest mysteries of modern physics. It is clear that it must exist, because without dark matter, for example, the motion of galaxies cannot be explained. But it has never been possible to detect dark matter in an expe", "url": "https://indiaeducationdiary.in/university-of-michigan-experts-develop-new-model-for-dark-matter/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Michigan-University.png?fit=1024%2C648&ssl=1", "publishedAt": "2023-01-31T11:08:34Z", "content": "Dark matter remains one of the greatest mysteries of modern physics. It is clear that it must exist, because without dark matter, for example, the motion of galaxies cannot be explained. But it has n… [+4277 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Researchers find new way to improve storage time of quantum information - Times of India", "description": "As part of the global push for practical quantum networks and quantum computers, an international team of scientists has made a breakthrough in retaining the quantum coherence of quantum dot spin qubits. These technologies will alter a wide range of >", "url": "https://timesofindia.indiatimes.com/videos/news/karnataka-bjps-kc-narayana-gowda-lauds-siddaramaiah-for-financial-aid/videoshow/97490619.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-97490619,imgsize-111350.cms", "publishedAt": "2023-01-31T11:00:13Z", "content": "Jan 31, 2023, 04:31PM ISTSource: ANIAs part of the global push for practical quantum networks and quantum computers, an international team of scientists has made a breakthrough in retaining the quant… [+941 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Numerical computation of electrical potential on a gas evolving electrode | Scientific Reports - Nature.com", "description": "Scientific Reports - Numerical computation of electrical potential on a gas evolving electrode", "url": "https://www.nature.com/articles/s41598-023-28592-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-28592-2/MediaObjects/41598_2023_28592_Fig1_HTML.png", "publishedAt": "2023-01-31T10:22:09Z", "content": "Figure 1\r\nMesh description. (a) Example of Fritz radii distribution showing the three populations. (b) Schematic example of surface meshing. Each rectangle corresponds to an element i. The size of me… [+25686 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "NASA Plans to Add Additional Asteroid Target for Lucy Mission — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: The Lucy mission spacecraft is on its more than 6-billion-kilometre trip to examine the Jupiter Trojan asteroids, and NASA announced that it is adding a new target for the mission. To undertake an engineering test of the spacecraft’s asteroid-t…", "url": "https://www.transcontinentaltimes.com/nasa-plans-add-additional-asteroid/", "urlToImage": "https://media.transcontinentaltimes.com/2023/01/Asteroid-300x169.jpg", "publishedAt": "2023-01-31T10:04:43Z", "content": "UNITED STATES: The Lucy mission spacecraft is on its more than 6-billion-kilometre trip to examine the Jupiter Trojan asteroids, and NASA announced that it is adding a new target for the mission. \r\nT… [+1859 chars]"}, {"source": {"id": null, "name": "Fatherly"}, "author": "Devan McGuinness", "title": "NASA Hubble Photo Shows Twinkling Lights Sparkling Through Technicolor Gas - Fatherly", "description": "A new photo released by the NASA/ESA Hubble Space Telescope proves that space is a magical wonder.", "url": "https://www.fatherly.com/news/twinkling-lights-sparkle-through-clouds-of-technicolor-gas-in-nasa-pic", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/1/30/112b8a99-8b19-48bc-9b03-c27da9b5e2aa-hubble_v372ori_potw2304a.jpg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.4893&fp-y=0.5515", "publishedAt": "2023-01-31T10:00:25Z", "content": "Stargazers on Earth get to witness the moon's changes and sometimes spot a meteor zipping through or even see Mars disappear behind the moon. With those amazing shows, we get to watch, its hard to im… [+1604 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Temperature-Sensitive Color-Changing Building Material - AZoM", "description": "Researchers have designed an innovative, new building material with chameleon-like properties that is able to change its infrared color and the amount of heat it emits or absorbs based on the outside temperature.", "url": "https://www.azom.com/news.aspx?newsID=60774", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_60774_16751521521879073.jpg", "publishedAt": "2023-01-31T09:37:00Z", "content": "Buildings are the predominant structure in modern cities, with most cities across the US housing more than 150 million buildings in any given metropolitan area. However, buildings are also one of the… [+4615 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA’s Perseverance rover completes ‘sample depot’ on Mars: Here’s how they will reach Earth - The Indian Express", "description": "NASA's Perseverance rover has dropped the tenth and last sample tube that will form a backup \"sample depot\" on the red planet. Here is how the space agency plans to return them to Earth and what it looking for.", "url": "https://indianexpress.com/article/technology/nasa-perseverance-mars-rover-sample-return-8415289/", "urlToImage": "https://images.indianexpress.com/2023/01/Perseverance-Mars-rover-20230131.jpg", "publishedAt": "2023-01-31T09:27:14Z", "content": "NASA announced on Wednesday that its Perseverance Rover, nicknamed Percy, has completed the first sample depot on another world by dropping the tenth and final sample tube. The tube will be part of a… [+4505 chars]"}, {"source": {"id": null, "name": "Alarabiya.net"}, "author": "Al Arabiya English", "title": "Life on Mars? Satellite shows carved outline of cute teddy bear - Al Arabiya English", "description": "Yogi, Paddington and Winnie the Pooh, move over. There’s a new bear in town. Or on Mars, anyway.The beaming face of a cute-looking teddy bear appears to ha", "url": "https://english.alarabiya.net/variety/2023/01/31/Life-on-Mars-Satellite-shows-carved-outline-of-cute-teddy-bear", "urlToImage": "https://vid.alarabiya.net/images/2023/01/31/8a1794ff-eed3-49d3-98a5-38c30688127f/8a1794ff-eed3-49d3-98a5-38c30688127f_16x9_600x338.jpg", "publishedAt": "2023-01-31T09:15:00Z", "content": "Yogi, Paddington and Winnie the Pooh, move over. Theres a new bear in town. Or on Mars, anyway.\r\nThe beaming face of a cute-looking teddy bear appears to have been carved into the surface of our near… [+1922 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Webb Telescope's observations reveals that the spectacular rings surrounding asteroid Chariklo are home to water ice | DH Latest News, DH NEWS, Latest News, NEWS, Science , Webb, Webb telescope, Webb Telescope's observations, telescope - East Coast Daily (English)", "description": "With the James Webb Space Telescope (JWST), the most potent telescope ever sent into space, the National Aeronautics and Space Administration (NASA) paved the way for a new era of astronomy. James Web", "url": "https://www.eastcoastdaily.in/2023/01/31/webb-telescopes-observations-reveals-that-the-spectacular-rings-surrounding-asteroid-chariklo-are-home-to-water-ice.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2023/01/02-44.jpg", "publishedAt": "2023-01-31T09:01:00Z", "content": "With the James Webb Space Telescope (JWST), the most potent telescope ever sent into space, the National Aeronautics and Space Administration (NASA) paved the way for a new era of astronomy. James We… [+891 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Ashwini Sakharkar", "title": "New technique to cool several nanoparticles simultaneously - Tech Explorist", "description": "A twin pack of cooled nanoparticles.", "url": "https://www.techexplorist.com/new-technique-cool-several-nanoparticles-simultaneously/56510/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/01/focused-laser-beams.jpg", "publishedAt": "2023-01-31T08:50:48Z", "content": "Either autonomous feedback controls levitated nanoparticle motion through a cavity or measurement-based feedback through external forces. Recent experiments on measurement-based ground-state cooling … [+3251 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amber Banerjee", "title": "Rolls-Royce goes nuclear: Unveils 1st micro-reactor for space propulsion and mining - Times of India", "description": "News News: The Rolls-Royce innovations and space website lists the micro-reactor that will aid in achieving high-mac propulsion using gas turbine and ramjet tech", "url": "https://timesofindia.indiatimes.com/auto/news/rolls-royce-goes-nuclear-unveils-1st-micro-reactor-for-space-propulsion-and-mining/articleshow/97484589.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97484845,width-1070,height-580,imgsize-1155662,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-01-31T08:38:00Z", "content": "2023 Hyundai Grand i10 Nios Review | Should you buy a hatchback instead of SUV? | TOI Auto"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Asteroid’s sudden flyby shows blind spot in planetary threat detection - The Indian Express", "description": "The discovery of an asteroid the size of a small shipping truck mere days before it passed Earth highlights a blind spot in our ability to predict those that could actually cause damage.", "url": "https://indianexpress.com/article/technology/asteroid-flyby-planetary-threat-detection-8414709/", "urlToImage": "https://images.indianexpress.com/2023/01/Asteroid-detection-20230131.jpg", "publishedAt": "2023-01-31T06:57:50Z", "content": "NASA for years has prioritized detecting asteroids much bigger and more existentially threatening than 2023 BU, the small space rock that streaked by 2,200 miles from the Earth’s surface, closer than… [+3469 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "NASA’s Chandra captured a massive knot-like collision of galaxy clusters - Tech Explorist", "description": "Untangling a knot of galaxy clusters.", "url": "https://www.techexplorist.com/nasa-chandra-captured-massive-knot-collision-galaxy-clusters/56503/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/01/Galaxy-cluster-Abell-2256.jpg", "publishedAt": "2023-01-31T06:46:09Z", "content": "Astronomers have observed a dramatic, continuing collision involving at least three galaxy clusters. Astronomers are using data from the Chandra X-ray Observatory of NASA, the XMM-Newton of the Europ… [+3670 chars]"}, {"source": {"id": null, "name": "Mongabay.com"}, "author": "Adititandon", "title": "[Commentary] Soil organic carbon as an indicator of health of agroecosystems requires qualification - Mongabay-India", "description": "The year 2022 saw a lot of frenzy around soil in the lead up to the United Nations Climate Change Conference (COP27) and the World Soil Day. The Coalition of Action for Soil Health (CA4SH), a multi-stakeholder organisation to improve global soil health, broug…", "url": "https://india.mongabay.com/2023/01/commentary-soil-organic-carbon-as-an-indicator-of-health-of-agroecosystems-requires-qualification/", "urlToImage": "https://imgs.mongabay.com/wp-content/uploads/sites/30/2023/01/31111508/Macerated_plant_remains_in_organic-rich_deposit_of_Kole_Wetlands_2.jpg", "publishedAt": "2023-01-31T06:05:53Z", "content": "<ul><li>Soil Organic Carbon (SOC) as an indicator for land and soil degradation, is becoming central to climate change mitigation attempts.</li><li>While SOC is a useful measure, it doesn’t fully cap… [+9817 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": "More from this author", "title": "The Ship Of Theseus Paradox: Who Are You? - Science ABC", "description": "The ship of Theseus paradox is a paradox which question identity of an object. If an object, say a ship, is gradually remade with new wood, is the ship now a new ship?", "url": "https://www.scienceabc.com/social-science/the-ship-of-theseus-paradox-who-are-you.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2022/12/Theseus-fighting-the-minotaur.jpg", "publishedAt": "2023-01-31T05:33:14Z", "content": "The ship of Theseus paradox is a paradox that questions the identity of an object. If an object, say a ship, is gradually remade with new wood, is the ship now a new ship? The paradox has been tackle… [+6621 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Astronomers Find 25 Hugely Powerful Fast Radio Bursts That Keep Repeating - ScienceAlert", "description": "Like gravitational waves (GWs) and gamma-ray bursts (GRBs), fast radio bursts (FRBs) are one of the most powerful and mysterious astronomical phenomena today.", "url": "https://www.sciencealert.com/astronomers-find-25-hugely-powerful-fast-radio-bursts-that-keep-repeating", "urlToImage": "https://www.sciencealert.com/images/2021-06/FRBs_1024.gif", "publishedAt": "2023-01-31T03:00:17Z", "content": "Like gravitational waves (GWs) and gamma-ray bursts (GRBs), fast radio bursts (FRBs) are one of the most powerful and mysterious astronomical phenomena today. These transient events consist of bursts… [+6531 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Fossil teeth show how brains grew in utero over years of human evolution - EastMojo", "description": "Fossilized bones help tell the story of what human beings and our predecessors were doing hundreds of thousands of years ago. But how can you learn about", "url": "http://www.eastmojo.com/world/2023/01/31/fossil-teeth-show-how-brains-grew-in-utero-over-years-of-human-evolution/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2023/01/fossils.jpg?fit=1420%2C700&ssl=1", "publishedAt": "2023-01-31T02:30:00Z", "content": "Fossilized bones help tell the story of what human beings and our predecessors were doing hundreds of thousands of years ago. But how can you learn about important parts of our ancestors life cycle l… [+7552 chars]"}, {"source": {"id": null, "name": "Newswaali.com"}, "author": null, "title": "NASA to send spacecraft to asteroid worth 70000 times global economy – Daily JinnahNews WAALI - News Waali", "description": "", "url": "https://newswaali.com/nasa-to-send-spacecraft-to-asteroid-worth-70000-times-global-economy-daily-jinnah-news-waali/", "urlToImage": "http://www.dailyjinnah.com/news/wp-content/uploads/2023/01/11-77.jpg", "publishedAt": "2023-01-31T00:21:11Z", "content": "California: NASA has announced sending a spacecraft to an important asteroid (asteroid) and it is said that the total value of precious metals on this planet is more than 70 thousand times the total … [+1214 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Mixing Between Species Reduces Vulnerability To Climate Change - Eurasia Review", "description": "Genetic diversity is the raw material that enables populations to evolve in response to changes in the environment – essentially, the more diversity the better. Rapid climate warming is challenging…", "url": "https://www.eurasiareview.com/31012023-mixing-between-species-reduces-vulnerability-to-climate-change/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2023/01/a-323.png?fit=800%2C450&ssl=1", "publishedAt": "2023-01-31T00:19:01Z", "content": "Genetic diversity is the raw material that enables populations to evolve in response to changes in the environment essentially, the more diversity the better.\r\nRapid climate warming is challenging ma… [+2427 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "NASA's Hubble telescope captures dazzling red glow of Soul Nebula - NewsBytes", "description": "NASA's Hubble Space Telescope has captured the brilliant reddish glow of Soul Nebula, also called Westerhout 5, which lies about 7000 light-years away", "url": "https://www.newsbytesapp.com/news/science/nasa-s-hubble-telescope-captures-brilliant-red-glow-of-soul-nebula/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l95520230130181002.jpeg", "publishedAt": "2023-01-30T23:55:04Z", "content": "NASA's Hubble telescope captures dazzling red glow of Soul Nebula\r\nNASA's Hubble Space Telescope has captured the brilliant reddish glow of Soul Nebula, also called Westerhout 5, which lies about 7,0… [+2196 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "Salesforce project is creating proteins with generative AI - TechSpot", "description": "Salesforce Research has been working on an innovative bio-application for artificial intelligence algorithms. ProGen is an AI model designed to create synthetic proteins. It was trained with...", "url": "https://www.techspot.com/news/97428-salesforce-project-creating-proteins-generative-ai.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/01/2023-01-30-image-14.jpg", "publishedAt": "2023-01-30T19:42:39Z", "content": "Why it matters: Generative AI technology can be much more than a mere threat to the livelihood of countless artists and writers. According to Salesforce, a perfectly trained ML algorithm can help wit… [+2371 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "50 States for Artemis - Episode 10 - NASA's Marshall Space Flight Center", "description": "From the ground to the Moon, suppliers across America are supporting NASA's #Artemis missions. Watch to learn more! #NASA #shorts", "url": "https://www.youtube.com/watch?v=zDKbzGaGtkw", "urlToImage": "https://i.ytimg.com/vi/zDKbzGaGtkw/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYKyATKH8wDw==&rs=AOn4CLDF8Hrum4yGMSvtmLj86HdiO6JN0w", "publishedAt": "2023-01-30T17:49:18Z", "content": null}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "James Webb finds the coldest ice in the universe, packed with life-nurturing molecules - ZME Science", "description": "The discovery of ice in the darkest, coldest regions of a molecular cloud opens a new window into the origin of the most complex molecules.", "url": "https://www.zmescience.com/science/news-science/james-webb-finds-the-coldest-ice-in-the-universe-packed-with-life-nurturing-molecules/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/01/weic2303a.jpg", "publishedAt": "2023-01-30T17:48:16Z", "content": "This image by the NASA/ESA/CSA James Webb Space Telescopes Near-InfraRed Camera (NIRCam) features the central region of the Chameleon I dark molecular cloud, which resides 630 light years away. Credi… [+6030 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "NASA Finalizing Secretive Decision on First Astronauts for the Artemis Moon Mission - Futurism", "description": "As the Artemis mission's 2024 launch date steadily approaches, NASA is undertaking its secretive selection process to decide who will be sent to the Moon.", "url": "https://futurism.com/the-byte/nasa-finalizing-artemis-astronauts", "urlToImage": "https://wp-assets.futurism.com/2023/01/Moonprint.jpg", "publishedAt": "2023-01-30T17:18:41Z", "content": "\"Its not always the most equitable or transparent process.\"\r\nShortlisted\r\nAs NASA's Artemis program plods toward a followup mission, the agency is undertaking its secretive selection process to decid… [+2063 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "We could have thousands of satellites in orbit by 2030: RAS exec - Inshorts", "description": "The Royal Astronomical Society (RAS) Deputy Executive Director Robert Massey, in a conference last week, said, \"There is the real prospect that we could see hundreds of thousands of satellites in orbit by the end of the decade.\" \"Detecting signals from other …", "url": "https://inshorts.com/en/news/we-could-have-thousands-of-satellites-in-orbit-by-2030-ras-exec-1675098306406", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2023/01_jan/30_mon/img_1675095893545_851.jpg?", "publishedAt": "2023-01-30T17:08:12Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Fungi's Drug-resistance Explained In Research - India Education Diary", "description": "Researchers are investigating how disease-causing fungi become resistant to antifungal drugs to help prevent potentially devastating consequences of the growing resistance harmful microbes are developing to drugs.“Antimicrobial drugs are fundamental", "url": "https://indiaeducationdiary.in/fungis-drug-resistance-explained-in-research/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/University-of-Alberta.jpeg?fit=600%2C400&ssl=1", "publishedAt": "2023-01-30T16:16:23Z", "content": "Researchers are investigating how disease-causing fungi become resistant to antifungal drugs to help prevent potentially devastating consequences of the growing resistance harmful microbes are develo… [+3761 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Queen Mary University of London researchers find the evolutionary secret of different animal life cycles - India Education Diary", "description": "For over 100 years, biologists have wondered why animals display different types of life cycles. Some species, like us humans and most vertebrates, develop directly into a fully formed—yet smaller—version of an adult. In contrast, many other animals", "url": "https://indiaeducationdiary.in/queen-mary-university-of-london-researchers-find-the-evolutionary-secret-of-different-animal-life-cycles/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/Queen-Mary-University-of-London.jpg?fit=281%2C180&ssl=1", "publishedAt": "2023-01-30T15:39:59Z", "content": "For over 100 years, biologists have wondered why animals display different types of life cycles. Some species, like us humans and most vertebrates, develop directly into a fully formedyet smallervers… [+4392 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Scientists just discovered a 17-pound meteorite in Antarctica - Interesting Engineering", "description": "Scientists recently secured five new meteorites in Antarctica. One of these space rocks is among the heaviest meteorites found on the frozen continent.", "url": "https://interestingengineering.com/science/rare-17-pound-meteorite", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/01/30/image/jpeg/TTxOl7ZCUzWXkglWb3yY9UgFZnuTk8qqJtHt52hm.jpg", "publishedAt": "2023-01-30T13:42:00Z", "content": "Research scientist at the Field Museum, Maria Valdes said in a press release, Size doesnt necessarily matter when it comes to meteorites, and even tiny micrometeorites can be incredibly scientificall… [+1235 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Researchers may have found the cause of star’s sudden 2020 slowdown - Devdiscourse", "description": "Read more about Researchers may have found the cause of star’s sudden 2020 slowdown  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2336186-researchers-may-have-found-the-cause-of-stars-sudden-2020-slowdown", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_01_2023_18_36_01_0954877.jpg?width=920&format=jpeg", "publishedAt": "2023-01-30T13:07:59Z", "content": "In 2020, SGR 1935+2154, a highly magnetic type of neutron star known as a magnetar, experienced a sudden slowdown and a few days later, it abruptly started emitting radio waves. The cosmic event attr… [+1769 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "New mathematical model demonstrates how body regulates potassium - ThePrint", "description": "Washington [US], January 30 (ANI): Potassium levels that are too high or too low might be lethal. A new mathematical model sheds insight on the often enigmatic ways in which the body manages this essential electrolyte. Potassium, a common mineral abundant in …", "url": "https://theprint.in/health/new-mathematical-model-demonstrates-how-body-regulates-potassium/1343282/", "urlToImage": null, "publishedAt": "2023-01-30T12:15:27Z", "content": "Washington [US], January 30 (ANI): Potassium levels that are too high or too low might be lethal. A new mathematical model sheds insight on the often enigmatic ways in which the body manages this ess… [+2449 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Ohio State University Expert Astronomers Go Ahead With New Method Technique To Find Starspots - India Education Diary", "description": "Astronomers have developed a powerful technique for identifying starspots, according to research presented this month at the 241st meeting of the American Astronomical Society.Our sun is at times dotted with sunspots, cool dark regions on the stellar", "url": "https://indiaeducationdiary.in/ohio-state-university-expert-astronomers-go-ahead-with-new-method-technique-to-find-starspots/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/1920_gettyimages-1285296091.jpg?fit=1024%2C683&ssl=1", "publishedAt": "2023-01-30T12:12:24Z", "content": "Astronomers have developed a powerful technique for identifying starspots, according to research presented this month at the 241st meeting of the American Astronomical Society.\r\nOur sun is at times d… [+3817 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "World's most powerful Inouye solar telescope offers fresh look at Sun's boiling surface - Republic World", "description": "The Inouye solar telescope in Hawai’i has offered a fresh glimpse into the happenings on the solar surface where the temperature is as high as 6,000°C.", "url": "https://www.republicworld.com/science/space/worlds-most-powerful-inouye-solar-telescope-offers-fresh-look-at-suns-boiling-surface-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/bt3imtx9bqpiu4n2_1675080407.jpeg", "publishedAt": "2023-01-30T12:08:00Z", "content": "The National Science Foundation (NSF) has released the latest visuals captured by the Inouye Solar Telescope of the Suns boiling surface. Located on the island of Maui in Hawaii, the Daniel K. Inouye… [+1841 chars]"}, {"source": {"id": null, "name": "Glassonweb.com"}, "author": null, "title": "Researchers Shed Light on the Physics Behind Glass Formation - Glass on Web", "description": "An international team of scientists has discovered new insights into the physics of vitrification – the process by which glass forms.", "url": "http://www.glassonweb.com/news/researchers-shed-light-physics-behind-glass-formation", "urlToImage": "http://www.glassonweb.com/sites/default/files/news/2023/scientists-window-physics-glass-formation.jpg", "publishedAt": "2023-01-30T10:44:41Z", "content": "Their findings, which centre on analysis of a common feature of glasses called the boson peak, could help pave the way for new developments in materials science.The peak can be observed in glass when… [+4363 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "How big is the largest possible earthquake? - Livescience.com", "description": "The amount of energy released in an earthquake is controlled by how much of the crust breaks. The good news is, we're not likely to see a magnitude 10.", "url": "https://www.livescience.com/largest-earthquake-possible", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VUi48jJogxFHiiEyUZAm4U-1200-80.jpg", "publishedAt": "2023-01-30T10:00:00Z", "content": "On May 22, 1960, a devastating earthquake hit southern Chile. For 10 minutes, the ground shook so violently that people were unable to stay on their feet. Cracks opened in roads, and buildings collap… [+7146 chars]"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Observing variations in soft X-ray signals - Innovation News Network", "description": "Researchers from Tokyo Metropolitan University have used numerical methods to model the variations observed in soft X-ray signals.", "url": "https://www.innovationnewsnetwork.com/observing-variations-in-soft-x-ray-signals/29328/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2023/01/Soft-X-ray-signals.png", "publishedAt": "2023-01-30T09:46:55Z", "content": "To compare, they analysed data from the Suzaku telescope and compared it with the modelling of solar winds interacting with the upper parts of our atmosphere. They succeeded in capturing how soft X-r… [+2670 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Details of Earth's Biggest Extinction Event Revealed by Mercury - Technology Networks", "description": "Definitive evidence of the cause of the Earth's largest extinction event has eluded experts, but new information from mercury released by volcanic eruptions brings new insights.", "url": "https://www.technologynetworks.com/applied-sciences/news/details-of-earths-biggest-extinction-event-revealed-by-mercury-369627", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369627/details-of-earths-biggest-extinction-event-revealed-by-mercury-369627-640x360.jpg?cb=20230130", "publishedAt": "2023-01-30T09:34:05Z", "content": "The Latest Permian Mass Extinction (LPME) was the largest extinction in Earths history to date, killing between 80-90% of life on the planet, though finding definitive evidence for what caused the dr… [+6132 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Sushant Singh", "title": "Is just smashing a spacecraft to an asteroid enough to save Earth or we need to rethink about it - The Tech Outlook", "description": "When astronauts first saw the Earth from the surface of the Moon they were astonished to see the blue floating planet in dark space. This reflects the vulnerability of Earth floating in the mid of the asteroids and planets.There is a number of astero", "url": "https://www.thetechoutlook.com/news/science/is-just-smashing-a-spacecraft-to-an-asteroid-enough-to-save-earth-or-we-need-to-rethink-about-it/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/01/2_20230129_225000_0001.jpg", "publishedAt": "2023-01-30T09:15:52Z", "content": "When astronauts first saw the Earth from the surface of the Moon they were astonished to see the blue floating planet in dark space. This reflects the vulnerability of Earth floating in the mid of th… [+1265 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble captures stunning view of turbulent cosmic Tarantula: Check it out - Devdiscourse", "description": "Read more about Hubble captures stunning view of turbulent cosmic Tarantula: Check it out on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2335779-hubble-captures-stunning-view-of-turbulent-cosmic-tarantula-check-it-out", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_01_2023_14_23_53_8059301.jfif?width=920&format=jpeg", "publishedAt": "2023-01-30T08:54:41Z", "content": "The Tarantula Nebula, a massive star-forming region located in the Large Magellanic Cloud, a satellite galaxy of the Milky Way, is a popular target for astronomers, due in part to the wealth of infor… [+1779 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Researchers Find New Method To Enable New Quantum Tech - India Education Diary", "description": "An international team of researchers has developed a new method of overcoming a key challenge for the development of future quantum tech.In a new paper published in the journal Physical Review X Quantum, the researchers describe how they may have sol", "url": "https://indiaeducationdiary.in/researchers-find-new-method-to-enable-new-quantum-tech/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/download-8-1.jpg?fit=305%2C165&ssl=1", "publishedAt": "2023-01-30T07:47:17Z", "content": "An international team of researchers has developed a new method of overcoming a key challenge for the development of future quantum tech.\r\nIn a new paper published in the journal Physical Review X Qu… [+3536 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Space rocks reveal surprising origin of Earth's life ingredients - Devdiscourse", "description": "Read more about Space rocks reveal surprising origin of Earth's life ingredients on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2335567-space-rocks-reveal-surprising-origin-of-earths-life-ingredients", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_06_2019_19_09_41_5510995.jpg?width=920&format=jpeg", "publishedAt": "2023-01-30T06:17:21Z", "content": "Researchers from the Imperial College London have found Earth's volatile chemicals, some of which form the building blocks of life, came from the outer Solar System - part beyond the asteroid belt, w… [+1955 chars]"}, {"source": {"id": null, "name": "Scienceabc.com"}, "author": "More from this author", "title": "How Do Squid Use Bacteria As Camouflage? - Science ABC", "description": "The Hawaiian bobtail squid has a symbiotic relationship with bioluminescent bacteria, that helps them camouflage by counterillumination", "url": "https://www.scienceabc.com/nature/animals/how-do-squid-use-bacteria-as-camouflage.html", "urlToImage": "https://www.scienceabc.com/wp-content/uploads/2023/01/A-tiny-Hawaiian-bobtail-squid-above-the-sand-at-night.jpg", "publishedAt": "2023-01-30T05:37:00Z", "content": "Hawaiin bobtail squid harbor a bacteria called Vibrio fischeri in special organs in their body. The bacteria is bioluminescent, and the light it gives off prevents the squid’s silhouette from being n… [+5118 chars]"}]}