{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA sending Artemis I back to launch pad in advance of Nov. 13 launch - WAAY-TV 31 News", "description": "This is the next step in the latest attempt to launch the rocket.", "url": "https://www.youtube.com/watch?v=BXi5Yn7JO5c", "urlToImage": "https://i.ytimg.com/vi/BXi5Yn7JO5c/maxresdefault.jpg", "publishedAt": "2022-11-03T22:26:00Z", "content": null}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "NASA “Flashlight” will hunt for hidden water on the moon - Freethink", "description": "NASA’s Lunar Flashlight mission will use reflections from laser light to measure lunar water hidden in permanently shadowed craters.", "url": "https://www.freethink.com/space/lunar-water", "urlToImage": "https://www.freethink.com/wp-content/uploads/2022/11/lunar-water-thumb.jpg?resize=1200,630", "publishedAt": "2022-11-03T22:00:00Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Total Lunar Eclipse 2022: Everything you need to know about last 'Blood Moon' of this year - ANI News", "description": "The Last solar eclipse of the year 2022 will be witnessed on Tuesday, November 8.", "url": "https://www.aninews.in/news/science/total-lunar-eclipse-2022-everything-you-need-to-know-about-last-blood-moon-of-this-year20221104031241", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221103214226.jpg", "publishedAt": "2022-11-03T21:42:00Z", "content": "New Delhi [India], November 4 (ANI): Get ready to witness the last total lunar eclipse of this year. North American Skygazers can see the moon to turning reddish tint on November 8.Almost a year afte… [+5983 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Sunlight-absorbing organic compounds are produced on the wet surfaces of atmospheric particles - Phys.org", "description": "Heterogenous oxidation reactions can occur upon mixing chemicals that are in two different physical states, such a liquid and a gas; for example, in the atmosphere the reaction of gaseous nitrate (NO3) free radicals reaching the wet surface of aerosol particl…", "url": "https://phys.org/news/2022-11-sunlight-absorbing-compounds-surfaces-atmospheric-particles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/sunlight-absorbing-org.jpg", "publishedAt": "2022-11-03T21:20:27Z", "content": "Heterogenous oxidation reactions can occur upon mixing chemicals that are in two different physical states, such a liquid and a gas; for example, in the atmosphere the reaction of gaseous nitrate (NO… [+3393 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: SpaceX launches first Falcon Heavy mission since 2019 from Florida; Tongan volcano eruption unleashed highest plume on record and more - Devdiscourse", "description": "The long-awaited Starliner mission carrying a crew of NASA astronauts to the International Space Station is the last step before the spacecraft can be certified for routine flights, and will mark a pivotal moment for Boeing's space unit as it struggles to com…", "url": "https://www.devdiscourse.com/article/technology/2238024-science-news-roundup-spacex-launches-first-falcon-heavy-mission-since-2019-from-florida-tongan-volcano-eruption-unleashed", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/11_06_2021_17_39_14_7149104.jpg?width=920&format=jpeg", "publishedAt": "2022-11-03T21:00:56Z", "content": "Following is a summary of current science news briefs.\r\nBoeing's first crewed Starliner spaceflight slips to April 2023\r\nBoeing's first Starliner capsule mission carrying humans has slipped from Febr… [+2283 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tongan Volcano Eruption Plume Soars \"Halfway To Space\", Highest On Record - NDTV", "description": "The powerful Jan. 15 underwater eruption of Tonga's Hunga Tonga-Hunga Ha'apai volcano in the South Pacific produced a plume that soared higher into Earth's atmosphere than any other on record - about 35 miles.", "url": "https://www.ndtv.com/world-news/tongan-volcano-eruption-plume-soars-halfway-to-space-highest-on-record-3488506", "urlToImage": "https://c.ndtvimg.com/2019-12/203ma0hg_volcano-generic_625x300_09_December_19.jpg", "publishedAt": "2022-11-03T20:33:20Z", "content": "The plume was composed primarily of water with some ash and sulfur dioxide. (Representational)\r\nWashington: The powerful Jan. 15 underwater eruption of Tonga's Hunga Tonga-Hunga Ha'apai volcano in th… [+4063 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Physics - Neutrino Astronomy Enters a New Era - Physics", "description": "Using the IceCube Neutrino Observatory in Antarctica, researchers have found significant evidence of a cosmic source of high-energy neutrinos.", "url": "https://physics.aps.org/articles/v15/171", "urlToImage": "https://physics.aps.org/assets/0a440436-7220-466a-b7a1-a5e0c33e31a1/e171_1_thumb.png", "publishedAt": "2022-11-03T18:39:33Z", "content": "An artist’s representation of a cosmic neutrino source shining above the IceCube Observatory at the South Pole. Beneath the ice are photodetectors that pick up the neutrino signals.\r\nDon your binocul… [+8085 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": "Michael\nBerger\n–", "title": "Incongruent results from proteomics core facilities compromise nanoparticle protein corona research - Nanowerk", "description": "Its significance of the protein corona for biomedical applications lies in its role of imparting a unique biological identity to the nanoparticle, which could be very different from the pristine nanoparticle surface. Robust characterization of the identity an…", "url": "https://www.nanowerk.com/spotlight/spotid=61775.php", "urlToImage": "https://www.nanowerk.com/spotlight/id61775x.jpg", "publishedAt": "2022-11-03T18:31:07Z", "content": "Become a Spotlight guest author! Join our large and growing group of guest contributors. Have you just published a scientific paper or have other exciting developments to share with the nanotechnolog… [+51 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Oldest Star Clusters In The Universe Identified Using James Webb Space Telescope. All You Need To Know - ABP Live", "description": "Small yellow-red dots surrounding the Sparkler galaxy, called sparkles, could either be young clusters actively forming stars, born three billion years after the Big Bang at the peak of star formation", "url": "https://news.abplive.com/science/oldest-star-clusters-in-the-universe-identified-using-james-webb-space-telescope-all-you-need-to-know-1561385", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/03/880549821d3e8a5c7092d923e1de1ae51667495234058324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-11-03T18:24:31Z", "content": "NASA released the James Webb Space Telescope's (JWST's) first image in July, 2022. It was a picture of the galaxy cluster SMACS 0723, which harbours thousands of galaxies. Known as Webb's First Deep … [+5894 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Gareth Dorrian, The Conversation", "title": "What are zombie planets? And what makes them spooky? - Scroll.in", "description": "Any planets orbiting a star when it goes supernova should be obliterated. Mysteriously though, a handful have been detected orbiting neutron stars.", "url": "https://scroll.in/article/1036211/what-are-zombie-planets-and-what-makes-them-spooky", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/182077-lzgjxucysg-1667137683.jpg", "publishedAt": "2022-11-03T18:00:00Z", "content": "All stars, including the Sun, have a finite lifetime. Stars shine by the process of nuclear fusion in which lighter atoms, such as hydrogen, fuse together to create heavier ones. This process release… [+6389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "100-Foot Asteroid To Shoot Past Earth On Friday, Says NASA - NDTV", "description": "The 100-foot-diameter asteroid 2022 UN5 is hurtling toward Earth at a speed of 29,520 kilometres per hour.", "url": "https://www.ndtv.com/world-news/100-foot-asteroid-to-shoot-past-earth-tomorrow-says-nasa-3488420", "urlToImage": "https://c.ndtvimg.com/2022-08/5hcpgaeo_asteroid-impact-650_625x300_18_August_22.jpg", "publishedAt": "2022-11-03T17:41:03Z", "content": "A 100-foot asteroid zooms in on Earth.\r\nA large asteroid will make a relatively close approach to Earth on Friday, NASA says, providing one of the best opportunities in years to gather data about a p… [+1600 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "'Stretched' nuclear states under the magnifying glass at the Krakow cyclotron - Phys.org", "description": "All chemical elements were formed in the process of evolution of the universe dominated by light atomic nuclei. The properties of these nuclei are therefore of crucial importance not only in astrophysics, but also in relation to our everyday life. Our knowled…", "url": "https://phys.org/news/2022-11-nuclear-states-magnifying-glass-krakow.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/stretched-nuclear-stat-1.jpg", "publishedAt": "2022-11-03T17:24:14Z", "content": "All chemical elements were formed in the process of evolution of the universe dominated by light atomic nuclei. The properties of these nuclei are therefore of crucial importance not only in astrophy… [+5652 chars]"}, {"source": {"id": null, "name": "Benzinga"}, "author": "PRNewswire", "title": "NASA to Provide Coverage of Preview Briefing, US Spacewalks - Benzinga", "description": "WASHINGTON, Nov. 3, 2022 /PRNewswire/ -- Astronauts aboard the International Space Station will conduct a series of U.S. spacewalks in November and December to install mounting hardware and a pair of rollout solar arrays", "url": "https://www.benzinga.com/pressreleases/22/11/n29551688/nasa-to-provide-coverage-of-preview-briefing-us-spacewalks", "urlToImage": null, "publishedAt": "2022-11-03T16:43:00Z", "content": "WASHINGTON, Nov. 3, 2022 /PRNewswire/ -- Astronauts aboard the International Space Station will conduct a series of U.S. spacewalks in November and December to install mounting hardware and a pair of… [+3101 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "NASA's CAPSTONE Probe Back to Full Operation and Headed for the Moon - ExtremeTech", "description": "NASA's commercial partner Advanced Space reports that CAPSTONE has righted itself and is on target to reach the moon this month.", "url": "https://www.extremetech.com/?p=340650", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2022/06/capstone_02-640x353.jpg", "publishedAt": "2022-11-03T16:37:00Z", "content": "As NASA prepares to return to the moon, all eyes are on the delayed Artemis 1 launch that will mark the first mission for the Space Launch System (SLS). Well, almost all eyes. The first phase of Arte… [+2354 chars]"}, {"source": {"id": null, "name": "Itnewsonline.com"}, "author": null, "title": "Leading STEAM Fashion Brand, SvahaUSA, Inspires Women and Girls This Holiday Season Who Love Space and Science - IT News Online", "description": "Leading STEAM Fashion Brand, SvahaUSA, Inspires Women and Girls This Holiday Season Who Love Space and Science", "url": "http://www.itnewsonline.com/PRNewswire/Leading-STEAM-Fashion-Brand-SvahaUSA-Inspires-Women-and-Girls-This-Holiday-Season-Who-Love-Space-and-Science/881987", "urlToImage": null, "publishedAt": "2022-11-03T16:30:16Z", "content": "<table><tr><td>Leading STEAM Fashion Brand, SvahaUSA, Inspires Women and Girls This Holiday Season Who Love Space and ScienceCopyright 2022 PR Newswire. All Rights Reserved2022-11-03</td></tr></table… [+4083 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Researchers Develop a Technique for Precise, Scalable, and Pristine Patterning of Nanoparticles - AZoNano", "description": "The precise arrangement of nanoparticles on arbitrary surfaces is highly desirable for leveraging their distinct properties in the preparation of highly functional nanoscale devices. However, realizing such surfaces is challenging.", "url": "https://www.azonano.com/news.aspx?newsID=39875", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39875_16674920651175946.jpg", "publishedAt": "2022-11-03T16:20:00Z", "content": "The precise arrangement of nanoparticles on arbitrary surfaces is highly desirable for leveraging their distinct properties in the preparation of highly functional nanoscale devices. However, realizi… [+9641 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Strongest Light-Matter Interaction in a Small Silicon Membrane - AZoNano", "description": "In an article published in Nature Communications, researchers achieved the strongest light-matter interaction in a small silicon membrane by incorporating topology optimization into measured fabrication constraints.", "url": "https://www.azonano.com/news.aspx?newsID=39874", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39874_16674918594178386.jpg", "publishedAt": "2022-11-03T16:19:00Z", "content": "In an article published in the journal Nature Communications, researchers achieved the strongest light-matter interaction in a small silicon membrane by incorporating topology optimization into measu… [+10416 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "A new quantum component made from graphene - Nanowerk", "description": "For the first time, researchers have been able to make a superconducting component from graphene that is quantum coherent and sensitive to magnetic fields. This step opens up interesting prospects for fundamental research.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=61774.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id61774.jpg", "publishedAt": "2022-11-03T16:16:12Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN,China Global Television Network", "title": "Chinese and U.S. scientists share views on deep space exploration - CGTN", "description": "A special program of the 2022 Tencent Science WE Summit – International Deep Space Dialogue – was held online on Thursday evening.Four scientists from China and the United States and an&nbsp;astronomy enthusiast had a dialogue and shared the latest discoveries", "url": "https://news.cgtn.com/news/2022-11-03/Chinese-and-U-S-scientists-share-views-on-deep-space-exploration-1eFoiR81eik/index.html", "urlToImage": "https://news.cgtn.com/news/2022-11-03/Chinese-and-U-S-scientists-share-views-on-deep-space-exploration-1eFoiR81eik/img/3652ae320c054525a900992451a57fab/3652ae320c054525a900992451a57fab-750.png", "publishedAt": "2022-11-03T15:53:56Z", "content": "A special program of the 2022 Tencent Science WE Summit International Deep Space Dialogue was held online on Thursday evening.\r\nFour scientists from China and the United States and an astronomy enthu… [+2060 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Firing protons at fluorine-19 helps explain calcium content in oldest observed star - Phys.org", "description": "An international team of researchers working at a research site situated a mile and a half below China's Jinping Mountains, has found via experimentation, a likely explanation for the high concentrations of calcium seen in the oldest known star. The group des…", "url": "https://phys.org/news/2022-11-protons-fluorine-calcium-content-oldest.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/stars-1.jpg", "publishedAt": "2022-11-03T15:30:02Z", "content": "An international team of researchers working at a research site situated a mile and a half below China's Jinping Mountains, has found via experimentation, a likely explanation for the high concentrat… [+2716 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Crows able to understand the concept of recursion - Phys.org", "description": "Researchers at the University of Tübingen have found via experimentation that crows are capable of understanding the concept of recursion. In their paper published in the journal Science Advances, Diana Liao, Katharina Brecht, Melissa Johnston and Andreas Nie…", "url": "https://phys.org/news/2022-11-crows-concept-recursion.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/crows-able-to-understa.jpg", "publishedAt": "2022-11-03T15:18:22Z", "content": "Researchers at the University of Tübingen have found via experimentation that crows are capable of understanding the concept of recursion. In their paper published in the journal Science Advances, Di… [+2456 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Preventing programmed destruction - Nature.com", "description": "This study identifies the Mycobacterium tuberculosis effector protein PtpB and shows that it counteracts gasdermin D-mediated pyroptosis and inflammatory cytokine release by altering the phospholipid composition of the host membrane.", "url": "https://www.nature.com/articles/s41579-022-00823-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41579-022-00823-9/MediaObjects/41579_2022_823_Figa_HTML.png", "publishedAt": "2022-11-03T14:49:20Z", "content": "Following sensing of microbial pathogens in the cytosol, the inflammasome mediates the proteolytic activation of pro-inflammatory caspases, the processing of interleukin-1 (IL-1) and IL-18, and the c… [+919 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Osaka University", "title": "Artificial Intelligence Makes Enzyme Engineering Easy - Newswise", "description": "You can't expect a pharmaceutical scientist to switch labs to the facilities available in a television studio and expect the same research output.", "url": "https://www.newswise.com/articles/artificial-intelligence-makes-enzyme-engineering-easy", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/11/03/6363ce5bb0846_Low-ResFig..png.png&width=600&height=600", "publishedAt": "2022-11-03T14:25:00Z", "content": "Newswise — Osaka, Japan – You can't expect a pharmaceutical scientist to switch labs to the facilities available in a television studio and expect the same research output. Enzymes behave exactly the… [+3943 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sarah Stanley", "title": "Water flow simulations using 3D models of fossils yield new clues to the evolution of tiny, ancient marine animals - Phys.org", "description": "About 536 million years ago, in the early Cambrian period, an abundance of different species of millimeter-scale marine organisms thrived in continental shelf habitats around the world. Today, their fossils yield clues to ancient ocean conditions and animal e…", "url": "https://phys.org/news/2022-11-simulations-3d-fossils-yield-clues.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/fluid-dynamics-of-tiny.jpg", "publishedAt": "2022-11-03T14:21:18Z", "content": "About 536 million years ago, in the early Cambrian period, an abundance of different species of millimeter-scale marine organisms thrived in continental shelf habitats around the world. Today, their … [+2977 chars]"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "High-Throughput Quantitative Phase Microscopy Holds Promise for Large-Scale Cell Studies - AZoOptics", "description": "Cell organelles perform a range of cellular life tasks. Their impairment is closely associated with cancer development and metastasis. Analysis of subcellular structures and their impaired states offers insights into the workings of pathologies, which may all…", "url": "https://www.azooptics.com/News.aspx?newsID=28085", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_28085_16674659496789233.jpg", "publishedAt": "2022-11-03T14:21:00Z", "content": "Nov 3 2022Reviewed by Emily Henderson, B.Sc.\r\nCell organelles perform a range of cellular tasks. Their impairment is closely associated with cancer development and metastasis. Analysis of subcellular… [+4116 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Describing the mechanism by which oxygen in the blood is detected - Phys.org", "description": "Hypoxia (oxygen deficiency), in addition to occurring in areas of considerable altitude, is a critical factor linked to various cardiopulmonary diseases of high morbidity and mortality in humans. The carotid body, a highly irrigated structure located in the c…", "url": "https://phys.org/news/2022-11-mechanism-oxygen-blood.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/describing-the-mechani.jpg", "publishedAt": "2022-11-03T14:07:03Z", "content": "Hypoxia (oxygen deficiency), in addition to occurring in areas of considerable altitude, is a critical factor linked to various cardiopulmonary diseases of high morbidity and mortality in humans. The… [+3688 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "NASA Discover Largest Meteor Impact Crater On Mars Since Exploration Began - msnNOW", "description": "NASA’s InSight lander recorded a magnitude 4 marsquake last Christmas Eve. Scientists only later learned the cause of that quake: a meteoroid strike estimated to be one of the biggest seen on Mars since NASA began exploring the cosmos. What’s more, the meteor…", "url": "https://www.msn.com/en-in/news/techandscience/nasa-discover-largest-meteor-impact-crater-on-mars-since-exploration-began/vi-AA13He6A?ocid=weather-verthp-feeds", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA13HbCQ.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-03T13:15:00Z", "content": "Like us on Facebook to see similar stories\r\nI am already a fan, don't show this again"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Earth's magnetic field could explain how our planet was formed - Innovation News Network", "description": "Scientists say that due resilience of Earth's magnetic field, researchers must consider it a factor in Earth-Moon formation.", "url": "https://www.innovationnewsnetwork.com/earths-magnetic-field-could-explain-how-planet-was-formed/26898/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2022/11/inn-earths-magnetic-field-002.jpg", "publishedAt": "2022-11-03T13:01:19Z", "content": "According to a new scientific assessment, a peculiar property of Earths magnetic field could help us to work out how the planet formed 4.5 billion years ago.\r\nMost theories about how the Earth and th… [+2348 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "In Pics: Spooky! NASA celebrates Halloween by sharing creepy images of Sun and more - HT Tech", "description": "Going with the Halloween theme, NASA surprised us with some really spooky images of various celestial objects! So, be prepared to be creeped out by the Sun, lightning, astronauts and more. Check out these creepy images shared by NASA.", "url": "https://tech.hindustantimes.com/photos/in-pics-spooky-nasa-celebrates-halloween-by-sharing-creepy-images-of-sun-and-more-71667478449350.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/03/1600x900/un_1667478972826_1667479032610_1667479032610.jpg", "publishedAt": "2022-11-03T12:43:23Z", "content": "Top SectionsExplore Tech\r\nCopyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Here’s How Gas Giant Exoplanets Act As an Anti-Ageing Formula for Their Host Stars and Keep Them ‘Young’ - The Weather Channel", "description": "Until now, researchers have lacked tangible documentation for these planets’ anti-ageing properties.", "url": "https://weather.com/en-IN/india/space/news/2022-11-03-gas-giant-exoplanets-as-anti-ageing-formula-for-host-stars", "urlToImage": "https://s.w-x.co/in-hot_jupiters.jpg", "publishedAt": "2022-11-03T12:36:14Z", "content": "You know how some stars just dont seem to age? And no, were not talking about Anil Kapoor, Keanu Reeves or any other humans blessed with good genetics, but the literal celestial stars that must count… [+2629 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Nasa Artemis: Live and work on the Moon - The Straits Times", "description": "Follow us on YouTube: https://str.sg/ytsubFor the first time in more than 50 years since Apollo, Nasa is edging closer to returning astronauts to the Moon un...", "url": "https://www.youtube.com/watch?v=k_7klOFLUvo", "urlToImage": "https://i.ytimg.com/vi/k_7klOFLUvo/maxresdefault.jpg", "publishedAt": "2022-11-03T12:22:10Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "A new model in optical fibers advances quantum sensing - Tech Explorist", "description": "This significantly reduced the limitations of internal loss and phase noise.", "url": "https://www.techexplorist.com/new-model-optical-fibers-advances-quantum-sensing/54642/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/quantum-entanglement.jpg", "publishedAt": "2022-11-03T11:25:43Z", "content": "Experimental limitations such as optical loss and noise have prevented entanglement-enhanced measurements from demonstrating a significant quantum advantage in sensitivity. In a study, the Optics and… [+2832 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Lunar eclipse, meteor shower, Spica: What's up in the skies in November - Economic Times", "description": "There are plenty of reasons to watch the skies in November. A total lunar eclipse, the Leonid meteors, and the chance to see the stars Elnath and Spi", "url": "https://economictimes.indiatimes.com/news/new-updates/lunar-eclipse-meteor-shower-spica-whats-up-in-the-skies-in-november/articleshow/95277697.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95277717,width-1070,height-580,imgsize-193450,overlay-economictimes/photo.jpg", "publishedAt": "2022-11-03T10:49:00Z", "content": "There are plenty of reasons to watch the skies in November, NASA has tweeted. A total lunar eclipse, the Leonid meteors, and the chance to see the stars Elnath and Spica.\r\nLumar eclipse\r\nA fortnight … [+1901 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bristol: Insects affect electric fields in the atmosphere, researchers find - India Education Diary", "description": "By measuring atmospheric electricity near a swarm of bees in flight, this study, published today in iScience, is the first to recognise biology as a source of space charge in the atmosphere.Previously, the team have studied how different organisms us", "url": "https://indiaeducationdiary.in/university-of-bristol-insects-affect-electric-fields-in-the-atmosphere-researchers-find/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/University_of_Bristol_logo-2.png?fit=1024%2C309&ssl=1", "publishedAt": "2022-11-03T10:18:44Z", "content": "By measuring atmospheric electricity near a swarm of bees in flight, this study, published today in iScience, is the first to recognise biology as a source of space charge in the atmosphere.\r\nPreviou… [+1873 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Sad ending! NASA's InSight spacecraft set to be killed on Mars - HT Tech", "description": "NASA's InSight spacecraft's death is expected to be announced next week. Check the latest details here.", "url": "https://tech.hindustantimes.com/tech/news/sad-ending-nasa-s-insight-spacecraft-set-to-be-killed-on-mars-71667469229918.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/03/1600x900/Untitled_design_-_2022-11-03T150241926_1667469268708_1667469268819_1667469268819.png", "publishedAt": "2022-11-03T10:06:30Z", "content": "It's a tale of a tragic end and a huge loss to humanity. NASA's InSight spacecraft is going to die soon. In a touching statement, the spacecraft said that the day is coming when it will fall silent f… [+3322 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Earth Observation Excellence Award deadline approaching - European Space Agency", "description": "In a little over a month, the window of opportunity for nominating deserving scientists for the prestigious ESA-EGU Earth Observation Excellence Award will close. With the period for lodging nominations closing on 7 December, past nominators and winners refle…", "url": "https://www.esa.int/Applications/Observing_the_Earth/Earth_Observation_Excellence_Award_deadline_approaching", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2022/09/earth_observation_excellence_award/24434899-1-eng-GB/Earth_Observation_Excellence_Award_pillars.jpg", "publishedAt": "2022-11-03T10:06:04Z", "content": "Applications03/11/2022153 views11 likes\r\nIn a little over a month, the window of opportunity for nominating deserving scientists for the prestigious ESA-EGU Earth Observation Excellence Award will cl… [+4250 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Oregon State University: Light-analyzing ‘lab on a chip’ opens door to widespread use of portable spectrometers - India Education Diary", "description": "Scientists including an Oregon State University materials researcher have developed a better tool to measure light, contributing to a field known as optical spectrometry in a way that could improve everything from smartphone cameras to environmental", "url": "https://indiaeducationdiary.in/oregon-state-university-light-analyzing-lab-on-a-chip-opens-door-to-widespread-use-of-portable-spectrometers/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Oregon-State-University.jpg?fit=1024%2C410&ssl=1", "publishedAt": "2022-11-03T09:09:17Z", "content": "Scientists including an Oregon State University materials researcher have developed a better tool to measure light, contributing to a field known as optical spectrometry in a way that could improve e… [+4117 chars]"}, {"source": {"id": null, "name": "Wdiy.org"}, "author": "Laurel Wamsley", "title": "Dozens of species were assumed to be mute — until they were recorded making sounds - WDIY", "description": "Some animals like birds and frogs are famous for the sounds they make. But have you ever heard a turtle talk? Most turtles were thought to not make sounds at all — before researchers went deep.", "url": "https://www.wdiy.org/npr-news/npr-news/2022-11-03/dozens-of-species-were-assumed-to-be-mute-until-they-were-recorded-making-sounds", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/98abc8d/2147483647/strip/true/crop/1422x747+0+160/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2022%2F11%2F01%2Fhydrophone-0ca6c7033dde5c5c707432e1a9b8d95ccddcc5f3.png", "publishedAt": "2022-11-03T09:01:00Z", "content": "In the animal kingdom, some creatures are famous for the sounds they make birds and their songs, cats and their meows, frogs and their ribbits.\r\nBut some animals are more quietly mysterious. Do turtl… [+3473 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Oregon State University: Volcanic activity and low ocean oxygen events linked to climate warming and rapid ice melt during last ice age, study finds - India Education Diary", "description": "A chemical analysis of sediment cores from the North Pacific Ocean show a consistent pairing of volcanic ash and hypoxia, a low ocean oxygen interval spanning thousands of years, during times of rapid climate warming at the end of the last ice age, n", "url": "https://indiaeducationdiary.in/oregon-state-university-volcanic-activity-and-low-ocean-oxygen-events-linked-to-climate-warming-and-rapid-ice-melt-during-last-ice-age-study-finds/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Oregon-State-University.jpg?fit=1024%2C410&ssl=1", "publishedAt": "2022-11-03T08:53:02Z", "content": "A chemical analysis of sediment cores from the North Pacific Ocean show a consistent pairing of volcanic ash and hypoxia, a low ocean oxygen interval spanning thousands of years, during times of rapi… [+4121 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New York University: Scientists Map Water in Molecular Crystals, Aiding Drug Development - India Education Diary", "description": "Molecular crystals—the building blocks that make up many drugs and other products—sometimes take on water molecules, which can alter the crystals in unforeseen ways. Notably, predicting which crystals are likely to contain water and at what level has", "url": "https://indiaeducationdiary.in/new-york-university-scientists-map-water-in-molecular-crystals-aiding-drug-development/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/New_York_University-Logo.wine_-2.png?fit=1024%2C683&ssl=1", "publishedAt": "2022-11-03T08:52:09Z", "content": "Molecular crystalsthe building blocks that make up many drugs and other productssometimes take on water molecules, which can alter the crystals in unforeseen ways. Notably, predicting which crystals … [+5847 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New York University: “That Just Sounds Wrong”—New Study Shows How Our Brains Tell Us When a Sound is Off - India Education Diary", "description": "Whether it’s a car door not properly closed, a shanked kick in football, or a misplaced note in music, our ears tell us when something doesn’t sound right. A team of neuroscientists has recently uncovered how the brain works to make distinctions betw", "url": "https://indiaeducationdiary.in/new-york-university-that-just-sounds-wrong-new-study-shows-how-our-brains-tell-us-when-a-sound-is-off/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/New_York_University-Logo.wine_-2.png?fit=1024%2C683&ssl=1", "publishedAt": "2022-11-03T08:47:33Z", "content": "Whether its a car door not properly closed, a shanked kick in football, or a misplaced note in music, our ears tell us when something doesnt sound right. A team of neuroscientists has recently uncove… [+3999 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "In awesome mission ‘Catch Me If You Can’, helicopter to capture electron rocket mid-air - HT Tech", "description": "Aerospace company Rocket Lab will attempt to catch an electron rocket mid-air using just a helicopter in a daring mission called ‘Catch me if you can’.", "url": "https://tech.hindustantimes.com/tech/news/in-awesome-mission-catch-me-if-you-can-helicopter-to-capture-electron-rocket-midair-71667463519351.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/03/1600x900/S92FlightTest001sm1_1667463706721_1667463711516_1667463711516.jpg", "publishedAt": "2022-11-03T08:24:23Z", "content": "The year 2022 has been the year of milestones in space tech. First, the NASA James Webb Space Telescope became operational and began sending us images of the universe from unimaginable distances. Sci… [+2134 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "NASA Posts Picture Of Waxing Crescent Moon With Stunning Colours Of The Atmosphere - News18", "description": "The waxing crescent moon was recently captured beautifully by NASA's International Space Station.", "url": "https://www.news18.com/news/buzz/nasa-posts-picture-of-waxing-crescent-moon-with-stunning-colours-of-the-atmosphere-6299467.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/nasa-166746057616x9.png", "publishedAt": "2022-11-03T07:53:03Z", "content": "The waxing crescent moon was recently captured beautifully by NASAs International Space Station. NASA reported that the image was taken on September 30, when the International Space Station (ISS) was… [+1917 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Trending Desk", "title": "NASA's Hubble Telescope Captures Image Of Mysterious Cosmic Keyhole - India.com", "description": "The picture has been captured by Hubble Space Telescope, which, in spite of the presence of James Webb Telescope, has not stopped working diligently.", "url": "https://www.india.com/viral/nasas-hubble-telescope-captures-image-of-mysterious-cosmic-keyhole-5721124/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/11/307767-cosmic-keyhole.jpg", "publishedAt": "2022-11-03T07:50:54Z", "content": "Trending News: NASA has captured an incredible image of what the space agency calls a ‘cosmic keyhole’. The picture has been captured by Hubble Space Telescope, which, in spite of the presence of Jam… [+1664 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "World’s first optical atomic clock with highly charged ions - Tech Explorist", "description": "Scientists have realized and evaluated a new type of optical atomic clock.", "url": "https://www.techexplorist.com/worlds-first-optical-atomic-clock-highly-charged-ions/54630/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/laser-interrogation.jpg", "publishedAt": "2022-11-03T06:19:18Z", "content": "Highly charged ions are a common form of matter in the cosmos. They are so-called because they have lost many electrons and have a high positive charge. This is why the outermost electrons are more s… [+3949 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Black Holes: How Do We See That Which Gives Off No Light? - Hubble Space Telescope", "description": "Stephanie La Massa, Space Telescope Science Institute Black holes are the most enigmatic objects in the universe, objects so dense that not even light can es...", "url": "https://www.youtube.com/watch?v=LWmTjp-UQfc", "urlToImage": "https://i.ytimg.com/vi/LWmTjp-UQfc/maxresdefault.jpg", "publishedAt": "2022-11-03T05:37:37Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: SpaceX launches first Falcon Heavy mission since 2019 from Florida; 'Dreaming of the Heavens': China launches final module to space station and more - Devdiscourse", "description": "Following is a summary of current science news briefs.  SpaceX launches first Falcon Heavy mission since 2019 from Florida  SpaceX's Falcon Heavy, the world's most-powerful active rocket, lifted off on Tuesday for the first time in more than three years throu…", "url": "https://www.devdiscourse.com/article/science-environment/2236792-science-news-roundup-spacex-launches-first-falcon-heavy-mission-since-2019-from-florida-dreaming-of-the-heavens-china-laun", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/15_09_2022_13_22_15_5594039.jpg?width=920&format=jpeg", "publishedAt": "2022-11-03T05:05:22Z", "content": "Following is a summary of current science news briefs.\r\nSpaceX launches first Falcon Heavy mission since 2019 from Florida\r\nSpaceX's Falcon Heavy, the world's most-powerful active rocket, lifted off … [+1656 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A Space Probe Brushed Past a Martian Moon to Take a Peek Inside - ScienceAlert", "description": "The long-standing mystery about the origin of the Martian moons could be a step closer to being solved.", "url": "https://www.sciencealert.com/a-space-probe-brushed-past-a-martian-moon-to-take-a-peek-inside", "urlToImage": "https://www.sciencealert.com/images/2022/11/phobos.jpg", "publishedAt": "2022-11-03T01:13:17Z", "content": "The long-standing mystery about the origin of the Martian moons could be a step closer to being solved.\r\nA space probe has come within dozens of kilometers of the larger of the two satellite siblings… [+4234 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Laurence Tognetti", "title": "The International Space Station Gets a Clean Bill of Health. Despite a Few Opportunistic Microbes, the Station is “Safe” for Astronauts - Universe Today", "description": "In a recent study published in Microbiome, a team of researchers led by NASA’s Jet Propulsion Laboratory conducted a five-year first-of-its-kind study investigating the microbiome (environmental profile) of the International Space Station (ISS). The purpose o…", "url": "https://www.universetoday.com/158473/the-international-space-station-gets-a-clean-bill-of-health-despite-a-few-opportunistic-microbes-the-station-is-safe-for-astronauts/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/11/microbeSamples_875pxx500px.jpg", "publishedAt": "2022-11-03T00:29:14Z", "content": "In a recent study published in Microbiome, a team of researchers led by NASAs Jet Propulsion Laboratory conducted a five-year first-of-its-kind study investigating the microbiome (environmental profi… [+2930 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "NASA detects 50+ methane “super-emitters” from space - Freethink", "description": "A new instrument aboard the International Space Station has been used to identify more than 50 “super-emitters” of methane.", "url": "https://www.freethink.com/environment/methane", "urlToImage": "https://www.freethink.com/wp-content/uploads/2022/10/methane-thumb.jpg?resize=1200,630", "publishedAt": "2022-11-02T22:00:00Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Ancient DNA analysis sheds light on the early peopling of South America: Study provides most complete genetic evidence to date of complex migration routes in Ancient Central and South America - Science Daily", "description": "Using DNA from two ancient humans unearthed in two different archaeological sites in northeast Brazil, researchers have unraveled the deep demographic history of South America at the regional level with some surprising results. Not only do they provide new ge…", "url": "https://www.sciencedaily.com/releases/2022/11/221102085438.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-02T21:27:44Z", "content": "The Americas were the last continent to be inhabited by humans. An increasing body of archaeological and genomic evidence has hinted to a complex settlement process. This is especially true for South… [+6418 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Doris Elin Urrutia", "title": "Milky Way stars photobomb picturesque spiral galaxy in stunning Hubble photo - Space.com", "description": "This galaxy is located 300 million light-years away, but the star to the right is much closer to Earth.", "url": "https://www.space.com/hubble-telescope-spiral-galaxy-NGC5495-sept2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MHevYwRjCBvBaCPAFW2svZ-1200-80.jpg", "publishedAt": "2022-11-02T19:00:13Z", "content": "The Hubble Space Telescope captured the sight of a beautiful spiral galaxy, adorned with the sparkle of two nearby stars.\r\nGalaxy NGC 5495 lies 300 million light-years from Earth, far behind the jewe… [+2382 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "LOFAR antennas unveil giant glow of radio emission surrounding cluster of galaxies - Phys.org", "description": "A Dutch-Italian-German team of astronomers has observed a huge glow of radio emission around a cluster of thousands of galaxies. They combined data from thousands of LOFAR antennas that were focused for 18 nights on an area the size of four full moons.", "url": "https://phys.org/news/2022-11-lofar-antennas-unveil-giant-radio.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/lofar-antennas-unveil.jpg", "publishedAt": "2022-11-02T18:00:04Z", "content": "A Dutch-Italian-German team of astronomers has observed a huge glow of radio emission around a cluster of thousands of galaxies. They combined data from thousands of LOFAR antennas that were focused … [+2772 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "U. Pittsburgh", "title": "Math clarifies how some fireflies twinkle in sync - Futurity: Research News", "description": "The same math that explains the synchronization of pendulum clocks and clapping audiences also clarifies how fireflies coordinate light shows.", "url": "https://www.futurity.org/mathematics-synchronization-fireflies-light-2823952/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/11/fireflies-firefly-1600.jpg", "publishedAt": "2022-11-02T17:03:33Z", "content": "Math borrowed from neuroscience can describe how swarms of fireflies coordinate their light show, researchers report.\r\nTheir new study captures key details about how fireflies behave in the wild.\r\n“T… [+3324 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "The first foreign crew of the International Space Station has arrived for a long mission - BollyInside", "description": "The first international crew arrived at the International Space Station (ISS) on November 2, 2000. The crew consisted of NASA astronauts William M.", "url": "https://www.bollyinside.com/news/the-first-foreign-crew-of-the-international-space-station-has-arrived-for-a-long-mission", "urlToImage": "https://cdn-photos.itemsb.com/wp-content/uploads/2022/11/Web-capture_2-11-2022_20450_www.bing_.com_.jpeg", "publishedAt": "2022-11-02T16:05:20Z", "content": "The first international crew arrived at the International Space Station (ISS) on November 2, 2000. The crew consisted of NASA astronauts William M. Shepard and Russian Aerospace Agency (now Roscosmos… [+4106 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "There's Something Strange About How These Stars Are Moving, Scientists Say - Futurism", "description": "Astronomers are puzzled by the strange behavior of a crooked cluster of stars, which appears to be following an alternative theory of gravity.", "url": "https://futurism.com/something-strange-stars-moving", "urlToImage": "https://wp-assets.futurism.com/2022/11/something-strange-stars-moving.jpg", "publishedAt": "2022-11-02T16:00:58Z", "content": "Astronomers are puzzled by the strange behavior of certain crooked clusters of stars, which appear to be violating our conventional understanding of gravity.\r\nMassive clusters of stars usually are bo… [+2841 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Analyzing Neutron Star Collisions with a New Model - AZoQuantum", "description": "Neutron stars are the densest substances in the universe, apart from black holes. Neutron stars, as their name suggests, are primarily composed of neutrons. Scientists still do not entirely understand the matter created when two neutron stars collide, though.", "url": "https://www.azoquantum.com/News.aspx?newsID=9274", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_9274_16673845808604105.jpg", "publishedAt": "2022-11-02T14:49:00Z", "content": "Neutron stars are the densest substances in the universe, apart from black holes. Neutron stars, as their name suggests, are primarily composed of neutrons. Scientists still do not entirely understan… [+2534 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Swift J1728.9–3613 is a black hole X-ray binary, research finds - Phys.org", "description": "Using NASA's Swift telescope and the Neutron star Interior Composition Explorer (NICER) instrument onboard the International Space Station, Indian astronomers have inspected timing and spectral properties of an X-ray transient known as Swift J1728.9–3613. The…", "url": "https://phys.org/news/2022-11-swift-j172893613-black-hole-x-ray.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/swift-j172893613-is-a.jpg", "publishedAt": "2022-11-02T13:00:01Z", "content": "Using NASA's Swift telescope and the Neutron star Interior Composition Explorer (NICER) instrument onboard the International Space Station, Indian astronomers have inspected timing and spectral prope… [+3438 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "The most vibrant displays of fall leaves on Earth can be seen from space - BollyInside", "description": "As the trees begin their transition into winter, it’s one thing to drive down quiet roads and marvel at the explosion of rich colors that grace the", "url": "https://www.bollyinside.com/news/the-most-vibrant-displays-of-fall-leaves-on-earth-can-be-seen-from-space", "urlToImage": "https://cdn-photos.itemsb.com/wp-content/uploads/2022/11/Web-capture_2-11-2022_1593_www.bing_.com_.jpeg", "publishedAt": "2022-11-02T10:35:27Z", "content": "As the trees begin their transition into winter, it’s one thing to drive down quiet roads and marvel at the explosion of rich colors that grace the country’s many foliage.\r\nSeeing them is another thi… [+2635 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "Black holes can have 'wildly different masses,' reveals study - NewsBytes", "description": "Physicists at the University of Queensland have discovered that black holes exhibit certain quantum properties", "url": "https://www.newsbytesapp.com/news/science/black-holes-have-properties-like-quantum-particles/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l38720221102123012.jpeg", "publishedAt": "2022-11-02T09:28:53Z", "content": "Black holes can have 'wildly different masses,' reveals study\r\nWritten bySanjana Shankar\r\nNov 02, 2022, 02:58 pm3 min read\r\nPhysicists at the University of Queensland were dumbfounded by their discov… [+2671 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope’s Eerie New View of “Pillars of Creation” Looks Supernatural - SciTechDaily", "description": "NASA’s James Webb Space Telescope (JWST) just keeps streaming the hits back to Earth. This time, data from the MIRI mid-infrared instrument onboard JWST shows a haunting view of the Pillars of Creation. Thousands of stars are embedded in those pillars, but ma…", "url": "https://scitechdaily.com/webb-space-telescopes-eerie-new-view-of-pillars-of-creation-looks-supernatural/", "urlToImage": "https://scitechdaily.com/images/James-Webb-Space-Telescope-Pillars-of-Creation.jpg", "publishedAt": "2022-11-02T07:33:32Z", "content": "ByCarolyn Collins Petersen, Universe TodayNovember 2, 2022\r\nThe NASA/ESA/CSA James Webb Space Telescopes mid-infrared view of the Pillars of Creation strikes a chilling and ghostly tone. Thousands of… [+7051 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Molly Swamy", "title": "Halloween in Space? ESO Telescope Captures Gigantic Star's 'Ghostly' Remains; Spooky Pic of Vela Supernova - LatestLY", "description": "A new picture captured by European Southern Observatory's (ESO's) Paranal observatory site in Chile has revealed a massive star's breathtaking 'ghostly' remains. The picture of the Vela Supernova went viral on the web for all the haunted reasons.", "url": "https://www.latestly.com/socially/social-viral/halloween-in-space-eso-telescope-captures-gigantic-stars-ghostly-remains-spooky-pic-of-vela-supernova-goes-viral-4407347.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/11/46-784x441.jpg", "publishedAt": "2022-11-02T07:16:15Z", "content": "European Southern Observatory (ESO) recently shared an incredible picture of Vela Supernova that displays a stunning tapestry of colours. The 'ghostly' remains of the gigantic star appear like a spoo… [+1173 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Divya P", "title": "Is Luka Sabbat Gay? Age, Height, Net Worth - News - News", "description": "Is Luka Sabbat Gay? Fans of Luka Sabbat can check this article to know whether Luka Sabbat is Gay or not. Luka Sabbat is a American model and cultural influencer. Here we have provided Luka Sabbat's Age, Height, and Luka Sabbat Girlfriend's name, so read the …", "url": "https://latestnews.fresherslive.com/articles/is-luka-sabbat-gay-girlfriend-salary-age-height-1090185", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/11/02/is-luka-sabbat-gay-girlfriend-salary-age-height-6362096685f5c-1667369318.jpg", "publishedAt": "2022-11-02T06:29:31Z", "content": "Is Luka Sabbat Gay?\r\nWant to know if Luka Sabbat is Gay or not? Then head into this article. As per sandrarose, Luka Sabbat is not gay. \r\nLuka Sabbat Age\r\nThe American model and cultural influencer w… [+797 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "ITMO: ITMO Scientists Suggest Efficient Microfluidic Synthesis for Metal-Organic Frameworks - India Education Diary", "description": "Nowadays, metal-organic frameworks (MOFs) are actively studied and used for cleaning and detection purposes, as well as for recording and storage of data. For the most part, they’re synthesized using conventional methods, which require lots of resour", "url": "https://indiaeducationdiary.in/itmo-itmo-scientists-suggest-efficient-microfluidic-synthesis-for-metal-organic-frameworks/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/ITMO_University-1.png?fit=1024%2C724&ssl=1", "publishedAt": "2022-11-02T06:20:11Z", "content": "Nowadays, metal-organic frameworks (MOFs) are actively studied and used for cleaning and detection purposes, as well as for recording and storage of data. For the most part, theyre synthesized using … [+8951 chars]"}]}