{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Russia Pauses Its Spacewalk Due to a Spacesuit Issue — Transcontinental Times - Transcontinental Times", "description": "RUSSIA: A Russian spacewalk from the International Space Station (ISS) had to be aborted this week due to a problem with cosmonaut Oleg Artemyev’s spacesuit. On Wednesday, August 17, Artemyev and co-pilot Denis Matveev were engaged in a six-and-a-half-hour sp…", "url": "https://www.transcontinentaltimes.com/2022/08/21/russia-pauses-its-space/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/08/Twii.jpg", "publishedAt": "2022-08-21T08:25:45Z", "content": "RUSSIA: A Russian spacewalk from the International Space Station (ISS) had to be aborted this week due to a problem with cosmonaut Oleg Artemyev’s spacesuit.\r\nOn Wednesday, August 17, Artemyev and co… [+2293 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Dwaipayan Roy", "title": "Study reveals how and when the Sun will die - NewsBytes", "description": "All things come to an end and so will the Sun", "url": "https://www.newsbytesapp.com/news/science/gaia-has-discovered-when-the-sun-will-die/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l28020220821110837.jpeg", "publishedAt": "2022-08-21T08:18:54Z", "content": "Study reveals how and when the Sun will die\r\nAug 21, 2022, 01:48 pm2 min read\r\nAll things come to an end and so will the Sun. As per data from the European Space Agency's Gaia space telescope publish… [+1638 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "Black hole collisions could measure cosmic expansion rate - BollyInside", "description": "Scientists may have found a way to use colliding black holes to measure how fast the universe is expanding and solve some of the mysteries surrounding", "url": "https://www.bollyinside.com/news/black-hole-collisions-could-measure-cosmic-expansion-rate", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/08/Black-hole-collisions-could-measure-cosmic-expansion-rate.jpeg", "publishedAt": "2022-08-21T07:44:18Z", "content": "Scientists may have found a way to use colliding black holes to measure how fast the universe is expanding and solve some of the mysteries surrounding dark energy.\r\nViolent mergers of black holes cre… [+4844 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "60 million years of climate change triggered rise of reptiles: Study - mid-day.com", "description": "Just over 250 million years ago, during the end of the Permian period, and start of the Triassic, reptiles' rates of evolution and diversity started exploding, leading to a dizzying variety of abilities, body plans, and traits", "url": "https://www.mid-day.com/lifestyle/nature-&-wildlife/article/60-million-years-of-climate-change-triggered-rise-of-reptiles-study-23242021", "urlToImage": "https://images.mid-day.com/images/images/2022/aug/Cold-a_d.jpg", "publishedAt": "2022-08-21T06:42:00Z", "content": "Interestingly, since Hooda's international debut, India have won every match that he has played in, across formats and he proved to be the country's lucky charm\r\n21 August,2022 10:44 AM IST\r\n| Harare… [+6 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA selects potential regions to land crew for Artemis III mission - The Indian Express", "description": "NASA has identified a set of 13 regions where the space agency could potentially land its crew during the Artemis III mission.", "url": "https://indianexpress.com/article/technology/science/nasa-artemis-iii-crewed-moon-mission-landing-region-site-8102629/", "urlToImage": "https://images.indianexpress.com/2022/08/Artemis-III-landing-regions-20220821.jpg", "publishedAt": "2022-08-21T05:41:44Z", "content": "As NASA prepares to send astronauts back to the Moon as part of its Artemis missions, the space agency has identified 13 potential locations for landing crewed missions near the lunar South Pole of E… [+2711 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "Sharks that can walk on land leave scientists shocked - Times Now", "description": "Scientists at Florida Atlantic University found that epaulette sharks are capable of walking on land with their fins. The researchers stated that the features were developed as a result of challenging environmental conditions. These sharks use their paddle-sh…", "url": "https://www.timesnownews.com/viral/epaulette-sharks-walk-on-land-based-on-florida-atlantic-university-shocking-study-article-93687033", "urlToImage": "https://static.tnn.in/thumb/msid-93687033,imgsize-100,width-1280,height-720,resizemode-75/93687033.jpg", "publishedAt": "2022-08-21T04:48:13Z", "content": "03:32\r\n'AAP Is Trying To Run Away From Main Issue, i.e Corruption', Says Vijender Gupta, BJP | Latest News"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "One of the Brightest Stars in Our Sky Is on the Brink of Death - Gizmodo Australia", "description": "Nothing lasts forever, including the stars in our night sky. One of the brighter and more notable stars in our...", "url": "https://www.gizmodo.com.au/2022/08/one-of-the-brightest-stars-in-our-sky-is-on-the-brink-of-death/", "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2022/08/19/GettyImages-1297828511.jpg?quality=80&resize=1280,720", "publishedAt": "2022-08-21T04:00:00Z", "content": "Nothing lasts forever, including the stars in our night sky. One of the brighter and more notable stars in our sky is Betelgeuse, the bright red supergiant in the shoulder of Orion.\r\nIn late 2019, as… [+4622 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "After 45 years, the 5-billion-year legacy of the Voyager 2 interstellar probe is just beginning - EastMojo", "description": "On August 20 1977, 45 years ago, an extraordinary spacecraft left this planet on a journey like no other. Voyager 2 was going to show us, for the first", "url": "http://www.eastmojo.com/world/2022/08/21/after-45-years-the-5-billion-year-legacy-of-the-voyager-2-interstellar-probe-is-just-beginning/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/Untitled-design-50-1.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-08-21T02:30:00Z", "content": "On August 20 1977, 45 years ago, an extraordinary spacecraft left this planet on a journey like no other. Voyager 2 was going to show us, for the first time, what the outer solar system planets looke… [+5699 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Study: Space mission shows Earth’s water may be from asteroids - Malay Mail", "description": "TOKYO, Aug 21 — Water may have been brought to Earth by asteroids from the outer edges of the solar system, scientists said after analysing rare samples collected on a six-year...", "url": "https://www.malaymail.com/news/life/2022/08/21/study-space-mission-shows-earths-water-may-be-from-asteroids/23855", "urlToImage": "https://www.malaymail.com/malaymail/uploads/images/2022/08/21/42908.jpeg?v=1661064960", "publishedAt": "2022-08-21T00:25:44Z", "content": "TOKYO, Aug 21 Water may have been brought to Earth by asteroids from the outer edges of the solar system, scientists said after analysing rare samples collected on a six-year Japanese space mission.\r… [+1932 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "This Is The First Plant We Should Grow on Mars, New Study Finds - ScienceAlert", "description": "Once we've overcome all the challenges involved in getting to Mars, we'll then have to figure out how to make life sustainable there – and growing and cultivating crops is going to be a major part of that.", "url": "https://www.sciencealert.com/this-is-the-first-plant-we-should-grow-on-mars-new-study-finds", "urlToImage": "https://www.sciencealert.com/images/2022/08/RadishPlants.jpg", "publishedAt": "2022-08-21T00:04:04Z", "content": "Once we've overcome all the challenges involved in getting to Mars, we'll then have to figure out how to make life sustainable there and growing and cultivating crops is going to be a major part of t… [+3406 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "A new way to Make Oxygen on Mars: Using Plasma - Universe Today", "description": "There’s more than one way to produce oxygen on Mars. Or at least there is now. After the success of the MOXIE experiment that rode along with Perseverance to the red planet in 2021, another idea to produce one of the most useful gases in the universe has been…", "url": "https://www.universetoday.com/157237/a-new-way-to-make-oxygen-on-mars-using-plasma/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/08/7466.jpg", "publishedAt": "2022-08-20T22:04:16Z", "content": "There’s more than one way to produce oxygen on Mars. Or at least there is now. After the success of the MOXIE experiment that rode along with Perseverance to the red planet in 2021, another idea to p… [+4271 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Earth's Limb with a Crescent Moon - nasa.gov", "description": "Astronauts viewed the layers of the atmosphere while orbiting over the southwestern Pacific Ocean.", "url": "https://earthobservatory.nasa.gov/images/150240/earths-limb-with-a-crescent-moon", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/150000/150240/iss066e086970_th.jpg", "publishedAt": "2022-08-20T22:02:22Z", "content": null}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "James Brizuela", "title": "The Big Bang Theory Has Been Debunked? - Giant Freakin Robot", "description": "New evidence from the James Webb Space Telescope is causing panic in the science community, as the Big Bang Theory could be debunked.", "url": "https://www.giantfreakinrobot.com/sci/big-bang-theory-debunked.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2022/08/big-bang-theory.jpg", "publishedAt": "2022-08-20T21:05:27Z", "content": "By James Brizuela\r\n| Published 8 hours ago\r\nScience appreciators around the world have been pleased with the new images being produced by the James Webb Space Telescope. This new highly advanced tele… [+2930 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Merged galaxy gives a glimpse at the future of the Milky Way - Digital Trends", "description": "An image from the Very Large Telescope shows a merged galaxy with the closest known pair of supermassive black holes.", "url": "https://www.digitaltrends.com/space/merged-galaxy-vlt/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/08/eso2211a1.jpg?p=1", "publishedAt": "2022-08-20T19:40:14Z", "content": "At the heart of almost every galaxy lies an enormous black hole. These monsters are so massive that they get a classification of their own: supermassive black holes, with masses millions or even bill… [+2222 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA astronaut in ISS shares spectacular visuals of aurora triggered by recent solar storm - Republic World", "description": "NASA astronaut Bob Hines, who is currently aboard the ISS, shared a few pictures of auroras over the north pole that were triggered by the recent solar storm.", "url": "https://www.republicworld.com/science/space/nasa-astronaut-in-iss-shares-spectacular-visuals-of-aurora-triggered-by-recent-solar-storm-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/zvmzga24fcewu9pb_1661013902.jpeg", "publishedAt": "2022-08-20T17:40:00Z", "content": "The sun is currently heading toward the most active period of its solar cycle, effects of which are being seen on our planet, especially in the polar regions. Recently, a strong flare of ionised part… [+2429 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Learn more about the Haughton-Mars Project with a month on \"Mars\" - BollyInside", "description": "Flying towards the base of the Haughton-Mars Project (HMP), the first impression was of a vast desert below. The reddish-brown soil and rock looks strange and gloomy, but actually brings many surpr…", "url": "https://www.bollyinside.com/news/learn-more-about-the-haughton-mars-project-with-a-month-on-mars", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/08/Learn-more-about-the-Haughton-Mars-Project-with-a-month-on.jpeg", "publishedAt": "2022-08-20T17:08:28Z", "content": "Flying towards the base of the Haughton-Mars Project (HMP), the first impression was of a vast desert below. The reddish-brown soil and rock looks strange and gloomy, but actually brings many surpris… [+5322 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "South Korea creates essential components for NASA's space telescope - BollyInside", "description": "The Korea Institute of Space and Astronomical Sciences has developed the basic equipment needed for the ground testing of NASA’s future space observatory project, the Ministry of Science and Inform…", "url": "https://www.bollyinside.com/news/south-korea-creates-essential-components-for-nasas-space-telescope", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/08/South-Korea-creates-essential-components-for-NASAs-space-telescope.jpeg", "publishedAt": "2022-08-20T16:56:30Z", "content": "The Korea Institute of Space and Astronomical Sciences has developed the basic equipment needed for the ground testing of NASAs future space observatory project, the Ministry of Science and Informati… [+2396 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Moving drops in space support the late professor's idea - BollyInside", "description": "At a time when astronomers around the world are obsessed with new ways of looking at the distant universe, experiments on the International Space Station have given researchers at Cornell Universit…", "url": "https://www.bollyinside.com/news/moving-drops-in-space-support-the-late-professors-idea", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/08/Moving-drops-in-space-support-the-late-professors-idea.jpeg", "publishedAt": "2022-08-20T16:32:29Z", "content": "At a time when astronomers around the world are obsessed with new ways of looking at the distant universe, experiments on the International Space Station have given researchers at Cornell University … [+5013 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The space workhorse of the future is the Vulcan Centaur rocket - BollyInside", "description": "Scheduled to launch in late 2022, the Vulcan Centaur rocket is a new methane-fueled rocket from United Launch Alliance (ULA), one of the most experienced space launchers in the United States. The V…", "url": "https://www.bollyinside.com/news/the-space-workhorse-of-the-future-is-the-vulcan-centaur-rocket", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/08/The-space-workhorse-of-the-future-is-the-Vulcan-Centaur.jpeg", "publishedAt": "2022-08-20T16:20:30Z", "content": "Scheduled to launch in late 2022, the Vulcan Centaur rocket is a new methane-fueled rocket from United Launch Alliance (ULA), one of the most experienced space launchers in the United States. The Vul… [+2876 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "SpaceX's Dragon spacecraft undocks from ISS with over 1,800 kg of supplies; see pics - Republic World", "description": "SpaceX's Dragon capsule separated from the ISS at 8:35 pm last night with around 1,814 kg of supplies and will splash down into the Pacific Ocean at 12:17 am.", "url": "https://www.republicworld.com/science/space/spacexs-dragon-spacecraft-undocks-from-iss-with-over-1800-kg-of-supplies-see-pics-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/xah9iozn9kuyqfgm_1661008145.jpeg", "publishedAt": "2022-08-20T15:22:00Z", "content": "SpaceXs Dragon spacecraft undocked with the International Space Station (ISS) on August 19 and is now heading for a splashdown into the Atlantic Ocean, off the coast of Florida. According to NASA, th… [+2046 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "In pics: From Jupiter to Earth, images taken by NASA's Voyager spacecraft - Inshorts", "description": "After 45 years of service, NASA is planning to shut down the Voyager spacecraft. During their course, the two Voyager spacecraft have travelled farther than any man-made object. It has captured amazing photos of several celestial bodies, including Saturn and …", "url": "https://inshorts.com/en/news/in-pics-from-jupiter-to-earth-images-taken-by-nasas-voyager-spacecraft-1661007918156", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2022/08_aug/20_sat/img_1661001145772_448.jpg?", "publishedAt": "2022-08-20T15:08:23Z", "content": "After 45 years of service, NASA is planning to shut down the Voyager spacecraft. During their course, the two Voyager spacecraft have travelled farther than any man-made object. It has captured amazi… [+232 chars]"}, {"source": {"id": null, "name": "Northeasttoday.in"}, "author": "https://www.facebook.com/NortheastToday", "title": "New Catfish Species - 'Pseudolaguvia Meghalayaensis' Discovered In Meghalaya - NorthEast Today", "description": "NET Web Desk Researchers of Assam Don Bosco University (ADBU) have discovered a new diminutive sisorid catfish – Pseudolaguvia meghalayaensis, in the confluence of ... Read more", "url": "https://www.northeasttoday.in/2022/08/20/new-catfish-species-pseudolaguvia-meghalayaensis-discovered-in-meghalaya/", "urlToImage": "https://www.northeasttoday.in/assets/resources/2022/08/Untitled-design-2022-08-19T224937.381.png", "publishedAt": "2022-08-20T14:07:53Z", "content": "Researchers of Assam Don Bosco University (ADBU) have discovered a new diminutive sisorid catfish – Pseudolaguvia meghalayaensis, in the confluence of Rongkil and Rongdal streams along Meghalaya’s No… [+933 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "New study says chewing may have played a vital role in human evolution - BGR", "description": "A new study posits that the evolution of chewing may have helped play a vital role in the evolution of humankind as a whole.", "url": "https://bgr.com/science/new-study-says-chewing-may-have-played-a-vital-role-in-human-evolution/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/08/AdobeStock_189551683.jpeg?quality=82&strip=all", "publishedAt": "2022-08-20T14:03:00Z", "content": "You probably don’t think twice about chewing, but scientists now say the evolution of chewing could have played a major role in how humans evolved over time. A new study researchers published in the … [+2640 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists click sharpest ever image of most massive known star in the Universe - WION", "description": "The name of this star is R136a1. It is in the heart of Tarantula Nebula and is the largest known star in the Universe. Previous attempts to click sharp images of this star were successful in a limited way because the star is situated amid dust and near other …", "url": "https://www.wionews.com/science/scientist-click-sharpest-ever-image-of-most-massive-known-star-in-the-universe-508699", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/08/20/289235-star-image.jpg", "publishedAt": "2022-08-20T13:31:23Z", "content": "There is no limit to what we can gaze at into the Universe as the expanse is unimaginably huge. All we can do is improve the way we look at it through our lenses and marvel at the beauty as we unders… [+1616 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "An asteroid impact crater found beneath the North Atlantic Ocean - Tech Explorist", "description": "More than one asteroid could have spelled doom for the dinosaurs.", "url": "https://www.techexplorist.com/asteroid-impact-crater-found-beneath-north-atlantic-ocean/53213/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/asteroid-impact.jpg", "publishedAt": "2022-08-20T12:30:40Z", "content": "Using seismic measurements, scientists have found evidence of an asteroid impact crater beneath the North Atlantic Ocean. According to scientists, this crater must have formed by an asteroid impact a… [+4201 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "False positive fungus results from investigation of microbial keratitis | Eye - Nature.com", "description": "Eye - False positive fungus results from investigation of microbial keratitis", "url": "https://www.nature.com/articles/s41433-022-02201-4", "urlToImage": null, "publishedAt": "2022-08-20T12:22:49Z", "content": "<li>Tuft S, Bunce C, De S, Thomas J. Utility of investigation for suspected microbial keratitis: a diagnostic accuracy study. Eye. 2022. https://doi.org/10.1038/s41433-022-01952-4.\r\n</li><li>Chidamba… [+586 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Hubble Space Telescope, James Webb Telescope helping learn more about faraway worlds! - HT Tech", "description": "NASA Exoplanets confirmed that there are more than 5,000 planets beyond our solar system. It also said that the Hubble Space Telescope and James Webb Telescope are helping learn more about faraway worlds.", "url": "https://tech.hindustantimes.com/tech/news/nasa-hubble-space-telescope-james-webb-telescope-helping-learn-more-about-faraway-worlds-71660996336182.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/20/1600x900/uhjk_1660996424794_1660996446719_1660996446719.PNG", "publishedAt": "2022-08-20T12:03:06Z", "content": "You must be knowing about planets in our solar system, one of them being the planet on which we live- Earth. But do you know that NASA has confirmed more than 5,000 planets beyond our solar system, s… [+2364 chars]"}, {"source": {"id": null, "name": "iTech Post"}, "author": "Olivia Cavallaro", "title": "#SpaceSnap Take a Look at the Hubble Space Telescope's Photo of the Rosette Nebula - iTech Post", "description": "Some 5,000 lightyears away sits a fiery red nebula in the shape of a beautiful rose. Some 5,000 lightyears away sits a fiery red nebula in the shape of a beautiful rose.", "url": "https://www.itechpost.com/articles/113152/20220820/spacesnap-take-look-hubble-space-telescopes-photo-rosette-nebula.htm", "urlToImage": "https://1401700980.rsc.cdn77.org/data/images/full/108002/the-rosette-nebula.jpg", "publishedAt": "2022-08-20T12:00:00Z", "content": "Some 5,000 lightyears away sits a fiery red nebula in the shape of a beautiful rose.\r\nPeering into the night skies will reveal a plethora of shapes and figures that are beyond one's imagination. The … [+3546 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "The mathematical model of animal growth shows life is defined by biology - Tech Explorist", "description": "Life is defined by biology, not physics.", "url": "https://www.techexplorist.com/mathematical-model-animal-growth-shows-life-defined-biology/53210/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/cockroaches.jpg", "publishedAt": "2022-08-20T10:16:29Z", "content": "The metabolic theory posits that physical constraints on energy uptake and allocation drive biological processes. This theory predicts broad ecological patterns such as the observed allometric scalin… [+2649 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "Thamizhalagi B", "title": "Matthew Ball Obituary, What was Matthew Ball Cause of Death? - News - News", "description": "Matthew Ball Obituary has been recently searched in a more significant amount of volume online, and moreover, people are eager to know What Was Matthew Ball Cause Of Death. Currently, Matthew Ball's death is widely spreading and people are concerned to know a…", "url": "https://latestnews.fresherslive.com/articles/matthew-ball-obituary-what-was-matthew-ball-cause-of-death-644517", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/08/20/matthew-ball-obituary-6300ace677b0e-1660988646.png", "publishedAt": "2022-08-20T09:47:03Z", "content": "Matthew Ball Obituary\r\nMatthew Ball Obituary and the death were widely searched online by the people hearing the death information. Following the death information, people wonder What Was Matthew Bal… [+1972 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Cornell University: Upon reflection, scientists evaluate Earth-cooling strategies - India Education Diary", "description": "A group of international scientists led by Cornell is – more rigorously and systematically than ever before – evaluating if and how the stratosphere could be made just a little bit “brighter,” reflecting more incoming sunlight so that an ever-warming", "url": "https://indiaeducationdiary.in/cornell-university-upon-reflection-scientists-evaluate-earth-cooling-strategies/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Cornell-University.png?fit=395%2C128&ssl=1", "publishedAt": "2022-08-20T09:14:22Z", "content": "A group of international scientists led by Cornell is more rigorously and systematically than ever before evaluating if and how the stratosphere could be made just a little bit brighter, reflecting m… [+3102 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds bandages can be made stickier, durable by using sound, bubbles - ANI News", "description": "Montreal [Canada], August 20 (ANI): During a recent study, researchers discovered that they can control the stickiness of adhesive bandages by using ultrasound waves and bubbles.", "url": "https://www.aninews.in/news/science/study-finds-bandages-can-be-made-stickier-durable-by-using-sound-bubbles20220820144114", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220820091106.jpg", "publishedAt": "2022-08-20T09:11:00Z", "content": "Montreal [Canada], August 20 (ANI): During a recent study, researchers discovered that they can control the stickiness of adhesive bandages by using ultrasound waves and bubbles.This discovery could … [+2116 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Looking inside a neutron star - Tech Explorist", "description": "The new model will improve insights gleaned from gravitational waves.", "url": "https://www.techexplorist.com/looking-inside-neutron-star/53205/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/neutron-star-merger-1.jpg", "publishedAt": "2022-08-20T07:52:08Z", "content": "Gravitational waves from inspiraling neutron stars allow us to infer the as-of-yet unknown equation of the state of cold hadronic matter at supranuclear densities. During the inspiral, the dominant m… [+2265 chars]"}, {"source": {"id": null, "name": "KOMO News"}, "author": "Alfred Charles, KOMONews.com Executive Producer", "title": "What was that streaking light in the sky above Seattle Friday night? - KOMO News", "description": "If you were in Settle and looked up to the skies Friday night, you might have caught a fast-moving light that streaked across the heavens.", "url": "https://komonews.com/news/local/what-was-that-streaking-light-in-the-sky-above-seattle-friday-night", "urlToImage": "https://komonews.com/resources/media/515fed2d-ceda-4bfc-82d7-6f54027c4169-large16x9_JasonFlorenceDirectUploader20thAug202205_12UTC.png?1660977061223", "publishedAt": "2022-08-20T06:43:31Z", "content": null}, {"source": {"id": null, "name": "Upjobsnews.com"}, "author": null, "title": "Further disruption on rail and bus services as transport strikes continue | Rail strikes & More Latest News Here - upjobsnews", "description": "", "url": "https://upjobsnews.com/further-disruption-on-rail-and-bus-services-as-transport-strikes-continue-rail-strikes-more-latest-news-here/", "urlToImage": "https://i.guim.co.uk/img/media/4789fb552fc907c5f8040a3fe16b46fe566bb221/0_116_3500_2101/master/3500.jpg", "publishedAt": "2022-08-20T06:30:20Z", "content": "Travellers are facing a further day of disruption on Saturday as thousands of transport workers go on strike in a long-running dispute over pay, jobs and conditions.\r\nNetwork Rail, several train comp… [+4066 chars]"}, {"source": {"id": null, "name": "Snow-forecast.com"}, "author": null, "title": "Underwater Snow 'Rising' on Jupiter's Moon Europa - The Whiteroom - Snow Forecast", "description": "A new study, published in the August issue of the journal Astrobiology, has projected that Jupiter’s icy moon Europa has pure snow that rises underwater to generate the moon’s icy crust, rather than falling from above. “Underwater snow” is not an entirely ext…", "url": "https://www.snow-forecast.com/whiteroom/underwater-snow-rising-on-jupiters-moon-europa/", "urlToImage": "https://www.snow-forecast.com/whiteroom/wp-content/uploads/2022/08/Europa-1024x757.jpg", "publishedAt": "2022-08-20T06:06:00Z", "content": "A new study, published in the August issue of the journal Astrobiology, has projected that Jupiters icy moon Europa has pure snow that rises underwater to generate the moons icy crust, rather than fa… [+1080 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "B S Shylaja", "title": "The curious case of anaemic stars - Deccan Herald", "description": "The curious case of anaemic stars", "url": "https://www.deccanherald.com/science-and-environment/the-curious-case-of-anaemic-stars-1137554.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/08/20/file7mdjlsrhp061jpo25m0c-1137554-1660973472.jpg", "publishedAt": "2022-08-20T05:31:12Z", "content": "While observing the spectra of stars almost a century ago the astronomer Adams hit upon an unusual star. The faint star in the constellation of Libra at a distance of 190 light years, just had a cata… [+4919 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "S Kaviya", "title": "Munawar Faruqui Wife Who is Munawar Faruqui Wife? - News - News", "description": "Munawar Faruqui Wife Who is Munawar Faruqui Wife is been the search by Munawar Faruqui fans. Here in this article, you can check Munawar Faruqui Wife Name, Who is Munawar Faruqui Wife, Munawar Faruqui Wife Age.", "url": "https://latestnews.fresherslive.com/articles/munawar-faruqui-wife-who-is-munawar-faruqui-wife-1040589", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/08/20/munawar-faruqui-wife-who-is-munawar-faruqui-wife-630060c472bc7-1660969156.jpg", "publishedAt": "2022-08-20T04:54:36Z", "content": "Who is Munawar Faruqui Wife?\r\nThere are many people who are fans of many celebrities in various fields like the film industry, sports, modeling, etc. Likewise, Munawar Faruqui fans are now in search … [+1397 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "SpaceX launches 53 new Starlink satellites - CGTN", "description": "SpaceX launched another batch of 53 Starlink internet satellites to orbit on Friday.", "url": "https://news.cgtn.com/news/2022-08-20/SpaceX-launches-53-new-Starlink-satellites--1cE6hZQhYju/index.html", "urlToImage": "https://news.cgtn.com/news/2022-08-20/SpaceX-launches-53-new-Starlink-satellites--1cE6hZQhYju/img/6ba111f4d6104560adf3ed91c5401286/6ba111f4d6104560adf3ed91c5401286-1280.png", "publishedAt": "2022-08-20T03:50:29Z", "content": "SpaceX launched a new batch of 53 Starlink internet satellites on Friday.\r\nA SpaceX Falcon 9 rocket lifted off from Cape Canaveral Space Force Station in Florida at around 1921 GMT to deliver the sat… [+670 chars]"}, {"source": {"id": null, "name": "Upjobsnews.com"}, "author": null, "title": "Astronomers Have Discovered a Black Hole Jet That Is 50 Times Larger Than Its Galaxy : ScienceAlert & More Latest News Here - upjobsnews", "description": "", "url": "https://upjobsnews.com/astronomers-have-discovered-a-black-hole-jet-that-is-50-times-larger-than-its-galaxy-sciencealert-more-latest-news-here/", "urlToImage": "https://www.sciencealert.com/images/2022/08/IllustrationOfBlackHoleJetAndBlueGiantStar.jpg", "publishedAt": "2022-08-20T01:01:35Z", "content": "Astronomers at Western Sydney University have discovered one of the biggest black hole jets in the sky.\r\nSpanning more than a million light years from end to end, the jet shoots away from a black hol… [+5288 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "How Asteroids And Moons Helped Scientists Figure Out How Collisions Caused The 'disintegration' Of A New Planet - Nation World News", "description": "The effect affects the porosity and composition of the Moon and planets more dramatically than scientists thought, increasing their potential for life.", "url": "https://nationworldnews.com/how-asteroids-and-moons-helped-scientists-figure-out-how-collisions-caused-the-disintegration-of-a-new-planet/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/How-asteroids-and-moons-helped-scientists-figure-out-how-collisions.jpg", "publishedAt": "2022-08-19T23:53:11Z", "content": "Studying how these impacts affect planetary bodies, asteroids, moons, and other rocks in outer space helps planetary scientists understand additional geology, particularly those of water, ice and eve… [+2867 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "With Little Else to Do in Bali, Monkeys Have Found a Way to Make Sex Toys - ScienceAlert", "description": "In the Sacred Monkey Forest of Bali, food is everywhere and masturbation is rampant.", "url": "https://www.sciencealert.com/with-little-else-to-do-in-bali-monkeys-have-found-a-way-to-make-sex-toys", "urlToImage": "https://www.sciencealert.com/images/2022/08/RockMasturbationMonkey.jpg", "publishedAt": "2022-08-19T22:04:55Z", "content": "In the Sacred Monkey Forest of Bali, food is everywhere and masturbation is rampant.\r\nThe thousand or so long-tailed macaques that live in this hotbed of hedonism have it really, really good.\r\nEvery … [+3849 chars]"}, {"source": {"id": null, "name": "Newsdeal.in"}, "author": "Rihan", "title": "NASA a Step Closer to Searching for Life on Jupiter Moon - NewsDeal", "description": "The odds are very slim that you’ll ever get inside the room known as High Bay 1 at NASA and Caltech’s Jet Propulsion Laboratory in Pasadena, Calif. If by some chance you did get inside, you certainly", "url": "https://newsdeal.in/nasa-a-step-closer-to-searching-for-life-on-jupiter-moon/", "urlToImage": "https://i0.wp.com/api.time.com/wp-content/uploads/2022/08/EuropaClipper.jpg", "publishedAt": "2022-08-19T20:03:41Z", "content": "The odds are very slim that youll ever get inside the room known as High Bay 1 at NASA and Caltechs Jet Propulsion Laboratory in Pasadena, Calif. If by some chance you did get inside, you certainly c… [+3584 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "Massive Asteroid Set for Closest Approach to Earth Since 1914 - msnNOW", "description": "Massive Asteroid , Set for Closest Approach , to Earth Since 1914. On August 20, a humongous asteroid larger than Giza's Great Pyramid will pass by Earth for the first time in over 100 years. On August 20, a humongous asteroid larger than Giza's Great Pyramid…", "url": "https://www.msn.com/en-us/news/technology/massive-asteroid-set-for-closest-approach-to-earth-since-1914/vi-AA10QMtL", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA10QgEY.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-08-19T18:55:35Z", "content": "Like us on Facebook to see similar stories\r\nI'm already a fan, don't show this again"}, {"source": {"id": null, "name": "Express"}, "author": "Rhiannon Du Cann", "title": "Archaeology breakthrough: Scientists discover remains of NEW dinosaur the size of a CAT - Express", "description": "ARCHAEOLOGISTS unearthed an incredible discovery after they found a new type of dinosaur that roamed the Earth on its hind legs more than 100 million years ago. And what's even more fascinating is the species is only the size of a household pet.", "url": "https://www.express.co.uk/news/science/1657751/archaeology-news-dinosaur-small-argentina-discovery-world-spt", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/1200x712/1657751_1.jpg", "publishedAt": "2022-08-19T18:26:34Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Tracking 30 Years of Sea Level Rise Around the World - SciTechDaily", "description": "Global mean sea level has risen 101 millimeters (3.98 inches) since 1992, and it continues to do so at 3.9 mm (0.15 inches) per year. A new satellite was launched by scientists and engineers thirty years ago to examine how the waters rise and decrease over ti…", "url": "https://scitechdaily.com/tracking-30-years-of-sea-level-rise-around-the-world/", "urlToImage": "https://scitechdaily.com/images/Tracking-30-Years-of-Sea-Level-Rise.gif", "publishedAt": "2022-08-19T17:44:07Z", "content": "ByMichael Carlowicz, NASA Earth ObservatoryAugust 19, 2022\r\n1992 2022\r\nGlobal mean sea level has risen 101 millimeters (3.98 inches) since 1992, and it continues to do so at 3.9 mm (0.15 inches) per … [+5467 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Baba Tamim", "title": "10 best images of James Webb to celebrate World Photography Day - Interesting Engineering", "description": "On this World Photography Day, interesting engineering presents some of the most stunning photographs from NASA’s James Webb Space Telescope, the largest telescope in the world.", "url": "https://interestingengineering.com/science/pictures-world-photography-day-nasa-james-webb-space-magic", "urlToImage": "https://inteng-storage.s3.amazonaws.com/2022/08/19/image/jpeg/Djns0N7dJI01XKtqB77RiETBy7xXCxWCqHKXR6a9.jpg", "publishedAt": "2022-08-19T17:19:43Z", "content": "The NASA-built James Webb satellite telescope is mostly used for infrared astronomy. It can study objects that are too early, far away, or dark for the Hubble Orbit Telescope, the largest optical tel… [+1264 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Lucy team discovers tiny moon in orbit around asteroid Polymele - News9 LIVE", "description": "NASA's Lucy mission has been tasked with observing multiple Trojan asteroids of Jupiter", "url": "https://www.news9live.com/science/lucy-team-discovers-tiny-moon-in-orbit-around-asteroid-polymele-190511", "urlToImage": "https://media.news9live.com/h-upload/2022/08/19/532223-asteroidspolymele00001printcropped.jpg", "publishedAt": "2022-08-19T17:00:06Z", "content": "NASA's Lucy mission, whose targets of observation are multiple Trojan asteroids of Jupiter, has discovered a tiny satellite in orbit around the asteroid Polymele. The discovery was made serendipitous… [+1819 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "InSight mission reveals surprising data on subsurface water on Mars - News9 LIVE", "description": "Dust has collected on the panels of the InSight lander, which is in the final stages of its mission", "url": "https://www.news9live.com/science/insight-mission-reveals-surprising-data-on-subsurface-water-on-mars-190507", "urlToImage": "https://media.news9live.com/h-upload/2022/08/19/532218-mars-1cropped1.jpg", "publishedAt": "2022-08-19T16:36:24Z", "content": "Data from NASA's InSight lander has revealed some surprising aspects of water on Mars. The scientific understanding of when in the history of the Red Planet the surface was more wet, for how long was… [+2102 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Ed Browne", "title": "This Awesome Image of the Sun Will Blow Your Mind - Newsweek", "description": "Reddit users have been wowed by a crystal-clear 145 megapixel image of the sun submitted by an astrophotographer.", "url": "https://www.newsweek.com/reddit-image-sun-145-megapixel-clear-1735264", "urlToImage": "https://d.newsweek.com/en/full/2101028/surface-sun.jpg", "publishedAt": "2022-08-19T16:28:02Z", "content": "A Reddit user has captivated thousands of people with a crystal-clear image of the sun, produced using a specially-designed telescope.\r\nUser ajamesmccarthy uploaded the image on Tuesday. Described as… [+2668 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "Indian origin scientist joins NASA's Artemis I mission to the moon - Inshorts", "description": "Amit Pandey, who hails from Uttarakhand, is all set to join NASA's new moon programme Artemis I as a senior scientist. \"NASA is currently undertaking a long-term lunar programme to enable astronauts to live and conduct research on the moon,\" Pandey, who works…", "url": "https://inshorts.com/en/news/indian-origin-scientist-joins-nasas-artemis-i-mission-to-the-moon-1660922446511", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2022/08_aug/19_fri/img_1660918347126_461.jpg?", "publishedAt": "2022-08-19T16:02:31Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Laurence Tognetti", "title": "What is the maximum number of moons that Earth could have? - Phys.org", "description": "In a recent study published in Earth and Planetary Astrophysics, a team of researchers from the University of Texas at Arlington, Valdosta State University, Georgia Institute of Technology, and the National Radio Astronomy Observatory estimated how many moons…", "url": "https://phys.org/news/2022-08-maximum-moons-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/what-is-the-maximum-nu-1.jpg", "publishedAt": "2022-08-19T15:18:03Z", "content": "In a recent study published in Earth and Planetary Astrophysics, a team of researchers from the University of Texas at Arlington, Valdosta State University, Georgia Institute of Technology, and the N… [+5481 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akash Dutta", "title": "When Sun turns into Earth-Killer: The dark side of Solar storms and CME - HT Tech", "description": "The same solar energy from the Sun that nurtures life on Earth can start a blaze of fury that is capable of leaving humanity on the verge of death. Know the reality of solar storms and CME that is not talked about.", "url": "https://tech.hindustantimes.com/tech/news/when-sun-turns-into-earth-killer-the-dark-side-of-solar-storms-and-cme-71660915087064.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/19/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1660915108017_1660915108017.jpg", "publishedAt": "2022-08-19T13:20:59Z", "content": "Life on Earth probably would not have been possible if the Sun was not there. From providing the warmth to make complex chemical reactions possible to sustaining them today by allowing plants to make… [+2442 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "New York Times", "title": "The Juicy Secrets of Stars That Eat Their Planets - Moneycontrol", "description": "Stars come in many varieties, including simmering dwarfs and brilliant hypergiants. The life expectancy and ultimate fate of a star — and, therefore, any planets orbiting it — is tied to its mass: Red dwarfs may live for trillions of years, whereas massive st…", "url": "https://www.moneycontrol.com/news/science/the-juicy-secrets-of-stars-that-eat-their-planets-9057741.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/NASA-stars-Diwali-Twitter-770x433.jpg", "publishedAt": "2022-08-19T13:20:31Z", "content": "The sun has nourished life on Earth, but it will not be so hospitable forever. Five billion years into the future, our solar systems star will grow so immense that Mercury, Venus and, possibly, Earth… [+6968 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Kumar Natasha", "title": "James Webb Telescope Capturing a Spectacular Galaxy - The Times Hub", "description": "Photo: inverse.com James Telescope Webb, having taken a marvelous galaxy This galaxy is an ideal butt, even a mirror-like galaxy with a massive, actively animated", "url": "https://thetimeshub.in/james-webb-telescope-capturing-a-spectacular-galaxy/29282/", "urlToImage": null, "publishedAt": "2022-08-19T13:14:57Z", "content": "Photo: inverse.com James Telescope Webb, having taken a marvelous galaxy\r\n James Webb Space Telescope for with the help of a photoprocessor, having created a new name image of the terrestrial galaxy.… [+704 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Ancient Asteroids Covered In Gravel, Here's The Complete Explanation! - Nation World News", "description": "Ancient asteroids are covered with pebbles that are millions of years old. This object has been caught on camera since 2019.", "url": "https://nationworldnews.com/ancient-asteroids-covered-in-gravel-heres-the-complete-explanation/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/Ancient-asteroids-covered-in-gravel-heres-the-complete-explanation.jpg", "publishedAt": "2022-08-19T12:48:52Z", "content": "Ancient asteroids are covered with pebbles that are millions of years old. This object has been caught on camera since 2019.\r\nScientists never have avenues to answer various questions about the myste… [+2811 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "New magnetic interactions might provide unique techniques to control electron transport - Tech Explorist", "description": "The research could pave the ways to manipulate electron flow with much less energy loss.", "url": "https://www.techexplorist.com/new-magnetic-interactions-might-provide-unique-techniques-control-electron-transport/53197/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/TbMn6Sn6-material.jpg", "publishedAt": "2022-08-19T12:40:12Z", "content": "Kagome’s are a material whose structure is named after a traditional Japanese basket weaving technique. The weaving creates a pattern of hexagons bordered by triangles and vice versa. In Kagome metal… [+2949 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UC San Diego: Subsurface Water on Mars Defies Expectations - India Education Diary", "description": "A new analysis of seismic data from NASA’s Mars InSight mission has revealed a couple of surprises.The first surprise: the top 300 meters of the subsurface beneath the landing site near the Martian equator contains little or no ice.“We find that Mars", "url": "https://indiaeducationdiary.in/uc-san-diego-subsurface-water-on-mars-defies-expectations/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/1200px-University_of_California_San_Diego_seal.svg_.png?fit=1024%2C1024&ssl=1", "publishedAt": "2022-08-19T12:26:22Z", "content": "A new analysis of seismic data from NASAs Mars InSight mission has revealed a couple of surprises.\r\nThe first surprise: the top 300 meters of the subsurface beneath the landing site near the Martian … [+4363 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Here's why Earth just had its shortest day on record - Deccan Herald", "description": "There are 24 hours in a day, right? Well, almost. Though it mostly goes unnoticed, hardly any of our days hit this number exactly. Decade to decade, season to season and even day to day, Earth’s rotation speeds up and slows down, shaving off or adding millise…", "url": "https://www.deccanherald.com/science-and-environment/heres-why-earth-just-had-its-shortest-day-on-record-1137511.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/08/20/file7mcn3zfif0yzjk7uohw-1-1137511-1660942990.jpg", "publishedAt": "2022-08-19T12:19:17Z", "content": "There are 24 hours in a day, right? Well, almost. Though it mostly goes unnoticed, hardly any of our days hit this number exactly. Decade to decade, season to season and even day to day, Earths rotat… [+6334 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Pavan Naidu", "title": "Astronomers notices how Black Hole was delivered to the spiral galaxy by another smaller galaxy - The Tech Outlook", "description": "On Friday, a new study using the data from NASA's Chandra X-ray Observatory and Hubble Space Telescope noticed how a large black hole might have been delivered to the spiral galaxy NGC 4424 by another, smaller galaxy, HDTech reports.Hubble tweeted th", "url": "https://www.thetechoutlook.com/news/science/astronomers-notices-how-black-hole-was-delivered-to-the-spiral-galaxy-by-another-smaller-galaxy/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2022/08/Untitled-design-16-5.jpg", "publishedAt": "2022-08-19T12:16:13Z", "content": "On Friday, a new study using the data from NASA’s Chandra X-ray Observatory and Hubble Space Telescope noticed how a large black hole might have been delivered to the spiral galaxy NGC 4424 by anothe… [+1205 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Hidden patterns found on the surface of water – Physics World - physicsworld.com", "description": "Interface between water and air appears to have common properties with ice", "url": "https://physicsworld.com/a/hidden-patterns-found-on-the-surface-of-water/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/08/water-droplet-Shutterstock_Grayson.jpg", "publishedAt": "2022-08-19T12:15:38Z", "content": "Soft and bumpy: work on soft airwater interfaces was pioneered over 10 years ago. (Courtesy: Shutterstock/Grayson)\r\nScientists in the US have found evidence that the surface of liquid water, even at … [+4049 chars]"}, {"source": {"id": null, "name": "Indiaai.gov.in"}, "author": null, "title": "AI can now unveil the secrets of the Big Bang Theory - INDIAai", "description": "A neural network has been developed that can be used to study the state of the universe after the Big Bang.", "url": "https://indiaai.gov.in/article/ai-can-now-unveil-the-secrets-of-the-big-bang-theory", "urlToImage": "https://d12aarmt01l54a.cloudfront.net/cms/images/Media-20220819170126/1200-630.png", "publishedAt": "2022-08-19T12:11:02Z", "content": "AI is used for several complex tasks. How about studying particle physics? The difference of opinion on the formation of the universe is several. A neural network has been developed that can be used … [+2927 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Astronomers Observe a Ring of Light as Photons Orbit M87A* — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: In 2019, astronomers teamed up to create the most powerful telescope ever, which they dispersed over the globe. The Event Horizon Telescope (EHT) initially saw a supermassive black hole at the centre of the Messier 87 (M87) galaxy. Even though …", "url": "https://www.transcontinentaltimes.com/2022/08/19/astronomers-photons/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2022/08/photons.jpg", "publishedAt": "2022-08-19T12:00:00Z", "content": "UNITED STATES: In 2019, astronomers teamed up to create the most powerful telescope ever, which they dispersed over the globe. The Event Horizon Telescope (EHT) initially saw a supermassive black hol… [+2763 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Texas A&M: Researchers Design New Inks For 3D-Printable Wearable Bioelectronics - India Education Diary", "description": "Flexible electronics have enabled the design of sensors, actuators, microfluidics and electronics on flexible, conformal and/or stretchable sublayers for wearable, implantable or ingestible applications. However, these devices have very different mec", "url": "https://indiaeducationdiary.in/texas-am-researchers-design-new-inks-for-3d-printable-wearable-bioelectronics/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/tam-box-stack-1.png?fit=720%2C576&ssl=1", "publishedAt": "2022-08-19T10:26:09Z", "content": "Flexible electronics have enabled the design of sensors, actuators, microfluidics and electronics on flexible, conformal and/or stretchable sublayers for wearable, implantable or ingestible applicati… [+3582 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Texas A&M: AgriLife Research To Study Lice-Mammal Coevolution - India Education Diary", "description": "A Texas A&M AgriLife Research project will take a deep look at the ages-long interaction between parasitic lice and mammal species, including humans.Researchers will study the evolutionary relationship between sucking lice and a wide range of pla", "url": "https://indiaeducationdiary.in/texas-am-agrilife-research-to-study-lice-mammal-coevolution/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/tam-box-stack-1.png?fit=720%2C576&ssl=1", "publishedAt": "2022-08-19T10:22:44Z", "content": "A Texas A&amp;M AgriLife Research project will take a deep look at the ages-long interaction between parasitic lice and mammal species, including humans.\r\nResearchers will study the evolutionary rela… [+4688 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Rare Neptune-size exoplanets may face solar superstorms from parent stars - Space.com", "description": "The discovery of a Neptune-sized exoplanet around a massive star could explain why such planets are rarely found.", "url": "https://www.space.com/hot-bright-giant-stars-strip-planets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nUs6LS6QNitQ3NXS5UsMsE-1200-80.jpg", "publishedAt": "2022-08-19T10:00:07Z", "content": "The discovery of a Neptune-sized exoplanet in orbit around a hot and bright giant star may help explain why the discovery of such worlds is rare. \r\nResearchers from the University of California, Berk… [+6326 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Astronomical feat! Galaxy as old as 260mn yrs found - Ahmedabad Mirror", "description": "By Manasi Saraf Joshi\n\nIn the latest discovery by a team from the Savitribai Phule Pune University (SPPU), astronomers have found extremely aged &lsquo;fossil lobes&rsquo; of a radio galaxy that was active once upon a time. The team was led by Surajit Paul fr…", "url": "https://www.ahmedabadmirror.com/astronomical-feat-galaxy-as-old-as-260mn-yrs-found/81842833.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1660846578827.jpg-org", "publishedAt": "2022-08-19T09:58:50Z", "content": "By Manasi Saraf Joshi\r\nIn the latest discovery by a team from the Savitribai Phule Pune University (SPPU), astronomers have found extremely aged ‘fossil lobes’ of a radio galaxy that was active once … [+1755 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Deformation mechanics may be key in cancer fight: Research - Hindustan Times", "description": "The genetic material governing a cell's function and behavior, called the genome, is safely stored in the nucleus. Nearly 150 years of looking through microscopes has taught pathologists and researchers that misshapen nuclei are warning signs of diseases like…", "url": "https://www.hindustantimes.com/lifestyle/health/deformation-mechanics-may-be-key-in-cancer-fight-research-101660900566012.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/19/1600x900/head_and_neck_cancer_thumb_1658928005096_1660900610188_1660900610188.jpg", "publishedAt": "2022-08-19T09:19:29Z", "content": "A team has uncovered surprising mechanical behaviors of the nucleus. For years, the nucleus within a cell was thought to be elastic like a rubber ball, deforming and snapping back into shape as the c… [+3236 chars]"}]}