{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "Study shows ‘Man in the Moon’ craters 200 mn years old than thought - The Siasat Daily", "description": "London: Scientists have 'reset the clock' for craters on the Moon, meaning that parts of its surface -- which characterise the children's story of the Man in the Moon -- are around 200 million years older than had been thought. Researchers from Norway and Fra…", "url": "https://www.siasat.com/study-shows-man-in-the-moon-craters-200-mn-years-old-than-thought-2639197/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/07/moon.jpg", "publishedAt": "2023-07-12T10:30:00Z", "content": "London: Scientists have ‘reset the clock’ for craters on the Moon, meaning that parts of its surface — which characterise the children’s story of the Man in the Moon — are around 200 million years ol… [+2924 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Scientists find evidence of world's oldest glaciers in South Africa - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/scientists-find-evidence-of-worlds-oldest-glaciers-in-south-africa/606645.html", "urlToImage": "", "publishedAt": "2023-07-12T10:00:31Z", "content": "New Delhi, Jul 12 (PTI) Scientists have discovered the traces of the world's oldest known glaciers, dating from 2.9 billion years ago, in rocks sitting under the planet's largest gold deposits in Sou… [+524 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Spacecraft Detects The Origin Of Superfast Solar Wind - India Education Diary", "description": "The Parker Solar Probe has flown close enough to the surface of the Sun to detect the fine structure of the solar wind close to where it is generated.In a paper published today in the journal Nature, a team of researchers including from Imperial Coll", "url": "https://indiaeducationdiary.in/spacecraft-detects-the-origin-of-superfast-solar-wind/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/07/newseventsimage_1686732335279_mainnews2012_x1.jpg", "publishedAt": "2023-07-12T09:35:55Z", "content": "The Parker Solar Probe has flown close enough to the surface of the Sun to detect the fine structure of the solar wind close to where it is generated.\r\nIn a paper published today in the journal Natur… [+3699 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Scientists discover extensive array of protein folds unexplored in nature - Nanowerk", "description": "A research team has discovered an astounding array of unexplored protein folds. This research will expand our understanding of the depth of the protein universe and the possibilities for de novo design of functional proteins.", "url": "https://www.nanowerk.com/news2/biotech/newsid=63312.php", "urlToImage": "https://www.nanowerk.com/news2/biotech/id63312.jpg", "publishedAt": "2023-07-12T08:36:53Z", "content": "Nanowerk Newsletter\r\nGet our Biotechnology News updates to your inbox!"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Stunning 3D Visualization: A Cosmic Evolution Through 5,000 Galaxies - SciTechDaily", "description": "Data shows Webb’s ability to image and identify thousands of galaxies at once. The Space Telescope Science Institute’s Office of Public Outreach has released a new scientific visualization of data from the CEERS (Cosmic Evolution Early Release Science) Survey…", "url": "https://scitechdaily.com/webbs-stunning-3d-visualization-a-cosmic-evolution-through-5000-galaxies/", "urlToImage": "https://scitechdaily.com/images/Universe-Astronomy-Art-Concept.jpg", "publishedAt": "2023-07-12T08:23:46Z", "content": "BySpace Telescope Science InstituteJuly 12, 2023\r\nNASAs James Webb Space Telescope has released a 3D visualization showcasing approximately 5,000 galaxies, including Maisies Galaxy, one of the earlie… [+7304 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Evidence of potential life on Venus found! - Economic Times", "description": "Scientists have discovered phosphine gas in the atmosphere of Venus, indicating the possibility of extraterrestrial life on the planet. The gas, typically released by living organisms, has been found at a depth deeper than previously observed. The discovery w…", "url": "https://economictimes.indiatimes.com/news/new-updates/evidence-of-potential-life-on-venus-found/articleshow/101691402.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101691557,width-1070,height-580,imgsize-670,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-12T07:32:00Z", "content": "In a groundbreaking discovery, scientists from Cardiff University in Wales has detected signs of life on Venus, the second planet from the Sun in our solar system.The team of scientists claimed to ha… [+1819 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sun To Reach Solar Maximum In 2 Years, May Lead To \"Internet Apocalypse\" - NDTV", "description": "Outages caused by solar storms could last for months, leading to huge economic impact", "url": "https://www.ndtv.com/science/sun-to-reach-solar-maximum-in-2-years-may-lead-to-internet-apocalypse-4199522", "urlToImage": "https://c.ndtvimg.com/2023-02/brq6dqjg_solar-flare-latest-650_625x300_10_February_23.jpg", "publishedAt": "2023-07-12T06:30:14Z", "content": "The frequency of solar flares has increased as the Sun is in its most active phase.\r\nThere has been a renewed interest in the solar cycles of the Sun as it sends out solar storms, sometimes so devast… [+2078 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shocking! Blackouts hit US, Canada after powerful solar flare eruption, NASA satellite shows - HT Tech", "description": "The NASA Solar Dynamics Observatory spotted an M6-class solar flare eruption on the Sun. The strong ultraviolet radiation sparked a major radio blackout in North America that affected the US and Canada.", "url": "https://tech.hindustantimes.com/tech/news/shocking-blackouts-hit-us-canada-after-powerful-solar-flare-eruption-nasa-satellite-shows-71689142741192.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/12/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1689142789390.jpg", "publishedAt": "2023-07-12T06:23:54Z", "content": "The coronal mass ejection (CME) that is racing to strike Earth tomorrow, July 13, is still on its way and it is likely to cause a terrifying solar storm. However, before that could hit, another solar… [+2663 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "China plans to send two rockets for crewed moon landing - Economic Times", "description": "Both the rockets will enter the moon's orbit and after a successful docking the astronauts will enter the lunar lander to descend onto the moon's surface, state media reported on Wednesday, citing a China Manned Space Agency engineer.", "url": "https://economictimes.indiatimes.com/news/international/world-news/china-plans-to-send-two-rockets-for-crewed-moon-landing/articleshow/101688727.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101688790,width-1070,height-580,imgsize-83082,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-12T06:03:00Z", "content": "China plans to send two rockets to the moon by 2030, one carrying the spacecraft that will land on the surface and the other transporting the astronauts. Both the rockets will enter the moon's orbit … [+1614 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"We're Sure...\": India Shoots For The Moon With Friday Chandrayaan Launch - NDTV", "description": "Chandrayaan-3 launch: India on Friday launches its latest attempt at an unmanned moon landing, the next frontier of a burgeoning, cut-price aerospace programme rapidly closing in on the milestones set by global superpowers.", "url": "https://www.ndtv.com/india-news/were-sure-india-shoots-for-the-moon-with-friday-chandrayaan-launch-4199402", "urlToImage": "https://c.ndtvimg.com/2023-07/abpc33vc_chandrayaan-pti_625x300_12_July_23.jpg", "publishedAt": "2023-07-12T05:49:20Z", "content": "Chandrayaan-3 launch will take place on Friday.\r\nBengaluru: India on Friday launches its latest attempt at an unmanned moon landing, the next frontier of a burgeoning, cut-price aerospace programme r… [+3002 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": ", Bhoumik Mhatre", "title": "MIT Researchers Have Developed a Unified Framework that Uses Machine Learning to Simultaneously Predict Molecular Properties and Generate New Molecules Using Only a Small Amount of Data for Training - MarkTechPost", "description": "To have a discovery via a Machine Learning algorithm, we need to have a large dataset of training data. There was a problem in predicting the molecular properties and generating new molecules. This can be solved via Machine Learning and Deep Learning approach…", "url": "https://www.marktechpost.com/2023/07/11/mit-researchers-have-developed-a-unified-framework-that-uses-machine-learning-to-simultaneously-predict-molecular-properties-and-generate-new-molecules-using-only-a-small-amount-of-data-for-training/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/07/Screenshot-2023-07-11-at-8.59.56-PM.png", "publishedAt": "2023-07-12T05:15:00Z", "content": "To have a discovery via a Machine Learning algorithm, we need to have a large dataset of training data. There was a problem in predicting the molecular properties and generating new molecules. This c… [+2434 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "ALERT! Stadium-sized potentially hazardous asteroid to come dangerously close to the Earth today! - HT Tech", "description": "An Apollo group asteroid, which has been declared as a Potentially Hazardous Object by NASA, is expected to make its closest approach to Earth today, July 12. Know if it will impact.", "url": "https://tech.hindustantimes.com/tech/news/alert-stadium-sized-potentially-hazardous-asteroid-to-come-dangerously-close-to-the-earth-today-71689136333949.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/12/1600x900/asteroid-6075441_640_1683023282496_1689137391926.jpg", "publishedAt": "2023-07-12T04:50:26Z", "content": "More and more asteroids have been flying past Earth albeit at close but safe distances. Due to the potential danger of impact, it is important for space agencies such as NASA and ESA to keep an eye o… [+2114 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "Granite Moon: NASA scientists discover huge granite 'mass' buried on Moon, clues of ancient volcanoes - The New Indian Express", "description": "The finding was made by NASA scientists based on data gathered by the Chinese Chang’E-1 and Chang’E-2 lunar orbiters and NASA’s Lunar Prospector and Lunar Reconnaissance Orbiters.", "url": "https://www.newindianexpress.com/world/2023/jul/12/granite-moon-nasa-scientistsdiscover-huge-granite-mass-buried-on-moon-clues-of-ancient-volcanoes-2593986.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2023/7/12/w600X390/MOON.jpg", "publishedAt": "2023-07-12T03:49:00Z", "content": "There is a theory that the Moon was formed when Earth and a Mars-sized planet collided some 4.51 billion years ago when the Solar System was still in its early stages. A chunk of Earth was chiselled … [+6115 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A better understanding of turbulence - Science Daily", "description": "Experiments at a unique wind tunnel show that laws formulated more than 80 years ago and their extensions only incompletely explain turbulent flows.", "url": "https://www.sciencedaily.com/releases/2023/07/230711133200.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-12T03:18:53Z", "content": "Experiments at the unique wind tunnel of the Max Planck Institute for Dynamics and Self-Organization (MPI-DS) in Göttingen show that laws formulated more than 80 years ago and their extensions only i… [+2298 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA to Discuss Science on Next Northrop Grumman Space Station Mission - India Education Diary", "description": "NASA will host a media teleconference at 10 a.m. EDT on Tuesday, July 18, to discuss the next science investigations bound for the International Space Station aboard Northrop Grumman’s Cygnus spacecraft on the company’s 19th commercial resupply missi", "url": "https://indiaeducationdiary.in/nasa-to-discuss-science-on-next-northrop-grumman-space-station-mission/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/nasa_meatball_1_2.jpeg", "publishedAt": "2023-07-12T03:17:05Z", "content": "NASA will host a media teleconference at 10 a.m. EDT on Tuesday, July 18, to discuss the next science investigations bound for the International Space Station aboard Northrop Grummans Cygnus spacecra… [+2652 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Machine learning helps identify the cause of an old phenomenon in meat tenderness - EurekAlert", "description": "When you bite into a juicy steak, tough isn’t what you’re looking for. There’s a lot of science behind the spectrum from tough to tender. Chaoyu Zhai, assistant professor of animal science in the College of Agriculture, Health and Natural Resources, recently …", "url": "https://www.eurekalert.org/news-releases/995188", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-07-12T02:00:32Z", "content": "When you bite into a juicy steak, tough isn’t what you’re looking for. There’s a lot of science behind the spectrum from tough to tender.\r\nChaoyu Zhai, assistant professor of animal science in UConn'… [+5153 chars]"}, {"source": {"id": null, "name": "Hurriyet Daily News"}, "author": "hurriyetdailynews.com", "title": "Webb Space Telescope spots most distant black hole - Hurriyet Daily News", "description": "Astronomers have discovered the most distant black hole yet using the Webb Space Telescope, but that record isn't expected to last.", "url": "https://www.hurriyetdailynews.com/webb-space-telescope-spots-most-distant-black-hole-184608", "urlToImage": "https://i.hurimg.com/i/hdn/75/200x200/64ad0fd74e3fe023d8ec1514.jpeg", "publishedAt": "2023-07-12T01:00:00Z", "content": "CAPE CANAVERAL, Fla.\r\nAstronomers have discovered the most distant black hole yet using the Webb Space Telescope, but that record isn't expected to last.\r\nThe black hole is at the center of a galaxy … [+1676 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals how to customize artificial tears to alleviate dry eye symptoms - News-Medical.Net", "description": "Compared to artificial tears, or eye drops, human tears are significantly more complex liquids, with a wide range of components including lipids, carbohydrates, proteins, water, and salt.", "url": "https://www.news-medical.net/news/20230711/Study-reveals-how-to-customize-artificial-tears-to-alleviate-dry-eye-symptoms.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/2/Close_up_of_the_beautiful_eye_of_a_young_child_-_Nik_Bruining_f959060df7e6466ba2733a4c18153083-620x480.jpg", "publishedAt": "2023-07-11T23:56:00Z", "content": "Compared to artificial tears, or eye drops, human tears are significantly more complex liquids, with a wide range of components including lipids, carbohydrates, proteins, water, and salt. It is this … [+2519 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Shubhangi Dua", "title": "New river flow analysis technique shows the possibility of life on Mars - Interesting Engineering", "description": "Using satellite images and the equations used to calculate river flow on Earth, scientists estimate that rivers on Mars may have once supported life.", "url": "https://interestingengineering.com/science/river-flow-analysis-shows-possibility-of-life-on-mars", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/11/image/jpeg/CpNM3J3rxZNdFgcRvVi4VasAyXqpt57EE6Oa1bUv.jpg", "publishedAt": "2023-07-11T23:09:00Z", "content": "Remote satellite data\r\nThe data from NASAs Cassini spacecraft has provided a more limited number of images of Titans surface than those of Mars, due to the moons thick atmosphere and distance from Ea… [+1284 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jennifer Nalewicki", "title": "500 million-year-old 'abnormal shrimp' used facial spikes to 'pincushion' soft prey - Livescience.com", "description": "Scientists have solved the mystery of what Anomalocaris canadensis, an extinct apex predator, may have eaten.", "url": "https://www.livescience.com/animals/extinct-species/500-million-year-old-abnormal-shrimp-used-facial-spikes-to-pincushion-soft-prey", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aFaACJUUVMRCmVJhogynMn-1200-80.jpeg", "publishedAt": "2023-07-11T20:48:30Z", "content": "An artist's depiction of Anomalocaris canadensis, a Cambrian critter that pierced its prey with its menacing appendages. (Image credit: Katrina Kenny)\r\nAround 500 million years ago, an apex predator … [+2696 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Revealing How Tin Selenide Adapts to Thermoelectric Performance - AZoM", "description": "Investigators from the FAMU-FSU College of Engineering and the National High Magnetic Field Laboratory revealed that when the compound tin selenide heats up, atomic-level structural changes occur, allowing it to conduct electricity but not heat.", "url": "https://www.azom.com/news.aspx?newsID=61594", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/SocialSharingImage_61594_16891061944615686.jpg", "publishedAt": "2023-07-11T20:11:00Z", "content": "Investigators from the FAMU-FSU College of Engineering and the National High Magnetic Field Laboratory revealed that when the compound tin selenide heats up, atomic-level structural changes occur, al… [+3299 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Reinventing cosmology: New research puts age of universe at 26.7 -- not 13.7 -- billion years - Science Daily", "description": "Our universe could be twice as old as current estimates, according to a new study that challenges the dominant cosmological model and sheds new light on the so-called 'impossible early galaxy problem.'", "url": "https://www.sciencedaily.com/releases/2023/07/230711133118.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-11T19:02:53Z", "content": "Our universe could be twice as old as current estimates, according to a new study that challenges the dominant cosmological model and sheds new light on the so-called \"impossible early galaxy problem… [+2728 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Festivals & Events News | ⚡When Will Sturgeon Moon 2023 Be Seen? Here’s Everything To Know About the Supermoon Event - LatestLY", "description": "Read Latest Festivals & Events News Quickly Here | If you love observing the moon, especially the days of a full moon, then August has two full moons. The month of August will begin with a full moon, the Sturgeon Moon. The first full moon of the month will be…", "url": "https://www.latestly.com/quickly/lifestyle/festivals-events/when-will-sturgeon-moon-2023-be-seen-here-s-everything-to-know-about-the-supermoon-event-5256792.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/07/atmosphere-close-moon-full-moon-circle-astronomy-705030-pxhere.com-1.jpg", "publishedAt": "2023-07-11T18:38:21Z", "content": "If you love observing the moon, especially the days of a full moon, then August has two full moons. The month of August will begin with a full moon, the Sturgeon Moon. The first full moon of the mont… [+36 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Highly efficient ruthenium-based catalysts with caffeine and theophylline - Science Daily", "description": "Researchers are developing highly efficient biosourced catalysts based on caffeine and theophylline, two natural substances.", "url": "https://www.sciencedaily.com/releases/2023/07/230711130745.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-11T18:36:35Z", "content": "A study by Lionel Delaude and François Mazars, researchers from the Laboratory of Catalysis at the University of Liège (Belgium), has shown that caffeine and theophylline can be used to 'green' catal… [+2738 chars]"}, {"source": {"id": null, "name": "Ynetnews"}, "author": "Ettay Nevo/Davidson Institute of Science", "title": "Satellites reignite interference woes for astronomers - Ynetnews", "description": "Space roundup: An unforeseen disruption from satellite constellations, the final launch of a veteran missile, a European space telescope, and solar power in lunar darkness", "url": "https://www.ynetnews.com/health_science/article/bkpcygsfn", "urlToImage": "https://ynet-pic1.yit.co.il/picserver5/crop_images/2023/07/11/r1xPOjgoFh/r1xPOjgoFh_1_0_580_326_0_large.jpg", "publishedAt": "2023-07-11T18:29:58Z", "content": "This week marked the final launch of the heavy-duty European rocket, Ariane 5. Launched on its last-ever mission on July 5 from the European Space Base in Kourou, French Guiana, this rocket was carry… [+7535 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Ohio State University", "title": "How an essential class of proteins can access blocked genes - Newswise", "description": "New research shows how one transcription factor functions as a special “pioneer factor” by managing to bind to a blocked segment of DNA to begin the process", "url": "https://www.newswise.com/articles/how-an-essential-class-of-proteins-can-access-blocked-genes", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-07-11T18:20:00Z", "content": "Newswise — COLUMBUS, Ohio – Genetic information contained within DNA has to be read by specific proteins that enable the process of gene activation to begin – but in many cases, these proteins can’t … [+5020 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "6 Famous Scientists Who Didn't Get the Nobel Prize for Their Work - Transcontinental Times", "description": "INDIA: The Nobel Prize is widely regarded as one of the most prestigious awards in the world, honoring individuals who have made outstanding contributions to various fields. Over the years, numerous remarkable scientists have been recognized and celebrated th…", "url": "https://www.transcontinentaltimes.com/6-scientists-didnt-get-nobel-prize/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/07/Nobel-Prize.jpg", "publishedAt": "2023-07-11T17:46:04Z", "content": "INDIA: The Nobel Prize is widely regarded as one of the most prestigious awards in the world, honoring individuals who have made outstanding contributions to various fields. Over the years, numerous … [+5353 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Chinese researchers make another new discovery from data acquired by Zhurong Mars rover - Global Times", "description": "Chinese researchers have made another new discovery while studying data acquired from China’s Zhurong Mars rover, confirming that wind and sand activities on the Martian surface have recorded changes in the ancient Martian environment. The discovery, scientis…", "url": "https://www.globaltimes.cn/page/202307/1294193.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2023/2023-04-11/08aa0b86-0626-4dd7-8ac9-6b850f38f112_s.png", "publishedAt": "2023-07-11T17:41:00Z", "content": "Photo released on June 11, 2021 by the China National Space Administration (CNSA) shows a selfie of China's first Mars rover Zhurong with the landing platform. Photo:CNSA\r\n Chinese researchers have m… [+2772 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Origins of Earth Elements: Supernova Findings in UGC 11860 Galaxy - SciTechDaily", "description": "A supernova explosion detected in the distant spiral galaxy UGC 11860 in 2014 has been studied by two teams of astronomers using the Hubble Telescope, yielding insights into the origins of chemical elements on Earth and the value of robotic telescopes in iden…", "url": "https://scitechdaily.com/origins-of-earth-elements-supernova-findings-in-ugc-11860-galaxy/", "urlToImage": "https://scitechdaily.com/images/Spiral-Galaxy-UGC-11860-Crop-scaled.jpg", "publishedAt": "2023-07-11T17:27:01Z", "content": "ByESA/HubbleJuly 11, 2023\r\nHubble Space Telescope image of the spiral galaxy UGC 11860, approximately 184 million light-years away in the Pegasus constellation, which recently played host to a highly… [+3716 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Spanish National Research Council (CSIC)", "title": "Xerces Blue butterfly genome sequenced, an icon of anthropogenic extinction - Newswise", "description": "The study has succeeded in sequencing the complete genome of the Xerces Blue butterfly, the first butterfly to become extinct.", "url": "https://www.newswise.com/articles/xerces-blue-butterfly-genome-sequenced", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2023/07/11/64ad8e5cb8b39_Low-Resxerces.jpg&width=600&height=600", "publishedAt": "2023-07-11T17:20:00Z", "content": "Newswise — The Xerces Blue moth (Glaucopsyche xerces) thrived in the sandy shores of San Francisco, USA. Urban growth wrecked much of its dwelling, leaving Golden Gate National Park as its sole refug… [+5095 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study provides unprecedented insights into the complexity of large-scale neural networks - News-Medical.Net", "description": "That experiences leave their trace in the connectivity of the brain has been known for a while, but a pioneering study by researchers at the German Center for Neurodegenerative Diseases (DZNE) and TUD Dresden University of Technology now shows how massive the…", "url": "https://www.news-medical.net/news/20230711/Study-provides-unprecedented-insights-into-the-complexity-of-large-scale-neural-networks.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2023-07-11T17:13:00Z", "content": "That experiences leave their trace in the connectivity of the brain has been known for a while, but a pioneering study by researchers at the German Center for Neurodegenerative Diseases (DZNE) and TU… [+3973 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "Aditya Kant", "title": "10 biggest moon missions of all time - The Statesman", "description": "Chandrayaan-3 is scheduled to launch to the moon from the Satish Dhawan Space Centre in Sriharikota, India, on July 14.", "url": "https://www.thestatesman.com/india/10-biggest-moon-missions-of-all-time-1503199496.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/09/Untitled-design-6-5.jpg", "publishedAt": "2023-07-11T16:06:00Z", "content": "Indias upcoming lunar mission is called Chandrayaan-3. On July 14, 2023, at 2:35 p.m. IST, Chandrayaan-3 is scheduled to launch to the moon from the Satish Dhawan Space Centre in Sriharikota, India. … [+3425 chars]"}, {"source": {"id": null, "name": "Theweekendleader.com"}, "author": "The Weekend Leader", "title": "Water on exoplanets 100x more likely: Study - The Weekend Leader", "description": "There are probably many more Earth-like exoplanets with liquid water than had been thought, significantly increasing the chance of finding life, according to a study that shows finding water on exoplanets is 100 times more likely.", "url": "https://www.theweekendleader.com/Headlines/78650/water-on-exoplanets-100x-more-likely-study.html", "urlToImage": "https://www.theweekendleader.com/admin/upload/11_07_2023_15_54_00_Enceladus-nasa.jpg?v=2023071121055252", "publishedAt": "2023-07-11T15:55:42Z", "content": "There are probably many more Earth-like exoplanets with liquid water than had been thought, significantly increasing the chance of finding life, according to a study that shows finding water on exopl… [+2064 chars]"}, {"source": {"id": null, "name": "Sicklecellanemianews.com"}, "author": "Margarida Maia, PhD", "title": "Mitapivat seen to increase hemoglobin for nearly half in SCD trial... - Sickle Cell Disease News", "description": "Treatment with mitapivat increased hemoglobin levels in up to 50% of patients with sickle cell disease in the RISE UP study's Phase 2 part.", "url": "https://sicklecellanemianews.com/?p=80725&preview=true&preview_id=80725", "urlToImage": "https://sicklecellanemianews.com/wp-content/uploads/2022/01/ClinicaltrialGraph.png", "publishedAt": "2023-07-11T15:07:23Z", "content": "For nearly half of people with sickle cell disease who took part in the Phase 2 part of a clinical trial called RISE UP, treatment with the oral medication mitapivat brought about a significant incre… [+5887 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Follow Euclid's first months in space - European Space Agency", "description": "Follow Euclid on its journey to Lagrange point L2 and find out how mission controllers at ESOC in Darmstadt are proceeding with turning on, checking and calibrating the spacecraft’s equipment, the telescope and scientific instruments, as they prepare for rout…", "url": "https://www.esa.int/Science_Exploration/Space_Science/Euclid/Follow_Euclid_s_first_months_in_space", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/06/euclid_spacecraft/24912463-1-eng-GB/Euclid_spacecraft_pillars.jpg", "publishedAt": "2023-07-11T15:03:01Z", "content": "Science &amp; Exploration11/07/2023855 views55 likes\r\nFollow Euclid on its journey to Lagrange point L2 and find out how mission controllers at ESOC in Darmstadt are proceeding with turning on, check… [+2865 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Dead whale becomes home to thriving marine life on ocean floor - India Today", "description": "Nearly 16 meters in length, the skeleton is of an unknown species of whale, however, the site is located in the migration area of the gray whale.", "url": "https://www.indiatoday.in/science/story/dead-whale-becomes-home-to-thriving-marine-life-on-ocean-floor-2405091-2023-07-11", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/media_bank/202307/dead-whale-114901-16x9.jpg?VersionId=J5NNnrU.LqoRQQw3G_znS5aohQvqUQlv", "publishedAt": "2023-07-11T14:06:56Z", "content": "By India Today Science Desk: A dead whale has become home to a thriving marine ecosystem at the bottom of the ocean and researchers have now captured the extent of this growing community under the wa… [+2340 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Md Nobhar", "title": "All you need to know about India's Chandrayaan-3 and its benefits for the US - Hindustan Times", "description": "Here is all you need is to know about Chandrayaan-3 and it's benefits for the United states. | World News", "url": "https://www.hindustantimes.com/world-news/all-you-need-to-know-about-indias-chandrayaan-3-and-its-benefits-for-the-us-101689078607395.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/07/11/1600x900/PTI07-11-2023-000178B-0_1689080484412_1689080519491.jpg", "publishedAt": "2023-07-11T13:22:25Z", "content": "The Indian Space Research Organization (ISRO) is preparing to launch Chandrayaan-3 on July 13, 2023, and the US is keen to reap the advantages of this historic lunar voyage. The White House claims th… [+3409 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Low gravity hole in Indian Ocean was caused by extinct ancient sea, scientists say - Livescience.com", "description": "Scientists have puzzled over the origins of a gravity hole in the Indian Ocean for years. Now, researchers think the sunken floor of an extinct ocean could be the cause.", "url": "https://www.livescience.com/planet-earth/rivers-oceans/indian-ocean-gravity-hole-was-caused-by-extinct-ancient-sea-scientists-say", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sGK457x4LkbHHZSGYuhLxg-1200-80.jpg", "publishedAt": "2023-07-11T13:05:12Z", "content": "Scientists may have finally identified the origins of a deep \"gravity hole\" in the Indian Ocean — a mysterious region where Earth's gravitational pull is weaker than at other parts of our planet.\r\nTh… [+3221 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "'Giant mirror in space': Astronomers discover most reflective exoplanet, 260 light years from Earth - The Economic Times", "description": "Astronomers have discovered a strange world, LTT9779b, which reflects 80% of its host star. The Neptune-sized planet is more than 260 light-years from Earth and is the first exoplanet comparable in brightness to Venus.", "url": "https://economictimes.indiatimes.com/magazines/panache/giant-mirror-in-space-astronomers-discover-most-reflective-exoplanet-260-light-years-from-earth/articleshow/101667066.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101667230,width-1070,height-580,imgsize-14398,overlay-etpanache/photo.jpg", "publishedAt": "2023-07-11T12:53:00Z", "content": "PARIS: A scorching hot world where metal clouds rain drops of titanium is the most reflective planet ever observed outside of our Solar System, astronomers said on Monday.This strange world, which is… [+2554 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "SpaceX breaks record for Falcon 9 with 16th launch of booster B1058 - Interesting Engineering", "description": "The latest launch and recovery of SpaceX's Falcon 9 booster B1058 demonstrates that the technology can safely be reused 20, not 10 times.", "url": "https://interestingengineering.com/innovation/spacex-breaks-record-falcon-9-16th-launch", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/11/image/jpeg/j2RhIR3c2TMwA0vIKpJ79hGkHgt0MNyOdqP4Z5XM.jpg", "publishedAt": "2023-07-11T12:09:00Z", "content": "SpaceX's booster B1058 was initially used in May 2020 to launch NASA crew members Doug Hurley and Bob Behnken on the Crew Dragon Demo-2 mission. This successful mission marked the end of a nearly nin… [+1272 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA awards second spacesuit task order to Axiom Space and Collins Aerospace - Devdiscourse", "description": "Read more about NASA awards second spacesuit task order to Axiom Space and Collins Aerospace  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2519078-nasa-awards-second-spacesuit-task-order-to-axiom-space-and-collins-aerospace", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/11_07_2023_17_16_06_0864081.jpg?width=920&format=jpeg", "publishedAt": "2023-07-11T12:06:59Z", "content": "NASA has awarded Axiom Space and Collins Aerospace spacesuit task orders to advance spacewalking capabilities in low Earth orbit as well as the lunar surface, the agency announced on Monday.\r\nThis is… [+1794 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "6 Key Skills That Act As Magnets For Success - Free Press Journal", "description": "6 Key Skills That Act As Magnets For Success", "url": "https://www.freepressjournal.in/ampstories/lifestyle/6-key-skills-that-act-as-magnets-for-success", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-07/be9b9fe0-b081-47c2-9dc0-9060d3516050/Untitled_design___2023_07_11T173606_372.png?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-07-11T12:06:12Z", "content": "Consistency: If you work on your goals for a day and the next day, do nothing; it won't fetch anything. Instead, consistent regular attempts would give you favourable results which will help you tast… [+8 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Sushmitha Ramakrishnan", "title": "Why we study black holes and gravitational waves - DW (English)", "description": "Scientists are hyped about a new discovery of giant gravitational waves. Seeing and hearing gravitational waves may unlock the universe's darkest secrets.", "url": "https://www.dw.com/en/why-we-study-black-holes-and-gravitational-waves/a-66109246", "urlToImage": "https://static.dw.com/image/66073589_6.jpg", "publishedAt": "2023-07-11T11:48:28Z", "content": "In June 2023, scientists announced they had found evidence to suggest that the universe is replete with a \"cosmic symphony\" of massive gravitational waves caused by pairs of black holes spinning arou… [+6944 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New Embryonic Cell Type Discovered Self-destructs To Protect The Developing Embryo - India Education Diary", "description": "Scientists studying gene activity data of the early human embryo have discovered an overlooked type of cell which self-destructs within days of forming, as part of a quality control process to protect the developing foetus. The findings give insights", "url": "https://indiaeducationdiary.in/new-embryonic-cell-type-discovered-self-destructs-to-protect-the-developing-embryo/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/07/53010090479_96cfd00c09_o.jpg", "publishedAt": "2023-07-11T11:29:23Z", "content": "Scientists studying gene activity data of the early human embryo have discovered an overlooked type of cell which self-destructs within days of forming, as part of a quality control process to protec… [+3523 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "First-ever view of the Milky Way - INSIGHTSIAS - Insights IAS", "description": "Facts for Prelims (FFP)   Source: DTE  Context:  Scientists have used data from the Ice Cube Neutrino Observatory in Antarctica to obtain the first view of the Milky Way galaxy through the lens of neutrino particles. This breakthrough provides researchers wit…", "url": "https://www.insightsonindia.com/2023/07/11/first-ever-view-of-the-milky-way/", "urlToImage": null, "publishedAt": "2023-07-11T11:27:05Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Three meteor shower events to peak in late July, says Pagasa | INQToday - INQUIRER.net", "description": "The Philippine Atmospheric, Geophysical and Astronomical Services Administration says meteor showers are set to occur thrice this month.Read more: https://in...", "url": "https://www.youtube.com/watch?v=bh60rZ0s8SA", "urlToImage": "https://i.ytimg.com/vi/bh60rZ0s8SA/maxresdefault.jpg", "publishedAt": "2023-07-11T11:19:20Z", "content": null}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Jason Bittel", "title": "Ticks can 'fly,' a 'shocking' discovery - National Geographic", "description": "Ticks can’t jump. But thanks to the forces of static electricity, sometimes, the arachnids can soar through the air, a new study says.", "url": "https://www.nationalgeographic.com/animals/article/flying-ticks-static-electricity-diseases", "urlToImage": "https://i.natgeofe.com/n/6796f2d8-3d14-4d81-be4f-b726bff3ac0f/Minden_00762286_16x9.jpg?w=1200", "publishedAt": "2023-07-11T11:02:46Z", "content": "In news absolutely no one wants to hear, scientists have just discovered that ticks can fly short distances through the air, thanks to the gravity-defying forces of static electricity.\r\nThese arachni… [+527 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Measuring and mapping the abundance of chromium across Mercury's surface - Tech Explorist", "description": "This is the first time that chromium has been directly detected and mapped across any planetary surface.", "url": "https://www.techexplorist.com/measuring-mapping-abundance-chromium-across-mercury-surface/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/chromium-mercury.jpg", "publishedAt": "2023-07-11T08:08:47Z", "content": "Mercury, the innermost planet, formed under highly reduced conditions, based mainly on surface Fe, S, and Si abundances determined from MESSENGER mission data. The minor element Cr may serve as an in… [+2591 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Musk's Starlink satellites are leaking radiation - India Today", "description": "The radiation is affecting observations as it outshines the radiation coming from astrophysical sources in the deep universe.", "url": "https://www.indiatoday.in/science/story/elon-musks-starlink-satellites-are-leaking-radiation-2404886-2023-07-11", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/media_bank/202307/starlink-072557-16x9_0.jpg?VersionId=g9VUw7Rgm6ajauk_11d6XFHScN.WKnD0", "publishedAt": "2023-07-11T08:01:48Z", "content": "By India Today Science Desk: Launched into space to enhance broadband connectivity across the planet, Elon Musk's Starlink satellite constellation is leaking 'unintended electromagnetic radiation' in… [+3085 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Naima Syed", "title": "Past Mysteries Unlocked with Pollens - Asiana Times", "description": "Extracted from the ocean beds, the sediments revealed valuable insights into the past in a study carried by the researchers from University of Naples Federico II, Italy and their associates. Sediments from ocean-beds helps in revealing intriguing past mysteri…", "url": "https://asianatimes.com/past-mysteries-unlocked-with-pollens/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/07/UGA-Today.jpg", "publishedAt": "2023-07-11T04:29:38Z", "content": "Extracted from the ocean beds, the sediments revealed valuable insights into the past in a study carried by the researchers from University of Naples Federico II, Italy and their associates.\r\nSedimen… [+3990 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Physics in a Leaf? Scientists Discover Link Between Photosynthesis and the “Fifth State of Matter” - SciTechDaily", "description": "UChicago researchers hope \"islands\" of exciton condensation could pave the way for new discoveries. Inside a lab, scientists marvel at a strange state that forms when they cool down atoms to nearly absolute zero. Meanwhile, just outside their window, trees ar…", "url": "https://scitechdaily.com/quantum-physics-in-a-leaf-scientists-discover-link-between-photosynthesis-and-the-fifth-state-of-matter/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis.jpg", "publishedAt": "2023-07-11T02:20:46Z", "content": "ByUniversity of ChicagoJuly 10, 2023\r\nScientists found that natural photosynthesis exhibits similar characteristics to exciton condensatesa frictionless energy state, typically requiring extremely lo… [+6677 chars]"}, {"source": {"id": null, "name": "Thedailytexan.com"}, "author": "Rylie Lillibridge", "title": "'The cosmic symphony of gravitational waves': UT researchers find gravitational waves shape universe - The Daily Texan", "description": "As part of a team of scientists, UT researchers found evidence for gravitational waves that shape the universe. The results were the culmination of 15 years of research. “We basically are in a bath of gravitational waves all around us,” researcher and physics…", "url": "https://thedailytexan.com/2023/07/10/the-cosmic-symphony-of-gravitational-waves-ut-researchers-find-gravitational-waves-shape-universe/", "urlToImage": "https://thedailytexan.com/wp-content/uploads/2023/07/7-10-23_Waves_Rin-Chiang.jpeg", "publishedAt": "2023-07-11T01:23:30Z", "content": "As part of a team of scientists, UT researchers found evidence for gravitational waves that shape the universe. The results were the culmination of 15 years of research.\r\nWe basically are in a bath o… [+2776 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Peek Into the Quantum Realm: MIT Physicists Generate the First Snapshots of Fermion Pairs - SciTechDaily", "description": "The images shed light on how electrons form superconducting pairs that glide through materials without friction. When your laptop or smartphone heats up, it’s due to energy that’s lost in translation. The same goes for power lines that transmit electricity be…", "url": "https://scitechdaily.com/a-peek-into-the-quantum-realm-mit-physicists-generate-the-first-snapshots-of-fermion-pairs/", "urlToImage": "https://scitechdaily.com/images/Fermion-Pair-Particle-Physics-Concept-Art.jpg", "publishedAt": "2023-07-10T22:33:41Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 10, 2023\r\nMIT physicists have successfully imaged particle pairings in a cloud of atoms, providing new insights into the behavior of electron… [+9604 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Find Time Was Slower in Quasars of Early Universe - VOA Learning English", "description": "The researchers studied the brightness of 190 quasars that existed about 1.5 billion years after the universe was created. The observations show that time moved five times more slowly back then.", "url": "https://learningenglish.voanews.com/a/scientists-find-time-was-slower-in-quasars-of-the-early-universe/7169978.html", "urlToImage": "https://gdb.voanews.com/36ce6fed-4636-4eee-a4c8-ec5ce886180d_w1200_r1.jpg", "publishedAt": "2023-07-10T21:57:13Z", "content": "A team of scientists has observed time moving slower than usual in quasars of the early universe. This effect is known as time dilation.\r\nQuasars are some of the brightest things in the universe and … [+3348 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "DC Correspondent", "title": "New show at Hyderabad planetarium from today - Deccan Chronicle", "description": "New show at Hyderabad planetarium from today", "url": "https://www.deccanchronicle.com/nation/in-other-news/110723/new-show-at-hyderabad-planetarium-from-today.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-qa4s0erqqnn5f4h8ajdh4sjr83-20230710230128.Medi.jpeg", "publishedAt": "2023-07-10T20:44:07Z", "content": "A new show launched at the B.M. Birla Planetarium would focus on high-energy physics that plays a fundamental role in understanding the universe. (Image Source: Facebook)"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Study attempts to find hidden growth of mineral dendrites - TheNewsMill", "description": "The growth of three-dimensional manganese dendrites has been reported by a research team from the University of Vienna, the Faculty of Physics at the University of Warsaw, and the University of Edinburgh. The researchers discovered that it happens as a result…", "url": "https://thenewsmill.com/2023/07/study-attempts-to-find-hidden-growth-of-mineral-dendrites/", "urlToImage": null, "publishedAt": "2023-07-10T18:44:10Z", "content": null}, {"source": {"id": null, "name": "Newswise"}, "author": "Macquarie University", "title": "Bees excel in rapid & optimal decision-making for crucial needs - Newswise", "description": "Millions of years of evolution equip honey bees to swiftly evaluate effort, risk, and reward in selecting flowers for hive sustenance, as per research in eLife.", "url": "https://www.newswise.com/articles/bees-excel-in-rapid-optimal-decision-making-for-crucial-needs", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2023/07/10/64ac4c8c687f1_Low-ResBeecloseupcreditTheotimeColin.jpg&width=600&height=600", "publishedAt": "2023-07-10T18:25:00Z", "content": "Newswise — Honey bees have to balance effort, risk and reward, making rapid and accurate assessments of which flowers are mostly likely to offer food for their hive. Research published in the journal… [+3513 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "NASA's James Webb telescope discovers the earliest strand of a mysterious 'cosmic web' | Mint - Mint", "description": "The discovery can shed light on how the universe was formed and also the invisible strings that hold it together", "url": "https://www.livemint.com/science/news/nasas-james-webb-telescope-discovers-the-earliest-strand-of-a-mysterious-cosmic-web-11689012685857.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/07/10/600x338/web_1689012928768_1689012934764.JPG", "publishedAt": "2023-07-10T18:18:36Z", "content": "Astronomers using the James Webb Telescope of Nasa have spotted a string of ancient galaxies stretching over 3 million light-years connected by a cosmic filament dating back to the early days of the … [+2427 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Selects 6 Proposals to Provide New Insights from Openly Available Data in the Physical Informatics System | Science Mission Directorate - Science@NASA", "description": "NASA’s Physical Sciences Research Program has selected six ground-based proposals in response to the Physical Science Informatics System call for proposals. This program element is part of Science Mission Directorate (SMD) Research Opportunities in Space and …", "url": "https://science.nasa.gov/science-news/biological-physical/nasa-selects-6-proposals-to-provide-new-insights-from-openly-available-data-in-the-physical-informatics-system", "urlToImage": null, "publishedAt": "2023-07-10T18:02:29Z", "content": "NASAs Physical Sciences Research Program has selected six ground-based proposals in response to the Physical Science Informatics System call for proposals. This program element is part of Science Mis… [+4212 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Luisa Hoffmann", "title": "WildDISCO: Visualizing whole bodies in unprecedented detail - Phys.org", "description": "Researchers developed a new method called wildDISCO that uses standard antibodies to map the entire body of an animal using fluorescent markers. This revolutionary technique provides detailed 3D maps of structures, shedding new light on complex biological sys…", "url": "https://phys.org/news/2023-07-wilddisco-visualizing-bodies-unprecedented.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/wilddisco-visualizing.jpg", "publishedAt": "2023-07-10T16:26:40Z", "content": "Comprehensive neuroanatomical and lymphatic mapping of the whole mouse body using wildDISCO. a, Depth color coding shows the pan-neuronal marker PGP 9.5+ neuronal projections at different z levels in… [+6639 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Two Previously Unknown Species Use the Toxic Gas Nitric Oxide To Grow - Technology Networks", "description": "In a long-term culture, scientists find and characterize two new microorganisms growing on the toxic gas nitric oxide, reducing it completely to N2.", "url": "https://www.technologynetworks.com/immunology/news/two-previously-unknown-species-use-the-toxic-gas-nitric-oxide-to-grow-375967", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/375967/two-previously-unknown-species-use-the-toxic-gas-nitric-oxide-to-grow-375967-640x360.jpg?cb=20230710", "publishedAt": "2023-07-10T16:08:17Z", "content": "Nitric oxide (NO) is a fascinating and versatile molecule, important for all living things as well as the environment. It is highly reactive and toxic, organisms use it as a signaling molecule, it de… [+4341 chars]"}, {"source": {"id": null, "name": "Eenewseurope.com"}, "author": "Wisse Hettinga", "title": "Magnetic robots that can walk, crawl, and swim - eeNews Europe", "description": "New soft-bodied robots that can be controlled by a simple magnetic field are well suited to work in confined spaces", "url": "https://www.eenewseurope.com/en/magnetic-robots-that-can-walk-crawl-and-swim/", "urlToImage": "https://ee.cdnartwhere.eu/wp-content/uploads/2023/07/Screen-Shot-2023-07-10-at-17.57.30.png", "publishedAt": "2023-07-10T16:02:52Z", "content": "MIT scientists have developed tiny, soft-bodied robots that can be controlled with a weak magnet. The robots, formed from rubbery magnetic spirals, can be programmed to walk, crawl, swim all in respo… [+1220 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Coury Turczyn", "title": "DNA-repair protein complex is a shapeshifter, reconfiguring itself to meet the demands of each task - Phys.org", "description": "Transcription factor IIH, or TFIIH, pronounced \"TF two H,\" is a veritable workhorse among the protein complexes that control human cell activity. It plays critical roles both in transcription—the highly regulated enzymatic synthesis of RNA from a DNA template…", "url": "https://phys.org/news/2023-07-dna-repair-protein-complex-shapeshifter-reconfiguring.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/georgia-state-research.jpg", "publishedAt": "2023-07-10T15:14:45Z", "content": "Transcription factor IIH, or TFIIH, pronounced \"TF two H,\" is a veritable workhorse among the protein complexes that control human cell activity. It plays critical roles both in transcriptionthe high… [+8003 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "ESA’s Aeolus satellite on its way back to Earth; currently falling around 1 km a day: Everything about first-of-its-kind assisted reentry - Devdiscourse", "description": "Read more about ESA’s Aeolus satellite on its way back to Earth; currently falling around 1 km a day: Everything about first-of-its-kind assisted reentry on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2517991-esas-aeolus-satellite-on-its-way-back-to-earth-currently-falling-around-1-km-a-day-everything-about-first-of-its-kind-assi", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_07_2023_20_17_04_4889729.jpg?width=920&format=jpeg", "publishedAt": "2023-07-10T15:11:47Z", "content": "After orbiting Earth for nearly five years, the European Space Agency's Aeolus mission is now over and the satellite has embarked on its journey back home. With its fuel supply almost depleted, the t… [+2521 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Physicist Who Bets That Gravity Can’t Be Quantized - Quanta Magazine", "description": "For decades, physicists have struggled to develop a quantum theory of gravity. But what if gravity — and space-time — are fundamentally classical?", "url": "https://www.quantamagazine.org/the-physicist-who-bets-that-gravity-cant-be-quantized-20230710/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2023/07/JonathanOppenheim-byPhilippAmmon-Social.webp", "publishedAt": "2023-07-10T14:49:37Z", "content": "Is gravity special in your view?\r\nYes. Physicists define all the other forces in terms of fields evolving in space-time. Gravity alone tells us about the geometry and curvature of space-time itself. … [+3052 chars]"}, {"source": {"id": null, "name": "Rollingstoneindia.com"}, "author": "Rolling Stone", "title": "How 'Jurassic Park' Is Becoming a Reality Thirty Years Later - Rolling Stone India", "description": "To mark the 30th anniversary of Jurassic Park, Colossal CEO Ben Lamm shares how the movie influenced his company’s plans to de-extinct animals", "url": "https://rollingstoneindia.com/how-jurassic-park-is-becoming-a-reality-thirty-years-later/", "urlToImage": "https://rollingstoneindia.com/wp-content/uploads/2023/07/MCDJUPA_EC006.jpg", "publishedAt": "2023-07-10T13:45:56Z", "content": "To mark the 30th anniversary of Jurassic Park, Colossal CEO Ben Lamm shares how the movie influenced his companys plans to de-extinct animalsI remember the first time I saw dinosaurs roar to life on … [+7250 chars]"}, {"source": {"id": null, "name": "Techbriefs.com"}, "author": "SAE Media Group", "title": "Tensegrity Robots to the Rescue - Tech Briefs", "description": "Squishy Robotics’ tensegrity sensor robots help first responders determine their approach to a disaster scene.", "url": "https://www.techbriefs.com/component/content/article/tb/pub/features/nasa-spinoff/48556", "urlToImage": "http://static.techbriefs.com/images/econa/fields/3/com_content_article/48556/tb-0823-spinoff-fig4_primary-feature-item.jpg", "publishedAt": "2023-07-10T11:07:31Z", "content": "Weighing less than three pounds, the stationary robot can be integrated with most commercial drones. (Image Squishy Robotics Inc.)\r\nDr. Alice Agogino was researching spherical, skeletal robots that m… [+7052 chars]"}]}