{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "'Weird', Long Lost Rocks Could Explain How a Hellish Earth Became Habitable - ScienceAlert", "description": "Early Earth is often described as 'Hadean' for good reason. Arising from the ashes of a collision that gave us our Moon, the primordial eon was characterized by hellish heat trapped beneath a thick blanket of carbon dioxide and water vapor.", "url": "https://www.sciencealert.com/weird-long-lost-rocks-could-explain-why-planet-earth-is-no-longer-a-flaming-hellhole", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/HadeanEarthCooling_1024.jpg", "publishedAt": "2022-03-04T21:01:31Z", "content": "Early Earth is often described as 'Hadean' for good reason. Arising from the ashes of a collision that gave us our Moon, the primordial eon was characterized by hellish heat trapped beneath a thick b… [+4442 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Good Things Come to Those Who Wait. Teams Will Begin Tapping One of the Last Unopened ... - Latest Tweet - LatestLY", "description": "The latest Tweet by NASA states, 'Good things come to those who wait. Teams will begin tapping one of the last unopened Moon rock samples acquired during Apollo 17, around 50 years ago. The goal is to learn more about the lunar surface in anticipation of upco…", "url": "https://www.latestly.com/socially/technology/science/good-things-come-to-those-who-wait-teams-will-begin-tapping-one-of-the-last-unopened-latest-tweet-by-nasa-3436338.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/04/nasa-784x441.jpg", "publishedAt": "2022-03-04T20:22:44Z", "content": "Good things come to those who wait.\r\nTeams will begin tapping one of the last unopened Moon rock samples acquired during Apollo 17, around 50 years ago. The goal is to learn more about the lunar surf… [+642 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "Iconic Tyrannosaurus may actually be three distinct species of dinosaur - ZME Science", "description": "Besides a lizard king, there may have been an emperor and queen too.", "url": "https://www.zmescience.com/science/paleontology/iconic-tyrannosaurus-may-actually-be-three-distinct-species-of-dinosaur/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2022/03/t-emperor.jpg", "publishedAt": "2022-03-04T18:31:48Z", "content": "By a wide margin, Tyrannosaurus rex is the most famous and most beloved dinosaur in the world. Named the king of the tyrant lizards, everything about this ferocious Cretaceous predator looks like it … [+5527 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Jasna Hodžić", "title": "Balkanatolia: ancient continent resolves biological paradox - Big Think", "description": "An ancient continent called Balkanatolia rose and fell in the area in and around what is now the eastern Mediterranean.", "url": "https://bigthink.com/the-past/balkanatolia-ancient-continent-biological-paradox/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-04-at-01.06.35.png", "publishedAt": "2022-03-04T18:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The oldest dinosaur precursor from South America is discovered in Brazil - Phys.org", "description": "Paleontologists from the Universidade Federal de Santa Maria (UFSM) published a study in the scientific periodic Gondwana Research describing the new fossilized specimen.", "url": "https://phys.org/news/2022-03-oldest-dinosaur-precursor-south-america.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/the-oldest-dinosaur-pr.jpg", "publishedAt": "2022-03-04T16:20:01Z", "content": "Paleontologists from the Universidade Federal de Santa Maria (UFSM) published a study in the scientific periodic Gondwana Research describing the new fossilized specimen.\r\nThe oldest dinosaurs have b… [+3014 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New details on the formation of 'metal soaps' in oil paint that hinder the conservation of artworks - Phys.org", "description": "When you think of soaps, you may first picture the liquid foams or solid bars that wash away dirt, grime and bacteria. However, not all soaps are cleansers. In the art conservation world, metal carboxylates, also known as \"metal soaps,\" are undesirable: They …", "url": "https://phys.org/news/2022-03-formation-metal-soaps-oil-hinder.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-details-on-the-for.jpg", "publishedAt": "2022-03-04T15:52:57Z", "content": "When you think of soaps, you may first picture the liquid foams or solid bars that wash away dirt, grime and bacteria. However, not all soaps are cleansers. In the art conservation world, metal carbo… [+8381 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "Last-minute defense against an asteroid that could obliterate it before impact - Phys.org", "description": "Gazing at the night sky can evoke a sense of wonder regarding humanity's place in the universe. But that's not all it can evoke. If you're knowledgeable about asteroid strikes like the one that wiped out the dinosaurs, then even a fleeting meteorite can nudge…", "url": "https://phys.org/news/2022-03-last-minute-defense-asteroid-obliterate-impact.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/last-minute-defense-ag.jpg", "publishedAt": "2022-03-04T15:50:01Z", "content": "Gazing at the night sky can evoke a sense of wonder regarding humanity's place in the universe. But that's not all it can evoke. If you're knowledgeable about asteroid strikes like the one that wiped… [+7228 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Predicting Semiconductor Solar Cell Performance From Terahertz and Microwave Spectroscopy - SciTechDaily", "description": "Many semiconducting materials are possible candidates for solar cells. In recent years, perovskite semiconductors in particular have attracted attention, as they are both inexpensive and easy to process and enable high efficiencies. Now a study with 15 partic…", "url": "https://scitechdaily.com/predicting-semiconductor-solar-cell-performance-from-terahertz-and-microwave-spectroscopy/", "urlToImage": "https://scitechdaily.com/images/Femtosecond-Laser-Laboratory.jpg", "publishedAt": "2022-03-04T15:40:43Z", "content": "In the femtosecond laser laboratory of Dr. Dennis Friedrich at HZB, the transport properties of semiconductors can be determined using terahertz or microwave spectroscopy. For this purpose, a laser l… [+3403 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Raju Singh", "title": "Amid war, US astronaut must return from space in Russian spaceship – 03/02/2022 - Play Crazy Game", "description": "Tensions between the United States and Russia after the invasion of Ukraine have been rising on Earth. At an altitude of over 400km, however, astronauts and cosmonauts from both countries coexist peacefully on the International Space Station (ISS). However, o…", "url": "https://playcrazygame.com/2022/03/04/amid-war-us-astronaut-must-return-from-space-in-russian-spaceship-03-02-2022/", "urlToImage": "https://conteudo.imguol.com.br/c/noticias/41/2020/10/14/a-nave-russa-soyuz-ms17-se-acoplou-a-iss-em-tempo-recorde-1602675960989_v2_615x300.jpg", "publishedAt": "2022-03-04T14:32:57Z", "content": "Tensions between the United States and Russia after the invasion of Ukraine have been rising on Earth. At an altitude of over 400km, however, astronauts and cosmonauts from both countries coexist pea… [+4832 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Scientists Explore Nature’s Strongest Glue to Design Even Stronger Biomaterials - AZoM", "description": "Prying a mussel from rock, wood, or anything else is tough. The underwater mollusks have a gluey secret that has fascinated researchers for a long time.", "url": "https://www.azom.com/news.aspx?newsID=58449", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_58449_16464035572862851.jpg", "publishedAt": "2022-03-04T14:31:00Z", "content": "Prying a mussel from rock, wood or anything else is tough. The underwater mollusks have a gluey secret that has fascinated researchers for a long time.\r\nImage Credit: Shutterstock.com/ Formatoriginal… [+6417 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "James Webb Space Telescope instrument gets ready to probe the universe's chemistry - Space.com", "description": "The Near-Infrared Spectrograph passed initial checkouts amid the observatory's mirror alignment activities.", "url": "https://www.space.com/james-webb-space-telescope-universe-chemistry-instrument", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BDEnFKchNdtYaXhEBL9DPP-1200-80.png", "publishedAt": "2022-03-04T14:00:54Z", "content": "NASA's James Webb Space Telescope is preparing for a deep-space chemistry experiment.\r\nDuring the observatory's commissioning and ongoing mirror alignment, Webb's Near-Infrared Spectrograph (NIRSpec)… [+3583 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "A “flower” on Mars? NASA's Curiosity rover spots a curious rock formation - Interesting Engineering", "description": "NASA's Curiosity rover spotted a rock formation in the shape of a flower during its ongoing wanderings around the red planet's Gale Crater.", "url": "https://interestingengineering.com/flower-on-mars", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/Ne6N5eBoG5/sizes/mars-curiosity_md.jpeg", "publishedAt": "2022-03-04T13:02:57Z", "content": "It's not life on Mars, but it does bear a slight resemblance.\r\nNASA's Curiosity rover spotted a rock formation in the shape of a flower during its ongoing wanderings around the red planet's Gale Crat… [+2121 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Nanometric Light Modulators Used to Study Deep Regions of the Brain - AZoNano", "description": "Scientists can depend on a formidable tool—light when it comes to recording and stimulating brain activity.", "url": "https://www.azonano.com/news.aspx?newsID=38783", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_38783_16463981157242634.jpg", "publishedAt": "2022-03-04T12:50:00Z", "content": "Scientists can depend on a formidable tool — light — when it comes to recording and stimulating brain activity. An international team of researchers, directed by Istituto Italiano di Tecnologia (Ital… [+3815 chars]"}, {"source": {"id": null, "name": "Science News"}, "author": null, "title": "Astronomers may not have found a sign of the universe’s first stars after all - Science News Magazine", "description": "A new study of radio waves from early in the universe’s history finds no hint of the “cosmic dawn” claimed by an earlier study.", "url": "https://www.sciencenews.org/article/universe-first-stars-cosmic-dawn-not-found", "urlToImage": "https://www.sciencenews.org/wp-content/uploads/2022/03/030222_ec_first-stars_feat.jpg", "publishedAt": "2022-03-04T12:00:00Z", "content": "A new study casts a haze over a hint of the universes first glimmers of starlight.\r\nIn 2018, researchers claimed that a subtle signature in radio waves from early in the universes history had reveale… [+3171 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "4-Tonne Rocket To Crash Into Moon Today, Create Huge Crater - NDTV", "description": "Astronomers won't be able to observe the crash, but expect its image will be taken by NASA's orbiter of India's Chandrayaan 2.", "url": "https://www.ndtv.com/india-news/4-tonne-rocket-to-crash-into-moon-today-create-huge-crater-2803304", "urlToImage": "https://c.ndtvimg.com/2022-02/qguvmk58_moon-pixabay_625x300_21_February_22.jpg", "publishedAt": "2022-03-04T09:35:42Z", "content": "The crash will send debris from Moon's surface to space.\r\nA wayward rocket will crash into the Moon on Friday, marking the first time that space junk is accidentally hitting the lunar surface. The fo… [+1880 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says fly your name around the moon! Get aboard the Artemis I mission, here is how - HT Tech", "description": "NASA has made an offer that you just can't refuse! You can fly your name around the moon. Know what it will take.", "url": "https://tech.hindustantimes.com/how-to/nasa-says-fly-your-name-around-the-moon-get-aboard-the-artemis-i-mission-here-is-how-71646384646364.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/04/1600x900/NASA_Artemis_I_1646384833969_1646384848201.jpg", "publishedAt": "2022-03-04T09:08:16Z", "content": "You are unlikely to fly to the moon anytime soon- or ever. However, you can definitely send your name there, courtesy this NASA offer. Yes, flying to the moon will be your name if you add it to this … [+2045 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Expanded alphabet, precise sequencing make DNA the next data storage solution - Nanowerk", "description": "Adding seven new letters to DNA's molecular alphabet and developing a precise readout method enabled researchers to transform the double helix into a robust, sustainable data storage platform fit for the Information Age.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=59951.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id59951.jpg", "publishedAt": "2022-03-04T08:40:37Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Over a kilometer wide potentially hazardous asteroid comes close to Earth | Watch - India Today", "description": "The Virtual Telescope Project 2 in Rome successfully captured the movement of the asteroid as it came close to Earth.", "url": "https://www.indiatoday.in/science/story/over-a-kilometer-wide-potentially-hazardous-asteroid-comes-close-to-earth-watch-1920600-2022-03-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Asteroid_138971_2001CB21-647x363.jpeg?lIpyGQ_g7yaCtU1Ib_6L3l3HzdiDXYak", "publishedAt": "2022-03-04T06:30:41Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Spacewatch: Nasa’s Webb telescope mirror alignment continues - The Guardian", "description": "Seven-step process to enable segments to work as a single mirror nears halfway point", "url": "https://amp.theguardian.com/science/2022/mar/04/spacewatch-nasa-webb-telescope-mirror-alignment-continues", "urlToImage": null, "publishedAt": "2022-03-04T06:00:00Z", "content": "SpacewatchSeven-step process to enable segments to work as a single mirror nears halfway point\r\nNasa has completed three of the seven stages to bring the 18 hexagonal segments of the James Webb space… [+1490 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Cutting through the clutter: Scientists develop an 'auditing' tool that can help improve the reliability of studies that explore relationships between things - Science Daily", "description": "Researchers develop tool that 'audits' the results of studies that examine interplay between variables. Using this approach, researchers identify inconsistent findings in one-third of previous association studies of gut microbiome and disease. The software ca…", "url": "https://www.sciencedaily.com/releases/2022/03/220303112229.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-04T03:38:00Z", "content": "Does coffee improve memory? Do carrots boost vision? Does vitamin D deficiency increase the risk for COVID-19?It depends.\r\nThe same research question can yield vastly different answers depending on h… [+13203 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Nicola Davis", "title": "Early stegosaur fossils may shed light on stegosaurus evolution - The Guardian", "description": "Bashanosaurus is thought to have lived about 168m years ago, according to study of fossils found in China", "url": "https://amp.theguardian.com/science/2022/mar/04/early-stegosaur-fossils-may-shed-light-on-stegosaurus-evolution", "urlToImage": null, "publishedAt": "2022-03-04T00:01:00Z", "content": "DinosaursBashanosaurus is thought to have lived about 168m years ago, according to study of fossils found in China\r\nA dinosaur that sported spine-like plates along its back is one of the earliest ste… [+4585 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Magnetic excitations could provide information transfer without heat loss: Magnons could transport information much more easily than electrical conductors - Science Daily", "description": "Just as electrons flow through an electrical conductor, magnetic excitations can travel through certain materials. Such excitations, known in physics as 'magnons' in analogy to the electron, could transport information much more easily than electrical conduct…", "url": "https://www.sciencedaily.com/releases/2022/03/220303162042.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-03T23:49:38Z", "content": "Just as electrons flow through an electrical conductor, magnetic excitations can travel through certain materials. Such excitations, known in physics as \"magnons\" in analogy to the electron, could tr… [+7149 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Two-faced orchestrator: Tis gene regulates positive and negative immune responses in plants: In a discovery important for agriculture and food safety, scientists report the genetic regulation of a model plant's immune response - Science Daily", "description": "The mechanism of plant defense mediated by the non-expressor of pathogenesis-related (NPR) genes in monocots (plants having a single embryonic leaf) is not well-documented. Now, scientists have discovered how the NPR family of genes regulate immune responses …", "url": "https://www.sciencedaily.com/releases/2022/03/220303141216.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-03T21:41:58Z", "content": "In a discovery important for agriculture and food safety, scientists report the genetic regulation of a model plant's immune response.The mechanism of plant defense mediated by the non-expressor of p… [+5015 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Neutron stars release warm winds as they devour companion stars - Space.com", "description": "When neutron stars siphon matter from a stellar companion, some of that matter is spit back out into space, creating never-before-seen warm winds, a new study shows.", "url": "https://www.space.com/warm-winds-released-by-neutron-star-study", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3zgPhqiHNbDrn2cG9AjwEM-1200-80.jpg", "publishedAt": "2022-03-03T20:14:01Z", "content": "Neutron stars release powerful warm winds after chowing down on their stellar companions, new research shows. \r\nNeutron stars\r\n are the remains of more massive stars that reached the end of their liv… [+3036 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Artemis: NASA`s crewed mission delayed till 2026 - WION", "description": "NASA has said that its first crewed Artemis mission will not see a launch before 2026. This notice has come after NASAs notification of  delays on Artemis-1 uncrewed flight around the Moon.", "url": "https://www.wionews.com/science/artemis-nasas-crewed-mission-delayed-till-2026-458714", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/12/06/225197-nasa-6.jpg", "publishedAt": "2022-03-03T18:42:01Z", "content": "NASA has said that its first crewed Artemis mission will not see a launch before 2026. This notice has come after NASA's notification of  delays on Artemis-1 uncrewed flight around the Moon. \r\nThe ag… [+2043 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Mars Explorers are Going to Need air, and Lots of it. Here’s a Technology That Might Help Them Breath... - Universe Today", "description": "In situ resource utilization (ISRU) is still a very early science.  Therefore, the technology utilized in it could be improved upon. One such technology that created one of the most useful materials for ISRU (oxygen) is MOXIE – the Mars OXygen In-situ Resourc…", "url": "https://www.universetoday.com/154809/mars-explorers-are-going-to-need-air-and-lots-of-it-heres-a-technology-that-might-help-them-breath-easy/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/03/6393.jpg", "publishedAt": "2022-03-03T17:54:26Z", "content": "In situ resource utilization (ISRU) is still a very early science.  Therefore, the technology utilized in it could be improved upon. One such technology that created one of the most useful materials … [+3872 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Thomas Macaulay", "title": "7 futuristic space technologies that NASA is exploring - The Next Web", "description": "If you're impressed by Martian rovers and helicopters, wait till you see what's on the horizon.\r\n\r\nNASA has unveiled a range of visionary tech that could be used in future space missions.\r\n\r\nThe ...", "url": "https://thenextweb.com/news/futuristic-space-technologies-that-nasa-is-funding", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2022%2F03%2FUntitled-design-1-2.jpg&signature=ffe616e2793d115dec275167ba0be2d8", "publishedAt": "2022-03-03T17:20:00Z", "content": "If youre impressed by Martian rovers and helicopters, wait till you see whats on the horizon.\r\nNASA has unveiled a range of visionary tech that could be used in future space missions.\r\nThe projects a… [+3765 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Stefanie Waldek", "title": "SpaceX successfully launches 47 Starlink satellites - Yahoo Movies Canada", "description": "SpaceX is aiming to launch more rockets in 2022 than it has in any year past, and with today’s successful Starlink launch, it’s well on its way to reaching...", "url": "https://ca.news.yahoo.com/spacex-successfully-launches-47-starlink-171608788.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/vn.hzZGhLstPvFiCHKeQ6A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/N77ZvPVt7pC.HMxVf3CH8w--~B/aD00MDAwO3c9NjAwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/techcrunch_350/e61e8e6f4f0c6cd52cbbe694c499176b", "publishedAt": "2022-03-03T17:16:08Z", "content": "SpaceX is aiming to launch more rockets in 2022 than it has in any year past, and with todays successful Starlink launch, its well on its way to reaching that goal.\r\nThe Starlink 4-9 mission lifted o… [+1897 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA's James Webb Space Telescope to double down on THIS galaxy once observed by Hubble - Republic World", "description": "NASA says that the galaxy being observed is one of the four galaxies that were once observed by the Hubble Space Telescope and are next on Webb's radar.", "url": "https://www.republicworld.com/science/space/nasas-james-webb-space-telescope-to-double-down-on-this-galaxy-once-observed-by-hubble-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/aq8tmpracxn3yelr_1646326147.jpeg", "publishedAt": "2022-03-03T17:03:00Z", "content": "NASA has released a picture of a massive merging galaxy which it says is one of the subjects the James Webb Space Telescope would study. Dubbed NGC 3256, the galaxy is one of the four galaxies that w… [+2153 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Dark energy: Neutron stars will tell us if it's only an illusion - Science Daily", "description": "Scientists provide the first simulation of neutron star collisions in extensions of general relativity relevant for cosmology, offering a new approach to test gravity.", "url": "https://www.sciencedaily.com/releases/2022/03/220303112014.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-03T16:57:57Z", "content": "A huge amount of mysterious dark energy is necessary to explain cosmological phenomena, such as the accelerated expansion of the Universe, with Einstein's theory. But what if dark energy was just an … [+3475 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Northwestern University: Kilonova afterglow potentially spotted for first time - India Education Diary", "description": "For the first time, Northwestern University-led astronomers may have detected an afterglow from a kilonova.A kilonova occurs when two neutron stars — some of the densest objects in the universe — merge to create a blast 1,000 times brighter than a cl", "url": "https://indiaeducationdiary.in/northwestern-university-kilonova-afterglow-potentially-spotted-for-first-time/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/Northwestern-University.jpg", "publishedAt": "2022-03-03T16:48:12Z", "content": "For the first time, Northwestern University-led astronomers may have detected an afterglow from a kilonova.\r\nA kilonova occurs when two neutron stars some of the densest objects in the universe merge… [+3939 chars]"}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": null, "title": "In the future, astronauts will be able to print spacesuits on a 3D printer - The Saxon", "description": "This would be a real revolution in space logistics, which would help open access to space for people of all physiques, regardless of gender, age or any other external parameters . Bonnie Dunbar, a former NASA astronaut, has noticed that many of her male colle…", "url": "https://thesaxon.org/in-the-future-astronauts-will-be-able-to-print-spacesuits-on-a-3d-printer/", "urlToImage": "https://thesaxon.org/wp-content/uploads/2022/03/v-budushhem-astronavty-smogut-pechatat-skafandry-na-3d-printere-5dd0105.jpg", "publishedAt": "2022-03-03T15:03:48Z", "content": "This would be a real revolution in space logistics, which would help open access to space for people of all physiques, regardless of gender, age or any other external parameters .\r\nBonnie Dunbar, a f… [+2115 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers discover speargun-​like mo­lecu­lar in­jec­tion sys­tems in two types of bacteria - Phys.org", "description": "Biologists from ETH Zurich have discovered speargun-like molecular injection systems in two types of bacteria and have described their structure for the first time. The special nanomachines are used by the microbes for the interaction between cells and could …", "url": "https://phys.org/news/2022-03-speargun-like-molecular-bacteria.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-discover-s.jpg", "publishedAt": "2022-03-03T15:03:29Z", "content": "Biologists from ETH Zurich have discovered speargun-like molecular injection systems in two types of bacteria and have described their structure for the first time. The special nanomachines are used … [+5353 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Why bubbles in viscoelastic liquids move faster - Phys.org", "description": "Why do large gas bubbles in viscoelastic liquids (such as polymer and protein solutions) rise so much faster than expected? An open question with great relevance for industrial production processes. Researchers at TU Graz and TU Darmstadt have now found an ex…", "url": "https://phys.org/news/2022-03-viscoelastic-liquids-faster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/why-bubbles-in-viscoel.jpg", "publishedAt": "2022-03-03T14:36:49Z", "content": "Why do large gas bubbles in viscoelastic liquids (such as polymer and protein solutions) rise so much faster than expected? An open question with great relevance for industrial production processes. … [+4379 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Engineers Demonstrate a New Method for Reducing Sulfur Pollution - AZoCleantech", "description": "Someone’s wastewater is just another person’s gold. A new Stanford University study lays the possibility for sewage to be mined for valuable elements used in fertilizers and batteries that could support smartphones and planes in the future.", "url": "https://www.azocleantech.com/news.aspx?newsID=31262", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31262_164630944179835.jpg", "publishedAt": "2022-03-03T14:15:00Z", "content": "One individual's wastewater could be another's gold. A new Stanford University study paves the way to mining sewage for valuable elements that find use in fertilizers and batteries that could support… [+4761 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "NGI uses twist to engineer 2D semiconductors with built-in memory functions - Science Daily", "description": "A team of researchers has demonstrated that slightly twisted 2D transition metal dichalcogenides (TMDs) display room-temperature ferroelectricity.", "url": "https://www.sciencedaily.com/releases/2022/03/220303102757.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-03T13:41:15Z", "content": "A team of researchers at The University of Manchester's National Graphene Institute (NGI) and the National Physical Laboratory (NPL) has demonstrated that slightly twisted 2D transition metal dichalc… [+3496 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Study of sauropod tracks shows the dinosaurs had a gait unlike any creature alive today - Phys.org", "description": "Using a new method of studying dinosaur tracks, a pair of researchers at Liverpool John Moores University has found that sauropods walked with a gait unlike any creature alive today. In their paper published in the journal Current Biology, Jens Lallensack and…", "url": "https://phys.org/news/2022-03-sauropod-tracks-dinosaurs-gait-creature.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/study-of-sauropod-trac.jpg", "publishedAt": "2022-03-03T13:33:29Z", "content": "Using a new method of studying dinosaur tracks, a pair of researchers at Liverpool John Moores University has found that sauropods walked with a gait unlike any creature alive today. In their paper p… [+2391 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "What makes plants electrically excitable - Phys.org", "description": "Plant cells use electrical signals to process and transmit information. In 1987, as a postdoc of Erwin Neher in Göttingen, biophysicist Rainer Hedrich discovered an ion channel in the central vacuole of the plant cell, which is activated by calcium and electr…", "url": "https://phys.org/news/2022-03-electrically.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/what-makes-plants-elec.jpg", "publishedAt": "2022-03-03T13:30:43Z", "content": "Plant cells use electrical signals to process and transmit information. In 1987, as a postdoc of Erwin Neher in Göttingen, biophysicist Rainer Hedrich discovered an ion channel in the central vacuole… [+4081 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "7,000-year-old grains hints at origin of Swiss pile dwellings - Phys.org", "description": "No place have researchers found more Neolithic pile dwellings than around the Alps. It is a mystery, however, how this \"building boom\" came to be. Researchers at the University of Basel have now uncovered new clues and say that settlers at Lake Varese in nort…", "url": "https://phys.org/news/2022-03-year-old-grains-hints-swiss-pile.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/7000-year-old-grains-h.jpg", "publishedAt": "2022-03-03T12:58:37Z", "content": "No place have researchers found more Neolithic pile dwellings than around the Alps. It is a mystery, however, how this \"building boom\" came to be. Researchers at the University of Basel have now unco… [+4186 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Tooth study prompts rethink of human evolution - Phys.org", "description": "A study into tooth wear in a group of wild Japanese macaques has significant implications for the study of human evolution, a University of Otago study has shown.", "url": "https://phys.org/news/2022-03-tooth-prompts-rethink-human-evolution.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/tooth-study-prompts-re.jpg", "publishedAt": "2022-03-03T12:51:13Z", "content": "A study into tooth wear in a group of wild Japanese macaques has significant implications for the study of human evolution, a University of Otago study has shown.\r\nLead author Dr. Ian Towle and Dr. C… [+3240 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Evidence Of An Ancient Human Culture Discovered In China - The Hans India", "description": "Scientists uncovered vestiges of an Old Stone Age civilisation less than 100 miles west of...", "url": "https://www.thehansindia.com/offbeat/evidence-of-an-ancient-human-culture-discovered-in-china-731739", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/03/03/1279684-sco.jpg", "publishedAt": "2022-03-03T11:00:10Z", "content": "Scientists uncovered vestiges of an Old Stone Age civilisation less than 100 miles west of Beijing, where ancient hominins manufactured tiny, blade-like implements from stone using a reddish pigment … [+2900 chars]"}, {"source": {"id": null, "name": "Krishi Jagran"}, "author": "Shivani Meena", "title": "Insect Farming Can Prove to be an Added advantage for Crop Production - Krishi Jagran ", "description": "Insect farming generates a consistent supply of waste products that may be utilized to enrich soils and boost crop growth, research says.", "url": "https://krishijagran.com/agriculture-world/insect-farming-can-prove-to-be-an-added-advantage-for-crop-production/", "urlToImage": "https://d2xsikgwxkxyoe.cloudfront.net/media/64897/insect-farming.jpg", "publishedAt": "2022-03-03T10:20:52Z", "content": "Insect Farming\r\nAccording to the authors of an Opinion piece published in the journal Trends in Plant Science, farming insects for food and animal feed will take off in the near future. According to … [+3009 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Watch Saturn, Venus and Mars forming trio in morning sky this month - Devdiscourse", "description": "Read more about Watch Saturn, Venus and Mars forming trio in morning sky this month on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/1946401-watch-saturn-venus-and-mars-forming-trio-in-morning-sky-this-month", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/11_02_2022_12_40_08_2375731.jpg?width=920&format=jpeg", "publishedAt": "2022-03-03T08:11:09Z", "content": "Early risers may notice Saturn steadily moving toward Mars and Venus each day, to form a trio low in the pre-dawn sky this month. According to NASA, the ringed planet will become more noticeable afte… [+1395 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Julianna LeMieux, PhD", "title": "New SuperFi-Cas9 Increases Fidelity Without Sacrificing Speed - GEN - Genetic Engineering ...", "description": "A redesigned Cas9 is thousands of times less likely to target the wrong stretch of DNA while remaining just as efficient as the original version.", "url": "https://www.genengnews.com/topics/genome-editing/new-superfi-cas9-increases-fidelity-without-sacrificing-speed/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/03/low-res.png", "publishedAt": "2022-03-03T08:00:14Z", "content": "CRISPRCas9 has limitations. One of the most concerning, in regards to using genome editing for therapeutic applications for humans, is off-target DNA cleavage. Although some Cas9 variants have been d… [+3856 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Latest research helps astronomers model how new stars and planets form - BollyInside", "description": "Scientists said it will provide astronomers with the information they need to understand how interstellar ice performs during the formation of stars and", "url": "https://www.bollyinside.com/news/latest-research-helps-astronomers-model-how-new-stars-and-planets-form", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-03-03T06:58:22Z", "content": "Scientists said it will provide astronomers with the information they need to understand how interstellar ice performs during the formation of stars and planets. Nineteen scientists from around the w… [+2246 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Can Now Trace Earth's History in Individual Grains of Sand - ScienceAlert", "description": "Grains of sand on a beach can tell us more than you might think about the history of the planet, new research reveals – something to think about the next time you're heading to the coast for a swim or splash around.", "url": "https://www.sciencealert.com/scientists-can-now-trace-earth-s-history-in-individual-grains-of-sand", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/SandGrains_1024.jpg", "publishedAt": "2022-03-03T05:13:38Z", "content": "Grains of sand on a beach can tell us more than you might think about the history of the planet, new research reveals something to think about the next time you're heading to the coast for a swim or … [+3234 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Ingenuity helicopter flies 20th flight on Mars, sets record - Sierra Leone Times", "description": "NASA Mars helicopter Ingenuity weighing 4-pounds landed in Mars Jezero Crater along with NASA life-hunting sample-caching Perseverance rover on 18th February 2021", "url": "https://www.bignewsnetwork.com/news/272353398/nasa-ingenuity-helicopter-completes-20th-flight-on-mars", "urlToImage": "https://cdn.bignewsnetwork.com/cus1646195833307.jpg", "publishedAt": "2022-03-03T04:48:00Z", "content": "HOUSTON, Texas: NASA's Mars helicopter, Ingenuity, weighing 4-pounds, landed in Mars' Jezero Crater along with NASA's life-hunting, sample-caching Perseverance rover on 18th February 2021.\r\nIngenuity… [+1738 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "A solar illusion: Coronal loops may not be what they seem - EurekAlert", "description": "Many coronal loops — ropey strands of plasma that scientists have long thought existed in the Sun’s atmosphere — may actually be optical illusions, according to a new paper that challenges prevailing assumptions of what we know, and don’t know, about the Sun.", "url": "https://www.eurekalert.org/news-releases/945078", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-03-03T04:18:20Z", "content": "Many coronal loops — ropey strands of plasma that scientists have long thought existed in the Sun’s atmosphere — may actually be optical illusions, according to a new paper that challenges prevailing… [+7260 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Discovery provides a more precise picture of the retina's optical properties - News-Medical.Net", "description": "Researchers at the National Eye Institute (NEI) have discovered that power-producing organelles in the eye's photoreceptor cells, called mitochondria, function as microlenses that help channel light to these cells' outer segments where it's converted into ner…", "url": "https://www.news-medical.net/news/20220302/Discovery-provides-a-more-precise-picture-of-the-retinas-optical-properties.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/3D_illustration_mitchondria_-_Wire_man__2906c5e1a5514570bffd716b0c282567-620x480.jpg", "publishedAt": "2022-03-03T02:41:00Z", "content": "Researchers at the National Eye Institute (NEI) have discovered that power-producing organelles in the eye's photoreceptor cells, called mitochondria, function as microlenses that help channel light … [+5008 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Weather satellite rockets to orbit to monitor U.S. West - CGTN", "description": "", "url": "https://news.cgtn.com/news/2022-03-03/Weather-satellite-rockets-to-orbit-to-monitor-U-S-West-185NlxKOaVq/index.html", "urlToImage": "https://news.cgtn.com/news/2022-03-03/Weather-satellite-rockets-to-orbit-to-monitor-U-S-West-185NlxKOaVq/img/6c4610d594df4505b01c6637eac171b5/6c4610d594df4505b01c6637eac171b5-750.jpeg", "publishedAt": "2022-03-03T02:35:50Z", "content": "America's newest weather satellite blasted off Tuesday to improve wildfire and flood forecasting across the western half of the country. \r\nIt's the replacement for a satellite launched exactly four y… [+2169 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Space Tourists Promise Not to Annoy Astronauts While on Space Station - Futurism", "description": "One of the world's first private sector space tourists has vowed not to irritate the actual astronauts aboard the International Space Station.", "url": "https://futurism.com/the-byte/space-tourists-promise-not-annoy", "urlToImage": "https://wp-assets.futurism.com/2022/03/space-tourists-promise-not-annoy.jpg", "publishedAt": "2022-03-02T22:20:48Z", "content": "They pinky swear they won't act like kids in a candy shop. \r\nBothering Astronauts\r\nWe can all heave huge sighs of relief knowing that the space tourists who are part of the first all-private mission … [+2108 chars]"}]}