{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX Launches Falcon 9 Resupply Rocket to ISS - Bloomberg Quicktake", "description": "SpaceX launched the Falcon 9 rocket on a mission to resupply the International Space Station. The booster rocket safely landed back on Earth a few minutes la...", "url": "https://www.youtube.com/watch?v=NwMV1ITayJU", "urlToImage": "https://i.ytimg.com/vi/NwMV1ITayJU/maxresdefault.jpg", "publishedAt": "2023-06-05T21:00:09Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "'Sooty bark disease,' harmful for maples and humans, can be monitored by pollen sampling stations - Phys.org", "description": "Especially after the last few COVID-affected years, nobody doubts that emerging infectious diseases can threaten the whole world. But humans are not the only ones at risk. With intensive global trade, many tree parasites are accidently introduced to Europe in…", "url": "https://phys.org/news/2023-06-sooty-bark-disease-maples-humans.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/the-sooty-bark-disease.jpg", "publishedAt": "2023-06-05T20:15:33Z", "content": "Especially after the last few COVID-affected years, nobody doubts that emerging infectious diseases can threaten the whole world. But humans are not the only ones at risk. With intensive global trade… [+4769 chars]"}, {"source": {"id": null, "name": "SpaceCoastDaily.com"}, "author": "Space Coast Daily", "title": "NASA's Hubble Telescope Focuses on Hazy Galaxy 50 Million Light-Years from Earth - SpaceCoastDaily.com", "description": "This moody image shows a galaxy named Messier 85, captured in all its delicate, hazy glory by the NASA/ESA Hubble Space Telescope.", "url": "https://spacecoastdaily.com/2023/06/nasas-hubble-telescope-focuses-on-hazy-galaxy-50-million-light-years-from-earth/", "urlToImage": "https://spacecoastdaily.com/wp-content/uploads/2023/06/NASA-Hubble-600-2.jpg", "publishedAt": "2023-06-05T18:29:55Z", "content": "Home » NASA’s Hubble Telescope Focuses on Hazy Galaxy 50 Million Light-Years from EarthBy Space Coast Daily  //  June 5, 2023 \r\nThis moody image shows a galaxy named Messier 85, captured in all its d… [+1512 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lois Yoksoulian", "title": "Webb Space Telescope detects universe's most distant complex organic molecules - Phys.org", "description": "Researchers have detected complex organic molecules in a galaxy more than 12 billion light-years away from Earth—the most distant galaxy in which these molecules are now known to exist. Thanks to the capabilities of the recently launched James Webb Space Tele…", "url": "https://phys.org/news/2023-06-webb-space-telescope-universe-distant.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/webb-space-telescope-d.jpg", "publishedAt": "2023-06-05T16:26:04Z", "content": "Researchers have detected complex organic molecules in a galaxy more than 12 billion light-years away from Earththe most distant galaxy in which these molecules are now known to exist. Thanks to the … [+4348 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Early Universe Crackled With Bursts of Star Formation, Webb Shows - NASA", "description": "Among the most fundamental questions in astronomy is: How did the first stars and galaxies form? NASA’s James Webb Space Telescope is already providing new insights into this question.", "url": "https://www.nasa.gov/feature/goddard/2023/early-universe-crackled-with-bursts-of-star-formation-webb-shows", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/stsci-01h1q2vfhvmajgh4wrnmk0dy52.png", "publishedAt": "2023-06-05T16:21:44Z", "content": null}, {"source": {"id": null, "name": "Science X"}, "author": null, "title": "Astronomers discover planets in NASA Kepler's final days of observations - Science X", "description": "Science X network: Science X is a network of high quality websites with most complete and comprehensive daily coverage of the full sweep of science, technology, and medicine news", "url": "https://sciencex.com/wire-news/447423294/astronomers-discover-planets-in-nasa-keplers-final-days-of-obser.html", "urlToImage": "https://scx0.b-cdn.net/tmpl/v2/img/logo_70.png", "publishedAt": "2023-06-05T16:16:32Z", "content": "A team of astrophysicists and citizen scientists have identified what may be some of the last planets NASA's retired Kepler space telescope observed during its nearly decade-long mission.\r\nThe trio o… [+4907 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Crocodiles and gharials are getting bizarre orange 'tans' in Nepal. Here's why. - Livescience.com", "description": "Researchers think it could be down to where these crocs are hanging out.", "url": "https://www.livescience.com/animals/alligators-crocodiles/crocodiles-and-gharials-are-getting-bizarre-orange-tans-in-nepal-heres-why", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wWqW8BCFYyr2akgyaL4t4o-1200-80.jpeg", "publishedAt": "2023-06-05T15:49:34Z", "content": "An alligator spotted in South Carolina turned orange in 2017 after spending the winter in a rusty iron culvert.  (Image credit: Leroy Burnell/The Post &amp; Courier/AP)\r\nFreshwater mugger crocodiles … [+3866 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "University of Alabama Huntsville", "title": "UAH professor helping to revolutionize Big Data astronomy, using statistics in a new way to decipher the universe - Newswise", "description": "The digital age has been a tremendous boon to the fields of both statistics and astronomy. However, according to Dr. Max Bonamente, a professor of physics and a", "url": "https://www.newswise.com/articles/uah-professor-helping-to-revolutionize-big-data-astronomy-using-statistics-in-a-new-way-to-decipher-the-universe", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2023/06/05/647dfea61c8e0_Bonamente758.jpg&width=600&height=600", "publishedAt": "2023-06-05T15:30:00Z", "content": "Newswise — The digital age has been a tremendous boon to the fields of both statistics and astronomy. However, according to Dr. Max Bonamente, a professor of physics and astronomy at The University o… [+4294 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Astronauts now have an expanded menu as ESA learns to fry food in space - Republic World", "description": "The European Space Agency recently conducted an experiment trying to fry food in space and make fries a staple food for astronauts during long-term missions.", "url": "https://www.republicworld.com/science/space/astronauts-now-have-an-expanded-menu-as-esa-learns-to-fry-food-in-space-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/cifpxgdfxiwcbjxp_1685964453.jpeg", "publishedAt": "2023-06-05T15:25:00Z", "content": "Scientists at the European Space Agency (ESA) have taken the first step in frying food in space. At an altitude of 2,000 feet, a research was recently conducted in microgravity conditions to see if p… [+2781 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Distinguishing environmental effects on binary black hole gravitational waveforms - Nature.com", "description": "A Bayesian approach to comparing the effects of accretion disks, dark matter or clouds of ultra-light bosons on gravitational waveforms from a black hole binary system concludes that detectors such as LISA can distinguish between these environments.", "url": "https://www.nature.com/articles/s41550-023-01990-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41550-023-01990-2/MediaObjects/41550_2023_1990_Fig1_HTML.png", "publishedAt": "2023-06-05T15:09:50Z", "content": null}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "All Large Objects in Universe Will Eventually Evaporate, Astrophysicists Say - Sci.News", "description": "In new research, astrophysicists at Radboud University show the existence of a local gravitational particle production mechanism in curved spacetimes similar to the Schwinger effect for electric fields.", "url": "https://www.sci.news/astronomy/black-hole-evaporation-11972.html", "urlToImage": "https://cdn.sci.news/images/2019/11/image_7759f-2MASS-J0521.jpg", "publishedAt": "2023-06-05T14:35:22Z", "content": "According to quantum mechanics, a vacuum state is populated by virtual particle pairs undergoing spontaneous creation and annihilation processes. These quantum fluctuations can turn into real particl… [+2747 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Mohammad Jazib", "title": "ESA's Mars Express Livestream: A Resounding Success in Sharing Mars' Wonders - Jagran Josh", "description": "One of the ace features of the Mars Express is its Visual Monitoring Camera (VMC), a high-resolution camera capable of capturing stunning images of Mars at an impressive resolution of up to 0.2 Km -45kms per pixel depending on the distance from the planet.", "url": "https://www.jagranjosh.com/general-knowledge/a-resounding-success-in-sharing-mars-wonders-1685973264-1", "urlToImage": "https://img.jagranjosh.com/images/2023/June/562023/Mars-Express-Livestream.jpg", "publishedAt": "2023-06-05T13:55:00Z", "content": "The European Space Agency (ESA) recently organized an exciting livestream event on Friday, June 2, 2023, bringing a never-before-seen view of Mars to viewers on Earth. Lasting for an hour, this live … [+3674 chars]"}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Metamaterials: Stiff and Good at Absorbing Vibrations - AZoM", "description": "Most people would prefer a mattress to a brick wall, and the decision is simple. A brick wall is rigid and does not absorb shocks or vibrations well, whereas a mattress is soft and works well as a shock absorber.", "url": "https://www.azom.com/news.aspx?newsID=61409", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_61409_16859607930784487.jpg", "publishedAt": "2023-06-05T13:52:00Z", "content": "Most people would prefer a mattress to a brick wall as a brick wall is rigid and does not absorb shocks or vibrations well, whereas a mattress is soft and works well as a shock absorber.\r\nA buckled m… [+3284 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Using gravitational lensing to measure mass of a quasar's galaxy with precision - Phys.org", "description": "A team of researchers from EPFL have found a way to use the phenomenon of strong gravitational lensing to determine with precision—about three times more precise than any other technique—the mass of a galaxy containing a quasar, as well as their evolution in …", "url": "https://phys.org/news/2023-06-gravitational-lensing-mass-quasar-galaxy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/using-gravitational-le.jpg", "publishedAt": "2023-06-05T13:36:29Z", "content": "A team of researchers from EPFL have found a way to use the phenomenon of strong gravitational lensing to determine with precisionabout three times more precise than any other techniquethe mass of a … [+5209 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "An Online Prediction Model to Help Advance Biological Discoveries - AZoRobotics", "description": "Researchers could have access to a wealth of biological knowledge by predicting where proteins will be found within a cell. This knowledge is essential for generating future scientific discoveries connected to medication development and treating conditions li…", "url": "https://www.azorobotics.com/News.aspx?newsID=14020", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ImageForNews_14020_1685965497540764.jpg", "publishedAt": "2023-06-05T13:21:00Z", "content": "Researchers could have access to a wealth of biological knowledge by predicting where proteins will be found within a cell. This knowledge is essential for generating future scientific discoveries co… [+3479 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Research investigates spectral changes of blazar OJ 287 - Phys.org", "description": "Using NASA's Neil Gherels Swift Observatory, Indian astronomers have observed a blazar known as OJ 287. Results of the observational campaign, published May 25 on the arXiv pre-print server, shed more light on the spectral changes of OJ 287, improving our kno…", "url": "https://phys.org/news/2023-06-spectral-blazar-oj.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/research-investigates.jpg", "publishedAt": "2023-06-05T13:14:53Z", "content": "Using NASA's Neil Gherels Swift Observatory, Indian astronomers have observed a blazar known as OJ 287. Results of the observational campaign, published May 25 on the arXiv pre-print server, shed mor… [+3621 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Researchers are exploring how mountains are built - Tech Explorist", "description": "Why mountains form are deeper than previously thought?", "url": "https://www.techexplorist.com/researchers-exploring-mountains-built/61386/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Calabrian-landscape.jpg", "publishedAt": "2023-06-05T12:52:06Z", "content": "The evidence from landscape change may give significant limits to historical geodynamic processes. However, the enormous uncertainty of topographic reconstruction has limited it.\r\nLead author Sean Ga… [+3658 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "James Webb Space Telescope Reveals Spectacular Image Of Distant Galaxy - Indiatimes.com", "description": "A new image clicked by the James Webb Space Telescope has offered a peek into a far-off galaxy called NGC 5068. Located about 17 million light-years away from Earth, the galaxy's image represents millions of stars.Each dot of white light represents a star, an…", "url": "https://www.indiatimes.com/technology/science-and-future/james-webb-space-telescope-reveals-spectacular-image-of-distant-galaxy-604937.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jun/1_647ddd463c3f1.png", "publishedAt": "2023-06-05T12:34:47Z", "content": "A new image clicked by the James Webb Space Telescope has offered a peek into a far-off galaxy called NGC 5068. Located about 17 million light-years away from Earth, the galaxy's image represents mil… [+1522 chars]"}, {"source": {"id": null, "name": "hortidaily.com"}, "author": null, "title": "How a mysterious protein plays a crucial role in plant growth - hortidaily.com", "description": "It's springtime on campus, which means that flowers and plants of all kinds are bursting to life, growing and blooming.\nBut why? What's going on inside a plant to drive this growth? It's a…", "url": "https://www.hortidaily.com/article/9534319/how-a-mysterious-protein-plays-a-crucial-role-in-plant-growth/", "urlToImage": "https://www.hortidaily.com/remote/https/agfstorage.blob.core.windows.net/misc/HD_com/2021/10/14/plant.jpg?preset=OgImage", "publishedAt": "2023-06-05T12:31:59Z", "content": "It's springtime on campus, which means that flowers and plants of all kinds are bursting to life, growing and blooming.\r\nBut why? What's going on inside a plant to drive this growth? It's a simple qu… [+836 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Peggy Hollinger, Clive Cookson", "title": "ESA aims to send astronauts to Moon on European rocket - Financial Times", "description": "ESA director-general outlines plan to develop independent human launch capability within a decade", "url": "https://www.ft.com/content/bced40b2-cca5-4183-b2c7-0d9c34b2c468", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fb25a3332-a222-4130-bafb-a583bb048809.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2023-06-05T12:23:53Z", "content": "The European Space Agency is drawing up proposals to develop spacecraft over the next decade that could fly ESA astronauts into orbit and to the Moon, according to its director-general Josef Aschbach… [+3847 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Escherichia coli ST2797 as a novel emerging extended-spectrum beta-lactamase Escherichia coli - News-Medical.Net", "description": "Researchers suggest that Escherichia coli ST2797 could potentially be a new type of extended-spectrum beta-lactamase (ESBL) Escherichia coli.", "url": "https://www.news-medical.net/news/20230605/Escherichia-coli-ST2797-as-a-novel-emerging-extended-spectrum-beta-lactamase-Escherichia-coli.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_750055_16859654002815915.jpg", "publishedAt": "2023-06-05T11:45:00Z", "content": "In a recent study published in the Microbiology Spectrum Journal, researchers suggest that Escherichia coli ST2797 could potentially be a new type of extended-spectrum beta-lactamase (ESBL) Escherich… [+5146 chars]"}, {"source": {"id": null, "name": "Webindia123.com"}, "author": null, "title": "Narinder Singh Kapany: The unheralded \"Father of Fiber Optics\" - news.webindia123.com", "description": "In this progressive world, our lives have completely become dependent on the internet", "url": "https://news.webindia123.com/news/Articles/World/20230605/4081667.html", "urlToImage": null, "publishedAt": "2023-06-05T11:38:12Z", "content": "<tr><td></td></tr><tr><td>\r\nIn this progressive world, our lives have completely become dependent on the internet. But ever wonder what made these interactions seamless and smooth: it's all because o… [+2592 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "SpaceX launches 22 second-generation Starlink satellites into orbit - Devdiscourse", "description": "Read more about SpaceX launches 22 second-generation Starlink satellites into orbit  on Devdiscourse", "url": "https://www.devdiscourse.com/article/technology/2477088-spacex-launches-22-second-generation-starlink-satellites-into-orbit", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/28_02_2023_10_33_43_09215.jfif?width=920&format=jpeg", "publishedAt": "2023-06-05T11:20:11Z", "content": "SpaceX's Falcon 9 rocket successfully launched 22 second-generation Starlink satellites, also known as 'V2 Mini', to low-Earth orbit on Sunday, June 4 at 8:20 a.m. ET. The launch took place from Spac… [+1750 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Peering into Cosmic Shadows: BlackGEM Telescopes Join the Hunt for Gravitational Waves - SciTechDaily", "description": "The BlackGEM array, a system of three new telescopes located at the European Southern Observatory’s (ESO) La Silla Observatory, has begun operations to detect gravitational waves caused by cosmic events like black hole and neutron star mergers. Unlike detecto…", "url": "https://scitechdaily.com/peering-into-cosmic-shadows-blackgem-telescopes-join-the-hunt-for-gravitational-waves/", "urlToImage": "https://scitechdaily.com/images/BlackGEM-Array-scaled.jpg", "publishedAt": "2023-06-05T10:47:46Z", "content": "ByEuropean Southern Observatory (ESO)June 5, 2023\r\nThe BlackGEM array, consisting of three new telescopes located at ESOs La Silla Observatory, has begun operations. This photograph shows the three o… [+9616 chars]"}, {"source": {"id": null, "name": "Newsdrum.in"}, "author": "NewsDrum Desk", "title": "5 incredible craters that will make you fall in love with the grandeur of Solar System - NewsDrum", "description": "Impact cratering happens on every solid body in the Solar System. In fact, it is the dominant process affecting the surf...", "url": "https://www.newsdrum.in/international/5-incredible-craters-that-will-make-you-fall-in-love-with-the-grandeur-of-our-solar-system", "urlToImage": "https://img-cdn.thepublive.com/fit-in/1200x627/newsdrum-in/media/media_files/cX0qTB5C3RZCpEMGtCYK.jpg", "publishedAt": "2023-06-05T10:33:37Z", "content": "Sydney: Impact cratering happens on every solid body in the Solar System. In fact, it is the dominant process affecting the surfaces on most extraterrestrial bodies today.\r\nOn Earth, however, such cr… [+5907 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "The 'breath' between atoms is a key building block for quantum technology - Tech Explorist", "description": "Vibration between two layers of atoms can be used to engineer quantum technologies.", "url": "https://www.techexplorist.com/breath-atoms-key-building-block-quantum-technology/61356/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Onpage-quantum-emitters-illustration.jpg", "publishedAt": "2023-06-05T10:33:05Z", "content": "A team led by UW ECE and Physics Professor Mo Li discovered a technique to use the “breathing” between two layers of atoms, creating a new building block for quantum technologies. \r\nBreathing is a pr… [+6056 chars]"}, {"source": {"id": null, "name": "SeafoodSource"}, "author": null, "title": "Study: Overfishing caused cod to evolve rapidly - SeafoodSource", "description": "New genetic evidence suggests the overfishing of cod in the 1900s led the fish to rapidly evolve over decades, according to a study led by Rutgers.", "url": "https://www.seafoodsource.com/news/environment-sustainability/study-overfishing-caused-cod-to-evolve-rapidly", "urlToImage": "https://divcomplatform.s3.amazonaws.com/www.seafoodsource.com/images/20c41009b016d01ef9092f82e0e87753.jpg", "publishedAt": "2023-06-05T10:04:05Z", "content": "New genetic evidence suggests the overfishing of cod in the 1900s led the fish to rapidly evolve over decades, according to a study led by Rutgers University.\r\nThe study, published in the Philosophic… [+4224 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Planktons could be an early warning sign of climate tipping point - Mint Lounge", "description": "New study shows that rising temperatures could drive plankton and other tiny oceanic organisms toward a carbon threshold, potentially exacerbating global warming", "url": "https://lifestyle.livemint.com/smart-living/environment/planktons-early-warning-signal-climate-tipping-point-111685956400816.html", "urlToImage": "https://images.livemint.com/img/2023/06/05/1140x641/phytoplankton_1685956800540_1685957094956.jpg", "publishedAt": "2023-06-05T09:45:57Z", "content": "A new study shows that rising temperatures could drive plankton and other tiny oceanic organisms toward a carbon threshold, potentially exacerbating global warming. Recent studies emphasise that its … [+2716 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Carl Zimmer", "title": "Journey to the blue yonder: How did birds first take off? - DTNEXT", "description": "Far from crazy, feathered dinosaurs have become a well-established fact, thanks largely to a trove of remarkable fossils that have been unearthed in northeast China since the mid-1990s.", "url": "https://www.dtnext.in/edit/journey-to-the-blue-yonder-how-did-birds-first-take-off-716677", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/04/738604-nation.jpg", "publishedAt": "2023-06-05T09:30:43Z", "content": "In 1993, Jurassic Park helped inspire 9-year-old Stephen Brusatte to become a paleontologist. So Dr. Brusatte was thrilled to advise the producers of last years Jurassic World: Dominion on what scien… [+3040 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "INDIATODAY", "title": "5 Terrifying Facts About the Universe - India Today", "description": "From supernova explosions to rogue planets, here are five terrifying facts about our universe.", "url": "https://www.indiatoday.in/visualstories/education/5-terrifying-facts-about-the-universe-40485-05-06-2023", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/visualstory/wp/2023/06/cropped-jongsun-lee-F-pSZO_jeE8-unsplash-scaled-1.jpg", "publishedAt": "2023-06-05T09:03:55Z", "content": "If a supernova were to occur relatively close to Earth it could have significant consequences such as radiation hazards, Ozone Depletion, etc."}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Whales' contribution to the global carbon flux is too small - Tech Explorist", "description": "Whales not to be counted on as ‘climate savers’.", "url": "https://www.techexplorist.com/whales-contribution-global-carbon-flux-small/61336/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/whale.jpg", "publishedAt": "2023-06-05T08:36:01Z", "content": "Whales have been titled climate savers in the media, with their recovery welcomed as a potential carbon solution. However, only a few studies have been performed to date providing data or model outpu… [+2493 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Scientists find key process in cell death that stops progression of cancer - WION", "description": "Scientists find key process in cell death that stops progression of cancer", "url": "https://www.wionews.com/science/scientists-find-key-process-in-cell-death-that-stop-progression-of-cancer-600762", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/05/357004-wion-images-2023-06-05t141121791.png", "publishedAt": "2023-06-05T08:33:48Z", "content": "In a first, scientists discovered new information about a key process which is involved in the early phases of programmed cell death also known as apoptosis which also stops cancer from spreading. Th… [+3104 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Satellites in danger, risk of collision high as Earth’s atmosphere heats up - India Today", "description": "The increased solar activity with several geomagnetic storms is pummeling the planet and the Earth’s atmosphere is heating up.", "url": "https://www.indiatoday.in/science/story/satellites-in-danger-risk-of-collision-high-as-earths-atmosphere-heats-up-2388960-2023-06-05", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/satellite_network-sixteen_nine.jpg?VersionId=bYdt3RIOeB9dFIIZefruPR_1sX30nTod", "publishedAt": "2023-06-05T08:11:24Z", "content": "By India Today Science Desk: Satellites in orbit are crucial for the day-to-day functioning of the planet, but they are also the most vulnerable and this time it's not from human-based activity. Inst… [+2353 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Mass Spec and AI Team Up To Determine Monomeric Polymer Sequences - Technology Networks", "description": "An AI-based mass spectrometric technique has been developed that can determine the monomeric sequence of a polymer, facilitating the development of new materials.", "url": "https://www.technologynetworks.com/analysis/news/mass-spec-and-ai-team-up-to-determine-monomeric-polymer-sequences-374196", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374196/mass-spec-and-ai-team-up-to-determine-monomeric-polymer-sequences-374196-640x360.jpg?cb=20230605", "publishedAt": "2023-06-05T08:00:48Z", "content": "The National Institute for Materials Science (NIMS) has developed an AI-based mass spectrometric technique capable of determining the monomeric sequence of a polymer. This technique may be useful in … [+2549 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Hachimoji DNA Could Help To Create New Biofuels - Technology Networks", "description": "Quantum biologists have investigated how protons move in a synthetic form of DNA not yet found in natural life.", "url": "https://www.technologynetworks.com/applied-sciences/news/hachimoji-dna-could-help-to-create-new-biofuels-374194", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374194/hachimoji-dna-could-help-to-create-new-biofuels-374194-640x360.jpg?cb=20230605", "publishedAt": "2023-06-05T08:00:48Z", "content": "Unlike naturally occurring DNA, synthetic DNA could allow scientists to engineer fresh genes or enhance existing ones, opening doors to transformative possibilities in medicine and biotechnology. Syn… [+2559 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 5 June 2023: Breathtaking Trifid Nebula - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of M20, also known as the Trifid Nebula. Know more about this amazing celestial object here.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-5-june-2023-breathtaking-trifid-nebula-71685951693459.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/05/1600x900/nasa_1685951804996_1685951810950.jpg", "publishedAt": "2023-06-05T07:57:29Z", "content": "Over the past few months, we've seen several amazing snapshots of celestial objects as part of NASA Astronomy Picture of the Day, which is published on a daily basis featuring astrophotographers from… [+1771 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Planet killer': Will Earth be wiped out by an asteroid? - news.com.au", "description": "'Planet killer' asteroids sound terrifying, so will planet Earth be wiped out by one?#Earth #asteroids #space #NASA #dinosaurs #planetsConnect with news.com....", "url": "https://www.youtube.com/watch?v=9MTQ0tWiUus", "urlToImage": "https://i.ytimg.com/vi/9MTQ0tWiUus/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYZSBcKEswDw==&rs=AOn4CLC3297WG86vqJCDPg1XSCTxpvGtBQ", "publishedAt": "2023-06-05T07:56:58Z", "content": null}, {"source": {"id": null, "name": "Inceptive Mind"}, "author": "Amit Malewar", "title": "New treatment creates stronger and more ductile steel alloys - Inceptive Mind", "description": "A new treatment tested on a high-quality steel alloy produces extraordinary strength and plasticity.", "url": "https://www.inceptivemind.com/new-treatment-creates-stronger-more-ductile-steel-alloys/31332/", "urlToImage": "https://www.inceptivemind.com/wp-content/uploads/2023/06/metal-rods.jpg", "publishedAt": "2023-06-05T07:31:35Z", "content": "Strength and flexibility are two traits that must typically be balanced rather than combined. Engineers at Purdue University and Sandia National Laboratories have developed a new treatment for high-q… [+2732 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Jellyfish in space? NASA telescope spots peculiar galaxy 700 million light-years away - Devdiscourse", "description": "Read more about Jellyfish in space? NASA telescope spots peculiar galaxy 700 million light-years away on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2476762-jellyfish-in-space-nasa-telescope-spots-peculiar-galaxy-700-million-light-years-away", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/05_06_2023_12_50_36_1775993.jpg?width=920&format=jpeg", "publishedAt": "2023-06-05T07:31:13Z", "content": "In this spectacular image captured by the NASA/ESA Hubble Space Telescope, the jellyfish galaxy JO206 takes center stage, showcasing a vibrant star-forming disc surrounded by a pale, luminous cloud o… [+2223 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Brace Yourselves: Giant Asteroid 2023 KW2 Zooms Toward Earth at 36,000 KMPH for Close Encounter Tomorrow! - Times Now", "description": "A gigantic asteroid, 2023 KW2, measuring up to 111 meters, is on its astronomical journey towards Earth, set to make a close approach tomorrow.", "url": "https://www.timesnownews.com/technology-science/brace-yourselves-giant-asteroid-2023-kw2-zooms-toward-earth-at-36000-kmph-for-close-encounter-tomorrow-article-100760112", "urlToImage": "https://static.tnn.in/thumb/msid-100760112,updatedat-1685949240541,width-1280,height-720,resizemode-75/100760112.jpg", "publishedAt": "2023-06-05T07:14:00Z", "content": "A gigantic asteroid, 2023 KW2, measuring up to 111 meters, is on its astronomical journey towards Earth"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scientists Find Mysterious Cosmic Threads In The Centre Of Milky Way - NDTV", "description": "The discovery is based on an analysis of the data captured by South African Radio Astronomy Observatory's MeerKAT radio telescope.", "url": "https://www.ndtv.com/science/scientists-find-mysterious-cosmic-threads-in-the-centre-of-milky-way-4094965", "urlToImage": "https://c.ndtvimg.com/2023-06/7brvqieo_cosmic-threads-in-milky-way-1200_625x300_05_June_23.jpg", "publishedAt": "2023-06-05T07:12:23Z", "content": "These structures are located 2,500 light years away from Earth.\r\nAn international team of scientists has discovered hundreds of mysterious structures in the centre of the Milky Way galaxy. According … [+1858 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Live | Hundreds of Mystery Structures Found at The Heart of The Milky Way | World News - TIMES NOW", "description": "Live |  A war over Taiwan would be “devastating” and affect the global economy “in ways we cannot imagine,” US Defence Secretary Lloyd Austin has warned, as ...", "url": "https://www.youtube.com/watch?v=5jkoyqXX_wc", "urlToImage": "https://i.ytimg.com/vi/5jkoyqXX_wc/hqdefault.jpg", "publishedAt": "2023-06-05T07:01:02Z", "content": null}, {"source": {"id": null, "name": "Internationalnewsandviews.com"}, "author": "INVC Desk", "title": "A Sky Gone Dim: The Impact of Light Pollution on our Starry Skies - INVC - INVC", "description": "Light pollution effects , Disappearing stars in the sky ,Twinkling stars visibility , Impact of artificial lighting , Light pollution consequences ,Night sky preservation", "url": "https://www.internationalnewsandviews.com/a-sky-gone-dim-the-impact-of-light-pollution-on-our-starry-skies368935-2/", "urlToImage": "https://www.internationalnewsandviews.com/wp-content/uploads/2023/06/spece.jpg", "publishedAt": "2023-06-05T06:10:36Z", "content": "INVC NEWSWashington  – : The claim that stars will completely disappear from the sky within the next two decades is not accurate. While light pollution does have an impact on our ability to see stars… [+4301 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Mehul Reuben Das", "title": "Tidying Up Space: Scientists are experimenting with Star Trek-like weapon to clean up space debris - Firstpost", "description": "In a development that looks straight out a Sci-Fi film or TV show, scientists at the University of Colorado, Boulder, are trying to make a 'tractor beam' or a machine that uses magnetic force to push or pull objects without touching them, to clear up space de…", "url": "https://www.firstpost.com/world/scientists-are-experimenting-with-star-trek-like-weapon-tractor-beam-to-clean-up-space-debris-12691592.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/06/Scientists-are-experimenting-with-Star-Trek-like-weapon-to-clean-up-space-debris.jpg", "publishedAt": "2023-06-05T05:46:47Z", "content": "As we draw closer to an age where space travel will be commonplace, some scientists are occupied with one question that has the potential to put a stop to Earths commonplace space travel, even before… [+4059 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Gas giants found to be rare in orbits around small red dwarf stars - News9 LIVE", "description": "The findings have implications for the chances of finding habitable rocky worlds in orbit around red dwarf stars.", "url": "https://www.news9live.com/science/gas-giants-found-to-be-rare-in-orbits-around-small-red-dwarf-stars-2165902", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/cfa-032-jupiterU-feature-Cropped.jpg", "publishedAt": "2023-06-05T05:15:11Z", "content": "The findings have implications for the chances of finding habitable rocky worlds in orbit around red dwarf stars.\r\nRed dwarf stars, smaller and dimmer than the Sun. In recent times, there has been an… [+2485 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Forget Carrington event, this is the WORST solar storm in history; it can strike again! - HT Tech", "description": "Carrington event might be the worst ‘recorded’ solar storm in history, but the Earth has suffered far worse. Know the worst solar storm in history that tech has unearthed. There is a possibility such a solar storm can strike again.", "url": "https://tech.hindustantimes.com/tech/news/forget-carrington-event-this-is-the-worst-solar-storm-in-history-it-can-strike-again-71685941541639.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/05/1600x900/forest-fire-3836834_1920_1_1685941593803_1685941593926.jpg", "publishedAt": "2023-06-05T05:08:59Z", "content": "When it comes to the worst recorded' solar storms in history, the first to come to mind is the solar storm of 1859, which is also known as the Carrington event. It was so powerful that it caused spar… [+2600 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New research reveals the genetic diversity and evolutionary history of primates - News-Medical.Net", "description": "The rich genetic diversity and evolutionary history of primates – the group that includes monkeys, apes, lemurs and humans ourselves - has been revealed in full for the first time in a new research paper published today.", "url": "https://www.news-medical.net/news/20230605/New-research-reveals-the-genetic-diversity-and-evolutionary-history-of-primates.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_750032_1685939727941999.jpg", "publishedAt": "2023-06-05T04:39:00Z", "content": "The rich genetic diversity and evolutionary history of primates – the group that includes monkeys, apes, lemurs and humans ourselves - has been revealed in full for the first time in a new research p… [+4884 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Innovative probe could deepen the understanding of key cellular messenger and lead to new drug discoveries - News-Medical.Net", "description": "A ground-breaking study by Loughborough University and the University of Oxford has led to the development of a small molecule probe that could deepen our understanding of a crucial cellular messenger and lead to the development of new therapeutic drugs.", "url": "https://www.news-medical.net/news/20230605/Innovative-probe-could-deepen-the-understanding-of-key-cellular-messenger-and-lead-to-new-drug-discoveries.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749926_16857095345409712.jpg", "publishedAt": "2023-06-05T04:18:00Z", "content": "A ground-breaking study by Loughborough University and the University of Oxford has led to the development of a small molecule probe that could deepen our understanding of a crucial cellular messenge… [+3595 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "See Venus And Mars Tangle In Twilight: The Night Sky This Week - Forbes", "description": "The stargazing highlights for the week ahead include twilight views of planets and the moon.", "url": "https://www.forbes.com/sites/jamiecartereurope/2023/06/04/see-venus-and-mars-tangle-in-twilight-the-night-sky-this-week/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6246af148347ed524aeac76b/0x0.jpg?format=jpg&crop=3150,1774,x0,y289,safe&width=1200", "publishedAt": "2023-06-04T23:15:00Z", "content": "Mars and Venus will be visible close to each other this week. \r\ngetty\r\nEach Monday I pick out the northern hemispheres celestial highlights (mid-northern latitudes) for the week ahead, but be sure to… [+3250 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study: One-third of Milky Way Planets May Hold Conditions to Support Life - VOA Learning English", "description": "A new study suggests about one-third of planets orbiting the most common stars in our Milky Way galaxy may hold liquid water, a condition needed to support life.", "url": "https://learningenglish.voanews.com/a/study-one-third-of-milky-way-planets-may-hold-conditions-to-support-life/7119351.html", "urlToImage": "https://gdb.voanews.com/01000000-0a00-0242-d3e1-08db2f1e1f99_cx0_cy9_cw0_w1200_r1.jpg", "publishedAt": "2023-06-04T22:01:33Z", "content": "A new study suggests about one-third of planets orbiting our galaxys most common stars may hold conditions to support life.\r\nThe study was based on data collected by two telescopes. Researchers invol… [+4324 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "6 million-year-old 'elephant graveyard' unearthed in Florida - The Jerusalem Post", "description": "The paleontologists uncovered the full skeletons of at least one adult and seven infant gomphotheres.", "url": "https://www.jpost.com/archaeology/article-745169", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/475509", "publishedAt": "2023-06-04T20:44:00Z", "content": "Paleontologists discovered an elephant graveyard from 5.5 million years ago in Florida, according to press reports from June 1. \r\nThe graveyard is filled with bones belonging to gomphotheres, an exti… [+1668 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Climate change is unleashing ancient \"zombie viruses\" - Earth.com", "description": "Climate change is unleashing ancient \"zombie viruses\" as ice layers melt • Earth.com", "url": "https://www.earth.com/news/climate-change-is-unleashing-ancient-zombie-viruses/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/04134521/Zombie-viruses-scaled.jpg", "publishedAt": "2023-06-04T19:46:28Z", "content": "Climate change is revealing secrets trapped within our planet’s permafrost. As the icy layers melt at an alarming rate, they are uncovering organisms thought to be extinct – ancient “zombie viruses” … [+4545 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Novel Nanoscale Ultra-Fast Microscopy Invaluable for Optimizing Semiconductor Performance - Technology Networks", "description": "A study about a class of materials called associative polymers appears to challenge a long-held understanding of how the materials, which have unique self-healing and flow properties, function at the molecular level.", "url": "https://www.technologynetworks.com/applied-sciences/news/30-year-old-dogma-in-associative-polymers-research-challenged-374218", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374218/30-year-old-dogma-in-associative-polymers-research-challenged-374218-640x360.jpg?cb=20230605", "publishedAt": "2023-06-04T18:56:15Z", "content": "A University of Virginia-led study about a class of materials called associative polymers appears to challenge a long-held understanding of how the materials, which have unique self-healing and flow … [+5687 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify 240-Million-Year-Old Mystery Ancient Marine Reptile - SciTechDaily", "description": "New research reveals that sulfur minerals that make fossils in the Norwegian archipelago are especially well-suited to radiography. X-ray analysis has led to the categorization of a previously-unidentified marine reptile fossil discovered in Edgeøya, Svalbard…", "url": "https://scitechdaily.com/scientists-identify-240-million-year-old-mystery-ancient-marine-reptile/", "urlToImage": "https://scitechdaily.com/images/Radiography-Imaging-of-a-Middle-Triassic-Mixosaurid-From-Svalbard.jpg", "publishedAt": "2023-06-04T13:11:09Z", "content": "ByPLOSJune 4, 2023\r\nPhotograph of specimen PMO 219.250. Credit: Engelschiøn et al. PLOS ONE, CC-BY 4.0\r\nNew research reveals that sulfur minerals that make fossils in the Norwegian archipelago are es… [+3753 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Grace Eliza Goodwin", "title": "Scientists saw a surge in brain activity in dying patients that could finally help explain mysterious near-dea - Business Insider India", "description": "Scientists observed a surge in brain activity in dying patients even after their hearts stopped. The activity consisted of gamma waves, which are associated", "url": "https://www.businessinsider.in/science/news/scientists-saw-a-surge-in-brain-activity-in-dying-patients-that-could-finally-help-explain-mysterious-near-death-experiences/articleshow/100745864.cms", "urlToImage": "https://www.businessinsider.in/photo/100745864/scientists-saw-a-surge-in-brain-activity-in-dying-patients-that-could-finally-help-explain-mysterious-near-death-experiences.jpg?imgsize=922882", "publishedAt": "2023-06-04T12:22:00Z", "content": "Scientists saw a surge in brain activity in dying patients. It's one of the very few times where researchers have had the opportunity to measure brain activity in humans immediately before and after … [+2065 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Earth's new “quasi-moon” will stick around for hundreds of years - Earth.com", "description": "Earth's new “quasi-moon” will stick around for hundreds of years • Earth.com", "url": "https://www.earth.com/news/earths-new-quasi-moon-will-stick-around-for-hundreds-of-years/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/04055044/Quasi-moon2-scaled.jpg", "publishedAt": "2023-06-04T11:52:47Z", "content": "Astronomers have recently discovered an asteroid that tags along with our planet during its annual journey around the sun. Dubbed 2023 FW13, this asteroid is considered by experts to be a quasi-moon … [+4054 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "Forget the 'Einstein' tile, meet the true aperiodic tile 'Spectre' - Interesting Engineering", "description": "A new tile called \"Spectre,\" a close relative of that \"Einstein\" tile revealed in March 2023, may have solved a decades-long mathematical problem.", "url": "https://interestingengineering.com/innovation/einstein-true-aperiodic-tile-spectre", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/03/image/jpeg/V4SPEZyhOHjooDO8ZtwvLDKCnw0q4hUY7bnPQnqQ.jpg", "publishedAt": "2023-06-04T11:35:00Z", "content": "Not wanting to leave this problem unsolved, the team kept working. They found a different shape closely related to the hat but could cover the surface without needing to be flipped over. It still did… [+853 chars]"}, {"source": {"id": null, "name": "Theindianpanorama.news"}, "author": "@theindpanorama", "title": "James Webb Telescope spots 9000 km long water plume erupting on Saturn’s Moon Enceladus - The Indian Panorama", "description": "Science & Technology | The James Webb Space Telescope has spied on Saturn's big Moon, Enceladus, and found water vapour plumes erupting from the surface. The plumes are over", "url": "https://www.theindianpanorama.news/science-technology/james-webb-telescope-spots-9000-km-long-water-plume-erupting-on-saturns-moon-enceladus/", "urlToImage": "https://www.theindianpanorama.news/wp-content/uploads/2023/06/James.jpg", "publishedAt": "2023-06-04T11:29:19Z", "content": "The James Webb Space Telescope has spied on Saturn’s big Moon, Enceladus, and found water vapour plumes erupting from the surface. The plumes are over 9,000 kilometers in length, giving a unique view… [+1186 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "IIT-Mandi researchers tap new energy source - our bodies - to charge laptops - Daijiworld.com", "description": "By Ganesh Bhatt\r\nNew Delhi, Jun 4 (IANS): Researchers at the Indian Institute of Technology (IIT) Mandi are developing thermoelectric materials that can efficiently convert heat into electricity.\r\nIn recent times, solar power has received a lot of attention, …", "url": "https://daijiworld.com/news/newsDisplay?newsID=1086552", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-06-04T10:47:05Z", "content": "By Ganesh Bhatt\r\nNew Delhi, Jun 4 (IANS): Researchers at the Indian Institute of Technology (IIT) Mandi are developing thermoelectric materials that can efficiently convert heat into electricity.\r\nIn… [+2352 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/newsdesk/", "title": "NASA Discovers Planet 10 Times Bigger Than Jupiter, 1 Year Of 23 Hours; Details Inside - India.com", "description": "This planet is 400 light years away from Earth and astronomers have found steam and gas in its atmosphere.", "url": "https://www.india.com/science/nasa-discovers-planet-10-times-bigger-than-jupiter-1-year-of-23-hours-details-inside-6089966/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/06/QT-WASP-18b.jpg", "publishedAt": "2023-06-04T10:46:53Z", "content": "This planet is 400 light years away from Earth and astronomers have found steam and gas in its atmosphere.\r\nThe Hubble and Spitzer telescopes detected water vapor, sodium, and potassium in WASP-39 b'… [+2176 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Evan Gough, Universe Today", "title": "This Underground Lab Is Preparing For Human Mars Missions We Might Actually Survive - Inverse", "description": "An underground lab is testing 3D printing and other futuristic tech for medical care on future Mars missions.", "url": "https://www.inverse.com/science/mars-missions-medical-experiments", "urlToImage": "https://imgix.bustle.com/uploads/getty/2023/5/31/738b6b40-cd33-4fe1-a178-533c0f3672c0-getty-1124672067.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-04T10:00:25Z", "content": "In the early days of spaceflight, just getting a satellite into Earths orbit was an accomplishment. In our era, landing rovers on other planets and bringing samples home from asteroids is the cutting… [+10726 chars]"}, {"source": {"id": null, "name": "Gearrice.com"}, "author": "Arthur Morgan", "title": "The centipede robot that defies technology to access anywhere - Gearrice", "description": "The centipede robot that can move on almost any terrain and access areas that are difficult for humans to access.", "url": "https://www.gearrice.com/update/the-centipede-robot-that-defies-technology-to-access-anywhere/", "urlToImage": "https://cdn.computerhoy.com/sites/navi.axelspringer.es/public/media/image/2023/06/robot-ciempies-3049836.jpg", "publishedAt": "2023-06-04T09:42:29Z", "content": "For many years, engineers from all over the world have been inspired by the animals that inhabit our nature to create all kinds of robots, like some inspired by amphibians, others by insects, and wit… [+1438 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cross-country culinary microbes: Uncovering a shared kitchen microbiota across European homes - News-Medical.Net", "description": "Microbial diversity in residential kitchens across five European countries was examined, revealing common bacterial genera/families and their distribution on cleaning utensils and kitchen surfaces. The study highlights variations in microbial composition by c…", "url": "https://www.news-medical.net/news/20230604/Cross-country-culinary-microbes-Uncovering-a-shared-kitchen-microbiota-across-European-homes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749972_16857292957998913.jpg", "publishedAt": "2023-06-04T06:06:00Z", "content": "Humans are constantly exposed to diverse microbes, which can have positive and adverse health effects. Considerable exposure the these microorganisms occurs indoors, with the highest bacterial coloni… [+6068 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Light-Speed Advances: Graphene Nanoprocessing With a Femtosecond Laser - SciTechDaily", "description": "Researchers at Tohoku University used a femtosecond laser to successfully micro/nanofabricate graphene films, creating multi-point holes without damage and removing contaminants. The technique could replace traditional, more complex methods, offering potentia…", "url": "https://scitechdaily.com/light-speed-advances-graphene-nanoprocessing-with-a-femtosecond-laser/", "urlToImage": "https://scitechdaily.com/images/Laser-Induced-Monolayer-Graphene-Nanoprocessing.jpg", "publishedAt": "2023-06-04T00:13:20Z", "content": "ByTohoku UniversityJune 3, 2023\r\nIllustration of a graphene film being hole-drilled by laser irradiation. The size of the carbon atoms is exaggerated and differs from the actual size. Credit: Yuuki U… [+5881 chars]"}, {"source": {"id": null, "name": "Jara.news"}, "author": "JARA News Media", "title": "Earth's energy budget is not in balance. Should we be concerned? - JARA News", "description": "Share If you like it A recent report from the World Meteorological Organization about the state of the climate indicates that the global mean temperature in 2022 was 1.15°C above the 1850-1900 (preindustrial reference period) average. Moreover, the last eight…", "url": "https://jara.news/earths-energy-budget-is-not-in-balance-should-we-be-concerned/", "urlToImage": "https://i0.wp.com/jara.news/wp-content/uploads/2023/06/file-20230429-26-xurb6x.png?resize=754%2C600&ssl=1", "publishedAt": "2023-06-03T23:59:39Z", "content": "A recent report from the World Meteorological Organization about the state of the climate indicates that the global mean temperature in 2022 was 1.15°C above the 1850-1900 (preindustrial reference pe… [+6432 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The Mildred Johnson Miss Juneteenth Pageant 2023 in Houston - FOX 26 Houston", "description": "The Mildred Johnson Miss Juneteenth Pageant has been an annual event since 2008, aiming to bring joy and celebrate the historical significance of Juneteenth....", "url": "https://www.youtube.com/watch?v=QYkkyDu7DrQ", "urlToImage": "https://i.ytimg.com/vi/QYkkyDu7DrQ/hqdefault.jpg", "publishedAt": "2023-06-03T22:49:21Z", "content": null}, {"source": {"id": null, "name": "News4social.com"}, "author": "Science Space Environment News", "title": "UAE Outlines Plans For Asteroid Mission - News 4 Social English", "description": "UAE outlines designs for asteroid mission WASHINGTON — The United Arab Emirates has produced new details about its planned mission", "url": "https://en.news4social.com/space/uae-outlines-plans-for-asteroid-mission/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/06/mbrexplorer.jpg", "publishedAt": "2023-06-03T22:31:58Z", "content": "WASHINGTON The United Arab Emirates has produced new details about its planned mission to the most important asteroid belt, one particular that is similar to an ongoing NASA mission.\r\nThe UAE House C… [+4018 chars]"}]}