{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Tech Explorist"}, "author": "Tech Explorist", "title": "DESI early data release contained nearly two million Galaxies, Quasars, and Stars - Tech Explorist", "description": "First small fraction of gigantic cosmic survey released and now available via DOE’s Berkeley Laboratory with a portion hosted by NOIRLab’s Astro Data Lab", "url": "https://www.techexplorist.com/desi-early-data-release-contained-nearly-two-million-galaxies-quasars-stars/62075/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/DESI-Observing.jpeg", "publishedAt": "2023-06-13T13:10:12Z", "content": "Nearly two million objects, including distant galaxies, quasars, and stars, comprise the early data release from the Lawrence Berkeley National Laboratory Dark Energy Spectroscopic Instrument (DESI) … [+6034 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Hubble telescope clicks a beautiful `jellyfish` galaxy - WION", "description": "NASAs Hubble telescope clicks a beautiful jellyfish galaxy", "url": "https://www.wionews.com/trending/nasa-hubble-telescope-clicks-a-beautiful-jellyfish-galaxy-603989", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/13/359197-jellyfish-galaxy.jpg", "publishedAt": "2023-06-13T12:47:57Z", "content": "James Webb Space Telescope (JWST) may be all that's bling right now but Hubble Space Telescope is like that dependable team player who does perfect work silently. It has been doing that for decades n… [+1797 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Mega-Bubble Triggers Coronial Chaos, Earth Narrowly Escapes Devastating Solar Storm - Transcontinental Times", "description": "UNITED STATES: Coronal mass ejections, gigantic eruptions of plasma and magnetic fields from the Sun's corona, are known to wreak havoc on Earth's delicate technological infrastructure. These powerful outbursts can disrupt satellite communications and power g…", "url": "https://www.transcontinentaltimes.com/earth-escape-devastating-solar-storm/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Sun.jpg", "publishedAt": "2023-06-13T12:09:47Z", "content": "UNITED STATES: In a jaw-dropping celestial spectacle, a mega-bubble collapsing in the Sun’s atmosphere set off a series of extraordinary events that had astronomers on the edge of their seats. The co… [+3798 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Webb telescope shows how the universe became transparent - The Indian Express", "description": "The James Webb Space Telescope has helped astronomers pinpoint how the gases in between stars and galaxies went from opaque to transparent, clearing up views.", "url": "https://indianexpress.com/article/technology/science/webb-telescope-universe-transparent-8660850/", "urlToImage": "https://images.indianexpress.com/2023/06/Webb-reionisation-20230613.jpg", "publishedAt": "2023-06-13T12:07:00Z", "content": "Soon after the birth of the universe, the gas in between stars and galaxies was opaque and starlight could not penetrate it. But a billion years after the big bang, this gas had become completely tra… [+1658 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New Study Expected To Discover The Theory Behind Earth’s Unique Oxygen-rich Atmosphere - India Education Diary", "description": "A new study may have found a missing link that helps explain the Earth’s unique oxygen-rich atmosphere — and the evolution of animal life on the planet.The findings in the paper Uncovering the Ediacaran phosphorus cycle, led by a Forrest Research Fou", "url": "https://indiaeducationdiary.in/new-study-expected-to-discover-the-theory-behind-earths-unique-oxygen-rich-atmosphere/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/Atmosphere-Card-1024x771.jpg", "publishedAt": "2023-06-13T12:01:05Z", "content": "A new study may have found a missing link that helps explain the Earths unique oxygen-rich atmosphere and the evolution of animal life on the planet.\r\nThe findings in the paper Uncovering the Ediacar… [+2335 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Nikhil Batra", "title": "Explained: What is the new Tatooine-Like Planet discovered by Astronomers - Jagran Josh", "description": "Astronomers have used a new technique to confirm a real-life Tatooine, the fictional planet with two suns that was home to Luke Skywalker in the famous Star Wars universe. Read below to learn more.", "url": "https://www.jagranjosh.com/general-knowledge/explained-what-is-the-new-tatooine-like-planet-discovered-by-astronomers-1686651623-1", "urlToImage": "https://img.jagranjosh.com/images/2023/June/1362023/tatooine-pl.jpg", "publishedAt": "2023-06-13T11:35:00Z", "content": "Astronomers have discovered a new planet that is eerily similar to Tatooine, the desert planet from the famous Star Wars movies. The planet has been named BEBOP-1 c, and here are all the details you … [+3552 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Where Did Earth's Water Come From? - SciTechDaily", "description": "Newly discovered exoplanets contribute to the development of a novel model that offers potential explanations for the origin of some of Earth’s signature features, such as its abundance of water. New research from Carnegie Science's Anat Shahar, along with UC…", "url": "https://scitechdaily.com/?p=280872", "urlToImage": "https://scitechdaily.com/images/Sun-Rises-Over-Earth.jpg", "publishedAt": "2023-06-13T11:33:43Z", "content": "ByCarnegie Institution for ScienceJune 13, 2023\r\nResearchers suggest that Earths water may have originated from interactions between the hydrogen-rich atmospheres and magma oceans of early planetary … [+7620 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Black holes will die, evaporate away – so will everything else - study - The Jerusalem Post", "description": "A recent study found that Stephen Hawking was correct about black holes dying by evaporating into Hawking radiation. But that fate could be shared by everything in the universe.", "url": "https://www.jpost.com/science/article-746119", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/540042", "publishedAt": "2023-06-13T11:24:00Z", "content": "Black holes, the gigantic remains of collapsed stars that are massive inescapable singularities of gravity, will eventually evaporate and fade into nothingness, something that Stephen Hawking predict… [+7416 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "Mountains up to 4.5 times the height of Mount Everest found deep inside Earth - Inshorts", "description": "Mountains with peaks up to 4.5 times higher than Mount Everest, the Earth's highest mountain above sea level, have been discovered deep inside the Earth. According to researchers, the mountains could be parts of the lower mantle that have been superheated due…", "url": "https://inshorts.com/en/news/mountains-up-to-45-times-the-height-of-mount-everest-found-deep-inside-earth-1686655359093", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2023/06_jun/13_tue/img_1686653465164_765.jpg?", "publishedAt": "2023-06-13T11:23:47Z", "content": null}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Facilitating Materials Physics Discoveries with Spectroscopy - AZoM", "description": "Terahertz (THz) spectroscopy and real-time monitoring are being combined in a ground-breaking method that will speed up the discovery of new materials, according to researchers from the University of Ottawa and the Max Planck Institute for the Science of Ligh…", "url": "https://www.azom.com/news.aspx?newsID=61457", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_61457_16866531107678087.png", "publishedAt": "2023-06-13T10:46:00Z", "content": "Terahertz (THz) spectroscopy and real-time monitoring are being combined in a ground-breaking method that will speed up the discovery of new materials, according to researchers from the University of… [+3646 chars]"}, {"source": {"id": null, "name": "FOX 2 Detroit"}, "author": "FOX 2 Detroit", "title": "University of Michigan partners with NASA to study Venus in unprecedented new mission - FOX 2 Detroit", "description": "Years of work will boil down to just an hour of skydiving for one probe, which must withstand the harshest conditions on Earth and in space.", "url": "https://www.fox2detroit.com/news/university-of-michigan-partners-with-nasa-to-study-venus-in-unprecedented-new-mission", "urlToImage": "https://images.foxtv.com/static.fox2detroit.com/www.fox2detroit.com/content/uploads/2023/06/1280/720/Davinci-Mission_Venus.jpg?ve=1&tl=1", "publishedAt": "2023-06-13T10:13:36Z", "content": "ANN ARBOR, Mich. (FOX 2) - The University of Michigan has visited just about every planet that circles our sun.\r\nIts partnership with NASA has taken technology that the school's Space Physics Researc… [+4180 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Vrinda Jain", "title": "NASA shares stunning pic of flower grown in space - Hindustan Times", "description": "Recently, Nasa shared a stunning picture of a flower that has been grown on the International Space Station. | Trending", "url": "https://www.hindustantimes.com/trending/nasa-shares-stunning-pic-of-flower-grown-in-space-101686649237862.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/13/1600x900/Space_flower_1686650307607_1686650318149.png", "publishedAt": "2023-06-13T10:00:15Z", "content": "Space and the universe are vast areas that are still being explored. Every day, researchers and scientists make fascinating discoveries that leave us in awe. Not only that, but several of them are al… [+1365 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Anticancer activity of lactoferrin-coated biosynthesized selenium nanoparticles for combating different human cancer cells via mediating apoptotic effects | Scientific Reports - Nature.com", "description": "Scientific Reports - Anticancer activity of lactoferrin-coated biosynthesized selenium nanoparticles for combating different human cancer cells via mediating apoptotic effects", "url": "https://www.nature.com/articles/s41598-023-36492-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-36492-8/MediaObjects/41598_2023_36492_Fig1_HTML.png", "publishedAt": "2023-06-13T09:33:59Z", "content": null}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Treadmill for microswimmers allows closer look at behavior - Nanowerk", "description": "Scientists created an acoustic microfluidic method that offers new opportunities to conduct experiments with swimming cells and microorganisms.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=63157.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id63157.jpg", "publishedAt": "2023-06-13T09:17:56Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "Red giant star Betelgeuse - INSIGHTSIAS - Insights IAS", "description": "Facts for Prelims (FFP) Source: TH  Context: Recent research on the massive red giant star Betelgeuse suggests that it is in its late carbon-burning stage (near the end of its life) and may explode as a supernova within a few decades.   Life Cycle of a Star: …", "url": "https://www.insightsonindia.com/2023/06/13/red-giant-star-betelgeuse/", "urlToImage": "https://www.insightsonindia.com/wp-content/uploads/2022/08/star_1.png", "publishedAt": "2023-06-13T09:02:03Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Empowering aging adults: waist-worn sensors may revolutionize independent activity monitoring and promote healthy aging - News-Medical.Net", "description": "Researchers investigated whether waist-mounted sensors could evaluate gait parameters in older adults.", "url": "https://www.news-medical.net/news/20230613/Empowering-aging-adults-waist-worn-sensors-may-revolutionize-independent-activity-monitoring-and-promote-healthy-aging.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_750836_16866465980048218.jpg", "publishedAt": "2023-06-13T08:59:00Z", "content": "In a recent study published in PLOS ONE, researchers investigated whether waist-mounted sensors could evaluate gait parameters reflecting older adults' speed, distance covered, and physical activity … [+5052 chars]"}, {"source": {"id": null, "name": "Editorji.com"}, "author": "Editorji News Desk", "title": "Brightest Gamma-Ray burst shatters existing models: Check details - Editorji", "description": "The brightest gamma-ray burst ever detected, GRB 221009A, occurred on October 9, 2022. Lasting for hundreds of seconds, it was 70 times brighter than any previous burst and had an unprecedented energy level.", "url": "https://www.editorji.com/tech-news/brightest-gamma-ray-burst-shatters-existing-models-check-details-1686645440673", "urlToImage": "https://cdn.editorji.com/pebQRTWsA9.jpg", "publishedAt": "2023-06-13T08:37:20Z", "content": "The brightest gamma-ray burst ever detected, GRB 221009A, occurred on October 9, 2022. Lasting for hundreds of seconds, it was 70 times brighter than any previous burst and had an unprecedented energ… [+871 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Fungi Lock Away Over One-Third of Global Fossil Fuel Emissions In the Soil! | Weather.com - The Weather Channel", "description": "The massive underground network of fungi could end up storing about 13 gigatons of carbon every year. This is the equivalent of 36% of total global fossil fuel emissions — more than China emits annually!", "url": "https://weather.com/en-IN/india/climate-change/news/2023-06-13-fungi-lock-one-third-of-global-fossil-fuel-emissions-in-soil", "urlToImage": "https://s.w-x.co/in-mushroom_farm.jpg", "publishedAt": "2023-06-13T08:26:32Z", "content": "Did you know that the largest organism in the world might actually be a fungus? The enormous Armillaria ostoyae fungus spans about 10 square kilometres of intricate underground roots underneath the M… [+2350 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Technology Captures Internal Plant World at Unprecedented Resolution - Technology Networks", "description": "New technology can capture the cellular life inside a plant at an unprecedented resolution, opening the door to understanding how plants respond to a changing climate and leading to more resilient crops.", "url": "https://www.technologynetworks.com/cell-science/news/new-technology-captures-internal-plant-world-at-unprecedented-resolution-374633", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374633/new-technology-captures-internal-plant-world-at-unprecedented-resolution-374633-640x360.jpg?cb=20230613", "publishedAt": "2023-06-13T08:23:05Z", "content": "The cellular life inside a plant is as vibrant as the blossom. In each plant tissuefrom root tip to leaf tipthere are hundreds of cell types that relay information about functional needs and environm… [+3080 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Web Desk", "title": "Lunar enigma: Could the Moon harbor microbial life? NASA researchers weigh in - The Week", "description": "In a groundbreaking revelation, NASA scientists suggest that the Moon, long considered a lifeless celestial body, may harbor microbial life in its dark craters located at the lunar south pole. Prabal Saxena, a planetary researcher at NASA's Goddard Space Flig…", "url": "https://www.theweek.in/news/sci-tech/2023/06/13/lunar-enigma-could-the-moon-harbor-microbial-life-nasa-researche.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2022/images/2023/2/moon-An-aircraft-passes-by-the-moon-in-Frankfurt-Germany-ap.jpg", "publishedAt": "2023-06-13T08:17:04Z", "content": "<ul><li>NASA scientists propose microbial life may exist in Moon's dark craters</li><li>Studies have provided compelling evidence for the survival of microorganisms in extreme environments</li><li>Hu… [+3394 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New method enables study of nano-sized particles - Science Daily", "description": "Researchers have created a new method of studying the smallest bioparticles in the body. The study has considerable scientific potential, such as in the development of more effective vaccines.", "url": "https://www.sciencedaily.com/releases/2023/06/230612114628.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-06-13T08:15:32Z", "content": "Researchers at Karolinska Institutet have created a new method of studying the smallest bioparticles in the body. The study, which is published in Nature Biotechnology, has considerable scientific po… [+1373 chars]"}, {"source": {"id": null, "name": "Indiatodayne.in"}, "author": "INDIATODAYNE", "title": "Animals That Produce 'Milk' But Aren’t Mammals - India Today NE", "description": "It’s not just mammals that got milk, these animals producing sort-of milks aren’t just nutrient rich, some contain stuff that help babies fight infection or establish a gut microbiome.", "url": "https://www.indiatodayne.in/visualstories/webstories/animals-that-produce-milk-but-arent-mammals-42181-13-06-2023", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/visualstory/wp/2023/06/pixabay_pink_flamingos.jpg", "publishedAt": "2023-06-13T08:06:14Z", "content": "Nematodes\r\nA nematode, a microscopic soil-dwelling roundworm, doesnt have a heart or blood, and their entire body only has about 1,000 cells (a human body has about 30,000,000,000,000 cells). Yet in … [+277 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "The Fermi-Pasta-Ulam-Tsingou Paradox Reveals Astonishing Insights into Nonlinear Dynamics - Transcontinental Times", "description": "NEW MEXICO: In the realm of scientific mysteries, few have captured the imagination of physicists quite like the Fermi-Pasta-Ulam-Tsingou (FPUT) paradox. In the 1950s, this paradox originated from an unexpected discovery, challenging our understanding of nonl…", "url": "https://www.transcontinentaltimes.com/the-fermi-pasta-ulam-tsingou-paradox/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Fermi-Pasta-Ulam-Tsingou.jpg", "publishedAt": "2023-06-13T08:05:42Z", "content": "NEW MEXICO: In the realm of scientific mysteries, few have captured the imagination of physicists quite like the Fermi-Pasta-Ulam-Tsingou (FPUT) paradox.\r\nIn the 1950s, this paradox originated from a… [+3444 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Sanskar Tiwari", "title": "All Facts Related to the Solar System - News Track English", "description": "Welcome to our comprehensive guide on all the fascinating facts related to the solar system. The solar system is an awe-inspiring expanse of celestial bodies that has captivated human curiosity for centuries. In this article, we will explore everything from t…", "url": "https://english.newstracklive.com/news/all-facts-related-to-the-solar-system-a-comprehensive-guide-emc-sc71-nu384-ta384-1280445-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Jun/13/big_thumb/Solar-System_64881c99d55b6.jpeg", "publishedAt": "2023-06-13T07:53:28Z", "content": "Welcome to our comprehensive guide on all the fascinating facts related to the solar system. The solar system is an awe-inspiring expanse of celestial bodies that has captivated human curiosity for c… [+6667 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Fly me to the Moon | Watch Musk's Falcon-9 crisscrosses across the Moon with 54 satellites - India Today", "description": "The Falcon-9 rocket is seen crisscrossing across the Moon in the night sky as it launches with 52 Starlink satellites", "url": "https://www.indiatoday.in/science/story/watch-elon-musks-spacex-falcon-9-moon-transit-200-rocket-landings-2392417-2023-06-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/falcon-9_moon-sixteen_nine.jpg?VersionId=flvPX24FuTgateMl3XUwDJDnOxJ9kW_W", "publishedAt": "2023-06-13T07:35:40Z", "content": "By India Today Science Desk: SpaceX has been known for ruling social media with its picturesque launches and precise landing of the rockets after delivering payloads into space. A new video is now ad… [+1539 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Jupiter's moons engage in celestial dance across Giant Red Spot - Devdiscourse", "description": "Read more about Jupiter's moons engage in celestial dance across Giant Red Spot on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2486461-jupiters-moons-engage-in-celestial-dance-across-giant-red-spot", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/13_06_2023_12_06_42_601613.jpg?width=920&format=jpeg", "publishedAt": "2023-06-13T06:53:43Z", "content": "Image Credit: NASA; ESA, JPL, Cassini Imaging Team, SSI; Processing: Kevin M. Gill\r\nNASA's Astronomy Picture of the Day (APOD) is a stunning video showcasing two of Jupiter's largest moons, Europa an… [+2008 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "First man-made object to cross the central Solar System - The Hans India", "description": "Pioneer 10 became the first man-made object to cross the central Solar System after crossing Neptune which at the time was the farthest planet from the Sun.", "url": "https://www.thehansindia.com/life-style/first-man-made-object-to-cross-the-central-solar-system-802661", "urlToImage": "https://assets.thehansindia.com/h-upload/2023/06/13/1357584-ol.jpg", "publishedAt": "2023-06-13T02:31:59Z", "content": "June 13, 1983: Pioneer 10 became the first man-made object to cross the central Solar System after crossing Neptune which at the time was the farthest planet from the Sun. Pioneer 10 (originally desi… [+688 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Open Space June 19th 2023: Live QA with Fraser - Fraser Cain", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/watch?v=UAJAXxRpZn4", "urlToImage": null, "publishedAt": "2023-06-13T01:25:36Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Bird Brains Can Sense Magnetic Fields With The Flick of a Switch - ScienceAlert", "description": "After a long-distance trip under the polite, if slightly repetitive instruction of your favorite GPS app, nothing is worse that being told how to navigate your own neighborhood.", "url": "https://www.sciencealert.com/bird-brains-can-sense-magnetic-fields-with-the-flick-of-a-switch", "urlToImage": "https://www.sciencealert.com/images/2023/05/BirdBrainSwitch.jpg", "publishedAt": "2023-06-13T00:49:47Z", "content": "After a long-distance trip under the polite, if slightly repetitive instruction of your favorite GPS app, nothing is worse that being told how to navigate your own neighborhood.\r\nMigratory birds that… [+3781 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Physicists have discovered a new state of matter – a crystal of bosons - The Times Hub", "description": "Spread the love Scientists have developed an exotic material composed of ordered excitons. The study is published in the journal Science. Physicists reported the discovery of an exotic state of matter – a boson-correlated insulator. It consists of excitons “c…", "url": "https://thetimeshub.in/physicists-have-discovered-a-new-state-of-matter-a-crystal-of-bosons/", "urlToImage": null, "publishedAt": "2023-06-12T23:07:29Z", "content": "Scientists have developed an exotic material composed of ordered excitons. The study is published in the journal Science. \r\nPhysicists reported the discovery of an exotic state of matter – a boson-co… [+450 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "The Tarantula Nebula Shouldn't Be Forming Stars. What's Going On? - Universe Today", "description": "The Tarantula Nebula is a star formation region in the Large Magellanic Cloud (LMC). Tarantula is about 160,000 light-years away and is highly luminous for a non-stellar object. It’s the brightest and largest star formation region in the entire Local Group of…", "url": "https://www.universetoday.com/161885/the-tarantula-nebula-shouldnt-be-forming-stars-whats-going-on/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/30Doradus-1024x786-1.jpg", "publishedAt": "2023-06-12T21:14:54Z", "content": "The Tarantula Nebula is a star formation region in the Large Magellanic Cloud (LMC). Tarantula is about 160,000 light-years away and is highly luminous for a non-stellar object. It’s the brightest an… [+10067 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How NASA plans to use Parker Solar Probe to avert the 'internet apocalypse' | WION Originals - WION", "description": "Internet rules the world. It is as essential as bread butter to human beings today. People cannot think about even a couple of hours without the internet. Im...", "url": "https://www.youtube.com/watch?v=TIQdugAabIw", "urlToImage": "https://i.ytimg.com/vi/TIQdugAabIw/maxresdefault.jpg", "publishedAt": "2023-06-12T21:00:19Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "RSC Prize winners 2023 Group 4 - Royal Society Of Chemistry", "description": "We are recognising more than 60 individuals and teams for their exceptional achievements in advancing the chemical sciences.Our prizes recognise those across...", "url": "https://www.youtube.com/watch?v=a-SMutqrXPw", "urlToImage": "https://i.ytimg.com/vi/a-SMutqrXPw/maxresdefault.jpg", "publishedAt": "2023-06-12T20:00:01Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Space food: Why Mars astronauts won't have to hold the fries (video) - Space.com", "description": "Frying works in microgravity, a recent study shows.", "url": "https://www.space.com/space-food-frying-works-microgravity", "urlToImage": "https://cdn.mos.cms.futurecdn.net/324WKJ7r5ytRk6GxX3Yi2C-1200-80.jpeg", "publishedAt": "2023-06-12T19:49:19Z", "content": "Astronauts heading to the moon and Mars in the relatively near future will be pleased to learn that there's one type of comfort food they can take with them — french fries.\r\nExperiments conducted by … [+3102 chars]"}, {"source": {"id": null, "name": "SpacePolicyOnline.com"}, "author": null, "title": "Weekly Roundup for SpacePolicyOnline.com: June 5-11, 2023 – SpacePolicyOnline.com - SpacePolicyOnline.com", "description": "Posted: June 12, 2023 2:50 pm ET | Last Updated: June 12, 2023 2:50 pm ET | Link to all the articles published on SpacePolicyOnline.com during the week of June 5-11, 2023 including NASA's Pam Melroy acknowledging NASA is unlikely to get all the money request …", "url": "https://spacepolicyonline.com/news/weekly-roundup-for-spacepolicyonline-com-june-5-11-2023/", "urlToImage": null, "publishedAt": "2023-06-12T18:50:00Z", "content": "Here are links to all the articles published on SpacePolicyOnline.com during the week of June 5-11, 2023, including our Whats Happening in Space Policy for this coming week. Click on each title to re… [+2979 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Dying stars may be a source of gravitational waves - Earth.com", "description": "Dying stars may be a source of gravitational waves • Earth.com", "url": "https://www.earth.com/news/dying-stars-may-be-a-source-of-gravitational-waves/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/12124010/cocoon1-scaled.jpg", "publishedAt": "2023-06-12T18:41:34Z", "content": "Until now, astrophysicists have only managed to detect gravitational waves from binary systems, such as the mergers of either two black holes, two neutron stars, or one of each. However, a team of sc… [+5820 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Wow! Amazing video shows International Space Station crossing the sun during spacewalk - Space.com", "description": "The station passes over a sunspot big enough to swallow Earth.", "url": "https://www.space.com/space-station-crossing-sun-during-spacewalk-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dYfbZsvsnhTvtPcGdfGhMo-1200-80.jpeg", "publishedAt": "2023-06-12T18:00:53Z", "content": "Capturing footage of the International Space Station (ISS) hurtling through space at approximately 17,500 mph (28,000 km/h) is no mean feat, yet French astrophotographer Thierry Legault has pulled it… [+2934 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Neanderthal genes still influence modern humans • Earth.com - Earth.com", "description": "Neanderthal genes still influence modern humans • Earth.com", "url": "https://www.earth.com/news/neanderthal-genes-still-influence-modern-humans/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/12094910/Neanderthal-genes.jpg", "publishedAt": "2023-06-12T15:57:13Z", "content": "Recent studies have found that Neanderthal genes comprise between one and four percent of the genome of present-day humans. However, how many of those genes are still actively influencing human trait… [+5279 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Webb Telescope Will Soon Get a Tiny Sidekick to Explore Alien Worlds - Gizmodo", "description": "NASA selected the $8.5 million cubesat to aid the Webb telescope, and together the space-base duo will observe the cosmos in ultraviolet light.", "url": "https://gizmodo.com/webb-telescope-tiny-sidekick-explore-exoplanets-1850529063", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/b5d9e7e7d1743102bc8d74788d1822d3.jpg", "publishedAt": "2023-06-12T15:55:00Z", "content": "For more than a year, the largest space-based telescope ever built has been observing the far ends of the cosmos with unprecedented detail. The Webb Space Telescope could soon get a little extra help… [+2483 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Moon causing earthquakes? Experts are amazed by its power - Geo News", "description": "With these huge datasets, they started to get some small but significant correlation, says expert", "url": "https://www.geo.tv/latest/492769-moon-causing-earthquakes-experts-are-amazed-by-its-power", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-06-12/492769_065140_updates.jpg", "publishedAt": "2023-06-12T15:42:00Z", "content": "It is a well-known fact that the moon has effects on Earth's oceans. But experts have claimed that the planets natural satellite produces forces which could cause earthquakes on our planet. \r\nExperts… [+3015 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Athletes` Eyesight May Improve By Adding Fresh Foods To Their Diet: Study - Zee News", "description": "Diet Tracking Essential Element For Effective Weight Loss: Study Visual range, or how well a person can see a target clearly over distance, is a critical asset for top athletes in almost any sport. The reason why objects get harder to see and appear fuzzier t…", "url": "https://zeenews.india.com/health/athletes-eyesight-may-improve-by-adding-fresh-foods-to-their-diet-study-2620834", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/06/12/1218875-athletes.jpg", "publishedAt": "2023-06-12T14:55:46Z", "content": "Nutrition is an essential component of every elite athlete's training programme. A recent study from the University of Georgia suggests that athletes' visual range might be improved by boosting their… [+4041 chars]"}, {"source": {"id": null, "name": "Businessnewsthisweek.com"}, "author": "Neel Achary", "title": "Insights into Redox-Independent Cellular Stress Response - Business News This Week", "description": "Stay connected with Business News This Week for business news, news this week, news headlines, business news, health, education, startups", "url": "http://businessnewsthisweek.com/health/insights-into-redox-independent-cellular-stress-response/", "urlToImage": "https://mediaexpress24.com/wp-content/uploads/2023/06/Infographic-1.jpg", "publishedAt": "2023-06-12T13:15:45Z", "content": "Researchers identify the regulatory pathway that governs a type of redox-independent stress response involving NRF2\r\nNuclear factor erythroid 2-related factor 2 (NRF2) is a master transcription facto… [+5263 chars]"}, {"source": {"id": null, "name": "Observervoice.com"}, "author": "OV Digital Desk", "title": "13 June: Anniversary of Asteroid Explorer Hayabusa Returns - Observer Voice", "description": "Hayabusa, also known as Hayabusa 1 or Hayabusa-MUSES-C, was a Japanese space probe designed to study the asteroid Itokawa.", "url": "https://observervoice.com/13-june-anniversary-of-asteroid-explorer-hayabusa-returns-25679/", "urlToImage": "https://observervoice.com/wp-content/uploads/2023/06/Asteroid-Explorer-Hayabusa.jpg", "publishedAt": "2023-06-12T12:54:23Z", "content": "Hayabusa, also known as Hayabusa 1 or Hayabusa-MUSES-C, was a Japanese space probe designed to study the asteroid Itokawa. It was launched by the Japan Aerospace Exploration Agency (JAXA) on May 9, 2… [+2902 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "China plans to launch a Moon-orbiting telescope by 2026 - NewsBytes", "description": "China has come up with a rather novel idea to study the Moon", "url": "https://www.newsbytesapp.com/news/science/china-to-launch-moon-orbiting-telescope-by-2026/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l11320230612181703.jpeg", "publishedAt": "2023-06-12T12:47:30Z", "content": "TechnologyChina plans to launch a Moon-orbiting telescope by 2026\r\nThe constellation of satellites will circle the Moon in the same orbit (Photo credit: ESA)\r\nChina has come up with a rather novel id… [+3089 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Could Our Next Home Be Just 4 Light Years Away? Astronomers find Proxima b Showing Promising Signs! - Times Now", "description": "Astrological breakthrough suggests Proxima b, our celestial neighbor, may be more than just a dry rock in space. New findings indicate vast oceans could exist, potentially supporting life.", "url": "https://www.timesnownews.com/technology-science/could-our-next-home-be-just-4-light-years-away-astronomers-find-proxima-b-showing-promising-signs-article-100941178", "urlToImage": "https://static.tnn.in/thumb/msid-100941178,updatedat-1686573439318,width-1280,height-720,resizemode-75/100941178.jpg", "publishedAt": "2023-06-12T12:37:19Z", "content": "IFS Apala Mishra Secured UPSC AIR 9 in 2020, Scored the Highest Interview Marks Recorded for UPSC CSE"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Astronomers share of photo new supernova shining brightly in Pinwheel Galaxy - WION", "description": "Astronomers share of photo new supernova shining brightly in Pinwheel Galaxy", "url": "https://www.wionews.com/science/astronomers-share-of-photo-new-supernova-shining-brightly-in-pinwheel-galaxy-603496", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/12/358867-stro-3.png", "publishedAt": "2023-06-12T11:40:32Z", "content": "Astronomers have shared a photo of a star collapsing on itself, called a supernova, in the Pinwheel Galaxy, about 21 million light-years away from Earth.\r\nThe cosmic event was witnessed through the G… [+2182 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of Central Florida Researcher Unveils Prime Findings About Asteroid Dinkinesh, A Target Of NASA’s Lucy Mission - India Education Diary", "description": "AUniversity of Central Florida researcher is part of a team that recently discovered significant insights into the size and surface composition of Dinkinesh, an asteroid that NASA’s Lucy mission will visit in November.Using observations from telescop", "url": "https://indiaeducationdiary.in/university-of-central-florida-researcher-unveils-prime-findings-about-asteroid-dinkinesh-a-target-of-nasas-lucy-mission/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/dinkinesh_for_web-1024x683.webp", "publishedAt": "2023-06-12T11:24:38Z", "content": "AUniversity of Central Florida researcher is part of a team that recently discovered significant insights into the size and surface composition of Dinkinesh, an asteroid that NASAs Lucy mission will … [+3147 chars]"}, {"source": {"id": null, "name": "Advanced Science News"}, "author": "Andrey Feldman", "title": "Scientists detect the X-ray signature of a single atom - Advanced Science News", "description": "A new technique can detect the X-ray signature of an individual atom, even determining the structure of its electron orbits.", "url": "https://www.advancedsciencenews.com/scientists-detect-the-x-ray-signature-of-a-single-atom/", "urlToImage": "https://www.advancedsciencenews.com/wp-content/uploads/2023/06/physics-g0f8d8458f_1280.jpg", "publishedAt": "2023-06-12T11:24:34Z", "content": "Since their discovery by Wilhelm Conrad Roentgen in 1895, X-rays have found extensive application in various scientific, industrial, and technological fields. This widespread utilization stems from t… [+5775 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "Italy’s Supervolcano More Likely To Erupt Than Previously Thought - Forbes", "description": "A new study concludes that the Campi Flegrei, part of a supervolcano located near Naples, are more likely to erupt than previously thought.", "url": "https://www.forbes.com/sites/davidbressan/2023/06/12/italys-supervolcano-more-likely-to-erupt-than-previously-thought/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6486e2a6387a50364ffa0961/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-06-12T11:22:38Z", "content": "The Volcano Solfatara is located just a few kilometers away from Naples and is part of the volcanic ... [+] region known as the Phlegrean fields.\r\nCorbis via Getty Images\r\nA new study by researchers … [+3053 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of Central Florida Contributes In Team That Finds Water On Ultra-hot Exoplanet - India Education Diary", "description": "AUniversity of Central Florida researcher and multiple alumni are part of a team that has used NASA’s James Webb Space Telescope (JWST) to identify water vapor in the atmosphere of an ultra-hot gas giant exoplanet and make a thermal map of its atmosp", "url": "https://indiaeducationdiary.in/university-of-central-florida-contributes-in-team-that-finds-water-on-ultra-hot-exoplanet/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/08/University-of-Central-Florida.jpeg", "publishedAt": "2023-06-12T11:10:16Z", "content": "AUniversity of Central Florida researcher and multiple alumni are part of a team that has used NASAs James Webb Space Telescope (JWST) to identify water vapor in the atmosphere of an ultra-hot gas gi… [+6169 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Innovative Technology for Capturing Carbon Dioxide From Air Licensed to Holocene - AZoCleantech", "description": "An innovative and sustainable chemistry developed at the Department of Energy's Oak Ridge National Laboratory for capturing carbon dioxide from air has been licensed to Holocene, a Knoxville-based startup focused on designing and building plants that remove c…", "url": "https://www.azocleantech.com/news.aspx?newsID=33546", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/NewsThumbImage_33546.jpg", "publishedAt": "2023-06-12T10:54:00Z", "content": "An innovative and sustainable chemistry developed at the Department of Energy's Oak Ridge National Laboratory for capturing carbon dioxide from air has been licensed to Holocene, a Knoxville-based st… [+6205 chars]"}, {"source": {"id": null, "name": "Snexplores.org"}, "author": null, "title": "This ancient bird rocked a head like a T. rex - Science News Explores", "description": "This bird from 120 million years ago had a head like a dinosaur and a body more like today’s birds.", "url": "https://www.snexplores.org/article/this-ancient-bird-rocked-a-head-like-a-t-rex", "urlToImage": "https://www.snexplores.org/wp-content/uploads/2023/01/011923_at_thero-bird_feat.jpg", "publishedAt": "2023-06-12T10:30:00Z", "content": "3-D: Short for three-dimensional. This term is an adjective for something that has features that can be described in three dimensions  height, width and length. \r\nancestor: A predecessor. It could be… [+5207 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Brilliant gamma-ray flare 100 times brighter than our entire galaxy reveals 1 monster black hole is actually 2 - Space.com", "description": "The second supermassive black hole is causing blasts of energy as it dives through a disk of blisteringly hot gas.", "url": "https://www.space.com/gamma-ray-flare-monster-black-holes-oj-287", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FJrXQ5ayG8A3XfavpGPZCd-1200-80.jpg", "publishedAt": "2023-06-12T10:00:00Z", "content": "Astronomers have confirmed the presence of a second supermassive black hole in the turbulent heart of a distant galaxy. \r\nThe scientists also found that both of these cosmic monsters are feeding on g… [+6259 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Insights Into Molecular Mechanisms Controlling Chromosome Movement During Cell Division - Technology Networks", "description": "A team uncover the molecular details of how a crucial protein facilitates proper chromosome movement when our cells divide.", "url": "https://www.technologynetworks.com/cell-science/news/new-insights-into-molecular-mechanisms-controlling-chromosome-movement-during-cell-division-374560", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374560/new-insights-into-molecular-mechanisms-controlling-chromosome-movement-during-cell-division-374560-640x360.jpg?cb=20230612", "publishedAt": "2023-06-12T09:56:15Z", "content": "During cell division, chromosomes, i.e., molecules containing our genetic material, must be properly replicated and segregated so that each daughter cell receives a complete and accurate set. Now, in… [+3366 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Giants of the jurassic seas were twice as large as killer whales - Tech Explorist", "description": "Paleontologists have discovered that a pliosaur could have grown to 14.4 metres.", "url": "https://www.techexplorist.com/giants-jurassic-seas-twice-as-large-as-killer-whales/61969/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/dinasaur.jpg", "publishedAt": "2023-06-12T09:32:29Z", "content": "A 25-meter-long Liopleurodon was displayed on the BBC’s Walking with Dinosaurs TV documentary series more than 20 years ago. The size of this pliosaur was hotly contested because it was believed to h… [+3396 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Human body to stretch like a `long pasta` if Earth falls into black hole, claim scientists - WION", "description": "Human body to stretch like a long pasta if Earth falls into black hole, claim scientists", "url": "https://www.wionews.com/science/human-body-to-stretch-like-a-long-pasta-if-earth-falls-into-black-hole-claim-scientists-603408", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/12/358796-untitled-design-2023-06-12t145103088.png", "publishedAt": "2023-06-12T09:21:19Z", "content": "The scientists have claimed that if Earth ever fell into a black hole the scariest feature of the universe which has such intense gravity that even light fails to get out then the human body is likel… [+2716 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "ESA celebrates 20 years of Mars Express with global colour Mosaic of Red Planet - News9 LIVE", "description": "The spacecraft captured the images from a higher than usual altitude to capture the data for the mosaic.", "url": "https://www.news9live.com/science/esa-celebrates-20-years-of-mars-express-with-global-colour-mosaic-of-red-planet-2175362", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/Global_Mars_in_colour_pillars-Cropped.jpg", "publishedAt": "2023-06-12T09:01:59Z", "content": "The spacecraft captured the images from a higher than usual altitude to capture the data for the mosaic.\r\nThe European Space Agency (ESA) has celebrated 20 years of observations by Mars Express, its … [+2139 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Jupiter's moons to supermassive black holes: What will James Webb Telescope observe next? - India Today", "description": "Astronomers are now excited about the second year of the observatory in space as Cycle-2 begins on July 1.", "url": "https://www.indiatoday.in/science/story/what-will-james-webb-telescope-observe-next-2391962-2023-06-12", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/cosmic_cliffs-sixteen_nine.jpg?VersionId=sd0asV7rxq41ytG4Monq1bqc9bN91giN", "publishedAt": "2023-06-12T08:32:25Z", "content": "By India Today Science Desk: The James Webb Space Telescope (JWST) has emerged as the biggest asset Earth has outside the planet. Located at Lagrange Point 2 nearly 15,00,000 kilometers away from the… [+2638 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble spots slightly dishevelled galaxy 44 million light-years from Earth - Devdiscourse", "description": "Read more about Hubble spots slightly dishevelled galaxy 44 million light-years from Earth on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2485165-hubble-spots-slightly-dishevelled-galaxy-44-million-light-years-from-earth", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_06_2023_13_10_28_0956664.jpg?width=920&format=jpeg", "publishedAt": "2023-06-12T08:16:08Z", "content": "The NASA/ESA Hubble Space Telescope's latest image reveals the mesmerizing beauty of NGC 7292, a galaxy located approximately 44 million light-years away in the constellation Pegasus. The galaxy is c… [+1991 chars]"}, {"source": {"id": null, "name": "Editorji.com"}, "author": "Editorji News Desk", "title": "Primates have been masturbating for around 40 million years, reveals study - Editorji", "description": "Biologists have traced back the history of masturbation in primates to at least 40 million years ago.", "url": "https://www.editorji.com/lifestyle-news/health/primates-have-been-masturbating-for-around-40-million-years-reveals-study-1686556295755", "urlToImage": "https://cdn.editorji.com/ECjFirB2Sp.jpg", "publishedAt": "2023-06-12T07:51:35Z", "content": "A new study conducted by University College London found that male primates or extinct monkeys have been masturbating for around 40 million years. \r\nPublished in Proceedings of the Royal Society B, t… [+345 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Unravelling the Freezing Paradox: Scientists Shed Light on a Mind-Boggling Phenomenon - Transcontinental Times", "description": "INDIA: Scientists have long been intrigued by the Freezing Paradox, a baffling phenomenon that challenges our understanding of the physical world. Recently, researchers from leading institutions around the globe have made significant strides in unravelling th…", "url": "https://www.transcontinentaltimes.com/unravelling-the-freezing-paradox/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Freezing-Paradox.jpg", "publishedAt": "2023-06-12T07:21:19Z", "content": "INDIA: Scientists have long been intrigued by the Freezing Paradox, a baffling phenomenon that challenges our understanding of the physical world. Recently, researchers from leading institutions arou… [+3343 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Two big asteroids nearly a kilometer wide headed toward Earth, Nasa tracking closely - India Today", "description": "Asteroids are rocky objects that orbit the Sun and are remnants from the early solar system formation and can vary in size.", "url": "https://www.indiatoday.in/science/story/two-big-asteroids-coming-close-to-earth-they-are-nearly-a-kilometer-wide-2391877-2023-06-12", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/asteroid_7-sixteen_nine.jpg?VersionId=sStT3aRnCqNnI7G2y3bdQuhgzmwLSt.a", "publishedAt": "2023-06-12T06:02:49Z", "content": "By India Today Science Desk: Two big asteroids are coming close to Earth as they move ahead in their orbits around the Sun. The two asteroids are predicted to be between 500 to 850 meters in diameter… [+2166 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "Adventure in Space: ISS Astronauts Install Fifth Roll-out Solar Blanket to Boost Power - Slashdot", "description": "The international space station is equpped with four 39-foot blankets (11.8-meters), reports CBS News.  The first one was delivered in December of 2000 &mdash; and now it's time for some changes:\n\nTwo astronauts ventured outside the International Space Statio…", "url": "https://hardware.slashdot.org/story/23/06/11/229259/adventure-in-space-iss-astronauts-install-fifth-roll-out-solar-blanket-to-boost-power", "urlToImage": "https://a.fsdn.com/sd/topics/iss_64.png", "publishedAt": "2023-06-11T23:01:16Z", "content": "Two astronauts ventured outside the International Space Station Friday and installed the fifth of six roll-out solar array blankets — iROSAs — needed to offset age-related degradation and micrometeor… [+1580 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Astronomers Observe Most Distant Organic Molecules in Universe - VOA Learning English", "description": "Scientists say they have observed the most distant organic molecules known to exist in the universe. The molecules were discovered, with the help of NASA’s James Webb Space Telescope, in a galaxy more than 12 billion light years from Earth.", "url": "https://learningenglish.voanews.com/a/astronomers-observe-most-distant-organic-molecules-in-universe/7129090.html", "urlToImage": "https://gdb.voanews.com/01000000-0a00-0242-4969-08db686b82d6_cx0_cy8_cw0_w1200_r1.jpg", "publishedAt": "2023-06-11T22:03:56Z", "content": "Scientists say they have observed the most distant organic molecules known to exist in the universe.\r\nAstronomers made the discovery using the James Webb Space Telescope, operated by the American spa… [+4787 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists have figured out how much the Milky Way actually weighs - The Times Hub", "description": "Spread the love Mass can be calculated using a rotation curve. The authors of the new study presented the most accurate way they believe the value of the mass of our galaxy. This writes  physics One way to estimate the mass of the Milky Way is to study the mo…", "url": "https://thetimeshub.in/scientists-have-figured-out-how-much-the-milky-way-actually-weighs/", "urlToImage": null, "publishedAt": "2023-06-11T19:07:46Z", "content": "Mass can be calculated using a rotation curve.\r\nThe authors of the new study presented the most accurate way they believe the value of the mass of our galaxy.\r\nThis writes  physics\r\n One way to estim… [+674 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX cargo craft docks with space station - AP Archive", "description": "(6 Jun 2023) RESTRICTION SUMMARY: MUST CREDIT NASA++ON-SCREEN GRAPHICS AND COMMENTARY FROM SOURCE++NASA - MUST CREDIT NASAInternational Space Station - 6 Jun...", "url": "https://www.youtube.com/watch?v=N5nSKPvfBMU", "urlToImage": "https://i.ytimg.com/vi/N5nSKPvfBMU/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGEgZShPMA8=&rs=AOn4CLAUlCkI79OOSYFl4VxRVP6qYpI7cA", "publishedAt": "2023-06-11T18:56:27Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Genetic Jigsaw: Piecing Together the Human Pangenome - SciTechDaily", "description": "Dr. Eimear Kenny, a renowned professor of Medicine, Genetics, and Genomic Sciences at the Icahn School of Medicine at Mount Sinai, has made substantial contributions to the international Human Pangenome Reference Consortium, leading to the creation of a more …", "url": "https://scitechdaily.com/genetic-jigsaw-piecing-together-the-human-pangenome/", "urlToImage": "https://scitechdaily.com/images/Human-Puzzle-Pieces-Illustration-Art.jpg", "publishedAt": "2023-06-11T18:43:40Z", "content": "ByThe Mount Sinai Hospital / Mount Sinai School of MedicineJune 11, 2023\r\nDr. Eimear Kenny has significantly contributed to the creation of an inclusive human pangenome reference, led by the internat… [+12570 chars]"}, {"source": {"id": null, "name": "Talker.news"}, "author": "Talker News", "title": "Stem cell breakthrough paves way for personalized medicine - Crow River Media", "description": "Scientists hope the latest development will make therapies cheaper, faster and safer.", "url": "https://talker.news/2023/06/09/stem-cell-breakthrough-paves-way-for-personalized-medicine/", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/crowrivermedia.com/content/tncms/assets/v3/editorial/a/a1/aa131a37-34a0-56c4-99c3-d519aa8d2805/64837df87e2b9.image.jpg?crop=1098%2C578%2C0%2C0&resize=1098%2C578&order=crop%2Cresize", "publishedAt": "2023-06-11T17:03:00Z", "content": "Stem cells. (Trevor Atkeson and Madhavi Pandya, Garvan Institute via SWNS)\r\nBy Mark Waghorn via SWNS\r\nA new age of personalized medicine could be on the horizon after a major discovery by stem cell r… [+4123 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "India on track to become 4th nation on the Moon as Russia delays lunar mission - Republic World", "description": "Russia's Luna 25 mission will now be launched to the Moon in August atop the Soyuz-2.1b carrier rocket from the Vostochny space center.", "url": "https://www.republicworld.com/science/space/india-on-track-to-become-4th-nation-on-the-moon-as-russia-delays-lunar-mission-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/owwuk9v8wbhpszf3_1686491941.jpeg", "publishedAt": "2023-06-11T14:45:00Z", "content": "India has the opportunity to beat Russia to the Moon as the latter has decided to postpone the launch of its first lunar mission until August of this year. Russia's Luna 25 was scheduled to launch on… [+2886 chars]"}]}