{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Wonderfulengineering.com"}, "author": null, "title": "Scientists Have Discovered A New Kind Of Highly Reactive Chemical In The Earth’s Atmosphere – And It Has Some Dangerous Properties - Wonderful Engineering", "description": "Advertisement A specific variant of trioxide has been uncovered in the Earth’s atmosphere by researchers from the University of Copenhagen, and it could pose a threat to human life. According to the researchers, these trioxides, which are formed as a result o…", "url": "https://wonderfulengineering.com/scientists-have-discovered-a-new-kind-of-highly-reactive-chemical-in-the-earths-atmosphere-and-it-has-some-dangerous-properties/", "urlToImage": "https://wonderfulengineering.com/wp-content/uploads/2022/05/Planet-Earths-Atmosphere.jpg", "publishedAt": "2022-06-06T18:07:37Z", "content": "A specific variant of trioxide has been uncovered in the Earth’s atmosphere by researchers from the University of Copenhagen, and it could pose a threat to human life. According to the researchers, t… [+3024 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "International Space Station & Boeing's Starliner captured in incredible pics from Earth - Republic World", "description": "The International Space Station and Boeing's Starliner are doing rounds on social media thanks to incredible pictures released by London-based photographers.", "url": "https://www.republicworld.com/science/space/international-space-station-and-boeings-starliner-captured-in-incredible-pics-from-earth-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/gss8v1guxsrabw0e_1654534798.jpeg", "publishedAt": "2022-06-06T17:22:00Z", "content": "Boeing Space recently completed its Orbital Flight Test-2 (OFT-2) mission but stunning visuals from the companys latest endeavour continue to emerge. Recently, London-based photographers shared new v… [+1939 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "One tree or two? Genes confirm Iban traditional knowledge in Borneo - Nature.com", "description": "Words in the languages of the Iban and Dusun people are the tip-off that a tree given a single scientific name is actually two species.", "url": "https://www.nature.com/articles/d41586-022-01577-3", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-01577-3/d41586-022-01577-3_23124634.jpg", "publishedAt": "2022-06-06T17:20:25Z", "content": "The pingan trees fruit (left) is distinct from the lumok trees (right), but Western scientists misclassified the two trees as one species for almost two centuries.Credit: left, Elias Ednie; right, El… [+3600 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "A Bout Of Global Warming Hit Earth 56 Million Years Ago. Study Explains How Gulf Of Mexico Evaded Mass Extinction - ABP Live", "description": "The study can help scientists determine how current climate change will affect marine life and aid in efforts to find deposits of oil and gas. The findings shed light on an ancient mass extinction.", "url": "https://news.abplive.com/science/a-bout-of-global-warming-hit-earth-56-million-years-ago-study-explains-how-gulf-of-mexico-evaded-mass-extinction-1535884", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/06/06/28310d48dc131874726a1cf2006e0f8d_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-06-06T16:55:00Z", "content": "A bout of global warming hit Earth 56 million years ago. The event acidified oceans and wiped out marine life. However, the bout of global warming had a milder effect in the Gulf of Mexico, where lif… [+4770 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Cosmological gravitational waves: A new approach to reach back to the Big Bang - Phys.org", "description": "Operating observatories around the globe target sky regions characterized by low contamination from Galactic radiation, looking for the imprint of Cosmological Gravitational Waves (CGWs) produced during Inflation, the mysterious phase of quasi-exponential exp…", "url": "https://phys.org/news/2022-06-cosmological-gravitational-approach-big.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/gravitationa.png", "publishedAt": "2022-06-06T16:44:23Z", "content": "Operating observatories around the globe target sky regions characterized by low contamination from Galactic radiation, looking for the imprint of Cosmological Gravitational Waves (CGWs) produced dur… [+4588 chars]"}, {"source": {"id": null, "name": "KRDO"}, "author": "CNN Newssource", "title": "How the Ingenuity helicopter is battling the arrival of dusty winter on Mars - KRDO", "description": "By Ashley Strickland, CNN Just a couple of weeks after the Ingenuity helicopter celebrated a year of flying on Mars, things got quiet. For the first time, the Ingenuity team on Earth lost contact with Ingenuity on sols 427 and 428, or Martian days that corres…", "url": "https://krdo.com/news/2022/06/06/how-the-ingenuity-helicopter-is-battling-the-arrival-of-dusty-winter-on-mars/", "urlToImage": "https://krdo.b-cdn.net/2020/07/krdo_ls.jpg", "publishedAt": "2022-06-06T15:57:52Z", "content": "By Ashley Strickland, CNN\r\nJust a couple of weeks after the Ingenuity helicopter celebrated a year of flying on Mars, things got quiet.\r\nFor the first time, the Ingenuity team on Earth lost contact w… [+4471 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Sierra Negra's volcanic eruption predicted five months in advance using new system - Republic World", "description": "Sierra Negra's volcanic eruption was predicted five months in advance by a system developed by University of Illinois researchers.", "url": "https://www.republicworld.com/technology-news/science/sierra-negras-volcanic-eruption-predicted-five-months-in-advance-using-new-system-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/yshdlmumy5dpkaoy_1654529048.jpeg", "publishedAt": "2022-06-06T15:35:00Z", "content": "In what could be a breakthrough in the volcanic forecast, researchers from the University of Illinois have developed a system that could predict the eruption of volcanos months earlier. According to … [+2255 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Research finds tree plantations encroaching on essential ecosystems - Phys.org", "description": "Trees store carbon, filter the air, create habitat, and supply a host of other benefits for animals and people. Planting the right trees, in the right places, in consultation with local communities, can support goals like addressing climate change and improvi…", "url": "https://phys.org/news/2022-06-tree-plantations-encroaching-essential-ecosystems.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/beyond-plant-trees-umb.jpg", "publishedAt": "2022-06-06T15:25:16Z", "content": "Trees store carbon, filter the air, create habitat, and supply a host of other benefits for animals and people. Planting the right trees, in the right places, in consultation with local communities, … [+7024 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "Sindujaa D N", "title": "Mysterious Radio Signal found in space!! - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "technology : There are many secrets hidden within the universe, about which even scientists have not been able to understand properly till date. Space", "url": "https://www.indiaherald.com/Technology/Read/994507489/Mysterious-Radio-Signal-found-in-space", "urlToImage": "https://www.indiaherald.com/imagestore/images/technology/sports_videos/mysterious-radio-signal-found-in-space4a52dae1-1a5a-4fc7-911d-e368ccfcef44-415x250-IndiaHerald.jpg", "publishedAt": "2022-06-06T15:06:52Z", "content": "Scientists have discovered a neutron star in space which is 1300 light years away from Earth. Researchers say that this star will help in understanding the star system. A strange pulse emanating from… [+1635 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA just rescued its Mars probe from verge of 'death'; agency explains averted crisis - Republic World", "description": "NASA's Mars orbiter MAVEN was launched in 2013 to explore the red planet's upper atmosphere and ionosphere and find out how it lost its atmosphere.", "url": "https://www.republicworld.com/science/space/nasa-just-rescued-its-mars-probe-from-verge-of-death-agency-explains-averted-crisis-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/rcfvn1vopcrbjzyl_1654526399.jpeg", "publishedAt": "2022-06-06T14:57:00Z", "content": "The Mars Atmosphere and Volatile Evolution, or MAVEN, which has served as NASA's eyes and ears around Mars since 2014 was rescued from a major \"existential crisis\", as the agency puts it. The orbiter… [+2356 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Is There Oxygen On Venus? NASA's DAVINCI Mission To Find Out - NDTV", "description": "The DAVINCI Mission is tentatively scheduled to launch June 2029 and enter the Venusian atmosphere in June 2031.", "url": "https://www.ndtv.com/world-news/is-there-oxygen-on-venus-nasas-davinci-mission-to-find-out-3043268", "urlToImage": "https://c.ndtvimg.com/2022-06/ojd042co_davinci-mission-to-venus-650_625x300_06_June_22.jpg", "publishedAt": "2022-06-06T13:54:33Z", "content": "The DAVINCI Mission will carry a button-sized sensor to measure oxygen in Venus' atmosphere.\r\nThe DAVINCI Mission is on course to study Venus, the second planet from Sun, in 2029 to understand its ch… [+2665 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Europe's Gaia mission to reveal new details about nearly two billion objects in our galaxy - Devdiscourse", "description": "Read more about Europe's Gaia mission to reveal new details about nearly two billion objects in our galaxy  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2063342-europes-gaia-mission-to-reveal-new-details-about-nearly-two-billion-objects-in-our-galaxy", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/06_06_2022_19_08_00_5184708.jpg?width=920&format=jpeg", "publishedAt": "2022-06-06T13:39:13Z", "content": "On 13 June, the European Space Agency will release the Gaia mission's third full data set which contains new and improved details for almost two billion objects in our home galaxy - the Milky Way. A … [+1732 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Stellar populations of NGC 5053 investigated with AstroSat - Phys.org", "description": "Using the AstroSat spacecraft, Indian astronomers have inspected a galactic globular cluster known as NGC 5053. Results of the study, presented in a paper published May 27 on the arXiv pre-print repository, provide important insights into the stellar populati…", "url": "https://phys.org/news/2022-06-stellar-populations-ngc-astrosat.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/stellar-populations-of.jpg", "publishedAt": "2022-06-06T13:18:22Z", "content": "Using the AstroSat spacecraft, Indian astronomers have inspected a galactic globular cluster known as NGC 5053. Results of the study, presented in a paper published May 27 on the arXiv pre-print repo… [+3298 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Dark Matter: Should We Be So Sure It Exists? Here's How Phil... - MENAFN.COM", "description": "<p> It has been more than 50 years since astronomers first proposed“dark matter”, which is thought to be the most common form of matter in the univer", "url": "https://menafn.com/1104330482/Dark-Matter-Should-We-Be-So-Sure-It-Exists-Heres-How-Philosophy-Can-Help", "urlToImage": "https://menafn.com/updates/pr/2022-06/06/TC_4f6edimage_story.jpg", "publishedAt": "2022-06-06T13:11:16Z", "content": "(MENAFN- The Conversation) \r\n It has been more than 50 years since astronomers first proposeddark matter, which is thought to be the most common form of matter in the universe. Despite this, we have … [+6931 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Astronomers find a treasure trove of black holes in small galaxies - Syfy", "description": "Astronomers have missed a LOT of black holes in nearby galaxies. They were hiding in plain sight, and we needed to look for them in just a very slightly new way.", "url": "https://www.syfy.com/syfy-wire/bad-astronomy-black-holes-dwarf-galaxies-hiding-out-open", "urlToImage": "https://www.syfy.com/sites/syfy/files/2022/01/henize210.jpg", "publishedAt": "2022-06-06T13:00:05Z", "content": "We know that essentially all big galaxies, like our own Milky Way, have supermassive black holes in their centers. We also strongly suspect these enormous monsters with millions or billions of times … [+4202 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA to test record-breaking GPS system on Moon under Artemis mission for first time - Republic World", "description": "NASA will launch the Lunar GNSS Receiver Experiment (LuGRE) payload to the Moon to test the new lunar navigation capability using Earth’s satellite system.", "url": "https://www.republicworld.com/science/space/nasa-to-test-record-breaking-gps-system-on-moon-under-artemis-mission-for-first-time-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/lwwjtgf2qvdmcq9j_1654518358.jpeg", "publishedAt": "2022-06-06T12:38:00Z", "content": "The forthcoming Moon missions under the Artemis Program would mark many firsts and NASA has added another one to the list. The US space agency believes that new navigation capabilities will be of sig… [+2434 chars]"}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": "Teilor Stone", "title": "\"Super-Earth\" next door. Astronomers have discovered a new exoplanet, where the year lasts 11 days - The Saxon", "description": "The found exoplanet is 4 times the size of the Earth and revolves around a dim red dwarf. We are . We are from Ukraine From the first day of the war, Focus never stopped working. Our team considers it its duty to inform the reader about what is happening, to …", "url": "https://thesaxon.org/super-earth-next-door-astronomers-have-discovered-a-new-exoplanet-where-the-year-lasts-11-days/7618/", "urlToImage": null, "publishedAt": "2022-06-06T12:26:01Z", "content": "Read Time:2 Minute, 30 Second\r\nThe found exoplanet is 4 times the size of the Earth and revolves around a dim red dwarf.\r\n We are\r\n. We are from Ukraine\r\nFrom the first day of the war, Focus never st… [+2651 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Mars Perseverance Rover Now Selects Its Own Targets To Zap With Its Laser - SciTechDaily", "description": "NASA’s Mars Perseverance Rover features an impressive SuperCam that can examine rocks and soils with a camera, laser, and spectrometers to seek organic compounds that could be related to past life on Mars. It first used the laser to zap rocks on Mars last yea…", "url": "https://scitechdaily.com/nasas-mars-perseverance-rover-now-selects-its-own-targets-to-zap-with-its-laser/", "urlToImage": "https://scitechdaily.com/images/Mars-2020-SuperCam-Laser-Zapping.jpg", "publishedAt": "2022-06-06T12:13:32Z", "content": "ByRoger Wiens, Purdue UniversityJune 6, 2022\r\nIllustration of the Mars Perseverance Rover using its SuperCam instrument to laser zap a rock in order to test what its made of. Credit: NASA\r\nNASA\r\nEsta… [+5098 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "This Ancient Molecule Is The Root Cause Of All Life On Earth... And Mars! - Indiatimes.com", "description": "Could life on Earth and Mars have originated from similar components? Scientists have found some evidence of the same in a giant breakthrough for questions about life's origin on Earth.According to scientists at the Foundation for Applied Molecular Evolution,…", "url": "https://www.indiatimes.com/technology/science-and-future/molecule-life-on-earth-and-mars-571487.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/33_629ded56ee167.jpg", "publishedAt": "2022-06-06T12:02:16Z", "content": "Could life on Earth and Mars have originated from similar components? Scientists have found some evidence of the same in a giant breakthrough for questions about life's origin on Earth.\r\nAccording to… [+2126 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Isaiah Richard", "title": "Solar Problems Gone? New Research Looks Into Sun's Rotation to Solve Known Issues - Tech Times", "description": "The Sun's rotation is a massive factor, and it is high time that astronomers consider it.", "url": "https://www.techtimes.com/articles/276355/20220606/solar-problems-gone-new-research-looks-suns-rotation-solve-known.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/397880/sunspot.jpg", "publishedAt": "2022-06-06T12:00:00Z", "content": "The Earth and the entire Solar System depend on the Sun for warmth and gravity as it floats around in space, with the bright yellow ball of light being the center of the many planets surrounding it, … [+2828 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Calgary: International team of scientists finds new type of natural gas - India Education Diary", "description": "Among Alberta’s incredible geological features are its vast shale deposits; these are among the richest sources of natural gas on the continent, with the so-called unconventional hydrocarbon reservoirs in the province containing over 1.29 trillion cu", "url": "https://indiaeducationdiary.in/university-of-calgary-international-team-of-scientists-finds-new-type-of-natural-gas/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/05/University-of-Calgary.png", "publishedAt": "2022-06-06T11:51:53Z", "content": "Among Albertas incredible geological features are its vast shale deposits; these are among the richest sources of natural gas on the continent, with the so-called unconventional hydrocarbon reservoir… [+4567 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "ESA's Euclid inches closer to unraveling secrets of dark universe; here's all about it - Republic World", "description": "ESA is launching the Euclid spacecraft with the aim to make a 3D map of the universe in order to explore the evolution of the dark universe.", "url": "https://www.republicworld.com/science/space/esas-euclid-inches-closer-to-unraveling-secrets-of-dark-universe-heres-all-about-it-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/crbuparhjtozcxa3_1654514513.jpeg", "publishedAt": "2022-06-06T11:45:00Z", "content": "The European Space Agencys (ESA) Euclid mission has stepped closer to its launch which is planned for 2023. Named after the Greek mathematician Euclid of Alexandria, the mission spacecraft is current… [+2521 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX’s NASA Crew Dragon launch manifest doubles in three months - Teslarati", "description": "NASA says it will soon award SpaceX another five Crew Dragon astronaut transport contracts after purchasing three extra missions from the company on February 28th. That June 1st announcement means that NASA has more than doubled the number of operational Crew…", "url": "https://www.teslarati.com/spacex-nasa-crew-dragon-manifest-doubles/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2021/11/Crew-3-Dragon-C210-F9-B1067-39A-vertical-102721-SpaceX-5-crop-c-1024x635.jpg", "publishedAt": "2022-06-06T11:05:51Z", "content": "NASA says it will soon award SpaceX another five Crew Dragon astronaut transport contracts after purchasing three extra missions from the company on February 28th.\r\nThat June 1st announcement means t… [+3903 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Emily Mullin", "title": "A New Kind of Genome Editing Is Here to Fine-Tune DNA - WIRED", "description": "Instead of deleting genes, epigenetic editing modulates their activity. A new paper tests if it’s able to undo a genetic effect of early alcohol exposure.", "url": "https://www.wired.com/story/a-new-kind-of-genome-editing-is-here-to-fine-tune-dna/", "urlToImage": "https://media.wired.com/photos/629a3f8e546f32c2b76f099e/191:100/w_1280,c_limit/knob_geneediting_GettyImages-1395175299.jpg", "publishedAt": "2022-06-06T11:00:00Z", "content": "We didn't see any indication of their drinking coming back to baseline, so we think that maybe this epigenetic editing will produce a long-lasting effect, Pandey says. I think a lot more work needs t… [+4309 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Japan: Experts discover amino acids in asteroid sample fetched by Hayabusa2 probe - Republic World", "description": "Japan had launched the Hayabusa2 spacecraft in 2014 toward the Ryugu asteroid located 300 million kilometres with an aim to understand the origin of life.", "url": "https://www.republicworld.com/science/space/japan-experts-discover-amino-acids-in-asteroid-sample-fetched-by-hayabusa2-probe-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/6ulf1znupeqvfq2r_1654512437.jpeg", "publishedAt": "2022-06-06T10:57:00Z", "content": "In a major breakthrough, Japanese researchers have discovered over 20 types of amino acids in the asteroid samples fetched by the Hayabusa2 spacecraft. The probe was launched by the Japanese Aerospac… [+2494 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "How the universe got its magnetic field? - Tech Explorist", "description": "MIT scientists are helping to solve one of the mysteries of the origins of cosmological magnetic fields.", "url": "https://www.techexplorist.com/universe-got-magnetic-field/47951/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/seed-magnetic-fields.jpg", "publishedAt": "2022-06-06T10:27:26Z", "content": "All cosmic objects are embedded in magnetic fields. However, these fields are weak, but they are dynamically significant because they have profound effects on the dynamics of the universe.\r\nThe origi… [+3462 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Infamous asteroid Apophis 'rediscovered' as scientists test asteroid defense mechanisms - Space.com", "description": "The asteroid, which was once thought to be a risk to Earth in 2029, was the perfect test subject during its recent close approach.", "url": "https://www.space.com/asteroid-apophis-rediscovered-planetary-defense-exercise", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mMa6fbwSoyZ3LkTnKTW7Ci-1200-80.jpeg", "publishedAt": "2022-06-06T10:00:28Z", "content": "An artist's impression of a potentially hazardous asteroid passing close to Earth. (Image credit: Juan Gartner via Getty Images)\r\nA test of whether asteroid defense systems could spot a potentially h… [+5371 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: A Planetary Breakup, Hercules Star Cluster, and the Harp Constellation - SciTechDaily", "description": "What's Up for June? A planetary breakup, prime viewing for a well-known star cluster, and the constellation Lyra. Skywatching highlights for June 2022 include the gathering of four naked-eye planets (Saturn, Mars, Jupiter, and Venus) in the morning sky. Check…", "url": "https://scitechdaily.com/dont-miss-a-planetary-breakup-hercules-star-cluster-and-the-harp-constellation/", "urlToImage": "https://scitechdaily.com/images/Hubble-Ring-Nebula-Messier-57.jpg", "publishedAt": "2022-06-06T09:49:07Z", "content": "ByPreston Dyches, NASA's Jet Propulsion LaboratoryJune 6, 2022\r\nSkywatchers in June will want to see the planets Saturn, Mars, Jupiter, and Venus, the Hercules Cluster, and the constellation Lyra.\r\nW… [+7775 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Visible light activates molecular machineries to treat infections: Study - DNA India", "description": "Scientists have demonstrated that light-activated molecular machines can drill holes through gram-negative and gram-positive bacteria membranes, killing them in as little as two minutes. Their study suggests a new way to combat antibiotic-resistant bacteria, …", "url": "https://www.dnaindia.com/lifestyle/video-visible-light-activates-molecular-machineries-to-treat-infections-study-2958304", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/06/06/2153151-1654507870-00000009.jpg", "publishedAt": "2022-06-06T09:31:12Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Penn State University: Promising new materials mimic muscle structure and function - India Education Diary", "description": "Inspired by the structure of muscles, an innovative new strategy for creating fiber actuators could lead to advances in robotics, prosthetics, and smart clothing, according to a Penn State led team of scientists who discovered the process.“Actuators", "url": "https://indiaeducationdiary.in/penn-state-university-promising-new-materials-mimic-muscle-structure-and-function/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/Penn-State-University.jpg", "publishedAt": "2022-06-06T08:03:44Z", "content": "Inspired by the structure of muscles, an innovative new strategy for creating fiber actuators could lead to advances in robotics, prosthetics, and smart clothing, according to a Penn State led team o… [+4055 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of California Irvine: UCI-led astronomy team finds evidence of galactic metal shrouded in dust - India Education Diary", "description": "A thorough understanding of galaxy evolution depends in part on an accurate measurement of the abundance of metals in the intergalactic medium – the space between stars – but dust can impede observations in optical wavelengths. An international team", "url": "https://indiaeducationdiary.in/university-of-california-irvine-uci-led-astronomy-team-finds-evidence-of-galactic-metal-shrouded-in-dust/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-California-Irvine.png", "publishedAt": "2022-06-06T08:03:22Z", "content": "A thorough understanding of galaxy evolution depends in part on an accurate measurement of the abundance of metals in the intergalactic medium the space between stars but dust can impede observations… [+5042 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists created the first ”time-crystal” two-body system - Tech Explorist", "description": "Time crystals are “impossible” but obey quantum physics.", "url": "https://www.techexplorist.com/scientists-created-first-time-crystal-two-body-system/47947/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/rotating-refrigerator.jpg", "publishedAt": "2022-06-06T07:04:14Z", "content": "Made from atoms in never-ending motion, the time crystals were long believed to be impossible. A time crystal is a macroscopic quantum system in periodic motion in its ground state. They exhibit the … [+1814 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA: Asteroid, larger than the Colosseum in Rome, is zooming-in on Earth; Know the risk - HT Tech", "description": "A 190-feet wide asteroid will soon be approaching the Earth, says NASA. Should you be concerned about an asteroid strike? Find out.", "url": "https://tech.hindustantimes.com/tech/news/nasa-asteroid-larger-than-the-colosseum-in-rome-is-zooming-in-on-earth-know-asteroid-strike-chances-71654494971420.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/06/1600x900/ygy_1637905928669_1654495006518.jpg", "publishedAt": "2022-06-06T05:58:59Z", "content": "After a brief spell of peace, large asteroids have begun swarming around Earth again. Earlier today, a 160-feet wide asteroid flew past the Earth and now, according to NASA, a larger 190-feet wide as… [+2339 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Heads up! Strawberry Moon set to delight skygazers on June 14 - Devdiscourse", "description": "Read more about Heads up! Strawberry Moon set to delight skygazers on June 14 on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2062764-heads-up-strawberry-moon-set-to-delight-skygazers-on-june-14", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_06_2021_09_57_36_4604358.jpg?width=920&format=jpeg", "publishedAt": "2022-06-06T05:28:55Z", "content": "June's Full Moon, also known as Strawberry Moon or Supermoon, will appear Tuesday morning, June 14, 2022, at 7:52 a.m. EDT. According to NASA, the Moon will appear full for about 3 days centered on t… [+2119 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "From mapping Earth's dust to performing surgery: These science experiments are headed to space - India Today", "description": "SpaceX will transport fresh supplies and cargo to the Space Station on Friday, kicking off a new series of experiments beyond Earth.", "url": "https://www.indiatoday.in/science/story/from-mapping-earth-s-dust-to-performing-surgery-these-science-experiments-are-headed-to-space-1958844-2022-06-06", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/SpaceX_Dragon_1-647x363.jpeg?ip228PcE23_ECXDP090.Erxf_qfKILoA", "publishedAt": "2022-06-06T05:08:15Z", "content": "SpaceX is all set to send a fresh supply of cargo, food, and science experiments to the International Space Station (ISS) on its Falcon-9 rocket on Friday. The 25th cargo resupply mission will launch… [+3602 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Stan Shaw", "title": "We have received a mysterious radio signal from the galaxy NGC 2082 - Tech News Inc", "description": "While observing a spiral galaxy known as NGC 2082, astronomers have discovered a mysterious, bright and compact radio source. Its origin remains unknown", "url": "https://technewsinc.com/we-have-received-a-mysterious-radio-signal-from-the-galaxy-ngc-2082/", "urlToImage": "https://cdn.futura-sciences.com/buildsv6/images/wide1920/e/3/7/e37383a287_50190182_galaxie-spirale-ngc-2082.jpg", "publishedAt": "2022-06-06T05:06:23Z", "content": "While observing a spiral galaxy known as NGC 2082, astronomers have discovered a mysterious, bright and compact radio source. Its origin remains unknown to this day.\r\nFrom the center of the galaxy NG… [+2085 chars]"}, {"source": {"id": null, "name": "Dubaiweek.ae"}, "author": "Stuart Wagner", "title": "Does Aurora Borealis occur on other planets outside the planet? - Dubai Week", "description": "Dance ribbons of green, red and purple light illuminate the night sky from time to...", "url": "https://www.dubaiweek.ae/does-aurora-borealis-occur-on-other-planets-outside-the-planet/", "urlToImage": null, "publishedAt": "2022-06-06T05:03:14Z", "content": "Dance ribbons of green, red and purple light illuminate the night sky from time to time Polar circle In the area around the north and Antarctica, is called Aurora borealisThe event was named after th… [+2823 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Press Trust of India", "title": "NASA awards contracts to develop next-gen spacesuits for ISS and lunar missions, two companies in fray - News9 LIVE", "description": "The values of the contracts have not yet been announced, but they have a combined ceiling of $3.5...", "url": "https://www.news9live.com/science/nasa-awards-contracts-to-develop-next-gen-spacesuits-for-iss-and-lunar-missions-two-companies-in-fray-174592", "urlToImage": "https://media.news9live.com/h-upload/2021/12/24/113624-axiom-space.jpg", "publishedAt": "2022-06-06T03:10:53Z", "content": "NASA on Wednesday announced it has awarded contracts to two companies to develop the next generation of spacesuits for missions to the International Space Station and the Moon. The winners of the Ext… [+1211 chars]"}, {"source": {"id": null, "name": "Techstory.in"}, "author": null, "title": "Recent NASA updates on next-gen spacesuits and lunar-roving robot - Techstory", "description": "Last week NASA announced three major announcements. The James Webb Space Telescope now has important target data to showcase its findings.", "url": "https://techstory.in/recent-nasa-developments-on-next-gen-spacesuits-and-lunar-roving-robot/", "urlToImage": "https://techstory.in/wp-content/uploads/2022/06/m18-109a.jpg", "publishedAt": "2022-06-06T02:44:53Z", "content": "Last week NASA announced three major announcements. The James Webb Space Telescope now has important target data to showcase its findings. By June 12 Webbb’s full science capabilities will be reveale… [+3242 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritvik Chaturvedi", "title": "Digging Deep: Is genetic recombination linked to expression of harmful traits? - The Indian Express", "description": "A study published this week by a team of researchers from Canada suggests that that regions of the genome that are likely to undergo recombination are also more likely to flush out a set of deleterious alleles.", "url": "https://indianexpress.com/article/technology/science/digging-deep-is-genetic-recombination-linked-to-expression-of-harmful-traits-7950676/", "urlToImage": "https://images.indianexpress.com/2022/06/Digging-Deep-Genetics.jpg", "publishedAt": "2022-06-06T02:17:18Z", "content": "Most mammals, including humans, are diploid. That is, nuclear DNA (nrDNA) exists as pairs of chromosomes (humans have 23 pairs of chromosomes, while mice have 20). This pair of chromosomes are homolo… [+6057 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "PAUL M. SUTTER, Universe Today", "title": "Dark matter fueled the first stars in the universe — new study - Inverse", "description": "Dark matter doesn’t really do much of anything in the present-day universe. But it may have played a crucial role in the early days of the cosmos.", "url": "https://www.inverse.com/science/dark-matter-first-stars", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2022/6/3/1fbff4d3-9950-4489-bfbf-bb03087d51ce-shutterstock-1818634925.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-06-06T00:00:25Z", "content": "Dark matter doesnt really\r\n do much of anything in the present-day universe. But in the early days of the cosmos, there may have been pockets of dark matter with high enough density that they provide… [+3494 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Use Technology Tool to Discover New Asteroids - VOA Learning English", "description": "Scientists have used a new technology tool to discover more than 100 asteroids that had not been identified before.", "url": "https://learningenglish.voanews.com/a/scientists-use-technology-tool-to-discover-new-asteroids/6600999.html", "urlToImage": "https://gdb.voanews.com/096e0000-0a00-0242-8fbd-08da44e99da4_w1200_r1.png", "publishedAt": "2022-06-05T22:01:05Z", "content": "Scientists have used a new tool to discover more than 100 asteroids that had not been identified before.\r\nThe method uses a complex computing method called an algorithm to search for asteroids that w… [+4226 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Joaquin Victor Tacla", "title": "Could a ‘Mirror Universe’ Solve Crisis in Cosmology? New Study on Hubble Constant Could Glean Light! - Tech Times", "description": "Do you believe in a mirror universe?", "url": "https://www.techtimes.com/articles/276343/20220605/mirror-universe-crisis-cosmology-new-study-hubble-constant.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/406103/nasa-illustration-of-early-universe.jpg", "publishedAt": "2022-06-05T22:00:00Z", "content": "Have you ever fancied the idea that somewhere out there, there's another you? That in a faraway mirrored universe, there's another version of yourself.\r\nThe mirror universe is usually an interest in … [+3357 chars]"}, {"source": {"id": null, "name": "Newsazi.com"}, "author": "Eli Pacheco", "title": "Is There A Center Of The Universe? - News Azi", "description": "When peering into space through a telescope, everything seems to look the same no matter what direction we point that telescope (via Forbes). According to the American Astronomical Society, galaxies seen from Earth appear to be scatter", "url": "https://newsazi.com/is-there-a-center-of-the-universe/", "urlToImage": "https://www.slashgear.com/img/gallery/is-there-a-center-of-the-universe/l-intro-1654456299.jpg", "publishedAt": "2022-06-05T19:30:27Z", "content": "When peering into space through a telescope, everything seems to look the same no matter what direction we point that telescope (via Forbes). According to the American Astronomical Society, galaxies … [+1587 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Raju Singh", "title": "NASA Highlights: Astronomical Photos of the Week (28/05 to 03/06/2022) - Play Crazy Game", "description": "The photos gathered by NASA this week on the Astronomy Picture of the Day website will interest science enthusiasts of all tastes. If you're interested in supernovas, you'll see the remnant RCW 86, formed from the remains of the oldest supernova ever recorded…", "url": "https://playcrazygame.com/2022/06/06/nasa-highlights-astronomical-photos-of-the-week-28-05-to-03-06-2022/", "urlToImage": "https://t.ctcdn.com.br/siLX_i12yJLCXCDu8jtpWmoVAx0=/988x556/smart/i598490.png", "publishedAt": "2022-06-05T19:15:36Z", "content": "The photos gathered by NASA this week on the Astronomy Picture of the Day website will interest science enthusiasts of all tastes. If you’re interested in supernovas, you’ll see the remnant RCW 86, f… [+9986 chars]"}, {"source": {"id": null, "name": "SpacePolicyOnline.com"}, "author": null, "title": "NASA MEDIA TELECON ON MISSION STUDYING THUNDERSTORMS, June 7, 2022, virtual, 11:00 am ET - SpacePolicyOnline.com", "description": "Posted: June 5, 2022 2:15 pm ET | Last Updated: June 5, 2022 2:15 pm ET | NASA will hold a media telecon on June 7, 2022 at 11:00 am ET (10:00 am Central) to discuss “research about intense summer thunderstorms over the central United States and their effects…", "url": "https://spacepolicyonline.com/events/nasa-media-telecon-on-mission-studying-thunderstorms-june-7-2022-virtual-1100-am-et/", "urlToImage": null, "publishedAt": "2022-06-05T18:24:01Z", "content": "NASA will hold a media telecon on June 7, 2022 at 11:00 am ET (10:00 am Central) to discuss “research about intense summer thunderstorms over the central United States and their effects on Earths atm… [+711 chars]"}, {"source": {"id": null, "name": "WJTV"}, "author": "Rachel Hernandez", "title": "Study shows plants can grow in soil from the moon - WJTV", "description": "JACKSON, Miss. (WJTV) – A NASA-funded study conducted at the University of Florida showed that plants can grow in soil from the moon. Scientists used samples of nutrient-poor lunar regolith (soil) that were collected from the moon on the Apollo 11, 12 and 17 …", "url": "https://www.wjtv.com/news/national/study-shows-plants-can-grow-in-soil-from-the-moon/", "urlToImage": "https://www.wjtv.com/wp-content/uploads/sites/72/2022/01/nasa-full-moon-1.jpg?w=1280", "publishedAt": "2022-06-05T16:20:44Z", "content": "JACKSON, Miss. (WJTV) – A NASA-funded study conducted at the University of Florida showed that plants can grow in soil from the moon. \r\nScientists used samples of nutrient-poor lunar regolith (soil) … [+1718 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Electric Organs Discovered in Electric Fish - Galaxy Reporters", "description": "Organs help electric fish, such as the electric eel, perform amazing things: They send and receive signals like bird songs, allowing them to see other electric fish by species, sex, and even individuals. A new study by Science Advances explains how small gene…", "url": "https://galaxyreporters.com/electric-organs-discovered-in-electric-fish/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/06/electric-organs.webp", "publishedAt": "2022-06-05T16:06:34Z", "content": "Organs help electric fish, such as the electric eel, perform amazing things: They send and receive signals like bird songs, allowing them to see other electric fish by species, sex, and even individu… [+2054 chars]"}, {"source": {"id": null, "name": "Raw Story"}, "author": "Nicole Karlis, Salon", "title": "Scientist says interstellar travel might be possible without spaceships - Raw Story", "description": "While a warp drive almost certainly isn't a thing that will ever exist, there's no law of physics that says interstellar travel isn't possible. Perhaps that is one reason why the sci-fi idea isn't out of the realm of possibility, and why some scientists aren'…", "url": "https://www.rawstory.com/space-travel/", "urlToImage": "https://www.rawstory.com/media-library/alien-life-is-out-there-but-our-theories-are-probably-steering-us-away-from-it.jpg?id=24827058&width=1200&coordinates=0%2C107%2C0%2C107&height=600", "publishedAt": "2022-06-05T15:33:34Z", "content": "While a warp drive almost certainly isn't a thing that will ever exist, there's no law of physics that says interstellar travel isn't possible. Perhaps that is one reason why the sci-fi idea isn't ou… [+4328 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA treats stargazers with 'eye-candy'; shares dazzling Hubble image of a star cluster - Republic World", "description": "NASA recently shared a Hubble image featuring the globular star cluster Liller 1 which is located about 30,000 light-years away from Earth.", "url": "https://www.republicworld.com/science/space/nasa-treats-stargazers-with-eye-candy-shares-dazzling-hubble-image-of-a-star-cluster-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/wvkiwk6oki7yvli8_1654441426.jpeg", "publishedAt": "2022-06-05T15:27:00Z", "content": "NASA has offered another treat to its fans as it shared a spectacular image of a star cluster glittering at its best. Captured by the Hubble Space Telescopes Wide Field Camera 3 (WFC), the picture fe… [+1906 chars]"}, {"source": {"id": null, "name": "Galaxyreporters.com"}, "author": null, "title": "Hubble Telescope Identifies A Peculiar Dwarf Galaxy - Galaxy Reporters", "description": "The Hubble Space Telescope has captured the fascinating new vision of a busy star-born factory. Minkowski’s Object with an unusual shape, a small galaxy, glows blue to the bottom left of the image, while the elliptical galaxy NGC 541 shines brightly at the to…", "url": "https://galaxyreporters.com/hubble-telescope-identifies-a-peculiar-dwarf-galaxy/", "urlToImage": "https://galaxyreporters.com/wp-content/uploads/2022/05/shutterstock_337137236-scaled.jpg", "publishedAt": "2022-06-05T15:08:30Z", "content": "The Hubble Space Telescope has captured the fascinating new vision of a busy star-born factory.\r\nMinkowski’s Object with an unusual shape, a small galaxy, glows blue to the bottom left of the image, … [+1463 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA's Curiosity rover spots another bizarre-shaped delicate rock on Mars - Republic World", "description": "NASA's decade-old Curiosity rover has spotted another bizarre creation while exploring the Gale crater - its exploration site - on Mars.", "url": "https://www.republicworld.com/science/space/nasas-curiosity-rover-spots-another-bizarre-shaped-delicate-rock-on-mars-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/jkvlfm7xsd5uvjes_1654439274.jpeg", "publishedAt": "2022-06-05T14:57:00Z", "content": "NASA's decade-old Curiosity rover has spotted another bizarre feature while exploring Mars. During its recent observation, the rover has imaged what looks like a dust-coloured plant stemming out of a… [+2244 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "What dandelions are \"thinking\" - the secret to their success - Earth.com", "description": "What dandelions are \"thinking\" - the secret to their success • Earth.com", "url": "https://www.earth.com/news/what-dandelions-are-thinking-the-secret-to-their-success/", "urlToImage": "https://cff2.earth.com/uploads/2022/06/05080441/Dandelion.png", "publishedAt": "2022-06-05T14:48:55Z", "content": "Dandelions flower in the early spring and provide a welcome source of nectar and pollen to bees, butterflies, birds and other pollinators. As the season progresses, they develop a “fluffy” head of se… [+5594 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruby khanna", "title": "6 Fun and Effective Ways You Can Include Balance Exercises in Your Walks - Sportskeeda", "description": "Balance is essential at any level of fitness and age. From helping you walk and run normally to preventing the risks of falling, balance plays an important role in regular life.", "url": "https://www.sportskeeda.com/health-and-fitness/6-balance-exercises-can-include-walks", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/06/3ee8e-16544362342484-1920.jpg", "publishedAt": "2022-06-05T14:12:21Z", "content": "Balance is essential at any level of fitness and age. From helping you walk and run normally to preventing the risks of falling, balance plays an important role in regular life. \r\nBalance exercises, … [+4202 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "From making Moon bricks to anti-ageing system: Experiments being sent by NASA to ISS - Republic World", "description": "NASA is sending tissue chips to study how microgravity affects immune function along with experiments that would help reverse ageing. Read all about it.", "url": "https://www.republicworld.com/science/space/from-making-moon-bricks-to-anti-ageing-system-experiments-being-sent-by-nasa-to-iss-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/n19czlgw8o9oz6wi_1654434640.jpeg", "publishedAt": "2022-06-05T13:20:00Z", "content": "SpaceXs Dragon will lift off to the International Space Station (ISS) on June 10 with many game-changing experiments. These experiments will be conducted by the Expedition 67 astronauts who would att… [+3012 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tom Kerss", "title": "Venus crossed the sun's face 10 years ago today. Most people alive will never see the sight again. - Space.com", "description": "A look back at the last transit of Venus for more than a century, as it appeared in pristine Hawaiian skies.", "url": "https://www.space.com/venus-transit-2012-skywatching-reminiscences", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bjHh2pTB3Eg5kkSYisSypJ-1200-80.jpg", "publishedAt": "2022-06-05T12:50:59Z", "content": "For many of us, the past two years have delivered a lesson in not taking things for granted. The chaos of the pandemic disrupted relationships, trade and the privileges we often enjoy without a secon… [+11875 chars]"}, {"source": {"id": null, "name": "Westsidepeoplemag.com"}, "author": "Izer", "title": "Putting special theory of relativity into practice - Westside People", "description": "The theory of relativity usually includes two interrelated theories by Albert Einstein: special relativity published in 1905 and general relativity", "url": "https://westsidepeoplemag.com/putting-special-theory-of-relativity-into-practice/", "urlToImage": "https://westsidepeoplemag.com/wp-content/uploads/2022/06/Putting-special-theory-of-relativity-into-practice.jpg", "publishedAt": "2022-06-05T12:50:32Z", "content": "The theory of relativity usually includes two interrelated theories by Albert Einstein: special relativity published in 1905 and general relativity published in 1915. Special relativity applies to al… [+6281 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "For the first time, the Perseverance rover has captured a cloud of Martian dust that grows - BollyInside", "description": "From the cold temperatures to the radiation that bombards its surface, Mars is an unfriendly location for a variety of reasons. However, there is another", "url": "https://www.bollyinside.com/news/technology/for-the-first-time-the-perseverance-rover-has-captured-a-cloud-of-martian-dust-that-grows", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/06/For-the-first-time-the-Perseverance-rover-has-captured-a.jpeg", "publishedAt": "2022-06-05T11:58:11Z", "content": "From the cold temperatures to the radiation that bombards its surface, Mars is an unfriendly location for a variety of reasons. However, there is another aspect of the planet that makes it difficult … [+2480 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "Cristian Antonescu", "title": "Astronomers Detect Mysterious Structure in a Galaxy - Optic Flux", "description": "The Atacama Large Millimeter/submillimeter Array (ALMA) proves itself useful once again, as astronomers have been using it to detect a mysterious structure in the form of faint radio emission. The structure was found in the host galaxy of the quasar known as …", "url": "https://www.opticflux.com/astronomers-detect-mysterious-structure-in-a-galaxy/20224/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/06/stars.jpg", "publishedAt": "2022-06-05T10:39:10Z", "content": "The Atacama Large Millimeter/submillimeter Array (ALMA) proves itself useful once again, as astronomers have been using it to detect a mysterious structure in the form of faint radio emission. The st… [+1681 chars]"}, {"source": {"id": null, "name": "Alarabiya.net"}, "author": "Al Arabiya English", "title": "Ancient volcanoes on the Moon may have created drinking water, study finds - Al Arabiya English", "description": "Ancient volcanoes on Earth’s moon may have created water, a new study found.Billions of years ago, a series of volcanic eruptions broke loose on the moon,", "url": "https://english.alarabiya.net/News/world/2022/06/05/Ancient-volcanoes-on-the-Moon-may-have-created-drinking-water-study-finds", "urlToImage": "https://vid.alarabiya.net/images/2022/06/05/bd025a32-6e9c-4f15-8c6f-3098a3d85e49/bd025a32-6e9c-4f15-8c6f-3098a3d85e49_16x9_600x338.JPG", "publishedAt": "2022-06-05T09:28:00Z", "content": "Ancient volcanoes on Earths moon may have created water, a new study found.\r\nBillions of years ago, a series of volcanic eruptions broke loose on the moon, engulfing hundreds of thousands of square m… [+2499 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Hubble Telescope captures giant star 32x larger than Sun, but it will die first! Check breathtaking NASA photo - HT Tech", "description": "NASA’s Hubble Telescope shared a breathtaking photo of a massive star that is 32 times larger than the Sun. Know details.", "url": "https://tech.hindustantimes.com/tech/news/hubble-telescope-captures-giant-star-32x-larger-than-sun-but-it-will-die-first-check-breathtaking-nasa-photo-71654420134561.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/05/1600x900/giant_star_1654420212533_1654420225690.PNG", "publishedAt": "2022-06-05T09:11:05Z", "content": "It is stunning and spooky at the same time! NASA's Hubble Telescope has again left everyone mesmerized with a new glimpse of a giant star. Though there are millions of stars that you can witness in a… [+1693 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "World Environment Day: From fractals to Fibonacci, 5 things to show math is an integral part of nature - India Today", "description": "On World Environment Day, here are five things that show mathematics is an integral part of nature.", "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/world-environment-day-from-fractals-to-fibonacci-5-things-to-show-math-is-an-integral-part-of-nature-1958591-2022-06-05", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/giulia-may-cNtMy74-mnI-unsplas-647x363.jpeg?arRjFeVk9ZLTT1tfIiglDrQqhnQbeXKl", "publishedAt": "2022-06-05T07:49:52Z", "content": "1 plus 1 equal 2 -- sounds like a simple calculation for humans but a tricky one for fish. And guess what? Fish can do maths too! A new study at the University of Bonn in Germany revealed that fish s… [+4237 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Haraprasad Das", "title": "NASA Releases Video Of Jupiter Captured By Juno Spacecraft - Pragativadi", "description": "California: American space agency NASA (National Aeronautics and Space Administration) never fails to amaze us with their updates. Now, the Jet Propulsion Laboratory of NASA has shared a video on Instagram which gives a glimpse of gas giant Jupiter.T", "url": "https://pragativadi.com/nasa-releases-video-of-jupiter-captured-by-juno-spacecraft/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2022/06/rp39flto_jupiter-240_625x300_04_June_22.jpg", "publishedAt": "2022-06-05T04:59:02Z", "content": "California: American space agency NASA (National Aeronautics and Space Administration) never fails to amaze us with their updates. Now, the Jet Propulsion Laboratory of NASA has shared a video on Ins… [+1083 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Scientists decode why mice go bananas when they’re around the fruit - ThePrint", "description": "ScientiFix, our weekly feature, offers you a summary of the top global science stories of the week, with links to their sources.", "url": "https://theprint.in/scientifix/scientists-decode-why-mice-go-bananas-when-theyre-around-the-fruit/983519/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/06/Mice.jpg", "publishedAt": "2022-06-05T03:00:49Z", "content": "New Delhi: Why do mice seem afraid around bananas? Researchers from McGill University in Canada claim to have found the answer bananas smell the same as a pregnant mouse.\r\nAccording to the team, amon… [+6162 chars]"}, {"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Jack Sylva", "title": "After an experiment goes wrong, scientists inadvertently create a horde of particularly vicious HAMSTERS - TDPel Media", "description": "After a gene editing experiment to'reduce aggression' went wrong, scientists inadvertently generated a colony of abnormally violent hamsters. Researchers", "url": "https://tdpelmedia.com/after-an-experiment-goes-wrong-scientists-inadvertently-create-a-horde-of-particularly-vicious-hamsters", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/04/09/58669909-10884147-image-a-5_1654330258913.jpg", "publishedAt": "2022-06-04T19:59:26Z", "content": "To learn more, scientists turned off Avpr1a, a receptor in the brain that interacts with vasopressin.The rats were supposed to grow friendlier now that they were immune to the hormone.\r\nThe consequen… [+860 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA Invites Media to Headquarters to Meet Commercial Crew Astronauts - India Education Diary", "description": "NASA will host an in-person media opportunity at 8:45 a.m. EDT Tuesday, June 7, at NASA Headquarters in Washington with the agency’s SpaceX Crew-2 astronauts to discuss their recent mission aboard the International Space Station to benefit life on Ea", "url": "https://indiaeducationdiary.in/nasa-invites-media-to-headquarters-to-meet-commercial-crew-astronauts/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/06/51668180531_71b7dbec4c_k.jpeg", "publishedAt": "2022-06-04T19:52:30Z", "content": "NASA will host an in-person media opportunity at 8:45 a.m. EDT Tuesday, June 7, at NASA Headquarters in Washington with the agencys SpaceX Crew-2 astronauts to discuss their recent mission aboard the… [+1036 chars]"}]}