{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Turning Back the Cosmic Clock: How NASA's Roman Space Telescope Will Rewind the Universe - SciTechDaily", "description": "A new simulation shows how NASA’s Nancy Grace Roman Space Telescope will turn back the cosmic clock, unveiling the evolving universe in ways that have never been possible before when it launches by May 2027. With its ability to rapidly image enormous swaths o…", "url": "https://scitechdaily.com/turning-back-the-cosmic-clock-how-nasas-roman-space-telescope-will-rewind-the-universe/", "urlToImage": "https://scitechdaily.com/images/How-NASA-Roman-Space-Telescope-Will-Rewind-Universe-scaled.jpg", "publishedAt": "2023-03-04T11:37:07Z", "content": "ByAshley Balzer, NASAs Goddard Space Flight CenterMarch 4, 2023\r\nIn this side view of the simulated universe, each dot represents a galaxy whose size and brightness corresponds to its mass. Slices fr… [+10454 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Adrian Beil", "title": "Starship debut leading the rocket industry toward full reusability - NASASpaceFlight.com - NASASpaceflight.com", "description": "Starship’s first orbital flight is currently planned for March. This is the first time the…", "url": "https://www.nasaspaceflight.com/2023/03/starship-debut-reusability/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/03/FnKfGSNakAAw2Ox-525x350.jpg", "publishedAt": "2023-03-03T19:50:41Z", "content": "Starship’s first orbital flight is currently planned for March. This is the first time the anticipated flight date of the vehicle is in the current month, and with that, a future of fully reusable ro… [+10343 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Daniela Hernandez", "title": "Take a Plunge Under Antarctica’s Ice, With Robots - The Wall Street Journal", "description": "Researchers sent robots deep into the frozen continent and got unprecedented close-up views beneath Antarctica’s ice. Among the goals: add more nuanced data to climate models.", "url": "https://www.wsj.com/story/take-a-plunge-under-antarcticas-ice-with-robots-f25b99d5", "urlToImage": "https://images.wsj.net/im-734285/social", "publishedAt": "2023-03-03T16:02:15Z", "content": "Marine ice (top left) has a greenish tint to it. By comparison, glacial ice (bottom left), which forms on land, is white. The transition from white to green ice is the supercooling horizon, says Dr. … [+141 chars]"}]}