{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's InSight Lander Reveals Details On Outermost Layer Of Mars - NDTV", "description": "NASA's robotic InSight lander, in the twilight of its service after nearly 4 years on Mars, is revealing new details about Earth's closest planetary neighbor based on data from 2 big meteorite impacts that shed light on the Martian crust's structure.", "url": "https://www.ndtv.com/world-news/nasas-insight-lander-reveals-details-on-outermost-layer-of-mars-3468197", "urlToImage": "https://c.ndtvimg.com/2018-11/btm5pe74_nasa-insight_650x400_27_November_18.jpg", "publishedAt": "2022-10-28T01:39:58Z", "content": "Until now, InSight had obtained data on the structure of the Martian crust.\r\nWashington: NASA's robotic InSight lander, in the twilight of its service after nearly four years on Mars, is revealing ne… [+4061 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "The contribution of water molecules to the hydrogen evolution reaction - EurekAlert", "description": "A research team from Chongqing University and Chongqing Technology and Business University summarizes recent progress on hydrogen evolution reaction (HER) activity descriptors, focusing on the contribution of interfacial water molecules, including their disso…", "url": "https://www.eurekalert.org/news-releases/969365", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-10-28T00:03:41Z", "content": "Coupling renewable energy to produce hydrogen by electrolysis of water is an effective way to develop new energy utilization and solve the energy crisis. It is significant to fully understand the cat… [+3379 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Juliane Jury", "title": "First online database of photocharged materials developed for battery research - Phys.org", "description": "Materials chemistry is a rapidly evolving area of research, with thousands of various semiconductors, and more materials being added all the time. What material among this variety would be the best for application in solar batteries, for example? How should s…", "url": "https://phys.org/news/2022-10-online-database-photocharged-materials-battery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/battery-research---fir.jpg", "publishedAt": "2022-10-27T20:08:03Z", "content": "Materials chemistry is a rapidly evolving area of research, with thousands of various semiconductors, and more materials being added all the time. What material among this variety would be the best f… [+3725 chars]"}, {"source": {"id": null, "name": "Payloadspace.com"}, "author": "Rachael Zisk, Rachael Zisk", "title": "Scientists Uncover Long-Lost Star Catalog - Payload - Payload", "description": "For millennia, humanity has been gazing up toward the stars, trying to make sense of the glittering madness. Hipparchus, a Greek astronomer who lived about 2,100 years ago, is credited not only with creating trigonometry, but also with assigning the first num…", "url": "https://payloadspace.com/scientists-uncover-long-lost-star-catalog/", "urlToImage": "https://payloadspace.com/wp-content/uploads/2022/10/image-19.png", "publishedAt": "2022-10-27T19:41:23Z", "content": "For millennia, humanity has been gazing up toward the stars, trying to make sense of the glittering madness. Hipparchus, a Greek astronomer who lived about 2,100 years ago, is credited not only with … [+1938 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Neutron star mergers confirmed to synthesise rare earth elements - News9 LIVE", "description": "For the first time, rare earth elements have been directly identified in the spectra of a neutron star merger", "url": "https://www.news9live.com/science/neutron-star-mergers-confirmed-to-synthesise-rare-earth-elements-204524", "urlToImage": "https://media.news9live.com/h-upload/2022/10/27/575293-211prrareearthelementssynthesisconfirmedtcropped.jpg", "publishedAt": "2022-10-27T18:39:15Z", "content": "For the first time, a group of researchers have identified rare earth elements formed during the process of neutrons star mergers. A violent explosion results after a pair of binary neutrons stars me… [+1862 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's InSight and Mars Reconnaissance Orbiter Team Up to Make Science Discovery (Media Briefing) - NASA", "description": "Two NASA missions, working in tandem, have made a science discovery on Mars.In this briefing, science team members from NASA’s InSight Mars lander and the Ma...", "url": "https://www.youtube.com/watch?v=z9C4yyqu3yI", "urlToImage": "https://i.ytimg.com/vi/z9C4yyqu3yI/maxresdefault.jpg", "publishedAt": "2022-10-27T18:33:03Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jessica Murray", "title": "Bumblebees get a buzz out of playing with balls, study finds - The Guardian", "description": "Research shows bees rolling wooden balls despite having no apparent incentive to do so", "url": "https://www.theguardian.com/science/2022/oct/27/bumblebees-playing-wooden-balls-bees-study", "urlToImage": "https://i.guim.co.uk/img/media/740920b95c23736e353ed84b61509ed3bb0bbf81/0_0_3944_2367/master/3944.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0f33989f107c76aff70419f527dd9d3e", "publishedAt": "2022-10-27T18:29:00Z", "content": "Bumblebees are associated with lives of work rather than play, but researchers have for the first time observed the insects playing with balls for enjoyment, just like humans and dogs.\r\nA team of UK … [+2316 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "New research sheds light on how genes turn on and off - ANI News", "description": "Using CRISPR techniques, the researchers removed parts of the yeast transcription machinery to systematically examine their role in regulating genes. Yeast and humans have mostly the same molecular machinery to regulate their genes, so yeast provides an excel…", "url": "https://www.aninews.in/news/science/new-research-sheds-light-on-how-genes-turn-on-and-off20221027235617", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221027173547.jpg", "publishedAt": "2022-10-27T18:26:00Z", "content": "Washington [US], October 27 (ANI): Yeast, the simple organism essential to making beer and bread, has revealed for Cornell University researchers a key mechanism in how genes are controlled.Gene tran… [+1630 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Thunderstorm in the Hive! Bees can produce electricity up to 1000 volts, camera shows - HT Tech", "description": "A new research published in the journal iScience has explained that a swarm of honey bees can generate as much electricity as a thunderstorm.", "url": "https://tech.hindustantimes.com/tech/news/thunderstorm-in-the-hive-bees-can-produce-electricity-up-to-1000-volts-camera-shows-71666893415943.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/27/1600x900/SAFRICA-ESKOM--0_1656960484905_1666894308182_1666894308182.JPG", "publishedAt": "2022-10-27T18:23:02Z", "content": "Can you believe swarms of honeybees can help in electricity generation? Yes! A new research published in the journal iScience has suggested that swarms of honeybees can generate as much electrical ch… [+1772 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New routes for the construction of strong metal–support interactions - Phys.org", "description": "Supported metal nanoparticle (NP) catalysts play an important role in a series of industrially important reactions for fuel production, fine chemical synthesis, pollutant removal, and solar harvesting.", "url": "https://phys.org/news/2022-10-routes-strong-metalsupport-interactions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-routes-for-the-con-1.jpg", "publishedAt": "2022-10-27T18:08:50Z", "content": "Supported metal nanoparticle (NP) catalysts play an important role in a series of industrially important reactions for fuel production, fine chemical synthesis, pollutant removal, and solar harvestin… [+2867 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Video: Solar Orbiter's unprecedented view of the quiet corona - Phys.org", "description": "The ESA-led Solar Orbiter mission has experienced its second close encounter with the sun. It is delivering more stunning data, and at higher resolution than ever before.", "url": "https://phys.org/news/2022-10-video-solar-orbiter-unprecedented-view.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/video-solar-orbiters-u.jpg", "publishedAt": "2022-10-27T18:07:33Z", "content": "The ESA-led Solar Orbiter mission has experienced its second close encounter with the sun. It is delivering more stunning data, and at higher resolution than ever before.\r\nThe moment of closest appro… [+2773 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Adrienne Berard", "title": "Traces of ancient ocean discovered on Mars - Phys.org", "description": "A recently released set of topography maps provides new evidence for an ancient northern ocean on Mars. The maps offer the strongest case yet that the planet once experienced sea-level rise consistent with an extended warm and wet climate, not the harsh, froz…", "url": "https://phys.org/news/2022-10-ancient-ocean-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/traces-of-ancient-ocea.jpg", "publishedAt": "2022-10-27T18:03:08Z", "content": "A recently released set of topography maps provides new evidence for an ancient northern ocean on Mars. The maps offer the strongest case yet that the planet once experienced sea-level rise consisten… [+5433 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Chasing Sprites in Electric Skies - NASA Goddard", "description": "Paul Smith is a night-sky fanatic and photographer. His obsession is sprites: immense jolts of light that flicker high above thunderstorms. Last October, he ...", "url": "https://www.youtube.com/watch?v=iwDRkQMOrU0", "urlToImage": "https://i.ytimg.com/vi/iwDRkQMOrU0/hqdefault.jpg", "publishedAt": "2022-10-27T17:57:46Z", "content": null}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Bricks made of lunar regolith can be used to construct Artemis base camp - News9 LIVE", "description": "In-situ resource utilisation can save valuable space on spacecraft for programmes such as Artemis", "url": "https://www.news9live.com/science/bricks-made-of-lunar-regolith-can-be-used-to-construct-artemis-base-camp-204518", "urlToImage": "https://media.news9live.com/h-upload/2022/10/27/575288-nasa-basecampforwebcropped.jpg", "publishedAt": "2022-10-27T17:47:15Z", "content": "NASA intends to establish a long-term presence on the lunar surface for the Artemis missions, with a cabin, a rover and a mobile home. Researchers have demonstrated that the fixed habitat can be cons… [+1713 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Our Search for Habitable Planets Just Got a Lot Narrower, Study Suggests - ExtremeTech", "description": "After analyzing a nearby exoplanet, the team has concluded it is unlikely that the most common type of star in the Milky Way is capable of supporting life as we know it.", "url": "https://www.extremetech.com/?p=340498", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2022/10/M-dwarf-and-exoplanet-640x353.jpg", "publishedAt": "2022-10-27T17:07:00Z", "content": "In the past few decades, astronomy has gone from speculating about the existence of planets outside our solar system to identifying more than 5,000 of them. Now, the hunt for habitable exoplanets is … [+2509 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Researchers develop spray-on \"metallic\" plastic that conducts electricity like metal - TechSpot", "description": "Traditional metallic and organic conductors are comprised of straight, closely packed rows of molecules or atoms. This allows electrons to flow through the material and makes them...", "url": "https://www.techspot.com/news/96468-researchers-develop-spray-metallic-plastic-conducts-electricity-like.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/10/2022-10-27-image-11.jpg", "publishedAt": "2022-10-27T16:57:31Z", "content": "TL;DR: Researchers at the University of Chicago have developed a material that can be made like a plastic but exhibits electrical conductivity properties commonly associated with a metal. \r\nTradition… [+3106 chars]"}, {"source": {"id": null, "name": "Theindianwire.com"}, "author": "Alaina Ali Beg", "title": "Prevalence of technical glitches, from Earth to Space and the threats they pose to humanity - The Indian Wire", "description": "In October 2022, NASA claimed its Transiting Exoplanet Survey Satellite (TESS) spacecraft running across the Universe on an alien-world hunting spree entered the ‘Safe Mode’ only to come back alive. This happened because of a technical glitch, a sudden unexpe…", "url": "https://www.theindianwire.com/space/prevalence-of-technical-glitches-from-earth-to-space-and-the-threats-they-pose-to-humanity-334553/", "urlToImage": "https://www.theindianwire.com/wp-content/uploads/2022/10/glitch-in-space.jpg", "publishedAt": "2022-10-27T16:47:22Z", "content": "In October 2022, NASA claimed its Transiting Exoplanet Survey Satellite (TESS) spacecraft running across the Universe on an alien-world hunting spree entered the Safe Mode only to come back alive.\r\nT… [+6291 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Scary sound of Earth's magnetic field is shocking; just LISTEN now - HT Tech", "description": "Scientists have collaborated with artists and musicians to bring the spooky sound of Earth's magnetic field to you. You can listen to it here.", "url": "https://tech.hindustantimes.com/tech/news/scary-sound-of-earth-s-magnetic-field-is-shocking-just-listen-now-71666888521477.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/27/1600x900/Earth_NASA_1653921317568_1666888968976_1666888968976.jpg", "publishedAt": "2022-10-27T16:44:34Z", "content": "Do you know Earth's magnetic field makes a sound? Yes, it does! And a scary sound at that. And most definitely it is not the sound of silence. A team of scientists have collaborated with artists and … [+1790 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "These eerie sounds made from a NASA flyby of Jupiter's moon Europa are haunting - Space.com", "description": "An eerie new video allows us to hear what NASA's Juno spacecraft experienced as it made a flyby of Jupiter's icy moon Europa last month.", "url": "https://www.space.com/juno-europa-plasma-wave-eerie-audio", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ShUgGBDmkArFBD4JzzeUy6-1200-80.jpg", "publishedAt": "2022-10-27T16:00:20Z", "content": "An eerie new video allows us to hear what NASA's Juno spacecraft experienced as it made a flyby of Jupiter's icy moon Europa last month.\r\nThe 11-second-long audio track expresses variations of plasma… [+2296 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Alan Boyle", "title": "How to See the Bigger Picture From NASA's Webb Space Telescope - Universe Today", "description": "Data visualization tools can give you a deeper appreciation of the fantastic cosmic images coming from NASA's James Webb Space Telescope.", "url": "https://www.universetoday.com/158231/how-to-see-the-bigger-picture-from-nasas-webb-space-telescope/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/10/webb2.jpg", "publishedAt": "2022-10-27T16:00:00Z", "content": "MEMPHIS, Tenn. Side-by-side pictures from NASAs 32-year-old Hubble Space Telescope and the brand-new James Webb Space Telescope may draw oohs and ahhs, but they don’t give you a full sense of just ho… [+6813 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "November's lunar eclipse will be the last total lunar eclipse for about 3 years: Check date and time - Devdiscourse", "description": "Read more about November's lunar eclipse will be the last total lunar eclipse for about 3 years: Check date and time on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2229093-novembers-lunar-eclipse-will-be-the-last-total-lunar-eclipse-for-about-3-years-check-date-and-time", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/27_10_2022_21_26_18_7708997.jfif?width=920&format=jpeg", "publishedAt": "2022-10-27T15:57:22Z", "content": "The last total lunar eclipse for three years will be happening on November 8, 2022, with the next occurring on March 14, 2025, according to NASA.\r\nOn this day, the Moon will be close enough to opposi… [+1702 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "New Hollow Metal Superlattices Created for Optical Applications - AZoNano", "description": "The method for creating unique hollow metal nanoparticle-based open-framework superlattices has significantly improved, according to Northwestern University researchers.", "url": "https://www.azonano.com/news.aspx?newsID=39841", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39841_16668730283259522.jpg", "publishedAt": "2022-10-27T15:17:00Z", "content": "Oct 27 2022Reviewed by Mila Perera\r\nAccording to Northwestern University researchers, the method for creating unique hollow metal nanoparticle-based open-framework superlattices has significantly imp… [+4968 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "New Strategy Stabilizes Atomically Dispersed Metal Catalysts - AZoNano", "description": "A research group has devised a novel “nanoglue” technique to maintain atomically scattered metal catalysts.", "url": "https://www.azonano.com/news.aspx?newsID=39842", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39842_16668722686782545.jpg", "publishedAt": "2022-10-27T15:15:00Z", "content": "Oct 27 2022Reviewed by Mila Perera\r\nA research group headed by Prof. Jie Zeng of the Chinese Academy of Sciences and international associates devised a novel “nanoglue” technique to maintain atomical… [+3879 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "High-res maps of entire polar regions provide new clues for climate researchers: Four more years of stunning images of polar regions are publicly available - Science Daily", "description": "A team of researchers has released four more years of high-resolution imagery data, which has been added to eight years of previous data, to create the most detailed polar region terrain maps ever created.", "url": "https://www.sciencedaily.com/releases/2022/10/221027093301.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-10-27T14:42:23Z", "content": "A team of researchers led by the University of Minnesota Twin Cities has released four more years of high-resolution imagery data, which has been added to eight years of previous data, to create the … [+2822 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Hubble celebrates Halloween with this inky image of a cosmic cobweb - Devdiscourse", "description": "Read more about Hubble celebrates Halloween with this inky image of a cosmic cobweb on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2228954-hubble-celebrates-halloween-with-this-inky-image-of-a-cosmic-cobweb", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/27_10_2022_20_07_54_5307702.jpg?width=920&format=jpeg", "publishedAt": "2022-10-27T14:38:55Z", "content": "The NASA/ESA Hubble Space Telescope is celebrating Halloween with this inky image of Abell 611, a cobweb of galaxies held together by a dark secret. Located over 1000 megaparsecs or roughly 3.2 billi… [+1881 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Troy Farah", "title": "A bizarre star is either the lightest neutron star ever found, or something even weirder - Salon", "description": "Why some astronomers think a weird neutron star might actually be made of elusive strange quarks", "url": "https://www.salon.com/2022/10/27/a-bizarre-star-is-either-the-lightest-neutron-star-ever-found-or-something-even-weirder/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/10/supernova_remnant_hess_j1731-347.jpg", "publishedAt": "2022-10-27T14:15:00Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "New puzzling discovery challenges Newton’s laws of gravity - Tech Explorist", "description": "Astronomy: Observation puzzles researchers.", "url": "https://www.techexplorist.com/new-puzzling-discovery-challenges-newtons-laws-gravity/54515/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/10/Prof.-Dr.-Pavel-Kroupa.jpg", "publishedAt": "2022-10-27T12:41:59Z", "content": "Until now, it has been almost impossible to determine from among the millions of stars close to a cluster those that belong to its tails. To do this, you have to look at the velocity, direction of mo… [+3887 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Fossil discovery in Scotland reveals origins of lizards: Study - Press Trust of India", "description": null, "url": "https://www.ptinews.com//news/health-and-lifestyle/fossil-discovery-in-scotland-reveals-origins-of-lizards-study/442447.html", "urlToImage": "", "publishedAt": "2022-10-27T12:26:57Z", "content": "London, Oct 27 (PTI) A fossil discovery in Scotland has brought to light new information on the early evolution of lizards during the time of the dinosaurs, according to a research.\r\nThe tiny skeleto… [+483 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Webb captures 'unprecedented' image of galaxies merging near supermassive black hole - The Indian Express", "description": "In an 'unprecedented' surprise for astronomers, the James Webb Space Telescope has captured a crisp image of multiple galaxies merging.", "url": "https://indianexpress.com/article/technology/science/james-webb-space-telescope-quasar-black-hole-8233260/", "urlToImage": "https://images.indianexpress.com/2022/10/James-Webb-telescope-galaxies-merging-20221027.jpg", "publishedAt": "2022-10-27T12:10:49Z", "content": "According to Johns Hopkins University, this image offers an unprecedented opportunity to observe how billions of years ago galaxies coalesced into the modern universe. “We think something dramatic is… [+1779 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "One month after the NASA asteroid collision success, what have scientists learned? - HT Tech", "description": "It has been one month since the historic NASA DART asteroid crash. What new secrets have the scientists revealed in this time? Check details.", "url": "https://tech.hindustantimes.com/tech/news/one-month-after-the-nasa-asteroid-collision-success-what-have-scientists-learned-71666870015878.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/27/1600x900/Asteroid-Strike-Explainer-0_1664104354008_1664104354008_1666870179879_1666870179879.jpg", "publishedAt": "2022-10-27T11:40:43Z", "content": "On September 26, NASA made history! For the first time ever, humans were able to shake and actually move a celestial body. The NASA Double Asteroid Redirection Test (DART) mission sent a spacecraft t… [+2712 chars]"}, {"source": {"id": null, "name": "Indiainternationaltimes.com"}, "author": "Staff Writer", "title": "Edward Stone: 50 Years at NASA ends, but his brainchild Voyager’s Project goes on - India International Times", "description": "Stone’s remarkable tenure on NASA’s longest-operating mission spans decades of historic discoveries and firsts. Edward Stone has retired as the project scientist for NASA’s Voyager mission a half-century after taking on the role. Stone accepted scientific lea…", "url": "https://indiainternationaltimes.com/edward-stone-50-years-at-nasa-ends-but-his-brainchild-voyagers-project-goes-on/6995", "urlToImage": "https://indiainternationaltimes.com/wp-content/uploads/2020/07/iitlogo-2.png", "publishedAt": "2022-10-27T11:32:20Z", "content": "It has been an honor and a joy to serve as the Voyager project scientist for 50 years, Stone said. The spacecraft have succeeded beyond expectation, and I have cherished the opportunity to work with … [+1585 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Inside the NASA rover where astronauts could live, work, and go to the toilet while on the Moon - euronews", "description": "NASA's prototype lunar rover has been tested in the Arizona desert as part of the Artemis programme aiming to send humans back to the Moon.READ MORE : https:...", "url": "https://www.youtube.com/watch?v=7a-ShS9Q504", "urlToImage": "https://i.ytimg.com/vi/7a-ShS9Q504/maxresdefault.jpg", "publishedAt": "2022-10-27T11:14:49Z", "content": null}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "3D Optical Coherence Tomography for Analyzing Cyanobacterial Biofilm Architecture - AZoOptics", "description": "In an article published in the journal Polymers, researchers assessed the effect of carbon nanotube (CNT)-modified surfaces in cyanobacterial biofilm development over a long-term assay under controlled hydrodynamic conditions.", "url": "https://www.azooptics.com/News.aspx?newsID=28065", "urlToImage": "https://www.azooptics.com/themes/Standard/images/full_site_logo.png", "publishedAt": "2022-10-27T10:59:00Z", "content": "Marine biofouling has serious negative effects on the environment, economy, and the energy sector. The scientific community has acknowledged the anti-adhesive and antimicrobial qualities of carbon na… [+5867 chars]"}, {"source": {"id": null, "name": "Journalsofindia.com"}, "author": "Coordinator", "title": "Sampurnanand Optical Telescope - JournalsOfIndia", "description": "In news- The 104 cm Sampurnanand Telescope (ST), a world-class telescope located near Nainital, at a workshop organised to commemorate", "url": "https://journalsofindia.com/sampurnanand-optical-telescope/", "urlToImage": "https://journalsofindia.com/wp-content/uploads/2022/10/Sampurnanand-Optical-Telescope.jpg", "publishedAt": "2022-10-27T10:46:44Z", "content": "Our vision is to orient the readers to grasp the facts objectively and analyse critically. In the rush of reaching first to the readers, the websites miss the balanced opinion, which is the need of t… [+190 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": null, "title": "There’s no one way for an insect to fly, but they’re all amazing in close up and slo-mo - Aeon", "description": "From the camera-shy to the natural-born performers, close-up, slow-motion footage reveals the varied wonders of insect flight", "url": "https://aeon.co/videos/theres-no-one-way-for-an-insect-to-fly-but-theyre-all-amazing-in-close-up-and-slo-mo", "urlToImage": "https://omicron.aeon.co/images/3b27cce2-4090-4988-b00e-36041163ca8c/header_moths-and-beetles-in-slow-motion-flight-landscape-4.jpg", "publishedAt": "2022-10-27T10:06:49Z", "content": "The US research biologist Adrian Smith uses powerful cameras to study and delight in how small winged creatures go from grounded to airborne in the blink of an eye. In this video, Smith walks viewers… [+645 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Physicists see light waves moving through a metal - Nanowerk", "description": "New research finds evidence of waveguiding in a unique quantum material. Their findings counter expectations about how metals conduct light and may push imaging beyond optical diffraction limits.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=61725.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id61725_2.jpg", "publishedAt": "2022-10-27T09:57:34Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Azooptics.com"}, "author": null, "title": "Elliptical Optical Flats & Coated Flat Mirrors - AZoOptics", "description": "Optical Surfaces Ltd. is a leading manufacturer of large, high precision optical flats and coated flat mirrors including a range of non-circular shapes such as elliptical and octagonal.", "url": "https://www.azooptics.com/News.aspx?newsID=28068", "urlToImage": "https://d36nqgmw98q4v5.cloudfront.net/images/news/ImageForNews_28068_16668634959534602.jpg", "publishedAt": "2022-10-27T09:41:00Z", "content": "Optical Surfaces Ltd. is a leading manufacturer of large, high precision optical flats and coated flat mirrors including a range of non-circular shapes such as elliptical and octagonal.\r\nLight weight… [+1831 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "In Pics: Plane-sized asteroid speeding towards Earth! Clocked at 47556 kmph by NASA - HT Tech", "description": "NASA has issued a warning that an asteroid, which is nearly as big as a commercial aircraft is speeding towards Earth today. This asteroid has been classified as a Potentially Hazardous Object by NASA. Will this space rock impact the planet?", "url": "https://tech.hindustantimes.com/photos/in-pics-plane-sized-asteroid-speeding-towards-earth-clocked-at-47556-kmph-by-nasa-71666862815041.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/27/1600x900/asteroid-3642332_640_1666863345992_1666863395214_1666863395214.jpg", "publishedAt": "2022-10-27T09:40:25Z", "content": "Top SectionsExplore Tech\r\nCopyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Enhancing mechanical properties of flash-spun filaments by pressure-induced phase separation control in supercritical high-density polyethylene solution | Scientific Reports - Nature.com", "description": "Scientific Reports - Enhancing mechanical properties of flash-spun filaments by pressure-induced phase separation control in supercritical high-density polyethylene solution", "url": "https://www.nature.com/articles/s41598-022-22781-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-22781-1/MediaObjects/41598_2022_22781_Fig1_HTML.png", "publishedAt": "2022-10-27T09:33:19Z", "content": "The formation of the HDPE/SCF solution was visually confirmed by the apparent phase change between the HDPE and solvent, as observed via the high-pressure view cell. Figure 1a shows the pressure chan… [+13600 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "'Smiling' Sun captured by NASA's Solar Observatory, here's what to know - DNA India", "description": "NASA's Solar Dynamics observatory caught black areas on the Sun in ultraviolet light. These patches give the Sun a smiley face.", "url": "https://www.dnaindia.com/science/report-smiling-sun-captured-by-nasa-s-solar-observatory-here-s-what-to-know-2996343", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/10/27/2549518-smiling-sun-captured-by-nasa-s-solar-observatory-here-s-what-to-know.jpg", "publishedAt": "2022-10-27T09:26:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Oct 27, 2022, 03:22 PM ISTNASA's Solar Dynamics observatory photographed black spots on the Sun using ultraviolet light. The pote… [+2285 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Ancient bacteria, shielded from harsh space radiation, might be sleeping on Martian surface - WION", "description": "The results suggested that if life had existed on Mars, the remnants of past life may still be present in the planets subsurface, where future expeditions may drill into the Martian soil.", "url": "https://www.wionews.com/science/ancient-bacteria-shielded-from-harsh-space-radiation-might-be-sleeping-on-martian-surface-528845", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/10/27/306541-screen-shot-2022-10-27-at-143838.png", "publishedAt": "2022-10-27T09:09:07Z", "content": "According to recent research, ancient microbes may be dozing beneath the surface of Mars, protected from the harsh radiation of space for millions of years. \r\nAlthough there hasn't been any proof of … [+1719 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "S Kaviya", "title": "Who are Curtis Joness Parents? Curtis Jones Biography, Parents Name and More - News - News", "description": "Who are Curtis Jones's Parents? Check this article to know who are Curtis Jones's Parents along with Curtis Jones biography. Curtis Jones is a English professional footballer.", "url": "https://latestnews.fresherslive.com/articles/who-are-curtis-jones-parents-where-is-curtis-jones-parents-from-what-is-curtis-jones-parents-nationality-1086340", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/10/27/who-are-curtis-jones-parents-where-is-curtis-jones-parents-from-what-is-curtis-jones-parents-nationality-635a38afafac4-1666857135.jpg", "publishedAt": "2022-10-27T08:23:03Z", "content": "Who are Curtis Jones's Parents?\r\nCurtis Jones is an English professional footballer born on 30 January 2001. Many people are eager to know their favorite personalities personal life, so Curtis Jones'… [+1161 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Nanoconfined water enters intermediate solid-liquid phase – Physics World - physicsworld.com", "description": "\"Hexatic\" phase of water trapped in narrow nanoscale cavities is also highly conductive", "url": "https://physicsworld.com/a/nanoconfined-water-enters-intermediate-solid-liquid-phase/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/10/image0.jpg", "publishedAt": "2022-10-27T08:14:01Z", "content": "The system studied. (Courtesy: Christoph Schran, Cambridge University)\r\nWhen water is trapped in narrow, nanoscale cavities, it enters an intermediate phase that is neither solid nor liquid, but some… [+4655 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "Oldest Human DNA found in UK: Reveals human existence from the Ice Age - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/science/oldest-human-dna-found-in-uk-reveals-human-existence-from-the-ice-age", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-10/b8a62617-67e2-4374-b454-5b611772b21e/istockphoto_1133041270_612x612.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-10-27T08:10:56Z", "content": "The Ice Age is said to have begun approximately 2.4 million years ago and lasted until 11,500 years ago when the earth was covered in polar ice sheets and alpine glaciers. Over the years, remains of … [+2692 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "S Kaviya", "title": "Who are Kenneth Taylors Parents? Kenneth Taylor Biography, Parents Name and More - News - News", "description": "Who are Kenneth Taylor's Parents? Check this article to know who are Kenneth Taylor's Parents along with Kenneth Taylor biography. Kenneth Taylor is a Dutch professional footballer.", "url": "https://latestnews.fresherslive.com/articles/who-are-kenneth-taylor-parents-where-is-kenneth-taylor-parents-from-what-is-kenneth-taylor-parents-nationality-1086328", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/10/27/who-are-kenneth-taylor-parents-where-is-kenneth-taylor-parents-from-what-is-kenneth-taylor-parents-nationality-635a38ad69bed-1666857133.jpg", "publishedAt": "2022-10-27T08:08:05Z", "content": "Who are Kenneth Taylor's Parents?\r\nKenneth Taylor is an Dutch professional footballer born on 16 May 2002. Many people are eager to know their favorite personalities personal life, so Kenneth Taylor'… [+1184 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Hubble Telescope Captures 'Keyhole' in The Constellation Orion - News18", "description": "The image shows a 'reflection nebula' approximately 1,350 light-years away in the constellation Orion", "url": "https://www.news18.com/news/buzz/hubble-telescope-captures-keyhole-in-the-constellation-orion-6251293.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/ga-166685589516x9.png", "publishedAt": "2022-10-27T07:40:13Z", "content": "In what could be a breakthrough discovery about space, scientists have learned about a smoke-wreathed keyhole among the stars. The image of the smoke-wreathed keyhole among the stars was captured usi… [+2135 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "IANS", "title": "NASA's Lucy spacecraft captures images of Earth, Moon ahead of gravity assist - Gadgets Now", "description": "A NASA spacecraft named Lucy, the first mission to the Jupiter Trojan asteroids, has captured an stunning image of Earth, along with a photo of the Earth and the Moon, as part of gravity assist to gain some of the orbital energy it needs to travel to this nev…", "url": "https://www.gadgetsnow.com/tech-news/nasas-lucy-spacecraft-captures-images-of-earth-moon-ahead-of-gravity-assist/articleshow/95115725.cms", "urlToImage": "https://static.toiimg.com/thumb/resizemode-4,msid-95115725,imgsize-4836,width-800/95115725.jpg", "publishedAt": "2022-10-27T06:56:00Z", "content": "A NASA spacecraft named Lucy, the first mission to the JupiterTrojan asteroids, has captured an stunning image of Earth, along with a photo of the Earth and the Moon, as part of gravity assist to gai… [+1497 chars]"}, {"source": {"id": null, "name": "Indiaai.gov.in"}, "author": null, "title": "The six best preprint servers for AI research publication - INDIAai", "description": "Most preprint servers permit researchers to upload draft versions of a work before submitting it to a more conventional peer-reviewed journal.", "url": "https://indiaai.gov.in/article/the-six-best-preprint-servers-for-ai-research-publication", "urlToImage": "https://d12aarmt01l54a.cloudfront.net/cms/images/Media-20221027100328/1200-630.png", "publishedAt": "2022-10-27T04:39:07Z", "content": "Most preprint servers permit researchers to upload draft versions of a work before submitting it to a more conventional peer-reviewed journal.\r\nThe preprint server IndiaRxiv is the most recent additi… [+5216 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Un unprecedent hunt: Molecules with memory at room temperature - EurekAlert", "description": "A fruitful collaboration within the Institute of Chemical Research of Catalonia (ICIQ) along other international institutions has allowed to demonstrate that a molecular magnetic memory near room temperature is a reality. A new way of storing information has …", "url": "https://www.eurekalert.org/news-releases/969172", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/27084d45-8399-407d-97c1-200d1f0dd45d/Rendition/thumbnail/Content/Public", "publishedAt": "2022-10-27T02:02:23Z", "content": "image: Low spin (pink) and high spin state (white) for an iron trimer complexview more \r\nCredit: ICIQ\r\nTarragona (Spain), October 26th 2022 – A new paradigm has appeared at ICIQ, demonstrating that t… [+4208 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "New Insights Into The Composition And Origin Of Saturn's Rings - IFLScience", "description": "Cassini has been collecting sunlight passing through the rings", "url": "https://www.iflscience.com/spectacular-new-images-and-insights-into-the-origin-of-saturn-s-rings-65939", "urlToImage": "https://assets.iflscience.com/assets/articleNo/65939/aImg/62971/saturn-s-as-seen-by-cassini-during-its-long-mission-image-credit-nasa-jpl-caltech-ssi-cornell-meta.jpg", "publishedAt": "2022-10-27T01:48:00Z", "content": "The Cassini spacecraft may have burned up in Saturns atmosphere years ago, but its data is still being analyzed. Researchers have now completed a catalog of data from 41 solar occultations of Saturns… [+2197 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Benjamin Pope", "title": "Radioactive Traces in Tree Rings Reveal Earth’s History of ‘Radiation Storms’ - The Wire Science", "description": "In 2012, Fusa Miyake discovered a big spike in the carbon-14 content of tree rings from 774 AD.", "url": "https://science.thewire.in/the-sciences/radiocarbon-tree-rings-radiation-storms/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/10/26150518/gabriel-jimenez-HiE8X1yH0mc-unsplash-scaled.jpg", "publishedAt": "2022-10-27T00:29:04Z", "content": "Photo: Gabriel Jimenez/Unsplash\r\n<ul><li>The rise and fall of carbon-14 levels in tree rings encodes a history of the 11-year cycle of the solar dynamo and the reversals of Earths magnetic field.</li… [+5886 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning NASA Image Shows Ganymede Casting a Massive Shadow Across Jupiter - SciTechDaily", "description": "NASA's Juno spacecraft saw Ganymede cast a large, dark spot on Jupiter during its 40th close pass by the planet on February 25, 2022. JunoCam captured this image from very close to Jupiter, making Ganymede’s shadow appear especially large. The Juno spacecraft…", "url": "https://scitechdaily.com/stunning-nasa-image-shows-ganymede-casting-a-massive-shadow-across-jupiter/", "urlToImage": "https://scitechdaily.com/images/Juno-Captures-Moon-Shadow-on-Jupiter-scaled.jpg", "publishedAt": "2022-10-26T23:49:28Z", "content": "ByNASAOctober 26, 2022\r\nCitizen scientist Thomas Thomopoulos created this enhanced-color image using raw data from the JunoCam instrument. At the time the raw image was taken, the Juno spacecraft was… [+1850 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Indian scientists shocked as government scraps nearly 300 awards - Nature.com", "description": "Although there are issues with how some award winners are chosen, researchers say they provide important recognition for work.", "url": "https://www.nature.com/articles/d41586-022-03286-3", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-03286-3/d41586-022-03286-3_23602794.jpg", "publishedAt": "2022-10-26T22:32:12Z", "content": "Researchers say that scrapping awards will demoralize the scientific community.Credit: Dhiraj Singh/Bloomberg/Getty\r\nIndian scientists were surprised to learn that the government plans to scrap nearl… [+4183 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Corrigendum for the article Switching from a Non-Protease inhibitor-Ba | DDDT - Dove Medical Press", "description": "Corrigendum for the article Switching from a Non-Protease inhibitor-Based Regimen To the Fixed Dose Combination of Darunavir/Cobicistat/Emtricitabine/Tenofovir Alafenamide in Clinical Practice", "url": "https://www.dovepress.com/corrigendum-switching-from-a-non-protease-inhibitor-based-regimen-to-t-peer-reviewed-fulltext-article-DDDT", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-10-26T19:29:48Z", "content": "Ranzenigo M, Gianotti N, Galli L, et al. Drug Des Devel Ther. 2022;16:1975–1982.\r\nPage 1975, Abstract, Results, line five, the text “the ongoing regimen was based on NNRTIs in 37 (35%) and on InSTIs … [+804 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Synthetic genetic circuits reprogram plant roots: Scientists use engineered gene circuits in plants to control gene expression and root architecture - Science Daily", "description": "Controlling gene activity is important for engineering plants for improved bioenergy crops and other applications. This research developed synthetic genes that use Boolean logic gates to achieve specific patterns of gene expression within a plant. The researc…", "url": "https://www.sciencedaily.com/releases/2022/10/221026122730.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-10-26T17:53:24Z", "content": "Controlling the activity of genes is an important step in engineering plants for improved bioenergy crops. This research developed synthetic genes that can be combined to achieve specific patterns of… [+3181 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": "Lisa Jennings", "title": "Opportunity Mars Rover Commander in ‘Goodnight, Oppy’ Resigns from Saturn - BollyInside", "description": "Steve Squyres had big plans to move to a new planet after NASA’s Opportunity Mars rover completed its mission, but that idea has “completely derailed”.", "url": "https://www.bollyinside.com/news/opportunity-mars-rover-commander-in-goodnight-oppy-resigns-from-saturn", "urlToImage": "//cdnimage.bollyinside.com/wp-content/uploads/2022/10/Web-capture_26-10-2022_213115_www.bing_.com_.jpeg", "publishedAt": "2022-10-26T16:21:28Z", "content": "Steve Squyres had big plans to move to a new planet after NASA’s Opportunity Mars rover completed its mission, but that idea has “completely derailed”.\r\nThis caused problems for Squyres, who was a me… [+5445 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Brightest-Ever Space Explosion Could Help Explain Dark Matter - Quanta Magazine", "description": "A recent gamma-ray burst known as the BOAT — “brightest of all time” — appears to have produced a high-energy particle that shouldn’t exist. For some, dark matter provides the explanation.", "url": "https://www.quantamagazine.org/brightest-ever-space-explosion-could-help-explain-dark-matter-20221026/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/10/BOAT-Gamma-Ray-Burst_1200_Social.webp", "publishedAt": "2022-10-26T13:50:39Z", "content": "On Sunday, October 9, Judith Racusin was 35,000 feet in the air, en route to a high-energy astrophysics conference, when the biggest cosmic explosion in history took place. I landed, looked at my pho… [+6024 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How Do Spacecraft Slow Down? We Asked a NASA Technologist - NASA", "description": "How do spacecraft slow down? Rigid heat shields and retropropulsion have been the favorites of engineers for years. Now NASA is testing a new inflatable heat...", "url": "https://www.youtube.com/watch?v=29dr_l3-9lU", "urlToImage": "https://i.ytimg.com/vi/29dr_l3-9lU/maxresdefault.jpg", "publishedAt": "2022-10-26T13:22:36Z", "content": null}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Crash landing on Mars … on purpose - EarthSky", "description": null, "url": "https://earthsky.org/space/crash-landing-on-mars-shield-nasa-jpl/", "urlToImage": "https://earthsky.org/upl/2022/10/crash-landing-on-Mars-attenuator-test-2022-e1666688841814.png", "publishedAt": "2022-10-26T12:03:50Z", "content": "As we know, landing on Mars is hard. Many landing attempts over decades failed, with the lander sadly smashing into Mars’ desert surface. Safe touchdowns are more the norm now (although still always … [+5061 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "ISS partners weigh options for using commercial space stations - SpaceNews", "description": "Partner agencies on the ISS say they are in discussions about how they will use, and pay for, commercial space stations that will replace it.", "url": "https://spacenews.com/iss-partners-weigh-options-for-using-commercial-space-stations/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/11/iss-nov2021.jpg", "publishedAt": "2022-10-26T11:39:30Z", "content": "LAS VEGAS Partner agencies on the International Space Station program say they are in discussions about how they will use, and pay for, commercial space stations that will replace it.\r\nRepresentative… [+3022 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Deena Theresa", "title": "Sea animals were thought to be mute. A scientist just discovered they can talk - Interesting Engineering", "description": "A scientist has found that 53 sea creatures previously thought to be mute can communicate, suggesting that nose-breathing vertebrates may have a common ancestor.", "url": "https://interestingengineering.com/science/scientists-discover-sea-animals-can-talk", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/10/26/image/jpeg/XpGG3emUqC4CjI5rjHXOhap7awwOvd3QjD3OyamH.jpg", "publishedAt": "2022-10-26T11:28:50Z", "content": "The voice recordings of the sea animals mostly comprised communication on mating and hatching. \r\n\"Sea turtles will sing from within their egg to synchronize hatching. If they call from inside, they a… [+1236 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "J Divya", "title": "Yassine Stein Biography, Real Name, Age, Height and Weight - News - News", "description": "Yassine Stein Biography, Check out the complete Yassine Stein Biography right here. Yassine Stein is an Rapper born on 1995.", "url": "https://latestnews.fresherslive.com/articles/yassine-stein-biography-real-name-age-height-and-weight-1085746", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/10/26/yassine-stein-biography-real-name-age-height-and-weight-63590407e06c7-1666778119.jpg", "publishedAt": "2022-10-26T10:02:45Z", "content": "Yassine Stein the Rapper biography is being searched by the fans. Here you can check the Yassine Stein biography and a lot more details.Yassine Stein was born on 1995. Yassine Stein has gained more p… [+2093 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Curtin University: Stargazers to catch a glimpse of NASA’s Lucy in the sky with diamonds - India Education Diary", "description": "The team from Curtin’s Desert Fireball Network will be in Port Hedland this weekend to observe the Earth encounter, alongside amateur stargazers and members of the public who will be able to capture photos from their mobile phones across the Pilbara", "url": "https://indiaeducationdiary.in/curtin-university-stargazers-to-catch-a-glimpse-of-nasas-lucy-in-the-sky-with-diamonds/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/04/Curtin-University.jpeg?fit=600%2C400&ssl=1", "publishedAt": "2022-10-26T09:25:34Z", "content": "The team from Curtins Desert Fireball Network will be in Port Hedland this weekend to observe the Earth encounter, alongside amateur stargazers and members of the public who will be able to capture p… [+2419 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "'Fluffiest Planet' With Density of a Marshmallow Located 580-Light-years From Earth - News18", "description": "It was detected in orbit around a red dwarf star by a variety of instruments which included the NASA-funded NEID radial-velocity instrument, according to a press release from NOIRLab.", "url": "https://www.news18.com/news/buzz/fluffiest-planet-with-density-of-a-marshmallow-located-580-light-years-from-earth-6243631.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/planet-1-166676670916x9.png", "publishedAt": "2022-10-26T06:55:23Z", "content": "Astronomers, just like us, are often left surprised by new space discoveries. Similarly, in a recent finding, a gas giant exoplanet with the density of a marshmallow was discovered. It was detected i… [+2175 chars]"}]}