{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Sakshi Tiwari", "title": "Falcon 9 Rocket — World’s Most Prolific Launch Vehicle — Ready For Flight Again After Massive Setback - EurAsian Times", "description": "After suffering an unprecedented malfunction earlier this month, the SpaceX Falcon 9 rocket — one of the most prolific space launch vehicles in the world— is reportedly cleared to make a comeback. The Federal Aviation Administration (FAA), which oversees the …", "url": "https://www.eurasiantimes.com/after-a-massive-setback-elon/", "urlToImage": "https://www.eurasiantimes.com/wp-content/uploads/2024/07/MUSK.jpg", "publishedAt": "2024-07-27T11:28:06Z", "content": "After suffering an unprecedented malfunction earlier this month, the SpaceX Falcon 9 rocket one of the most prolific space launch vehicles in the world is reportedly cleared to make a comeback.\r\nThe … [+6327 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Sonali Sharma", "title": "NASA images: 12 dazzling images of stars captured by NASA - DNA India", "description": "dazzling images of stars captured by NASA", "url": "https://www.dnaindia.com/web-stories/viral/nasa-images-12-dazzling-images-of-stars-captured-by-nasa-1722077886838", "urlToImage": null, "publishedAt": "2024-07-27T11:11:48Z", "content": "U Camelopardalis, or U Cam for short, is a star nearing the end of its life. As stars run low on fuel, they become unstable."}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Neha Yadav", "title": "10 marvellous images of Moon shared by NASA - Hindustan Times", "description": "10 marvellous images of Moon shared by NASA", "url": "https://www.hindustantimes.com/web-stories/in-focus/10-marvellous-images-of-moon-shared-by-nasa-101721898191488.html", "urlToImage": null, "publishedAt": "2024-07-27T06:30:17Z", "content": "By Neha YadavPublished Jul 27, 2024\r\nHindustan TimesIn FocusPhoto Credits: Darya Kawa Mirza/NASA"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India's Fully Robotic Telescope In Ladakh Captures Building-Sized Asteroid's Closest Approach To Earth - NDTV", "description": "The GROWTH-India telescope at the Indian Astronomical Observatory in Ladakh recently captured a building-sized asteroid on its approach to Earth.", "url": "https://www.ndtv.com/science/indias-fully-robotic-telescope-in-ladakh-captures-building-sized-asteroids-closest-approach-to-earth-6198708", "urlToImage": "https://c.ndtvimg.com/2024-07/9v7gie8g_growthindia-telescope-asteroid_625x300_27_July_24.jpeg?ver-20240615.100", "publishedAt": "2024-07-27T03:11:58Z", "content": "GROWTH-India Telescope is India's first fully robotic optical research telescope.\r\nThe GROWTH-India telescope at the Indian Astronomical Observatory in Ladakh recently captured a building-sized aster… [+2410 chars]"}, {"source": {"id": null, "name": "Astrobiology News"}, "author": "Keith Cowing", "title": "Ladakh’s Rock Varnish May Help Identify Habitable Environments In Space - Astrobiology News", "description": "Magnetofossils-- fossil remains of magnetic particles produced by magnetotactic bacteria have been spotted in rock varnish layers in Ladakh.", "url": "https://astrobiology.com/2024/07/ladakhs-rock-varnish-may-help-identify-habitable-environments-in-space.html", "urlToImage": "https://astrobiology.com/wp-content/uploads/2024/07/Ladakhs-Rock-Varnish.png", "publishedAt": "2024-07-26T14:34:48Z", "content": "(a) FE-SEM image of the varnish layer showing the presence of magnetotactic multicellular aggregate (MMA) type entity embedded in the varnish layer marked by yellow arrows ; inset a1 shows magnified … [+4770 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Colorado Boulder Leads Coalition in Offering Free Science Resources for High School Students - India Education Diary", "description": "A coalition of educators from 10 states and led by the University of Colorado Boulder has released a new series of free science curricula for high school students—touching on issues critical to the lives of young people, from wildfires to rising sea", "url": "https://indiaeducationdiary.in/university-of-colorado-boulder-leads-coalition-in-offering-free-science-resources-for-high-school-students/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2024/07/openscied3.webp", "publishedAt": "2024-07-26T11:03:37Z", "content": "A coalition of educators from 10 states and led by the University of Colorado Boulder has released a new series of free science curricula for high school studentstouching on issues critical to the li… [+4646 chars]"}]}