{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "An asteroid has the potential to destroy an entire city. This is how NASA intends to proceed - BollyInside", "description": "The Earth is situated in a hazardous environment. Asteroids and comets, for example, are continually speeding through space and colliding with our planet.", "url": "https://www.bollyinside.com/news/an-asteroid-has-the-potential-to-destroy-an-entire-city-this-is-how-nasa-intends-to-proceed", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/An-asteroid-has-the-potential-to-destroy-an-entire-city.jpg", "publishedAt": "2022-03-24T04:13:30Z", "content": "The Earth is situated in a hazardous environment. Asteroids and comets, for example, are continually speeding through space and colliding with our planet. The majority of these are insignificant and … [+5472 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Shunned By European Space Agency, Russian ROSCOSMOS To Go Ahead With Solo Mars Mission Sans ESA Rover - EurAsian Times", "description": "Russia will commence work on its own Mars mission following the indefinite suspension of a joint project by the European Space Agency (ESA) in the aftermath of the Ukraine invasion, Interfax news agency quoted a top official as saying on March 18. The ESA ann…", "url": "https://eurasiantimes.com/russian-roscosmos-to-go-ahead-with-solo-mars-mission-sans-esa-rover/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/03/Russia-Mars-lander.png", "publishedAt": "2022-03-24T03:24:02Z", "content": "Russia will commence work on its own Mars mission following the indefinite suspension of a joint project by the European Space Agency (ESA) in the aftermath of the Ukraine invasion, Interfax news age… [+5439 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Trisha Sengupta", "title": "Listen to 5,000 worlds beyond the solar system in Nasa’s latest sonification - Hindustan Times", "description": "Nasa took to Instagram to share the sonification post related to the 5,000 worlds beyond our solar system. | Trending", "url": "https://www.hindustantimes.com/trending/listen-to-5-000-worlds-beyond-our-solar-system-in-nasa-s-latest-sonification-101648091638241.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/24/1600x900/Nasa_solar_system_sonification_Instagram_Earth_1648091694363_1648091707021.PNG", "publishedAt": "2022-03-24T03:20:31Z", "content": "The Instagram pages managed by Nasa are nothing short of treasure troves for those who enjoy the videos and images that give them a peek of the world outside that lies beyond this Blue Planet. If you… [+2727 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "NASA to seek a second moon lander, giving Bezos new opening - Moneycontrol", "description": "The National Aeronautics and Space Administration plans to release a draft request for proposals by the end of March for moon lander concepts for missions after the Artemis III program, which aims to bring astronauts to the moon in 2025, the agency announced …", "url": "https://www.moneycontrol.com/news/world/nasa-to-seek-a-second-moon-lander-giving-bezos-new-opening-8267761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/385602501-770x433.jpg", "publishedAt": "2022-03-24T02:36:07Z", "content": "A super blue blood moon sets behind the Golden Gate Bridge in San Francisco, California, U.S., on Wednesday, Jan. 31, 2018. Blue moons are the second full moon in a one-month period take place once e… [+2404 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "Lettuce may protect astronauts’ bones on Mars trip - OrissaPOST", "description": "New York: Astronauts might one day grow and eat genetically modified plants to ward off disease associated with long spaceflights. Researchers at the University of California, Davis College of Engineering have developed a transgenic, or genetically modified, …", "url": "https://www.orissapost.com/lettuce-may-protect-astronauts-bones-on-mars-trip/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2022/03/lettuce-in-space.png", "publishedAt": "2022-03-24T02:30:00Z", "content": "New York: Astronauts might one day grow and eat genetically modified plants to ward off disease associated with long spaceflights.\r\nResearchers at the University of California, Davis College of Engin… [+1916 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers find mechanism for long term memory storage - ANI News", "description": "Washington [US], March 24 (ANI): While studying how memories are stored in the brain, a team identified a novel protein folding mechanism that is essential for long-term memory storage.", "url": "https://www.aninews.in/news/science/researchers-find-mechanism-for-long-term-memory-storage20220324061131", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/ghdfigd3nf2022032400045020220324004112-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-24T00:44:39Z", "content": "Washington [US], March 24 (ANI): While studying how memories are stored in the brain, a team identified a novel protein folding mechanism that is essential for long-term memory storage.The researcher… [+1855 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Passant Rabie", "title": "Incredible images capture a ridiculously swole galaxy - Inverse", "description": "Astronomers captured a new image of spiral galaxy with an overdeveloped arm. NGC 772 is on the Atlas of Peculiar Galaxies as one of the weirdest galaxies.", "url": "https://www.inverse.com/science/massive-spiral-galaxy", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/3/23/2ac48b3c-449a-424c-add1-18c99fdeb1d4-5edc7a26-9c7a-43d7-b56c-9aeb7287a951-noirlab2209a-copy.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-03-23T23:30:25Z", "content": "Its tough competition out there for a galaxy.\r\n With an estimate of nearly 2 trillion observable galaxies in the universe, you have to do what you can to stand out. For some, its about sheer muscle p… [+2513 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "US Space Force CHPS to Patrol the Moon - BollyInside", "description": "CHPS, a cutting-edge new network, may be able to regulate space traffic around the Moon. We’ll need a mechanism to track space trash and the expanding", "url": "https://www.bollyinside.com/news/us-space-force-chps-to-patrol-the-moon", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/US-Space-Force-CHPS-to-Patrol-the-Moon.jpg", "publishedAt": "2022-03-23T23:13:26Z", "content": "CHPS, a cutting-edge new network, may be able to regulate space traffic around the Moon.\r\nWell need a mechanism to track space trash and the expanding number of missions orbiting the Moon and beyond … [+3884 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The first pebbles from China’s Moon have sparked a study frenzy - BollyInside", "description": "Until recently, geochronologist Li Xian-research Hua’s was restricted to Earth’s molten rocks. However, when a Chinese spacecraft delivered the country’s", "url": "https://www.bollyinside.com/news/the-first-pebbles-from-chinas-moon-have-sparked-a-study-frenzy", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/03/The-first-pebbles-from-Chinas-Moon-have-sparked-a-study.jpg", "publishedAt": "2022-03-23T22:01:41Z", "content": "Until recently, geochronologist Li Xian-research Huas was restricted to Earths molten rocks. However, when a Chinese spacecraft delivered the countrys first Moon pebbles in December 2020, Li shifted … [+5383 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Single-photon source paves the way for practical quantum encryption: New source is compact and operates at room temperature - Science Daily", "description": "Researchers describe new high-purity single-photon source that can operate at room temperature. The source is an important step toward practical applications of quantum technology, such as highly secure communication based on quantum key distribution (QKD).", "url": "https://www.sciencedaily.com/releases/2022/03/220323125124.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-23T19:35:16Z", "content": "Researchers have developed a new high-purity single-photon source that can operate at room temperature. The source is an important step toward practical applications of quantum technology, such as hi… [+4016 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Mars orbiter click photos of China`s Zhurong rover - WION", "description": "Mars is a busy place these days. National Aeronautics and Space Administration (NASA) and Chinese space agency both have heavy scientific activity going on and around the red planet. Though both agencies are carrying out their scientific observations independ…", "url": "https://www.wionews.com/science/nasas-mars-orbiter-click-photos-of-chinas-zhurong-rover-464999", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/03/23/249656-zhurong-final.jpg", "publishedAt": "2022-03-23T18:26:36Z", "content": "Mars is a busy place these days. National Aeronautics and Space Administration (NASA) and Chinese space agency both have heavy scientific activity going on and around the red planet. Though both agen… [+1208 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Ingenious AI Method Could Find Precious New Rare-Earth Compounds - ScienceAlert", "description": "Rare-earth elements are crucial components in all kinds of electronics, from smartphones and broadband cables to wind turbines and electric cars. But coming up with useful compounds that can expand our practical use of rare-earths is notoriously dif", "url": "https://www.sciencealert.com/ai-is-pointing-the-way-to-finding-new-rare-earth-compounds", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/PersonInspectingMineralSampleWithMagnifyingGlass_1024.jpg", "publishedAt": "2022-03-23T18:01:14Z", "content": "Rare-earth elements are crucial components in all kinds of electronics, from smartphones and broadband cables to wind turbines and electric cars. But coming up with useful compounds that can expand o… [+3254 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Revamped design could take powerful biological computers from the test tube to the cell - Phys.org", "description": "Tiny biological computers made of DNA could revolutionize the way we diagnose and treat a slew of diseases, once the technology is fully fleshed out. However, a major stumbling block for these DNA-based devices, which can operate in both cells and liquid solu…", "url": "https://phys.org/news/2022-03-revamped-powerful-biological-tube-cell.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/revamped-design-could.jpg", "publishedAt": "2022-03-23T18:00:03Z", "content": "Tiny biological computers made of DNA could revolutionize the way we diagnose and treat a slew of diseases, once the technology is fully fleshed out. However, a major stumbling block for these DNA-ba… [+7942 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova, Tereza Pultarova", "title": "The Bohr model: The famous but flawed depiction of an atom - Space.com", "description": "The Bohr model is neat, but imperfect, depiction of atom structure.", "url": "https://www.space.com/bohr-model-atom-structure", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xnxfLdVuSgG3hcjNCgjMuX-1200-80.jpg", "publishedAt": "2022-03-23T17:09:29Z", "content": "The Bohr model, introduced by Danish physicist Niels Bohr in 1913, was a key step on the journey to understand atoms.\r\nAncient Greek thinkers already believed that matter was composed of tiny basic p… [+7695 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Don't underestimate undulating graphene: Unique electronics made possible by wavy patterns that channel electrons - Science Daily", "description": "A theory suggests putting graphene on an undulating surface stresses it enough to create a minute electromagnetic field. The phenomenon could be useful for creating 2D electron optics or valleytronics devices.", "url": "https://www.sciencedaily.com/releases/2022/03/220323114513.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-23T16:51:14Z", "content": "Lay some graphene down on a wavy surface, and you'll get a guide to one possible future of two-dimensional electronics.Rice University scientists put forth the idea that growing atom-thick graphene o… [+2395 chars]"}, {"source": {"id": null, "name": "CengNews"}, "author": "Jeff Salle", "title": "Earth's Core Discovered to Have Strange Magnetic Waves ⋆ Ceng News - Ceng News", "description": "Small magnetic waves with a seven-year cycle have been discovered at Earth's core.Electric currents generated by the movement of molten", "url": "https://www.cengnews.com/news/earths-core-discovered-to-have-strange-magnetic-waves-352154.html", "urlToImage": "https://www.cengnews.com/wp-content/uploads/2022/03/1648053411_earth-core.jpg", "publishedAt": "2022-03-23T16:37:46Z", "content": "Small magnetic waves with a seven-year cycle have been discovered at Earth’s core.\r\nElectric currents generated by the movement of molten iron deep within the planet’s core are responsible for the pl… [+3044 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Getting the thick and thin on the Milky-Way's evolution - Nanowerk", "description": "The Milky Way may have evolved in different phases, beginning with the formation of disk stellar populations about thirteen billion years ago, scientists suggest.", "url": "https://www.nanowerk.com/news2/space/newsid=60153.php", "urlToImage": "https://www.nanowerk.com/news2/space/id60153.jpg", "publishedAt": "2022-03-23T16:33:52Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Bone density study confirms watery lifestyle of 'ominous' Spinosaurus - Devdiscourse", "description": "But the researchers found that another spinosaurid called Suchomimus lacked dense bones and likely was a wading predator - showing an unexpected degree of ecological diversity within this group.  Spinosaurus, about 50 feet (15 meters) long and weighing seven …", "url": "https://www.devdiscourse.com/article/science-environment/1974113-bone-density-study-confirms-watery-lifestyle-of-ominous-spinosaurus", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_02_2020_14_16_02_5162024.jpg?width=920&format=jpeg", "publishedAt": "2022-03-23T16:01:04Z", "content": "Spinosaurus, the largest-known carnivorous dinosaur, and its closest relatives long have confounded scientists trying to understand how these unusual water-loving beasts lived their lives and hunted … [+3906 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Comet Leonard disintegrates as it goes around the Sun - WION", "description": "Comet Leonard, which was easily visible from Earth in the month of December last year has disintegrated on its close approach to the Sun, say media reports. What remains of the comet is now moving away from the Sun.", "url": "https://www.wionews.com/science/comet-leonard-disintegrates-as-it-goes-around-the-sun-464947", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/12/22/228305-comet.PNG", "publishedAt": "2022-03-23T16:00:57Z", "content": "Comet Leonard, which was easily visible from Earth in the month of December last year has disintegrated on its close approach to the Sun, say media reports. What remains of the comet is now moving aw… [+1117 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "Faster Than A Missile! NASA’s Successful Launch Of BOLT II Can Make Hypersonic Travel A New Reality - EurAsian Times", "description": "The US Air Force’s Office of Scientific Research (AFOSR) successfully launched its Boundary Layer Transition and Turbulence (BOLT II) project onboard a two-stage sounding rocket on March 21 from NASA’s Wallops Test Flight Facility in Virginia. The launch is a…", "url": "https://eurasiantimes.com/nasas-successful-launch-of-bolt-ii-can-make-lightning-fast-travel/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/03/Sr71_Blackbird.jpg", "publishedAt": "2022-03-23T15:47:53Z", "content": "The US Air Forces Office of Scientific Research (AFOSR) successfully launched its Boundary Layer Transition and Turbulence (BOLT II) project onboard a two-stage sounding rocket on March 21 from NASAs… [+5049 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "Nirmal Narayanan", "title": "Anti-universe where times runs backward could be real, scientists say - IBTimes India", "description": "Scientists believe that there could be a mirror image of our universe, which is very crucial to maintaining the symmetry of the universe", "url": "https://www.ibtimes.co.in/anti-universe-where-times-runs-backward-could-be-real-scientists-say-846828", "urlToImage": "https://data1.ibtimes.co.in/en/full/681127/universe-expanding-faster-rate-previously-calculated.png", "publishedAt": "2022-03-23T14:13:01Z", "content": "First proof of alien life on Mars may be detected by a UK space laboratory\r\nThe concept of the parallel universe has been the hottest genre among Hollywood filmmakers for years. Even though there is … [+1464 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Aussie scientists unravel vital role of 'junk' DNA - The Tribune India", "description": "A piece of DNA, previously considered as 'junk' material by scientists, could be the key to extinguishing fear-related memories for people with post-traumatic stress disorder (PTSD) and phobias, according to a new study led by Australian researchers.", "url": "https://www.tribuneindia.com/news/schools/aussie-scientists-unravel-vital-role-of-junk-dna-380018", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_856112348.jpg", "publishedAt": "2022-03-23T14:09:00Z", "content": "Sydney, March 23 \r\nA piece of DNA, previously considered as 'junk' material by scientists, could be the key to extinguishing fear-related memories for people with post-traumatic stress disorder (PTSD… [+2550 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Juno Spacecraft Captures Stunning View of Jupiter's Moons Io and Europa – And a Crater on Ganymede - SciTechDaily", "description": "NASA’s Juno mission captured this view of Jupiter’s southern hemisphere during the spacecraft’s 39th close flyby of the planet on January 12, 2022. Zooming in on the right portion of the image (see image below) reveals two more worlds in the same frame: Jupit…", "url": "https://scitechdaily.com/nasa-juno-spacecraft-captures-stunning-view-of-jupiters-moons-io-and-europa-crater-on-ganymede/", "urlToImage": "https://scitechdaily.com/images/Ganymede-Crater.jpg", "publishedAt": "2022-03-23T13:53:05Z", "content": "NASA’s Juno mission captured this view of Jupiter’s southern hemisphere during the spacecraft’s 39th close flyby of the planet on January 12, 2022. Credit: NASA/JPL-Caltech/SwRI/MSSS, Image processin… [+3056 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "ESAs Solar Orbiter to make its closest approach to Sun: Only 48 million km will lie between the two - News9 LIVE", "description": "Solar Orbiter's present, extremely elliptical orbit will fluctuate little over the next three years, ...", "url": "https://www.news9live.com/science/esas-solar-orbiter-to-make-its-closest-approach-to-sun-only-48-million-km-will-lie-between-the-two-160632", "urlToImage": "https://media.news9live.com/h-upload/2022/03/23/260017-solar-orbiter-sun.jpg", "publishedAt": "2022-03-23T13:02:37Z", "content": "ESA's Solar Orbiter spacecraft is on its way to the best vantage point of its mission route after being two years in space. NASA is also a contributor to the European Space Agency's mission. The prob… [+2679 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "ISS astronauts conduct spacewalk, NASA shares live footage. Watch here - Mint", "description": "Astronauts Raja Chari, Matthias Maurer are conducting a spacewalk to install new hoses on the International Space Station's Radiator Beam Valve Module, which helps regulate the station's temperature.", "url": "https://www.livemint.com/science/news/iss-astronauts-conduct-spacewalk-nasa-shares-live-footage-watch-here-11648038001640.html", "urlToImage": "https://images.livemint.com/img/2022/03/23/600x338/51732390695_6d2609b78a_k_1648038439482_1648038443186.jpg", "publishedAt": "2022-03-23T12:57:51Z", "content": "NASA had shared on 10 March that the astronauts from International Space Station (ISS) Expedition 66 will conduct two spacewalks Tuesday, 15 March, and Wednesday, 23 March, to continue upgrades to th… [+3294 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "'New type of UV light' kills 98% of microbes in a room and could help prevent the next pandemic - Daily Mail", "description": "'Far-UVC' light can kill microbes without damaging human skin, say experts at the University of St. Andrews, University of Dundee, University of Leeds, and Columbia University in New York.", "url": "https://www.dailymail.co.uk/sciencetech/article-10643177/New-type-UV-light-kills-98-microbes-room-help-prevent-pandemic.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/23/12/55699387-0-image-a-40_1648038267510.jpg", "publishedAt": "2022-03-23T12:44:52Z", "content": "A 'new' kind of ultraviolet light kills almost all microbes in a room and could help avoid another lethal pandemic, a new study shows. \r\nResearchers say 'far-UVC' light emitted from ceiling lamps can… [+9857 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA finds new Empire State Building-sized asteroid; to make closest approach on Mar 24 - Republic World", "description": "Bigger than the Empire state building, the space rock dubbed 2013 BO76 has a diameter of 450 metres and would swing by from a distance of 51,11,759 km.", "url": "https://www.republicworld.com/science/space/nasa-finds-new-empire-state-building-sized-asteroid-to-make-closest-approach-on-mar-24-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/pfsan6uncqisgict_1648037814.jpeg", "publishedAt": "2022-03-23T12:19:00Z", "content": "NASA's Jet Propulsion Laboratory (JPL) has warned that another potentially hazardous asteroid is hurtling towards the Earth and will make its closest approach on March 24. Bigger than the Empire stat… [+1912 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Stephanie Mlot", "title": "NASA to Send Rockets Through Active Aurora for Science - PCMag India", "description": "The space agency wants to study how the northern lights interact with Earth's atmosphere.", "url": "https://in.pcmag.com/news/148542/nasa-to-send-rockets-through-active-aurora-for-science", "urlToImage": "https://sm.pcmag.com/t/pcmag_in/news/n/nasa-to-se/nasa-to-send-rockets-through-active-aurora-for-science_mrh6.1200.jpg", "publishedAt": "2022-03-23T12:13:28Z", "content": "NASA is set to launch a pair of rockets through an active aurora to study the natural light display.\r\nOften spotted in a polar climate, aurora borealis (also known as the northern lights) are actuall… [+1932 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Astronomers reveal clearest image yet of mysterious 'odd radio circle' - Daily Mail", "description": "There are now three leading theories about what causes 'odd radio circles' thanks to the new images captured by the South African Radio Astronomy Observatory's MeerKat radio telescope.", "url": "https://www.dailymail.co.uk/sciencetech/article-10643299/Astronomers-reveal-clearest-image-mysterious-odd-radio-circle.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/23/12/55698589-0-image-a-24_1648036839369.jpg", "publishedAt": "2022-03-23T11:59:59Z", "content": "They are astronomy's newest mystery objects, 'odd radio circles' a million light years across that were first spotted two years ago.\r\nNow, using the world's most capable radio telescopes, astronomers… [+6222 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Study Shows The Unimaginable Terrible Effects Of Dinosaur-Killing Asteroid - The Hans India", "description": "This massive cloud of sulfur-bearing gases, once airborne, blocked the Sun and cooled Earth for many ...", "url": "https://www.thehansindia.com/offbeat/study-shows-the-unimaginable-terrible-effects-of-dinosaur-killing-asteroid-734709", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/03/23/1283165-brutal-than.jpg", "publishedAt": "2022-03-23T11:30:06Z", "content": "A new study indicates that when the dinosaur-killing asteroid struck with Earth 66 million years ago, vast amounts of sulphur were hurled into the stratosphere that were far terrible than previously … [+2358 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Mars and Saturn conjunction, April 4 and 5, 2022 - EarthSky", "description": null, "url": "https://earthsky.org/tonight/mars-and-saturn-conjunction-april-4-5-2022/", "urlToImage": null, "publishedAt": "2022-03-23T11:26:02Z", "content": "On April 4 and 5, 2022, Mars and Saturn look like next-door neighbors on the sky’s dome. Look low in the east-southeast 60 minutes before sunrise. Illustration via John Jardine Goss.\r\nThe morning con… [+1595 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Growing uniformly sized nanodiamonds - Nanowerk", "description": "Scientists report a method to grow ultra-uniform nanodiamonds without the need for explosives. The technique also could be used to add beneficial single-atom defects in otherwise perfect crystals.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60148.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60148.jpg", "publishedAt": "2022-03-23T09:58:49Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "The James Webb Space Telescope has become a space rockstar - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/smart-living/innovation/the-james-webb-space-telescope-has-become-a-space-rockstar-111648025687335.html", "urlToImage": "https://images.livemint.com/img/2022/03/23/1140x641/NASA-Space-Telescope-0_1648025776198_1648025787087.jpg", "publishedAt": "2022-03-23T09:23:17Z", "content": "The James Webb Space Telescope successor to the famed Hubble Space Telescope blasted off from South America in December and reached its designated exploration point in January this year. Since then, … [+3941 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Ingenuity helicopter aces 22nd flight on Mars as it flies to new destination - India Today", "description": "The helicopter has flown for 4,647 meters on Mars as it is currently flying to the northwest portion of a region known as Séítah.", "url": "https://www.indiatoday.in/science/story/ingenuity-helicopter-aces-22nd-flight-on-mars-as-it-flies-to-new-destination-1928465-2022-03-23", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202203/Ingenuity_8-647x363.jpeg?7slrgi.0rQdQMY9Bu5uMopGxIkD3gM0Y", "publishedAt": "2022-03-23T06:54:32Z", "content": null}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "NASA's Perseverance to Cover Longest Distance in a Single Month Using Artificial Intelligence | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Mission officials have said that the six-wheeled scientist is on a 5-kilometre journey that began March 14 and is full of sandpits, craters, and fields of sharp rocks. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-03-23-nasas-perseverance-to-cover-longest-distance-in-a-single-month", "urlToImage": "https://s.w-x.co/in-perseverance_1.jpg", "publishedAt": "2022-03-23T05:26:38Z", "content": "Using artificial intelligence, NASA's Perseverance Mars rover is trying to cover more distance in a single month than any rover before.\r\nMission officials have said that the six-wheeled scientist is … [+2521 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "OCT studies without noise. A new method for better detection of eye diseases - EurekAlert", "description": "Worldwide, as many as 285 million people suffer from serious eye diseases or blindness. Unfortunately, most of them do not have access to modern methods of treatment, so help often comes too late. This situation could change with the advent of a very signific…", "url": "https://www.eurekalert.org/news-releases/947221", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/a844e039-75bb-4576-a9b0-3e85f64cd737/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-23T02:05:12Z", "content": "image: OCT studies without noise. A new method for better detection of eye diseases. Photo: Karol Karnowskiview more \r\nCredit: Source IPC PAS/ICTER, Karol Karnowski\r\nWorldwide, as many as 285 million… [+6945 chars]"}, {"source": {"id": null, "name": "Devhardware.com"}, "author": "Izer", "title": "Giant debris cloud spotted by NASA telescope after celestial bodies collided - Dev Hardware", "description": "Astronomers had the opportunity to observe a massive, star-sized debris cloud from such a collision as it passed in front of a nearby star and blocked", "url": "https://www.devhardware.com/giant-debris-cloud-spotted-by-nasa-telescope-after-celestial-bodies-collided/", "urlToImage": "", "publishedAt": "2022-03-23T01:34:20Z", "content": "Astronomers had the opportunity to observe a massive, star-sized debris cloud from such a collision as it passed in front of a nearby star and blocked some of its light. This temporary dimming of sta… [+4470 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Celebrating Women's History Month: Most recent female station crew members - EurekAlert", "description": "For Women’s History Month, NASA and the International Space Station celebrate the women who conduct science aboard the orbiting lab. Women have participated in scientific research on the space station since 2001 and become an integral part of advances in the …", "url": "https://www.eurekalert.org/news-releases/947342", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/8ff922df-df8b-4ae2-80ca-301d41eb77c6/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-23T00:22:21Z", "content": "image: Astronauts assigned for the Crew-4 Commercial Crew Program (CCP) mission, scheduled to launch in April 2022, include, left to right, NASA astronauts Jessica Watkins, Robert Bob Hines, and Kjel… [+17487 chars]"}, {"source": {"id": null, "name": "The Economist"}, "author": "The Economist", "title": "Robotised insects may search collapsed buildings for survivors - The Economist", "description": "They can detect movement, body warmth and exhaled carbon dioxide", "url": "https://www.economist.com/science-and-technology/robotised-insects-may-search-collapsed-buildings-for-survivors/21808326", "urlToImage": "https://www.economist.com/img/b/1280/720/90/sites/default/files/images/2022/03/articles/main/20220326_stp001.jpg", "publishedAt": "2022-03-23T00:00:00Z", "content": "WHY GO TO all the trouble of designing and building a drone if nature has already done most of the job for you? That is the attitude taken by the small but determined band of researchers who are tryi… [+2827 chars]"}, {"source": {"id": null, "name": "Heraldoffashion.com"}, "author": "Izer", "title": "Calculating the global carbon footprint of space science - Herald of Fashion", "description": "credit: natural astronomy (2022). DOI: 10.1038 / s41550-022-01639-6 A team of researchers at the University of Toulouse has attempted to calculate the", "url": "https://heraldoffashion.com/calculating-the-global-carbon-footprint-of-space-science/", "urlToImage": "https://heraldoffashion.com/wp-content/uploads/2022/03/Calculating-the-global-carbon-footprint-of-space-science.jpg", "publishedAt": "2022-03-22T22:36:13Z", "content": "natural astronomy (2022). DOI: 10.1038 / s41550-022-01639-6″ width=”685″ height=”436″/&gt; credit: natural astronomy (2022). DOI: 10.1038 / s41550-022-01639-6\r\nA team of researchers at the University… [+3138 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "China plans to open its space station to tourism within a decade - Daily Mail", "description": "While there are no specific details for the future of space tourism in China, it is likely that people without formal astronaut training could be launched 'relatively soon'.", "url": "https://www.dailymail.co.uk/sciencetech/article-10640665/China-plans-open-space-station-tourism-decade.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/17/54317911-0-China_plans_to_complete_its_Tiangong_space_station_by_the_end_of-a-25_1647971125639.jpg", "publishedAt": "2022-03-22T18:56:35Z", "content": "China plans to open its new space station up to 'tourism' within the next decade - sparking what the country hopes is a race to compete with the likes of private American space tourists such as Jeff … [+10391 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ashley Balzer", "title": "NASA's Roman mission will test competing cosmic acceleration theories - Phys.org", "description": "A team of scientists has predicted the science return from one of NASA's Nancy Grace Roman Space Telescope's groundbreaking planned surveys, which will analyze millions of galaxies strewn across space and time. The mission's enormous, deep panoramas will prov…", "url": "https://phys.org/news/2022-03-nasa-roman-mission-cosmic-theories.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nasas-roman-mission-wi.jpg", "publishedAt": "2022-03-22T18:45:38Z", "content": "These six cubes show the simulated distribution of galaxies at redshifts 9, 8, 5, 3, 2, and 1, with the corresponding cosmic ages shown. As the universe expands, the density of galaxies within each c… [+9896 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Marine organisms may adapt to climate change, but with hidden costs - Earth.com", "description": "Marine organisms may adapt to climate change, but with hidden costs • Earth.com", "url": "https://www.earth.com/news/marine-organisms-may-adapt-to-climate-change-but-with-hidden-costs/", "urlToImage": "https://cff2.earth.com/uploads/2022/03/22120436/Marine-organisms-scaled.jpg", "publishedAt": "2022-03-22T18:09:34Z", "content": "According to new research published in the journal Nature Communications, although ocean life could possibly adapt to major climate changes, there may be unforeseen costs to quickly evolving in a sud… [+2403 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Physics - Sound Speed Measured on Mars - Physics", "description": "Researchers have made the first measurements of the speed of sound on Mars, revealing that the red planet’s temperature fluctuates on a faster timescale than previously thought.", "url": "https://physics.aps.org/articles/v15/43", "urlToImage": "https://physics.aps.org/assets/44c7d44c-2718-490b-9e6a-bbda0d9f729a/e43_1_thumb.png", "publishedAt": "2022-03-22T18:05:36Z", "content": "NASA’s Perseverance rover uses microphones to record sounds on Mars that researchers have used to measure the speed of sound on that planet.\r\nLast February, the internet was awash with alien sounds a… [+4745 chars]"}, {"source": {"id": null, "name": "Devhardware.com"}, "author": "Izer", "title": "Physicists challenge haters, create quadrangular ice - Dev Hardware", "description": "The research team used a laser to melt the ice.Photo: Chris HigginsA team of physicists recently discovered a new phase of water ice, after They put", "url": "https://www.devhardware.com/physicists-challenge-haters-create-quadrangular-ice/", "urlToImage": null, "publishedAt": "2022-03-22T17:32:54Z", "content": "The research team used a laser to melt the ice.\r\nPhoto: Chris Higgins\r\nA team of physicists recently discovered a new phase of water ice, after They put normal Snow under unusually high pressure and … [+2915 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Study analyses the characteristics of Apophis, the asteroid that will approach Earth in 2029 - Nanowerk", "description": "The Apophis asteroid was discovered in 2004 and has been monitored since then due to its classification as a potentially hazardous asteroid (PHA), as it was estimated that it would have a 2% chance of hitting Earth.", "url": "https://www.nanowerk.com/news2/space/newsid=60138.php", "urlToImage": "https://www.nanowerk.com/news2/space/id60138.jpg", "publishedAt": "2022-03-22T16:58:30Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Novel Lab-Made Nanotexture Kills up to 70% of Bacteria - AZoNano", "description": "Researchers developed a natural antibacterial texture for use on food packaging to extend shelf life and minimize waste, inspired by the bacteria-killing wings of insects like cicadas.", "url": "https://www.azonano.com/news.aspx?newsID=38862", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_38862_16479524211683233.jpg", "publishedAt": "2022-03-22T15:06:00Z", "content": "Researchers developed a natural antibacterial texture for use on food packaging to extend shelf life and minimize waste, inspired by the bacteria-killing wings of insects like cicadas.\r\nMultifunction… [+4721 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Italian scientists create a yeast-free pizza by blowing bubbles in dough - Daily Mail", "description": "Putting yeast-free pizza dough inside an autoclave (an industrial device usually used to sterilize plastics) can create bubbles of CO2, researchers in Naples report.", "url": "https://www.dailymail.co.uk/sciencetech/article-10639839/Italian-scientists-create-yeast-free-pizza-blowing-bubbles-dough.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/13/55657197-0-image-a-9_1647956750760.jpg", "publishedAt": "2022-03-22T15:00:34Z", "content": "Scientists in Naples claim to have created the perfect yeast-free pizza by 'blowing bubbles' in dough. \r\nThe experts exposed yeast-free pizza dough to intense pressures in an industrial device called… [+5772 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Supermassive black holes identified as likely cause of stopping star formation - News9 LIVE", "description": "The formation of supermassive black holes is what causes young galaxies to turn into old galaxies", "url": "https://www.news9live.com/science/supermassive-black-holes-identified-as-likely-cause-of-stopping-star-formation-160447", "urlToImage": "https://media.news9live.com/h-upload/2022/03/22/259770-potw1951acropped.jpg", "publishedAt": "2022-03-22T13:35:44Z", "content": "A combination of machine learning, sophisticated supercomputer simulations and data from large scale surveys of the cosmos have resulted in researchers getting closer to solve a 20 year old conundrum… [+3341 chars]"}, {"source": {"id": null, "name": "Polymerupdate.com"}, "author": null, "title": "Plastics waste – no problem; scientists develop enzymes to break down PET in weeks - polymerupdate.com", "description": "With an admissible lifespan of around 450 years, plastics, the wonder material of the sixties and se...", "url": "https://www.polymerupdate.com/news/Important/22Mar2022/1158893/plastics-waste-–-no-problem-scientists-develop-enzymes-to-break-down-pet-in-weeks", "urlToImage": "https://www.polymerupdate.com/images/logo/200x200.png", "publishedAt": "2022-03-22T12:34:07Z", "content": "With an admissible lifespan of around 450 years, plastics, the wonder material of the sixties and seventies, have become a cause of major concern for the entire world due to irresponsible dumping of … [+3241 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Asteroid Ryugu could be a remnant of an extinct comet - Daily Mail", "description": "Samples from the diamond shaped, half-mile diameter space rock were returned to Earth for study by the Japan Aerospace Exploration Agency (JAXA) in 2020.", "url": "https://www.dailymail.co.uk/sciencetech/article-10639185/Asteroid-Ryugu-remnant-extinct-comet.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/22/10/43979755-0-image-a-5_1647946545549.jpg", "publishedAt": "2022-03-22T11:34:50Z", "content": "Asteroid Ryugu could be a remnant of an extinct comet that spent tens of thousands of years racing through the solar system, new data suggests.\r\nScientists believe it was then vaporised by high tempe… [+6783 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "World record: Scientists succesfully stored qubit for 20 milliseconds - Tech Explorist", "description": "The new world record for qubit storage.", "url": "https://www.techexplorist.com/world-record-scientists-succesfully-stored-qubit-20-milliseconds/45477/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/03/storing-photonic-qubits.jpg", "publishedAt": "2022-03-22T11:06:08Z", "content": "There is a significant hindrance to developing long-haul quantum communication systems: After a few hundred kilometers within an optical fiber, the photons that carry the qubits or ‘quantum bits’ (th… [+2602 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "After asteroid struck Earth, NASA makes THIS claim - HT Tech", "description": "An asteroid struck Earth, but worryingly, NASA detected it just two hours before it crashed. Find out what it tells about NASA’s planetary defense system", "url": "https://tech.hindustantimes.com/tech/news/after-asteroid-struck-earth-nasa-makes-this-claim-71647946332041.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/22/1600x900/asteroid-g5603adab3_1920_1647078503425_1647946402612.jpg", "publishedAt": "2022-03-22T10:55:30Z", "content": "Shockingly, an asteroid hit Earth last week. The news in itself is not that shocking as many pebble-sized asteroids get pulled by Earths gravity and burn up in the atmosphere. What was truly surprisi… [+2762 chars]"}, {"source": {"id": null, "name": "Eletimes.com"}, "author": "https://www.facebook.com/eletimes", "title": "New Experiment could Confirm the Fifth State of Matter - ELE Times", "description": "An experiment that could confirm the fifth state of matter in the universe—and change physics as we know it—has been", "url": "https://www.eletimes.com/new-experiment-could-confirm-the-fifth-state-of-matter", "urlToImage": "https://www.eletimes.com/wp-content/uploads/2022/03/new-experiment-could-c.jpg", "publishedAt": "2022-03-22T07:30:46Z", "content": "Physicist Dr Melvin Vopson has already published research suggesting that information has mass and that all elementary particles, the smallest known building blocks of the universe, store information… [+1981 chars]"}, {"source": {"id": null, "name": "Parisbeacon.com"}, "author": "Paris Beacon", "title": "The Hubble Space Telescope captures a picture of a barred spiral galaxy 48 million light-years from Earth - Paris Beacon News", "description": "The Hubble Space Telescope managed to capture a photograph of NGC 1097, a barred spiral galaxy, located 48 million light-years from Earth. “This image reveals the complexity of the latticework of stars and dust at the center of NGC 1097, with long tendrils of…", "url": "https://www.parisbeacon.com/64718/", "urlToImage": "https://www.parisbeacon.com/wp-content/uploads/2022/03/The-Hubble-Space-Telescope-captures-a-picture-of-a-barred.jpg", "publishedAt": "2022-03-22T05:31:47Z", "content": "The Hubble Space Telescope managed to capture a photograph of NGC 1097, a barred spiral galaxy, located 48 million light-years from Earth.\r\n“This image reveals the complexity of the latticework of st… [+855 chars]"}]}