{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Herzindagi.com"}, "author": "Alice Mary Topno", "title": "Zinnia: Get To See The Space Flower Up, Close And Personal, Courtesy NASA - HerZindagi English", "description": "NASA has recently shared a beautiful image of a flower grown on the International Space Station. The Zinnia flower was grown as part of the Veggie facility in orbit.", "url": "https://www.herzindagi.com/society-culture/nasa-shares-picture-of-flower-grown-in-space-zinnia-flower-article-234322", "urlToImage": "https://images.herzindagi.info/image/2023/Jun/Zinnia-FLOWER-by-NASA.jpg", "publishedAt": "2023-06-14T04:20:00Z", "content": "NASA (National Aeronautics and Space Administration) has once again stunned the globe with its recent achievement. This time, the attention is on a unique flower called the Zinnia flower that thrived… [+2636 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How did Earth get its water? New clues discovered in an asteroid sample - Earth.com", "description": "How did Earth get its water? New clues discovered in an asteroid sample • Earth.com", "url": "https://www.earth.com/news/how-did-earth-get-its-water-new-clues-discovered-in-an-asteroid-sample/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/13201930/asteroid-smashing-earth_1medium.jpg", "publishedAt": "2023-06-14T02:35:18Z", "content": "The Japanese Hayabusa spacecraft brought an asteroid sample to learn more about Earths water. Tiny salt grains discovered in this sample provide strong evidence that liquid water may be more common i… [+11869 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "A Comparative Evaluation of the Fracture Resistance of Mineral Trioxide Aggregate (MTA) Plus and MTA Angelus: An In Vitro Study - Cureus", "description": "Background\r\n\r\nMineral trioxide aggregate (MTA) is a biocompatible dental material used for root-end filling in endodontics. A wide variety of literature has been published on the assessment of fracture resistance of MTA. However, the results were conflicting …", "url": "https://www.cureus.com/articles/154209-a-comparative-evaluation-of-the-fracture-resistance-of-mineral-trioxide-aggregate-mta-plus-and-mta-angelus-an-in-vitro-study", "urlToImage": "https://assets.cureus.com/uploads/figure/file/648908/article_river_8273c080ffde11ed8d136dabbf16f3cd-figure-1.png", "publishedAt": "2023-06-14T01:06:24Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Sandra Erwin", "title": "DARPA downsizes Blackjack space experiment - SpaceNews", "description": "DARPA downsizes Blackjack space experiment", "url": "http://spacenews.com/darpa-downsizes-blackjack-space-experiment/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/06/FtnVK1mWcAAhcjE-scaled-e1686678365274.jpeg?fit=2553%2C1260", "publishedAt": "2023-06-14T01:00:00Z", "content": "WASHINGTON The Defense Advanced Research Projects Agency on June 12 launched four satellites for a technology demonstration in low Earth orbit.\r\nThe satellites flew to orbit on the SpaceX Transporter… [+2106 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Study explains unusual deformation in Earth's largest continental rift: Computer models confirm that the African Superplume is responsible for the unusual deformations as well as rift-parallel seismic anisotropy observed beneath the East African Rift Syste - Science Daily", "description": "Computer models confirm that the African Superplume is responsible for the unusual deformations, as well as rift-parallel seismic anisotropy observed beneath the East African Rift System.", "url": "https://www.sciencedaily.com/releases/2023/06/230613190839.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-06-13T23:56:01Z", "content": "Computer models confirm that the African Superplume is responsible for the unusual deformations as well as rift-parallel seismic anisotropy observed beneath the East African Rift System.In continenta… [+5259 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Chris Panella, Jessica Orwig", "title": "Huge cosmic burst came from two circling black holes: study - Business Insider", "description": "Scientists said the bright flare occurred after one of the black holes crashed through a gaseous disk at near the speed of light.", "url": "https://www.businessinsider.com/huge-cosmic-burst-two-circling-black-holes-study-2023-6", "urlToImage": "https://i.insider.com/6488af0362d3f1001996806b?width=1200&format=jpeg", "publishedAt": "2023-06-13T21:45:00Z", "content": "In galaxy OJ287, which lives 5 billion light-years away, there was a massive burst of light that shone 100 times brighter than our home galaxy, the Milky Way.\r\nThere are few cosmic giants in our univ… [+3861 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "Astronauts Will Be Tracking Dust Into the Lunar Gateway. Is This a Problem? - Universe Today", "description": "A NASA-supported study examines how lunar regolith could impact the Gateway and other aspects of NASA's Artemis Program.", "url": "https://www.universetoday.com/161788/astronauts-will-be-tracking-dust-into-the-lunar-gateway-is-this-a-problem/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/08/NASA-Astronauts-Lunar-South-Pole.jpg", "publishedAt": "2023-06-13T19:42:27Z", "content": "Lunar regolith (aka. Moondust”) is a major hazard for missions heading to the Moon. It’s everywhere on the surface – 5 to 10 meters (~16.5 to 33 feet) in depth in some places – not to mention jagged … [+6926 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "NASA Sending Adorable Little Buddy to Hang Out Next to the James Webb - Futurism", "description": "After spending a year and a half one million miles away from Earth, NASA's James Webb Space Telescope is finally getting some company.", "url": "https://futurism.com/the-byte/sidekick-cubesat-james-webb", "urlToImage": "https://wp-assets.futurism.com/2023/06/sidekick-cubesat-james-webb.jpg", "publishedAt": "2023-06-13T18:35:01Z", "content": "This toaster-sized \"sidekick\" sounds like the perfect companion.\r\nSidekick Energy\r\nAfter spending an exceedingly lonely year and a half peering into the universe roughly a million miles from the Eart… [+2074 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Aluminium-ion batteries with improved storage capacity - EurekAlert", "description": "•\tScientists develop positive electrode material using an organic redox polymer based on phenothiazine.\n•\tAluminium-ion batteries containing this material stored an unprecedented 167 milliampere hours per gram, outperforming batteries using graphite as electr…", "url": "https://www.eurekalert.org/news-releases/992424", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/6035aab2-7b86-4a91-a1aa-8bfcb7a5f8ed/Rendition/thumbnail/Content/Public", "publishedAt": "2023-06-13T18:32:11Z", "content": "image: The schematic diagram of the battery shows the redox process in which the electrode material is oxidized and aluminate anions are deposited.view more \r\nCredit: Birgit Esser / University of Fre… [+4899 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Ashworth", "title": "New flying gecko species reveals hidden biodiversity of northern India - Phys.org", "description": "A new species of gliding gecko has been uncovered in northern India. Bearing the name of the Indian state it was discovered in, the Mizoram parachute gecko, or Gekko mizoramensis, is one of 14 geckos known to take to the air. While one specimen of the new spe…", "url": "https://phys.org/news/2023-06-flying-gecko-species-reveals-hidden.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-flying-gecko-speci.jpg", "publishedAt": "2023-06-13T17:12:36Z", "content": "A new species of gliding gecko has been uncovered in northern India. Bearing the name of the Indian state it was discovered in, the Mizoram parachute gecko, or Gekko mizoramensis, is one of 14 geckos… [+4172 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Scott Sutherland", "title": "The mystery of our transparent universe has been solved! - Yahoo Canada Shine On", "description": "The rest of the universe would be hidden from us if it weren't for this transparency, and now Webb has revealed how it happened!", "url": "https://ca.news.yahoo.com/mystery-transparent-universe-solved-155008607.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/x34.V0vy5vcYQZn1HU2WUQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_weather_network_616/53cfbf3f371892136271d2e935058999", "publishedAt": "2023-06-13T15:50:08Z", "content": "![Quasar-J0100+2802-JWST](https://images.twnmm.com//c55i45ef3o2a/2qJAwmbGvpvtxaPcPNRGk6/1ef2210104bbb863730914c4c174cec7/Quasar-J0100_2802-JWST.jpg)*This image captured by the James Webb Space Telesc… [+6150 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "'Cosmic magnifying glass' reveals super-rare warped supernova with gravitational lens. (Thanks, Einstein!) - Space.com", "description": "The discovery is the tip of the iceberg for gravitationally lensed supernovas that could help us better understand the expansion of the universe.", "url": "https://www.space.com/supernova-gravitational-lens-sn-zwicky", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wFKkB6BQYvVan5RTZxamiB-1200-80.jpg", "publishedAt": "2023-06-13T15:45:41Z", "content": "The gravity of a distant galaxy warped space and magnified the light of a faraway supernova, potentially revealing tantalizing details about stellar explosions, as well as an unseen population of gal… [+6904 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Weighing a quasar's galaxy with precision - Nanowerk", "description": "Scientists have managed to weigh - more precisely than any other technique - a galaxy hosting a quasar, thanks to the fact that it acts as a gravitational lens.", "url": "https://www.nanowerk.com/news2/space/newsid=63160.php", "urlToImage": "https://www.nanowerk.com/news2/space/id63160.jpg", "publishedAt": "2023-06-13T15:39:05Z", "content": "Nanowerk Newsletter\r\nGet our Space Exploration news updates to your inbox!"}, {"source": {"id": null, "name": "Plos.org"}, "author": null, "title": "Environmental science articles - Read the latest from PLOS - PLOS", "description": "Discover the latest environmental science research articles from PLOS, covering topics including agriculture, economics, and water resources.", "url": "https://latitude.plos.org/2023/06/environmental-science-research-plos/", "urlToImage": "http://latitude.plos.org/wp-content/uploads/sites/18/2023/03/690x320_EnviSci_blog-header.png", "publishedAt": "2023-06-13T15:09:49Z", "content": "PLOS’ environmental science journals cover a broad range of topics, from agriculture and ecosystems, to the effects of environmental change on health, and resource management. Read some of the latest… [+2115 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Aliens likely to communicate through newly discovered supernova, claim scientists - WION", "description": "Aliens likely to communicate through newly discovered supernova, claim scientists", "url": "https://www.wionews.com/science/aliens-likely-to-communicate-through-newly-discovered-supernova-claim-scientists-604051", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/13/359233-untitled-design-2023-06-13t202225981.png", "publishedAt": "2023-06-13T14:53:21Z", "content": "In the latest study, scientists have suggested that a newly discovered supernova, which is 21 million light-years from Earth, can turn into a beacon for aliens to communicate. The University of Washi… [+2845 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Could Gamma-ray burst kill off life on Earth? | Latest English News | WION - WION", "description": "Gamma-ray bursts are so powerful they could vaporise the Earth from 200 light-years away. Gamma-ray bursts are thought to occur when a massive star runs out ...", "url": "https://www.youtube.com/watch?v=PMNEF30zDPM", "urlToImage": "https://i.ytimg.com/vi/PMNEF30zDPM/maxresdefault.jpg", "publishedAt": "2023-06-13T14:49:26Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "World's most painful ant sting targets nerves in the same way scorpion venom does - Livescience.com", "description": "Bullet and greenhead ants produce toxins they inject with every sting, which prolong nerve signals to the brain and lead to trembling, uncontrollable and long-lasting pain in mammals.", "url": "https://www.livescience.com/animals/ants/worlds-most-painful-ant-sting-targets-nerves-in-the-same-way-scorpion-venom-does", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZUwZMzem3zhrNZQmDg6X4d-1200-80.jpg", "publishedAt": "2023-06-13T14:02:38Z", "content": "The South American bullet ant (Paraponera clavata) inflicts the world's most painful ant sting, which can be felt for up to 12 hours. (Image credit: Shutterstock)\r\nAnts that inflict the world's most … [+3312 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": "James Urquhart", "title": "Molecular fossils solve evolutionary mystery | Research - Chemistry World", "description": "Fossilised protosteroids confirm Nobel-prizewinner’s decades-old prediction", "url": "https://www.chemistryworld.com/news/molecular-fossils-solve-evolutionary-mystery/4017555.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/9/8/7/526987_image_3_28422.jpg", "publishedAt": "2023-06-13T13:30:31Z", "content": "Fossilised protosteroid molecules discovered in 1.6 billion year old rocks could be signs of a hidden world of ancient organisms belonging to the earliest forms of complex life. The finding suggests … [+3138 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Photographer Captures ISS Crossing the Sun During Astronaut Spacewalk - PetaPixel", "description": "Can you spot them?", "url": "https://petapixel.com/2023/06/13/photographer-captures-iss-crossing-the-sun-during-astronaut-spacewalk/", "urlToImage": "https://petapixel.com/assets/uploads/2023/06/ISS-transit.jpg", "publishedAt": "2023-06-13T13:29:41Z", "content": "An astrophotographer captured the International Space Station (ISS) crossing the Sun as two astronauts were conducting a spacewalk to install solar panels. \r\nThierry Legault drove six hours from his … [+2135 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "A novel method creates a window for studying the transport and distribution of elements in plants: Study - ThePrint", "description": "Gatersleben [Germany], June 13 (ANI): Plant roots are crucial in the uptake, selection, enrichment, and retention of a variety of mineral elements, which supplies distant plant tissues with nutrients and sequesters excess metals. A variety of ion transporters…", "url": "https://theprint.in/environment/a-novel-method-creates-a-window-for-studying-the-transport-and-distribution-of-elements-in-plants-study/1625376/", "urlToImage": null, "publishedAt": "2023-06-13T13:14:20Z", "content": "Gatersleben [Germany], June 13 (ANI): Plant roots are crucial in the uptake, selection, enrichment, and retention of a variety of mineral elements, which supplies distant plant tissues with nutrients… [+3322 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "NASA`s Hubble telescope clicks a beautiful `jellyfish` galaxy - WION", "description": "NASAs Hubble telescope clicks a beautiful jellyfish galaxy", "url": "https://www.wionews.com/trending/nasa-hubble-telescope-clicks-a-beautiful-jellyfish-galaxy-603989", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/13/359197-jellyfish-galaxy.jpg", "publishedAt": "2023-06-13T12:47:57Z", "content": "James Webb Space Telescope (JWST) may be all that's bling right now but Hubble Space Telescope is like that dependable team player who does perfect work silently. It has been doing that for decades n… [+1797 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unveiling Quantum Gravity: New Results From IceCube Neutrino Observatory and Fermi Space Telescope - SciTechDaily", "description": "Researchers have reached a significant milestone in the field of quantum gravity research, finding preliminary statistical support for quantum gravity. In a study published in Nature Astronomy on June 12, a team of researchers from the University of Naples “F…", "url": "https://scitechdaily.com/?p=285779", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Quantum-Gravity-Art-Concept.jpg", "publishedAt": "2023-06-13T12:42:40Z", "content": "New research provides preliminary evidence supporting a quantum gravity model which suggests that the speed of ultrarelativistic particles reduces with increased energy. The study used data from the … [+2365 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Mega-Bubble Triggers Coronial Chaos, Earth Narrowly Escapes Devastating Solar Storm - Transcontinental Times", "description": "UNITED STATES: Coronal mass ejections, gigantic eruptions of plasma and magnetic fields from the Sun's corona, are known to wreak havoc on Earth's delicate technological infrastructure. These powerful outbursts can disrupt satellite communications and power g…", "url": "https://www.transcontinentaltimes.com/earth-escape-devastating-solar-storm/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Sun.jpg", "publishedAt": "2023-06-13T12:09:47Z", "content": "UNITED STATES: In a jaw-dropping celestial spectacle, a mega-bubble collapsing in the Sun’s atmosphere set off a series of extraordinary events that had astronomers on the edge of their seats. The co… [+3798 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Webb telescope shows how the universe became transparent - The Indian Express", "description": "The James Webb Space Telescope has helped astronomers pinpoint how the gases in between stars and galaxies went from opaque to transparent, clearing up views.", "url": "https://indianexpress.com/article/technology/science/webb-telescope-universe-transparent-8660850/", "urlToImage": "https://images.indianexpress.com/2023/06/Webb-reionisation-20230613.jpg", "publishedAt": "2023-06-13T12:07:00Z", "content": "Soon after the birth of the universe, the gas in between stars and galaxies was opaque and starlight could not penetrate it. But a billion years after the big bang, this gas had become completely tra… [+1658 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New Study Expected To Discover The Theory Behind Earth’s Unique Oxygen-rich Atmosphere - India Education Diary", "description": "A new study may have found a missing link that helps explain the Earth’s unique oxygen-rich atmosphere — and the evolution of animal life on the planet.The findings in the paper Uncovering the Ediacaran phosphorus cycle, led by a Forrest Research Fou", "url": "https://indiaeducationdiary.in/new-study-expected-to-discover-the-theory-behind-earths-unique-oxygen-rich-atmosphere/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/Atmosphere-Card-1024x771.jpg", "publishedAt": "2023-06-13T12:01:05Z", "content": "A new study may have found a missing link that helps explain the Earths unique oxygen-rich atmosphere and the evolution of animal life on the planet.\r\nThe findings in the paper Uncovering the Ediacar… [+2335 chars]"}, {"source": {"id": null, "name": "Potatopro.com"}, "author": null, "title": "That's a relief! European Space Agency (ESA) finds you can fry potatoes in space - PotatoPro", "description": "European Space Agency (ESA) has been supporting research in frying cooking methods in microgravity to fill in knowledge gaps on Earth and in space. Frying potatoes in space seems to be possible!", "url": "https://www.potatopro.com/news/2023/thats-relief-european-space-agency-esa-finds-you-can-fry-potatoes-space", "urlToImage": "https://media.potatopro.com/fry-food-1200.jpg", "publishedAt": "2023-06-13T12:00:00Z", "content": "ESA has been supporting research in frying cooking methods in microgravity to fill in knowledge gaps on Earth and in space. Even though frying potatoes is done everywhere around the world, it involve… [+2278 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Pioneering Review Report Shows Intricate Cell-environment Connection - India Education Diary", "description": "A pioneering review article has shed new light on the intricate connection between cells and the environment they exist in, expanding our understanding of the physical aspects of cell biology.\"This is important because conventional methods, such as c", "url": "https://indiaeducationdiary.in/pioneering-review-report-shows-intricate-cell-environment-connection/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/01/news_group_of_eight_the_university_of_western_australia_650x400.jpg", "publishedAt": "2023-06-13T11:52:54Z", "content": "A pioneering review article has shed new light on the intricate connection between cells and the environment they exist in, expanding our understanding of the physical aspects of cell biology.\r\n“This… [+2623 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Nikhil Batra", "title": "Explained: What is the new Tatooine-Like Planet discovered by Astronomers - Jagran Josh", "description": "Astronomers have used a new technique to confirm a real-life Tatooine, the fictional planet with two suns that was home to Luke Skywalker in the famous Star Wars universe. Read below to learn more.", "url": "https://www.jagranjosh.com/general-knowledge/explained-what-is-the-new-tatooine-like-planet-discovered-by-astronomers-1686651623-1", "urlToImage": "https://img.jagranjosh.com/images/2023/June/1362023/tatooine-pl.jpg", "publishedAt": "2023-06-13T11:35:00Z", "content": "Astronomers have discovered a new planet that is eerily similar to Tatooine, the desert planet from the famous Star Wars movies. The planet has been named BEBOP-1 c, and here are all the details you … [+3552 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Where Did Earth's Water Come From? - SciTechDaily", "description": "Newly discovered exoplanets contribute to the development of a novel model that offers potential explanations for the origin of some of Earth’s signature features, such as its abundance of water. New research from Carnegie Science's Anat Shahar, along with UC…", "url": "https://scitechdaily.com/?p=280872", "urlToImage": "https://scitechdaily.com/images/Sun-Rises-Over-Earth.jpg", "publishedAt": "2023-06-13T11:33:43Z", "content": "ByCarnegie Institution for ScienceJune 13, 2023\r\nResearchers suggest that Earths water may have originated from interactions between the hydrogen-rich atmospheres and magma oceans of early planetary … [+7620 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "Mountains up to 4.5 times the height of Mount Everest found deep inside Earth - Inshorts", "description": "Mountains with peaks up to 4.5 times higher than Mount Everest, the Earth's highest mountain above sea level, have been discovered deep inside the Earth. According to researchers, the mountains could be parts of the lower mantle that have been superheated due…", "url": "https://inshorts.com/en/news/mountains-up-to-45-times-the-height-of-mount-everest-found-deep-inside-earth-1686655359093", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2023/06_jun/13_tue/img_1686653465164_765.jpg?", "publishedAt": "2023-06-13T11:23:47Z", "content": null}, {"source": {"id": null, "name": "AZoM"}, "author": null, "title": "Facilitating Materials Physics Discoveries with Spectroscopy - AZoM", "description": "Terahertz (THz) spectroscopy and real-time monitoring are being combined in a ground-breaking method that will speed up the discovery of new materials, according to researchers from the University of Ottawa and the Max Planck Institute for the Science of Ligh…", "url": "https://www.azom.com/news.aspx?newsID=61457", "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ImageForNews_61457_16866531107678087.png", "publishedAt": "2023-06-13T10:46:00Z", "content": "Terahertz (THz) spectroscopy and real-time monitoring are being combined in a ground-breaking method that will speed up the discovery of new materials, according to researchers from the University of… [+3646 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Titanic asteroid passes by earth - Indiatimes.com", "description": "Trending News: On June 12, a large asteroid called Titanic orbited around the Sun and approached Earth. It is estim", "url": "https://timesofindia.indiatimes.com/etimes/trending/titanic-asteroid-passes-by-earth/articleshow/100962255.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100962266,width-1070,height-580,imgsize-27544,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-13T10:30:00Z", "content": null}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "Red giant star Betelgeuse - INSIGHTSIAS - Insights IAS", "description": "Facts for Prelims (FFP) Source: TH  Context: Recent research on the massive red giant star Betelgeuse suggests that it is in its late carbon-burning stage (near the end of its life) and may explode as a supernova within a few decades.   Life Cycle of a Star: …", "url": "https://www.insightsonindia.com/2023/06/13/red-giant-star-betelgeuse/", "urlToImage": "https://www.insightsonindia.com/wp-content/uploads/2022/08/star_1.png", "publishedAt": "2023-06-13T09:02:03Z", "content": null}, {"source": {"id": null, "name": "Editorji.com"}, "author": "Editorji News Desk", "title": "Brightest Gamma-Ray burst shatters existing models: Check details - Editorji", "description": "The brightest gamma-ray burst ever detected, GRB 221009A, occurred on October 9, 2022. Lasting for hundreds of seconds, it was 70 times brighter than any previous burst and had an unprecedented energy level.", "url": "https://www.editorji.com/tech-news/brightest-gamma-ray-burst-shatters-existing-models-check-details-1686645440673", "urlToImage": "https://cdn.editorji.com/pebQRTWsA9.jpg", "publishedAt": "2023-06-13T08:37:20Z", "content": "The brightest gamma-ray burst ever detected, GRB 221009A, occurred on October 9, 2022. Lasting for hundreds of seconds, it was 70 times brighter than any previous burst and had an unprecedented energ… [+871 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Web Desk", "title": "Lunar enigma: Could the Moon harbor microbial life? NASA researchers weigh in - The Week", "description": "In a groundbreaking revelation, NASA scientists suggest that the Moon, long considered a lifeless celestial body, may harbor microbial life in its dark craters located at the lunar south pole. Prabal Saxena, a planetary researcher at NASA's Goddard Space Flig…", "url": "https://www.theweek.in/news/sci-tech/2023/06/13/lunar-enigma-could-the-moon-harbor-microbial-life-nasa-researche.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2022/images/2023/2/moon-An-aircraft-passes-by-the-moon-in-Frankfurt-Germany-ap.jpg", "publishedAt": "2023-06-13T08:17:04Z", "content": "<ul><li>NASA scientists propose microbial life may exist in Moon's dark craters</li><li>Studies have provided compelling evidence for the survival of microorganisms in extreme environments</li><li>Hu… [+3394 chars]"}, {"source": {"id": null, "name": "Indiatodayne.in"}, "author": "INDIATODAYNE", "title": "Animals That Produce 'Milk' But Aren’t Mammals - India Today NE", "description": "It’s not just mammals that got milk, these animals producing sort-of milks aren’t just nutrient rich, some contain stuff that help babies fight infection or establish a gut microbiome.", "url": "https://www.indiatodayne.in/visualstories/webstories/animals-that-produce-milk-but-arent-mammals-42181-13-06-2023", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/visualstory/wp/2023/06/pixabay_pink_flamingos.jpg", "publishedAt": "2023-06-13T08:06:14Z", "content": "Nematodes\r\nA nematode, a microscopic soil-dwelling roundworm, doesnt have a heart or blood, and their entire body only has about 1,000 cells (a human body has about 30,000,000,000,000 cells). Yet in … [+277 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "The Fermi-Pasta-Ulam-Tsingou Paradox Reveals Astonishing Insights into Nonlinear Dynamics - Transcontinental Times", "description": "NEW MEXICO: In the realm of scientific mysteries, few have captured the imagination of physicists quite like the Fermi-Pasta-Ulam-Tsingou (FPUT) paradox. In the 1950s, this paradox originated from an unexpected discovery, challenging our understanding of nonl…", "url": "https://www.transcontinentaltimes.com/the-fermi-pasta-ulam-tsingou-paradox/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Fermi-Pasta-Ulam-Tsingou.jpg", "publishedAt": "2023-06-13T08:05:42Z", "content": "NEW MEXICO: In the realm of scientific mysteries, few have captured the imagination of physicists quite like the Fermi-Pasta-Ulam-Tsingou (FPUT) paradox.\r\nIn the 1950s, this paradox originated from a… [+3444 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Sanskar Tiwari", "title": "All Facts Related to the Solar System - News Track English", "description": "Welcome to our comprehensive guide on all the fascinating facts related to the solar system. The solar system is an awe-inspiring expanse of celestial bodies that has captivated human curiosity for centuries. In this article, we will explore everything from t…", "url": "https://english.newstracklive.com/news/all-facts-related-to-the-solar-system-a-comprehensive-guide-emc-sc71-nu384-ta384-1280445-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Jun/13/big_thumb/Solar-System_64881c99d55b6.jpeg", "publishedAt": "2023-06-13T07:53:28Z", "content": "Welcome to our comprehensive guide on all the fascinating facts related to the solar system. The solar system is an awe-inspiring expanse of celestial bodies that has captivated human curiosity for c… [+6667 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Insights Into Redox-Independent Cellular Stress Response - Technology Networks", "description": "Researchers from Juntendo University have unraveled the roles of phase-separated liquid droplets, p62 bodies, in redox-independent NRF2 activation and the significance of phosphorylation in this process.<br />", "url": "https://www.technologynetworks.com/cell-science/news/new-insights-into-redox-independent-cellular-stress-response-374617", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374617/new-insights-into-redox-independent-cellular-stress-response-374617-640x360.jpg?cb=20230613", "publishedAt": "2023-06-13T07:42:28Z", "content": "Cellular stress, or oxidative stress, occurs when there is a buildup of reactive oxygen species (ROS), which interferes with cellular mechanisms and can even cause damage to proteins, lipids, and DNA… [+4955 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "Owen Gingerich, Astronomer Who Saw God in the Cosmos, Dies at 93 - Slashdot", "description": "Owen Gingerich, a renowned astronomer and historian of science, has passed away at the age of 93. Gingerich dedicated years to tracking down 600 copies of Nicolaus Copernicus's influential book \"De Revolutionibus Orbium Coelestium Libri Sex\" and was known for…", "url": "https://science.slashdot.org/story/23/06/13/003238/owen-gingerich-astronomer-who-saw-god-in-the-cosmos-dies-at-93", "urlToImage": "https://a.fsdn.com/sd/topics/space_64.png", "publishedAt": "2023-06-13T07:36:52Z", "content": "You may have also been called a troll because you literally wished ill on the dead.\r\nGingerich did nothing more than you are doing. You have a predisposition against religion, so you are using your p… [+2081 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 13 June 2023: Moons crossing Great Red Spot on Jupiter - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Jupiter’s two Galilean moons, Europa and Io, crossing the gas giant.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-13-june-2023-moons-crossing-great-red-spot-on-jupiter-71686640731737.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/Untitled_design_1686641342391_1686641362391.jpg", "publishedAt": "2023-06-13T07:30:19Z", "content": "Jupiter has been shocking astronomers ever since astronomer Galileo Galilei started recording its mysteries as far back as 1610. Jupiter is also known as the Gas Giant as it has a dense atmosphere of… [+2101 chars]"}, {"source": {"id": null, "name": "Pratidintime.com"}, "author": "Pratidin Bureau", "title": "NASA's Mission to Prevent ‘Internet Apocalypse’ - Pratidin Time", "description": "NASA’s Parker Solar Probe has successfully travelled through solar wind, gathering valuable insights into the sun’s workings to prevent a potential “internet ap", "url": "https://www.pratidintime.com/world/nasa-launch-mission-to-prevent-internet-apocalypse", "urlToImage": "https://gumlet.assettype.com/pratidintime%2F2023-06%2F846f35dc-b852-4e18-9096-bc493c71446d%2FNew_Project__5_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-06-13T07:06:56Z", "content": "Typically found at the suns poles during quiet periods, the holes do not directly impact Earth. However, during the suns active phase every 11 years, when its magnetic field flips, these holes appear… [+86 chars]"}, {"source": {"id": null, "name": "Timestech.in"}, "author": "Analog Devices", "title": "The Amazing Technology Behind EV Batteries - TimesTech", "description": "A battery management system (BMS) is responsible for extracting the maximum capacity and lifetime from these cells while ensuring safety", "url": "https://timestech.in/the-amazing-technology-behind-ev-batteries/", "urlToImage": "https://timestech.in/wp-content/uploads/2023/06/evbb.jpg", "publishedAt": "2023-06-13T06:09:25Z", "content": "Unlike a single energy storage element such as a fuel tank, an electric vehicle (EV) battery pack consists of hundreds of individual lithium-ion (Li-Ion) bat-tery cells in a long series. When not ope… [+12049 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Hubble Space Telescope captures image of irregular galaxy NGC 7292 - News9 LIVE", "description": "The irregular galaxy lacks the well-defined arms seen in 'grand design' spiral galaxies.", "url": "https://www.news9live.com/science/hubble-space-telescope-captures-image-of-irregular-galaxy-ngc-7292-2176294", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/potw2324a-Cropped.jpg", "publishedAt": "2023-06-13T06:01:59Z", "content": "The irregular galaxy lacks the well-defined arms seen in 'grand design' spiral galaxies.\r\nThe Hubble Space Telescope has captured an image of an irregular galaxy designated as NGC 7292, located at a … [+1756 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "SOFIA observes complex magnetic fields and star formation in Tarantula Nebula - News9 LIVE", "description": "The observations were made by the Stratospheric Observatory for Infrared Astronomy before its retirement.", "url": "https://www.news9live.com/science/sofia-observes-complex-magnetic-fields-and-star-formation-in-tarantula-nebula-2176246", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/30Doradus-1024x786-Cropped.jpg", "publishedAt": "2023-06-13T05:38:37Z", "content": "The observations were made by the Stratospheric Observatory for Infrared Astronomy before its retirement.\r\nAstronomers have studied the relationship between magnetic fields and gravity in the Tarantu… [+1751 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "SpaceX orbits 72 satellites - United News of India", "description": "Washington, June 13 (UNI) US aerospace manufacturer and space transportation services company SpaceX said it had orbited 72 satellites on a Falcon 9 medium-lift launch vehicle.", "url": "http://www.uniindia.com/~/spacex-orbits-72-satellites/World/news/2990212.html", "urlToImage": "", "publishedAt": "2023-06-13T04:55:00Z", "content": "More News14 Jun 2023 | 8:20 AMBamako, June 14 (UNI) Fifteen people were killed, and 32 others injured in a collision of vehicles on the national road linking Mali's capital Bamako to the town of Sego… [+1079 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "450-foot asteroid, bigger than the Statue of Liberty, rushing towards Earth at fearsome speed - HT Tech", "description": "NASA has revealed key details about a mammoth asteroid that is set to make its closest approach to Earth. Know its speed, size, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/450foot-asteroid-statue-of-liberty-earth-nasa-speed-54272-kmph-71686630599977.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/orbit-viewer-snapshot_1686630862332_1686630865898.jpg", "publishedAt": "2023-06-13T04:35:01Z", "content": "Located at JPL, the Center for Near-Earth Object Studies (CNEOS) works alongside the Planetary Defense Coordination Office at NASA Headquarters in Washington to characterize the orbits of near-Earth … [+1834 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "First man-made object to cross the central Solar System - The Hans India", "description": "Pioneer 10 became the first man-made object to cross the central Solar System after crossing Neptune which at the time was the farthest planet from the Sun.", "url": "https://www.thehansindia.com/life-style/first-man-made-object-to-cross-the-central-solar-system-802661", "urlToImage": "https://assets.thehansindia.com/h-upload/2023/06/13/1357584-ol.jpg", "publishedAt": "2023-06-13T02:31:59Z", "content": "June 13, 1983: Pioneer 10 became the first man-made object to cross the central Solar System after crossing Neptune which at the time was the farthest planet from the Sun. Pioneer 10 (originally desi… [+688 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Bird Brains Can Sense Magnetic Fields With The Flick of a Switch - ScienceAlert", "description": "After a long-distance trip under the polite, if slightly repetitive instruction of your favorite GPS app, nothing is worse that being told how to navigate your own neighborhood.", "url": "https://www.sciencealert.com/bird-brains-can-sense-magnetic-fields-with-the-flick-of-a-switch", "urlToImage": "https://www.sciencealert.com/images/2023/05/BirdBrainSwitch.jpg", "publishedAt": "2023-06-13T00:49:47Z", "content": "After a long-distance trip under the polite, if slightly repetitive instruction of your favorite GPS app, nothing is worse that being told how to navigate your own neighborhood.\r\nMigratory birds that… [+3781 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How OSIRIS-REx may uncover the mystery of what sparked life. - The Planetary Society", "description": "Want to learn just how the mission will unfold, how the sample container will land on Earth, how it’ll be retrieved (there will be helicopters), and the elab...", "url": "https://www.youtube.com/watch?v=5ciqJBpcPak", "urlToImage": "https://i.ytimg.com/vi/5ciqJBpcPak/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4Ac4FgAKACooCDAgAEAEYZSBFKEUwDw==&rs=AOn4CLC4EmGsNpwS6QYR-vHgo_XvjUV9pA", "publishedAt": "2023-06-13T00:16:55Z", "content": null}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Physicists have discovered a new state of matter – a crystal of bosons - The Times Hub", "description": "Spread the love Scientists have developed an exotic material composed of ordered excitons. The study is published in the journal Science. Physicists reported the discovery of an exotic state of matter – a boson-correlated insulator. It consists of excitons “c…", "url": "https://thetimeshub.in/physicists-have-discovered-a-new-state-of-matter-a-crystal-of-bosons/", "urlToImage": null, "publishedAt": "2023-06-12T23:07:29Z", "content": "Scientists have developed an exotic material composed of ordered excitons. The study is published in the journal Science. \r\nPhysicists reported the discovery of an exotic state of matter – a boson-co… [+450 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "It`s not so red. Never-before-seen images of Mars are absolutely stunning - WION", "description": "Its not so red. Never-before-seen images of Mars are absolutely stunning", "url": "https://www.wionews.com/science/its-not-so-red-never-before-seen-images-of-mars-are-absolutely-stunning-603664", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/13/358988-mars-2.png", "publishedAt": "2023-06-12T21:05:36Z", "content": "Scientists are busy trying to find answers to the questions - is Mars habitable... is there a potential for life beneath the Martian crust? Mars is the fourth planet and the furthest terrestrial plan… [+2013 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Dying stars may be a source of gravitational waves - Earth.com", "description": "Dying stars may be a source of gravitational waves • Earth.com", "url": "https://www.earth.com/news/dying-stars-may-be-a-source-of-gravitational-waves/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/12124010/cocoon1-scaled.jpg", "publishedAt": "2023-06-12T18:41:34Z", "content": "Until now, astrophysicists have only managed to detect gravitational waves from binary systems, such as the mergers of either two black holes, two neutron stars, or one of each. However, a team of sc… [+5820 chars]"}, {"source": {"id": null, "name": "Themorningnews.com"}, "author": "Jeanine Bagley", "title": "Moons Can Cause Earthquakes on Earth, Scientists Say - The Morning News", "description": "Moon has a significant impact on earth as it causes the oceans on our planet to form tides. But a new research study has revealed a phenomenal influence the moon has on earth’s oceans. The study mentioned that earthquakes have happened in the past due to the …", "url": "https://themorningnews.com/news/2023/06/12/moons-can-cause-earthquakes-on-earth-scientists-say/", "urlToImage": "https://themorningnews.com/wp-content/uploads/2023/06/Earthquakes-are-not-triggered-by-the-phases-of-the-moon.jpg", "publishedAt": "2023-06-12T16:35:00Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Neanderthal genes still influence modern humans • Earth.com - Earth.com", "description": "Neanderthal genes still influence modern humans • Earth.com", "url": "https://www.earth.com/news/neanderthal-genes-still-influence-modern-humans/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/12094910/Neanderthal-genes.jpg", "publishedAt": "2023-06-12T15:57:13Z", "content": "Recent studies have found that Neanderthal genes comprise between one and four percent of the genome of present-day humans. However, how many of those genes are still actively influencing human trait… [+5279 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Experiment shows Einstein-Podolsky-Rosen paradox scales up - Phys.org", "description": "A group of physicists at the University of Basel, in Switzerland, has found via experimentation that the Einstein-Podolsky-Rosen paradox still holds even when scaled up. Paolo Colciaghi, Yifan Li, Philipp Treutlein and Tilman Zibold describe their experiment …", "url": "https://phys.org/news/2023-06-einstein-podolsky-rosen-paradox-scales.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/experiment-shows-einst.jpg", "publishedAt": "2023-06-12T13:21:40Z", "content": "A group of physicists at the University of Basel, in Switzerland, has found via experimentation that the Einstein-Podolsky-Rosen paradox still holds even when scaled up. Paolo Colciaghi, Yifan Li, Ph… [+2618 chars]"}, {"source": {"id": null, "name": "Observervoice.com"}, "author": "OV Digital Desk", "title": "13 June: Anniversary of Asteroid Explorer Hayabusa Returns - Observer Voice", "description": "Hayabusa, also known as Hayabusa 1 or Hayabusa-MUSES-C, was a Japanese space probe designed to study the asteroid Itokawa.", "url": "https://observervoice.com/13-june-anniversary-of-asteroid-explorer-hayabusa-returns-25679/", "urlToImage": "https://observervoice.com/wp-content/uploads/2023/06/Asteroid-Explorer-Hayabusa.jpg", "publishedAt": "2023-06-12T12:54:23Z", "content": "Hayabusa, also known as Hayabusa 1 or Hayabusa-MUSES-C, was a Japanese space probe designed to study the asteroid Itokawa. It was launched by the Japan Aerospace Exploration Agency (JAXA) on May 9, 2… [+2902 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sanjana Shankar", "title": "China plans to launch a Moon-orbiting telescope by 2026 - NewsBytes", "description": "China has come up with a rather novel idea to study the Moon", "url": "https://www.newsbytesapp.com/news/science/china-to-launch-moon-orbiting-telescope-by-2026/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l11320230612181703.jpeg", "publishedAt": "2023-06-12T12:47:30Z", "content": "TechnologyChina plans to launch a Moon-orbiting telescope by 2026\r\nThe constellation of satellites will circle the Moon in the same orbit (Photo credit: ESA)\r\nChina has come up with a rather novel id… [+3089 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "Could Our Next Home Be Just 4 Light Years Away? Astronomers find Proxima b Showing Promising Signs! - Times Now", "description": "Astrological breakthrough suggests Proxima b, our celestial neighbor, may be more than just a dry rock in space. New findings indicate vast oceans could exist, potentially supporting life.", "url": "https://www.timesnownews.com/technology-science/could-our-next-home-be-just-4-light-years-away-astronomers-find-proxima-b-showing-promising-signs-article-100941178", "urlToImage": "https://static.tnn.in/thumb/msid-100941178,updatedat-1686573439318,width-1280,height-720,resizemode-75/100941178.jpg", "publishedAt": "2023-06-12T12:37:19Z", "content": "Horoscope Today, June 14, 2023: Aries Should Be Careful While Communicating, Virgo will See Financial Benefits"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of Central Florida Researcher Unveils Prime Findings About Asteroid Dinkinesh, A Target Of NASA’s Lucy Mission - India Education Diary", "description": "AUniversity of Central Florida researcher is part of a team that recently discovered significant insights into the size and surface composition of Dinkinesh, an asteroid that NASA’s Lucy mission will visit in November.Using observations from telescop", "url": "https://indiaeducationdiary.in/university-of-central-florida-researcher-unveils-prime-findings-about-asteroid-dinkinesh-a-target-of-nasas-lucy-mission/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/dinkinesh_for_web-1024x683.webp", "publishedAt": "2023-06-12T11:24:38Z", "content": "AUniversity of Central Florida researcher is part of a team that recently discovered significant insights into the size and surface composition of Dinkinesh, an asteroid that NASAs Lucy mission will … [+3147 chars]"}, {"source": {"id": null, "name": "Advanced Science News"}, "author": "Andrey Feldman", "title": "Scientists detect the X-ray signature of a single atom - Advanced Science News", "description": "A new technique can detect the X-ray signature of an individual atom, even determining the structure of its electron orbits.", "url": "https://www.advancedsciencenews.com/scientists-detect-the-x-ray-signature-of-a-single-atom/", "urlToImage": "https://www.advancedsciencenews.com/wp-content/uploads/2023/06/physics-g0f8d8458f_1280.jpg", "publishedAt": "2023-06-12T11:24:34Z", "content": "Since their discovery by Wilhelm Conrad Roentgen in 1895, X-rays have found extensive application in various scientific, industrial, and technological fields. This widespread utilization stems from t… [+5775 chars]"}, {"source": {"id": null, "name": "Snexplores.org"}, "author": null, "title": "This ancient bird rocked a head like a T. rex - Science News Explores", "description": "This bird from 120 million years ago had a head like a dinosaur and a body more like today’s birds.", "url": "https://www.snexplores.org/article/this-ancient-bird-rocked-a-head-like-a-t-rex", "urlToImage": "https://www.snexplores.org/wp-content/uploads/2023/01/011923_at_thero-bird_feat.jpg", "publishedAt": "2023-06-12T10:30:00Z", "content": "3-D: Short for three-dimensional. This term is an adjective for something that has features that can be described in three dimensions  height, width and length. \r\nancestor: A predecessor. It could be… [+5207 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Insights Into Molecular Mechanisms Controlling Chromosome Movement During Cell Division - Technology Networks", "description": "A team uncover the molecular details of how a crucial protein facilitates proper chromosome movement when our cells divide.", "url": "https://www.technologynetworks.com/cell-science/news/new-insights-into-molecular-mechanisms-controlling-chromosome-movement-during-cell-division-374560", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374560/new-insights-into-molecular-mechanisms-controlling-chromosome-movement-during-cell-division-374560-640x360.jpg?cb=20230612", "publishedAt": "2023-06-12T09:56:15Z", "content": "During cell division, chromosomes, i.e., molecules containing our genetic material, must be properly replicated and segregated so that each daughter cell receives a complete and accurate set. Now, in… [+3366 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Giants of the jurassic seas were twice as large as killer whales - Tech Explorist", "description": "Paleontologists have discovered that a pliosaur could have grown to 14.4 metres.", "url": "https://www.techexplorist.com/giants-jurassic-seas-twice-as-large-as-killer-whales/61969/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/dinasaur.jpg", "publishedAt": "2023-06-12T09:32:29Z", "content": "A 25-meter-long Liopleurodon was displayed on the BBC’s Walking with Dinosaurs TV documentary series more than 20 years ago. The size of this pliosaur was hotly contested because it was believed to h… [+3396 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Human body to stretch like a `long pasta` if Earth falls into black hole, claim scientists - WION", "description": "Human body to stretch like a long pasta if Earth falls into black hole, claim scientists", "url": "https://www.wionews.com/science/human-body-to-stretch-like-a-long-pasta-if-earth-falls-into-black-hole-claim-scientists-603408", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/12/358796-untitled-design-2023-06-12t145103088.png", "publishedAt": "2023-06-12T09:21:19Z", "content": "The scientists have claimed that if Earth ever fell into a black hole the scariest feature of the universe which has such intense gravity that even light fails to get out then the human body is likel… [+2716 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Jupiter's moons to supermassive black holes: What will James Webb Telescope observe next? - India Today", "description": "Astronomers are now excited about the second year of the observatory in space as Cycle-2 begins on July 1.", "url": "https://www.indiatoday.in/science/story/what-will-james-webb-telescope-observe-next-2391962-2023-06-12", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/cosmic_cliffs-sixteen_nine.jpg?VersionId=sd0asV7rxq41ytG4Monq1bqc9bN91giN", "publishedAt": "2023-06-12T08:32:25Z", "content": "By India Today Science Desk: The James Webb Space Telescope (JWST) has emerged as the biggest asset Earth has outside the planet. Located at Lagrange Point 2 nearly 15,00,000 kilometers away from the… [+2638 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Aditya Saikrishna", "title": "Unravelling the Freezing Paradox: Scientists Shed Light on a Mind-Boggling Phenomenon - Transcontinental Times", "description": "INDIA: Scientists have long been intrigued by the Freezing Paradox, a baffling phenomenon that challenges our understanding of the physical world. Recently, researchers from leading institutions around the globe have made significant strides in unravelling th…", "url": "https://www.transcontinentaltimes.com/unravelling-the-freezing-paradox/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Freezing-Paradox.jpg", "publishedAt": "2023-06-12T07:21:19Z", "content": "INDIA: Scientists have long been intrigued by the Freezing Paradox, a baffling phenomenon that challenges our understanding of the physical world. Recently, researchers from leading institutions arou… [+3343 chars]"}]}