{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Getty Images", "title": "As temperatures rise, NASA set to track climate change - Global temperatures rise - Economic Times", "description": "A record hot June and an already-hotter July, paired with wildfires, flooding, heatwaves, have made millions of people over the globe experience the effects of extreme weather. While June already set a record, July is likely to be the warmest absolute month o…", "url": "https://economictimes.indiatimes.com/news/science/as-temperatures-rise-nasa-set-to-track-climate-change/global-temperatures-rise/slideshow/102044776.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102044776,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-22T18:47:00Z", "content": "Carrier 1.5 Ton 3 Star AI Flexicool Inverter Split AC (Copper, Convertible 4-in-1 Cooling,High Density Filter, Auto Cleanser, 2023 Model,ESTER Exi - CAI18ER3R32F0,White)\r\nBuy Now"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "300,000-Year-Old Weapon Reveals Early Humans Were Woodworking Masters - SciTechDaily", "description": "New research on a 300,000-year-old throwing stick reveals advanced woodworking techniques among early humans, suggesting communal hunting practices involving the whole community. The artifact, demonstrating high craftsmanship, indicates early humans' deep kno…", "url": "https://scitechdaily.com/300000-year-old-weapon-reveals-early-humans-were-woodworking-masters/", "urlToImage": "https://scitechdaily.com/images/Early-Humans-Throwing-Stick-Weapon.jpg", "publishedAt": "2023-07-22T16:51:42Z", "content": "Artistic reconstruction showing the stick would have been thrown. Credit: Benoit Clarys\r\nNew research on a 300,000-year-old throwing stick reveals advanced woodworking techniques among early humans, … [+3738 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Louisiana Students to Hear from NASA Astronauts Aboard Space Station - India Education Diary", "description": "As part of the state’s first Earth-to-space call, students from Louisiana will have an opportunity soon to hear from NASA astronauts aboard the International Space Station. NASA astronauts Frank Rubio and Woody Hoburg will answer prerecorded que", "url": "https://indiaeducationdiary.in/louisiana-students-to-hear-from-nasa-astronauts-aboard-space-station/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2023-07-22T15:50:19Z", "content": "As part of the states first Earth-to-space call, students from Louisiana will have an opportunity soon to hear from NASA astronauts aboard the International Space Station.\r\nNASA astronauts Frank Rubi… [+1630 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Warning: GPS Data Could Detect Large Earthquakes Hours Before They Happen - SciTechDaily", "description": "A systematic global analysis of GPS time-series data from nearly 100 large earthquakes suggests the existence of a precursory phase of fault slip that occurs about two hours before seismic rupture. The analysis of Global Positioning System (GPS) time-series d…", "url": "https://scitechdaily.com/early-warning-gps-data-could-detect-large-earthquakes-hours-before-they-happen/", "urlToImage": "https://scitechdaily.com/images/GPS-Earthquake-Art.jpg", "publishedAt": "2023-07-22T15:41:50Z", "content": "ByWalter Beckwith, American Association for the Advancement of Science (AAAS)July 22, 2023\r\nA comprehensive analysis of GPS time-series data suggests a precursory phase of fault slip occurs two hours… [+3751 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study gives more insight into treatment of schistosomias - ANI News", "description": "The schistosomiasis worms (Schistosoma mansoni) are uncommon in a number of aspects, most notably the requirement that male and female adults remain partnered throughout their lives in order for reproduction to be effective. As many as 3,000 eggs might be lai…", "url": "https://www.aninews.in/news/science/study-gives-more-insight-into-treatment-of-schistosomias20230722210048", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230722143218.jpg", "publishedAt": "2023-07-22T15:33:19Z", "content": "Washington [US], July 22 (ANI): The schistosomiasis-worms\"&gt;schistosomiasis worms (Schistosoma mansoni) are uncommon in a number of aspects, most notably the requirement that male and female adults… [+4247 chars]"}, {"source": {"id": null, "name": "Kuwaittimes.com"}, "author": "Rajesh", "title": "Asteroid-smashing NASA probe sent boulders into space - Kuwait Times", "description": "When a NASA spacecraft successfully knocked an asteroid off course last year it sent dozens of boulders skittering into space, images from the Hubble telescope showed on Thursday. NASA’s fridge-sized", "url": "https://www.kuwaittimes.com/asteroid-smashing-nasa-probe-sent-boulders-into-space/", "urlToImage": "https://www.kuwaittimes.com/wp-content/uploads/2023/07/15948.jpg", "publishedAt": "2023-07-22T15:13:07Z", "content": "When a NASA spacecraft successfully knocked an asteroid off course last year it sent dozens of boulders skittering into space, images from the Hubble telescope showed on Thursday. NASAs fridge-sized … [+2111 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "North America and Asia might collide to form next supercontinent on Earth, predicts scientist - WION", "description": "North America and Asia might collide to form next supercontinent on Earth, predicts scientist", "url": "https://www.wionews.com/science/north-america-and-asia-might-collide-to-form-next-supercontinent-on-earth-predicts-scientist-618490", "urlToImage": "https://cdn.wionews.com/sites/default/files/2023/07/22/368815-960x0.jpg", "publishedAt": "2023-07-22T14:45:56Z", "content": "Today, we have seven continents, but an intriguing future awaits us. \r\nGeophysicist Ross Mitchell has recently unveiled his new book: \"The Next Supercontinent\" in which he talks about not only the pa… [+2228 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "More species of dinosaurs are to be discovered that have already been found - Interesting Engineering", "description": "Paleontologists say many more fossils of dinosaurs are buried underground than have been uncovered thus far and most of them belong to an entirely new species.", "url": "https://interestingengineering.com/science/more-species-of-dinosaurs-are-to-be-discovered-that-have-already-been-found", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/22/image/jpeg/TcAlZYZvMZB6PjSu8GZ1feiiE2MzqCPrYQnGZOzD.jpg", "publishedAt": "2023-07-22T13:38:00Z", "content": "Of course there are more groups out there, told the Smithsonian New York Institute of Technology paleontologist Karen Poole.\r\nA 2006 study speculated that to date paleontologists had found less than … [+1212 chars]"}, {"source": {"id": null, "name": "Theindianpanorama.news"}, "author": "@theindpanorama", "title": "Anti-ageing function of human cell protein discovered - The Indian Panorama", "description": "Health | Researchers have found an anti-ageing function in a protein deep within human cells. The protein, ATSF-1, controlled the fine balance between creation of", "url": "https://www.theindianpanorama.news/health/anti-ageing-function-of-human-cell-protein-discovered/", "urlToImage": "https://www.theindianpanorama.news/wp-content/uploads/2023/07/anti.jpg", "publishedAt": "2023-07-22T13:29:49Z", "content": "Researchers have found an anti-ageing function in a protein deep within human cells. The protein, ATSF-1, controlled the fine balance between creation of new and repair of damaged mitochondria, the p… [+1592 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Foundational Species: How Eelgrass Spread Around the World - SciTechDaily", "description": "An international research team led by GEOMAR reconstructs the worldwide colonization history of the most widespread marine plant. Seagrasses evolved from freshwater plants and use sunlight and carbon dioxide (CO2) for photosynthesis. They are able to thrive i…", "url": "https://scitechdaily.com/foundational-species-how-eelgrass-spread-around-the-world/", "urlToImage": "https://scitechdaily.com/images/Eelgrass-Seagrass-Illustration.jpg", "publishedAt": "2023-07-22T13:11:43Z", "content": "ByHelmholtz Centre for Ocean Research Kiel (GEOMAR)July 22, 2023\r\nScientists traced the colonization history of eelgrass using nuclear and chloroplast genomes from 200 individuals across 16 locations… [+8011 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Massive, Cloud-Like Planet Discovered That's as Fluffy as Cotton Candy - ScienceAlert", "description": "The galaxy can throw some odd curveballs, but an exoplanet discovered 1,232 light-years away is one of the oddest yet.", "url": "https://www.sciencealert.com/massive-cloud-like-planet-discovered-thats-as-fluffy-as-cotton-candy", "urlToImage": "https://www.sciencealert.com/images/2023/07/cotton-candy-world.jpg", "publishedAt": "2023-07-22T12:31:18Z", "content": "The galaxy can throw some odd curveballs, but an exoplanet discovered 1,232 light-years away is one of the oddest yet.\r\nIt's WASP-193b, and while it's nearly 50 percent bigger than Jupiter, it's so l… [+3416 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Scientists Advocate Planetary Geoarchaeology Amidst New Space Race | Weather.com - The Weather Channel", "description": "With the new space era, the material record on the Moon is rapidly becoming at risk of being destroyed.", "url": "https://weather.com/en-IN/india/space/news/2023-07-22-scientists-advocate-planetary-geoarchaeology-amidst-new-space-race", "urlToImage": "https://s.w-x.co/in-moon_lander.jpg", "publishedAt": "2023-07-22T12:19:00Z", "content": "As a new space race heats up, scientists have proposed planetary geoarchaeology the study of how cultural and natural processes on Earth's moon, on Mars and across the solar system may be altering, p… [+2122 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Matter Breakthrough: Researchers Uncover Unique Quantum Behavior - SciTechDaily", "description": "Researchers from EPFL have discovered a new way to create a crystalline structure called a \"density wave\" in an atomic gas. This breakthrough can help us better understand the behavior of quantum matter, one of the most complex problems in physics. “Cold atom…", "url": "https://scitechdaily.com/quantum-matter-breakthrough-researchers-uncover-unique-quantum-behavior/", "urlToImage": "https://scitechdaily.com/images/Density-Wave-scaled.jpg", "publishedAt": "2023-07-22T11:32:24Z", "content": "A team of scientists has doubled the manipulative potential of cold atomic gases, creating a new type of matter. This breakthrough could advance quantum technology by stimulating density waves in a s… [+2586 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University Of Freiburg Experts Find Hidden Particle Interactions At The Cell Surface - India Education Diary", "description": "Is it possible that in most measurements in the field of life sciences, important interactions remain hidden inside the cell or at the cell surface? This question has puzzled the team of laser- and bio-physicist Prof. Dr. Alexander Rohrbach from the", "url": "https://indiaeducationdiary.in/university-of-freiburg-experts-find-hidden-particle-interactions-at-the-cell-surface/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/1519797914815-1-1024x683.jpg", "publishedAt": "2023-07-22T10:34:39Z", "content": "Is it possible that in most measurements in the field of life sciences, important interactions remain hidden inside the cell or at the cell surface? This question has puzzled the team of laser- and b… [+4956 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "NASA's rover photo shows water once absolutely gushed on Mars - Mashable", "description": "The Red Planet didn't just have a little water. It had roaring rivers.", "url": "https://mashable.com/article/mars-rover-perseverance-water", "urlToImage": "https://helios-i.mashable.com/imagery/articles/00P2lrrPu1TxUVDypHzETMU/hero-image.fill.size_1200x675.v1689871376.jpg", "publishedAt": "2023-07-22T10:00:00Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This 2-faced white dwarf star defies astrophysical norms - HT Tech", "description": "Meet Janus, the enigmatic white dwarf star with 2 faces – one hydrogen-dominant, the other helium-graced. Its magnetic field holds the key to this celestial oddity.", "url": "https://tech.hindustantimes.com/tech/news/this-2-faced-white-dwarf-star-defies-astrophysical-norms-71690019354818.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/22/1600x900/Janus__1690019542809_1690019543131.jpg", "publishedAt": "2023-07-22T09:53:44Z", "content": "Behold Janus, a celestial enigma that defies conventional norms! Unlike the figurative phrase denoting two-facedness, this white dwarf star embodies the very essence of duality, quite literally. Draw… [+2026 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Into the Unknown: NASA's GEDI Space Laser Provides Answers to Rainforest Canopy Mystery - SciTechDaily", "description": "NASA's GEDI, a space laser, has provided a groundbreaking, detailed structural view of the world's rainforests, enabling researchers to further understand these complex ecosystems. Uncovering the Secrets of Rainforest Canopies We know less about the rainfores…", "url": "https://scitechdaily.com/into-the-unknown-nasas-gedi-space-laser-provides-answers-to-rainforest-canopy-mystery/", "urlToImage": "https://scitechdaily.com/images/Lasers-Measuring-Rainforest.jpg", "publishedAt": "2023-07-22T09:12:20Z", "content": "ByNorthern Arizona UniversityJuly 22, 2023\r\nNASAs space laser, GEDI, has revolutionized our understanding of rainforests, revealing a simpler structure with a peak leaf concentration at 15 meters. Th… [+6748 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telangana Today", "title": "Chemical Cocktails Invented To Reverse Our Age In A Week | Research On Human Reverse Aging - Telangana Today", "description": "Preparations for human clinical trials of first-age reversal gene therapy are ongoing.", "url": "https://telanganatoday.com/chemical-cocktails-invented-to-reverse-our-age-in-a-week-research-on-human-reverse-aging", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2023/07/Chemical-Cocktails-Invented-To-Reverse-Our-Age-In-A-Week-Research-On-Human-Reverse-Aging.jpg", "publishedAt": "2023-07-22T08:45:33Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Reprogramming form of virus capsids could help in progress of biomedicine: Research - ETHealthWorld", "description": "The resultant nanostructures may be used in vaccine development and medicine delivery inside the body.Virus capsid proteins-the proteins that shield the genome of a virus-can be used to build precisely structured protein assemblies.", "url": "https://health.economictimes.indiatimes.com/news/industry/reprogramming-form-of-virus-capsids-could-help-in-progress-of-biomedicine-research/102034614", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-102034614,imgsize-11038,width-1200,height=765,overlay-ethealth/industry/reprogramming-form-of-virus-capsids-could-help-in-progress-of-biomedicine-research.jpg", "publishedAt": "2023-07-22T07:40:14Z", "content": "Washington DC: Bioengineers have developed a method to regulate the size and shape of virus particles by combining viral protein building blocks with DNA templates.The resultant nanostructures may be… [+3031 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Rare Fossil Shows Ancient Mammal Digging Its Teeth Into a Dinosaur 3x Its Size! | Weather.com - The Weather Channel", "description": "The fossil of the two animals intimately intertwined in a mortal combat is among the first evidence to show actual predatory behaviour by a mammal on a dinosaur. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/science/news/2023-07-21-fossil-of-ancient-mammal-preying-on-a-dinosaur", "urlToImage": "https://s.w-x.co/in-mortal_combat.jpg", "publishedAt": "2023-07-22T07:26:32Z", "content": "Anybody who thinks smaller mammals dont stand a chance against larger predators has clearly never watched that one video of a housecat casually slapping away a gator at least five times its size. And… [+2919 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals how monitoring brain waves reduces post-op complications - ThePrint", "description": "Washington [US], July 22 (ANI): Brain wave characteristics were discovered in a recent study that looked at the EEG patterns of patients under anaesthesia. These findings may help anesthesiologists recognise when patients are entering that deeper degree of un…", "url": "https://theprint.in/health/study-reveals-how-monitoring-brain-waves-reduces-post-op-complications/1681249/", "urlToImage": null, "publishedAt": "2023-07-22T07:14:53Z", "content": "One of these different patterns was discovered in the brain’s alpha waves (which have a frequency ranging from eight to fourteen cycles per second). When patients were unconscious, the magnitude of t… [+4918 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "NASA's mesmerizing Saturn images ignite cosmic wonder among netizens - The Economic Times", "description": "NASA's Cassini spacecraft has captured stunning images of Saturn and its enchanting moons, leaving viewers in awe and wonder. One striking photo shows Saturn with its majestic rings appearing as a delicate line across its yellow surface, with Mimas accompanyi…", "url": "https://economictimes.indiatimes.com/news/new-updates/nasas-mesmerizing-saturn-images-ignite-cosmic-wonder-among-netizens/articleshow/102034004.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102033987,width-1070,height-580,imgsize-14822,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-22T07:14:04Z", "content": "A stunning release of images featuring Saturn and its enchanting moons by NASA has left the online community in awe and wonder, prompting contemplation about our place in the vast cosmos. The mesmeri… [+1704 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Massive $10 quintillion metal-rich asteroid draws closer to US reach: Report | Mint - Mint", "description": "NASA is less than 100 days away from launching a spacecraft to study asteroid 16 Psyche, estimated to be worth $10 quintillion. The spacecraft will launch in October using a SpaceX Falcon Heavy rocket and spend 26 months in orbit around the asteroid.", "url": "https://www.livemint.com/science/news/massive-10-quintillion-metal-rich-asteroid-draws-closer-to-us-reach-report-11690005818765.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/07/22/600x338/asteroid_1675756353876_1690006489758.png", "publishedAt": "2023-07-22T06:15:46Z", "content": "NASA informed on Friday that it is less than 100 days from the launch of a spacecraft aimed at studying an asteroid with an estimated value of $10 quintillion. As reported by Business Insider, the Je… [+2166 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Mysterious Black Stone Falls From Sky, Hits Woman On French Terrace - News18", "description": "In a mysterious set of events, a black rock from the sky fell into a woman's cup when she was having coffee on her terrace.", "url": "https://www.news18.com/viral/mysterious-black-stone-falls-from-sky-hits-woman-on-french-terrace-8397097.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/07/untitled-design-2023-07-22t104608.632-169000297816x9.jpg", "publishedAt": "2023-07-22T05:17:23Z", "content": "A seemingly ordinary coffee gathering on a terrace turned into a bizarre and extraordinary incident in France on July 6. According to a report by Newsweek, a woman and her friend were leisurely sippi… [+2634 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "SpaceX targets Saturday launch for 22 Starlink Satellites - Devdiscourse", "description": "Read more about SpaceX targets Saturday launch for 22 Starlink Satellites on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2532851-spacex-targets-saturday-launch-for-22-starlink-satellites", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_05_2022_10_26_20_6709552.jpg?width=920&format=jpeg", "publishedAt": "2023-07-22T05:08:45Z", "content": "SpaceX is gearing up for another Falcon 9 launch of 22 Starlink satellites to low-Earth orbit. The mission is set to lift off on Saturday, July 22 at 7:34 p.m. ET (23:34 UTC), from Space Launch Compl… [+1360 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "BESSY II: Surface analysis of catalyst particles in aqueous solutions - EurekAlert", "description": "Hematite and anatase in suspension are photocatalytic model systems. They are ideal for studying the solid/electrolyte interface at the molecular level and for exploring the chemical reactions at electrode-electrolyte interfaces. With a liquid-jet-experiment …", "url": "https://www.eurekalert.org/news-releases/996369", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/7b785509-7224-43b2-9c37-0f34d2af999f/Rendition/thumbnail/Content/Public", "publishedAt": "2023-07-22T02:00:12Z", "content": "image: The microjet is a fast-flowing stream of liquid so narrow that it produces only an extremely dilute vapour cloud. Photons and particles can reach and leave the surface of the jet without colli… [+4521 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Dorminey", "title": "E.T. Might Even Harness Nearby Red Dwarfs Using Dyson Spheres - Forbes", "description": "Swedish astronomers continue the hunt for hypothetical Dyson spheres. Such alien-built spheres would be capable of completely harnessing a whole star’s energy.", "url": "https://www.forbes.com/sites/brucedorminey/2023/07/21/et-might-even-harness-nearby-red-dwarfs-using-dyson-spheres/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64bb17e8a971dd720dd98952/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-07-22T00:07:14Z", "content": "Dyson sphere. Alien mega structure around a star.\r\ngetty\r\nIf extraterrestrial intelligent life is out there - and everybody and their brother now seems to think so - it could hypothetically be as muc… [+4180 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Chinese Society for Environmental Sciences", "title": "Recent Research Reveals Possible Arsenic Release from Sediment due to Organic Matter Influence - Newswise", "description": "Chinese Researchers Investigate Arsenic Mobilization Factors and Microbial Impact", "url": "https://www.newswise.com/articles/recent-research-reveals-possible-arsenic-release-from-sediment-due-to-organic-matter-influence", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-07-21T20:35:00Z", "content": "Newswise — Researchers from the Chinese Research Academy of Environmental Sciences have conducted a study\r\n to assess the impact of environmental factors and microbial communities on the mobilization… [+3244 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jennifer Nalewicki", "title": "Chile's Atacama Desert is the sunniest spot on Earth, catching as many rays as Venus - Livescience.com", "description": "Scientists have identified Earth's sunniest spot, and it has the same radiation as Venus.", "url": "https://www.livescience.com/planet-earth/chiles-atacama-desert-is-the-sunniest-spot-on-earth-catching-as-many-rays-as-venus", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BJzFNN8sr7jnV7gSPTBRd9-1200-80.jpg", "publishedAt": "2023-07-21T20:23:41Z", "content": "The sunniest spot on Earth is the Altiplano of the Atacama Desert, an arid plateau near the Andes mountains in Chile that receives as much sunshine as Venus\r\n.\r\nWhile normally cold and dry, this sunn… [+2793 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Runs Dress Rehearsal in Advance of Asteroid Sample Return - Gizmodo", "description": "The asteroid sample return mission is scheduled to drop off pieces of a space rock in September.", "url": "https://gizmodo.com/nasa-rehearsal-asteroid-sample-osiris-rex-bennu-1850664789", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/3d5a5fe2e3466ea5fc2ef17f13bee049.jpg", "publishedAt": "2023-07-21T19:30:00Z", "content": "After landing on an asteroid nearly three years ago to scoop up a sample from its rocky surface, the OSIRIS-REx mission is finally in the homestretch. NASA is preparing for the special delivery of th… [+2581 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Climate change may be changing the color of Earth's oceans - Space.com", "description": "\"To actually see it happening for real is not surprising, but frightening.\"", "url": "https://www.space.com/earth-oceans-change-color-climate-change", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QKbjY4SUaYHfGDtzXCrsih-1200-80.png", "publishedAt": "2023-07-21T18:30:00Z", "content": "The color of Earth's oceans has changed significantly over the past two decades, and these shifts are the result of human-driven climate change. They cannot be explained by natural variability alone … [+5490 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Scott Alan Johnston", "title": "China is Working on a New Crew Spacecraft to Carry Up to 7 Passengers - Universe Today", "description": "China’s next-generation crew capsule was given an updated timeline this week. According to Yang Liwei, deputy chief designer of China’s Human Spaceflight Program, the new capsule will make its first flight in 2027 or 2028.  Meeting this timeline will be a key…", "url": "https://www.universetoday.com/162484/china-is-working-on-a-new-crew-spacecraft-to-carry-up-to-7-passengers/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/07/CCTV.jpg", "publishedAt": "2023-07-21T18:01:57Z", "content": "Chinas next-generation crew capsule was given an updated timeline this week. According to Yang Liwei, deputy chief designer of China’s Human Spaceflight Program, the new capsule will make its first f… [+3071 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "SPbPU experts have improved technology to combat cancer - India Education Diary", "description": "A scientific team from the Institute of Biomedical Systems and Biotechnologies of SPbPU has increased the effectiveness of photothermal therapy in the treatment of malignant tumors. The scientists proposed simultaneous application of selenium and gol", "url": "https://indiaeducationdiary.in/spbpu-experts-have-improved-technology-to-combat-cancer/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/07/1-2-1024x683.jpg", "publishedAt": "2023-07-21T17:19:23Z", "content": "A scientific team from the Institute of Biomedical Systems and Biotechnologies of SPbPU has increased the effectiveness of photothermal therapy in the treatment of malignant tumors. The scientists pr… [+2003 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Massive Relic Galaxy Without Dark Matter Puzzles Astronomers - IFLScience", "description": "The discovery of the object challenges some of the expectations of cosmology.", "url": "https://www.iflscience.com/massive-relic-galaxy-without-dark-matter-puzzles-astronomers-69941", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69941/aImg/69487/scale-meta.jpg", "publishedAt": "2023-07-21T16:20:28Z", "content": "Our understanding of the universe is incomplete. The best model we have requires the existence of two substances we have yet to prove to exist: dark energy and dark matter. While that is less than id… [+2706 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storms that plagued the Earth this week: Massive solar flare eruption, 2 CME strikes, more - HT Tech", "description": "This was one of the most chaotic weeks in a long time, with two separate CME strikes, and a long-duration solar flare eruption, and a menacing sunspot facing the Earth.", "url": "https://tech.hindustantimes.com/photos/solar-storms-that-plagued-the-earth-this-week-massive-solar-flare-eruption-2-cme-strikes-geomagnetic-storm-sunspot-71689953840023.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/21/1600x900/northern-lights-984120_1920_1632829433522_1689954173264.jpg", "publishedAt": "2023-07-21T15:54:49Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "Oneindia.com"}, "author": null, "title": "Life on Mars: The story so far | Making Mars habitable for human life - Oneindia", "description": "Mars, our closest neighbour in the Solar System has been long speculated to harbour life creating environment. But no life has been found yet on the red planet. Does that mean life cannot be possible on it? Well the answer to this question is not simple. For …", "url": "https://www.oneindia.com/videos/life-on-mars-the-story-so-far-making-mars-habitable-for-human-life-3927468.html", "urlToImage": "https://www.oneindia.com/image/560x292x81/2023/07/4266726147-life-on-mars-the-story-so-far-making-mars-habitable-for-human-life-in-depth.jpg", "publishedAt": "2023-07-21T15:16:57Z", "content": "SettingsX\r\nSettingsX"}, {"source": {"id": null, "name": "Innovationnewsnetwork.com"}, "author": null, "title": "Assessing the role of cosmic dust aggregates in planet formation - Innovation News Network", "description": "Learn more about how the collision and sticking of large cosmic dust aggregates could play a crucial role in planet formation.", "url": "https://www.innovationnewsnetwork.com/assessing-the-role-of-cosmic-dust-aggregates-in-planet-formation/35216/", "urlToImage": "https://www.innovationnewsnetwork.com/wp-content/uploads/2023/07/shutterstockJurik-Peter_1716048040.jpg", "publishedAt": "2023-07-21T14:14:07Z", "content": "Current theories suggest that cosmic dust aggregates collide and stick together to form larger dust aggregates that may eventually combine and form into planets.\r\nTherefore, numerical models that cha… [+3019 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Astronomers find new type of stellar object that challenges understanding of neutron star physics - WION", "description": "Here, we bring you the news that is trending across WION's social media platforms- Astronomers have discovered a new type of stellar object that could change...", "url": "https://www.youtube.com/watch?v=lhczXRMLZNA", "urlToImage": "https://i.ytimg.com/vi/lhczXRMLZNA/maxresdefault.jpg", "publishedAt": "2023-07-21T14:00:02Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "COVID-19 shutdown highlights air quality policy challenges - Phys.org", "description": "In a study conducted in NYC during the COVID-19 pandemic, researchers found that air quality policies focusing on reducing pollutant emissions from the transportation sector have made significant strides. However, the study also revealed some concerning trend…", "url": "https://phys.org/news/2023-07-covid-shutdown-highlights-air-quality.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/air-quality.jpg", "publishedAt": "2023-07-21T13:58:02Z", "content": "In a study conducted in NYC during the COVID-19 pandemic, researchers found that air quality policies focusing on reducing pollutant emissions from the transportation sector have made significant str… [+2051 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Where did the stars go? - The Planetary Society", "description": "Link to full article: https://www.planetary.org/articles/why-are-there-no-starsLook up at space at night from a dark location and you can see innumerable sta...", "url": "https://www.youtube.com/watch?v=hxwWfJQjyx0", "urlToImage": "https://i.ytimg.com/vi/hxwWfJQjyx0/maxresdefault.jpg", "publishedAt": "2023-07-21T13:57:58Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Hubble Images a Starstruck Galaxy - NASA", "description": "The irregular galaxy Arp 263 lurks in the background of this image from the NASA/ESA Hubble Space Telescope, but the view is dominated by a stellar photobomber.", "url": "https://www.nasa.gov/image-feature/goddard/2023/hubble-images-a-starstruck-galaxy", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/potw2329a.jpg", "publishedAt": "2023-07-21T12:30:15Z", "content": null}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Abhinav Singh", "title": "What makes Aditya L1 mission to Sun by ISRO special? - The Week", "description": "It will be the first of its kind to study and research the Sun's atmosphere", "url": "https://www.theweek.in/news/sci-tech/2023/07/21/what-makes-aditya-l1-mission-to-sun-by-isro-special.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/May/Closeup-of-the-Sun-NASA-shut.jpg", "publishedAt": "2023-07-21T12:26:55Z", "content": "India's first solar mission, ISRO's Aditya L1 spacecraft, named after one of the Sanskrit names of the Sun, will be launched by the PSLV-XL launch vehicle on August 26, 2023, from the Satish Dhawan S… [+4647 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Scientists identify key genes that initiate embryo development in mice - Interesting Engineering", "description": "Scientists have identified the OBOX gene family as a plausible candidate.", "url": "https://interestingengineering.com/science/scientists-identify-key-genes-that-initiate-embryo-development-in-mice", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/21/image/jpeg/Tx95f7pjKiJw8iDCB3DLGpwFssGAndb6y1JUJkxb.jpg", "publishedAt": "2023-07-21T11:40:00Z", "content": "The team found that embryo development stops at the two to four-cell stage without these genes. \r\nMost interesting, and unanticipated, was that the function of these OBOX genes was highly redundant: … [+1981 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "55% of Americans expect routine space tourism in next 50 years: Report - Daijiworld.com", "description": "Washington, Jul 21(IANS): More than half of US adults expect that people will routinely travel in space as tourists in the next 50 years, according to a new report released on Friday.\r\nThe Pew Research Center survey report, however, showed that Americans them…", "url": "https://daijiworld.com/index.php/news/newsDisplay?newsID=1102125", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-07-21T11:17:06Z", "content": "Washington, Jul 21(IANS): More than half of US adults expect that people will routinely travel in space as tourists in the next 50 years, according to a new report released on Friday.\r\nThe Pew Resear… [+2558 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Sanskar Tiwari", "title": "The Bohr Model of the Atom: Describing Electron Energy Levels in Hydrogen - News Track English", "description": "Understanding the structure of atoms is a fundamental concept in the field of chemistry. One of the significant advancements in this area is the Bohr Model, which revolutionized the way we comprehend electron energy levels in hydrogen atoms. In this article, …", "url": "https://english.newstracklive.com/news/the-bohr-model-of-the-atom-describing-electron-energy-levels-in-hydrogen-emc-sc71-nu384-ta384-1286541-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Jul/21/big_thumb/BOHR_64ba6318ec7fc.JPG", "publishedAt": "2023-07-21T10:57:04Z", "content": "Understanding the structure of atoms is a fundamental concept in the field of chemistry. One of the significant advancements in this area is the Bohr Model, which revolutionized the way we comprehend… [+3515 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "European satellite being made to crash intentionally on Earth - India Today", "description": "In a first-of-its-kind operation, ESA's spacecraft operators will soon intervene and attempt an assisted reentry.", "url": "https://www.indiatoday.in/science/story/european-satellite-being-made-to-crash-intentionally-on-earth-2409864-2023-07-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/media_bank/202307/aeolus-212839-16x9.jpg?VersionId=gxP1fxwcVFRkagwgg8_eqNjc2ec.dXOm", "publishedAt": "2023-07-21T10:36:14Z", "content": "By India Today Science Desk: The European Space Agency's (ESA) Aeolus wind satellite, after exceeding its planned life in orbit, is making its way back to Earth. The satellite, which has been orbitin… [+3238 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Natasha Rego", "title": "The giant next door: What clues does Jupiter hold to future of the solar system? - Hindustan Times", "description": "Elsewhere, gas giants occupy central positions; often, by pushing engulfing smaller planets. Is this where our solar system is headed? Or how it was formed?", "url": "https://www.hindustantimes.com/lifestyle/art-culture/jupiter-the-oldest-most-influential-and-intriguing-planet-in-the-solar-system-a-vacuum-cleaner-and-more-101689933440556.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/07/21/1600x900/A-close-up-of-Jupiter-s-south-pole-taken-by-NASA-s_1689933430233.jpg", "publishedAt": "2023-07-21T09:57:20Z", "content": "Jupiter is the oldest, most influential (being by far the biggest), and arguably the most intriguing planet in the neighbourhood. \r\nPREMIUMA close-up of Jupiters south pole taken by NASAs Juno Probe … [+4135 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Sanskar Tiwari", "title": "The Laws of Motion: Newtons Fundamental Principles Describing Object Behavior - News Track English", "description": "The Laws of Motion: Newton's Fundamental Principles Describing Object Behavior\r\n\r\nSir Isaac Newton, an eminent physicist and mathematician, revolutionized our understanding of the physical world with his groundbreaking laws of motion. These laws, collectively…", "url": "https://english.newstracklive.com/news/the-laws-of-motion-newtons-fundamental-principles-describing-object-behavior-emc-sc71-nu384-ta384-1286488-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Jul/21/big_thumb/3m_64ba51bcb4c99.JPG", "publishedAt": "2023-07-21T09:54:01Z", "content": "The Laws of Motion: Newton's Fundamental Principles Describing Object Behavior\r\nSir Isaac Newton, an eminent physicist and mathematician, revolutionized our understanding of the physical world with h… [+7826 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Witness the spectacular alignment of Mars, Venus, Mercury, and the crescent Moon today - IndiaTimes", "description": "Trending News: Today, an extraordinary celestial event is expected as Mars, Venus, and Mercury align with the cresc", "url": "https://timesofindia.indiatimes.com/etimes/trending/witness-the-spectacular-alignment-of-mars-venus-mercury-and-the-crescent-moon-today/articleshow/102010682.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-102010692,width-1070,height-580,imgsize-20812,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-07-21T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Early, energetic collisions could have driven volcanism on Venus - Devdiscourse", "description": "Read more about Early, energetic collisions could have driven volcanism on Venus  on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2531758-early-energetic-collisions-could-have-driven-volcanism-on-venus", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/14_09_2020_15_52_09_6139448.jpg?width=920&format=jpeg", "publishedAt": "2023-07-21T09:15:44Z", "content": "A new study has found that Earth's sister planet Venus likely experienced higher-speed, higher-energy impacts, creating a superheated core that fuelled volcanism and resurfaced the planet.\r\nA team le… [+1940 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": null, "title": "JWST detects carbon in early universe - NewsBytes", "description": "NASA's JWST detected significant carbon in the early universe, a billion years after the Big Bang. Contrary to expectations, heavier elements appear more widespread than previously believed.", "url": "https://www.newsbytesapp.com/visualstories/science/jwst-detects-carbon-in-early-universe", "urlToImage": "https://i.cdn.newsbytesapp.com/web/story168992826895858.jpg?tr=w-360", "publishedAt": "2023-07-21T08:34:25Z", "content": "JWST detects carbon in early universe"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Tourists Help Scientists Reveal Microplastic Pollution on Remote Arctic Beaches - Technology Networks", "description": "Tourists acting as citizen scientists have helped a research team detect microplastics on remote Arctic beaches, revealing concentrated areas of plastic pollution.", "url": "https://www.technologynetworks.com/applied-sciences/news/tourists-help-scientists-reveal-microplastic-pollution-on-remote-arctic-beaches-376562", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/376562/tourists-help-scientists-reveal-microplastic-pollution-on-remote-arctic-beaches-376562-640x360.jpg?cb=20230721", "publishedAt": "2023-07-21T08:27:08Z", "content": "Tourists acting as citizen scientists have helped a research team detect microplastics on remote Arctic beaches. The global scale of plastic production means that these tiny fragments of plastic are … [+4432 chars]"}, {"source": {"id": null, "name": "Atmos.earth"}, "author": "Atmos", "title": "Making Waves | Atmos - Atmos Magazine", "description": "Scientists have found evidence of a universal hum, thrumming around and within us—a cosmic sign of our interconnectedness.", "url": "https://atmos.earth/overview-universal-hum-making-waves/", "urlToImage": "https://atmos.earth/wp-content/uploads/2023/07/45426757602_6218bff488_o.png", "publishedAt": "2023-07-21T08:02:30Z", "content": "Over a century ago, Albert Einstein predicted the existence of gravitational wavesnearly imperceptible ripples in the fabric of space-time that travel unencumbered at the speed of light. It wasnt unt… [+3488 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "240-foot Asteroid 2023 NR1 rushing towards Earth at a fiery 54710 kmph, NASA warns - HT Tech", "description": "240foot Asteroid 2023 NR1 rushing towards Earth at a fiery 54710 kmph NASA warns NASA has warned that a massive 240foot wide Asteroid 2023 NR1 will make its closest approach towards Earth tomorrow. Is it a matter of concern NASA reveals. Generally most of the…", "url": "https://tech.hindustantimes.com/web-stories/240foot-asteroid-2023-nr1-rushing-towards-earth-at-a-fiery-54710-kmph-nasa-warns-71689943941001.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/21/1600x900/galaxy-4253100_640_1669619302531_Pixabay_1689943980279_1689943996414.jpg/", "publishedAt": "2023-07-21T07:28:29Z", "content": "Photo Credit: Pixabay\r\n NASA has warned that a massive 240-foot wide Asteroid 2023 NR1 will make its closest approach towards Earth tomorrow. Is it a matter of concern? NASA reveals. \r\nPhoto Credit: … [+1271 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Perseid Meteor Shower 2023: Check when, where and how to see it - WION", "description": "Perseid Meteor Shower 2023: Check when, where and how to see it", "url": "https://www.wionews.com/trending/perseid-meteor-shower-2023-check-when-where-and-how-to-see-it-618063", "urlToImage": "https://cdn.wionews.com/sites/default/files/2023/07/21/368553-perseids-meteor-shower.png", "publishedAt": "2023-07-21T06:45:06Z", "content": "Perseid Meteor Shower: Perseid meteor shower, one of the most dramatic views in the night sky, will be active between July 17 and August 24. It will peak on August 12 and 13. The high hourly rate and… [+2357 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "PLOS", "title": "Engineering plants for resilience to climate change - Tech Explorist", "description": "PLOS Biology explores plant engineering to improve climate resilience and carbon capture potential of crops.", "url": "https://www.techexplorist.com/engineering-plants-resilience-climate-change/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/Plants-hero.jpg", "publishedAt": "2023-07-21T06:23:53Z", "content": "Climate change is affecting the types of plant varieties we can cultivate, as well as how and where we can do so. A new collection of articles in the open access journal PLOS Biology explores the twi… [+4787 chars]"}, {"source": {"id": null, "name": "The Hitavada"}, "author": "The Hitavada", "title": "ISRO successfully performs fourth orbit-raising manoeuvre of Chandrayaan-3 spacecraft - The Hitavada", "description": "BENGALURU,THE Indian Space Research Organisation (ISRO) on Thursday successfully performed the fourth orbit-raising manoeuvre (Earth-bound perigee firing) of the Chandrayaan-3 spacecraft from the ISRO Telemetry, Tracking and Command Netw", "url": "https://www.thehitavada.com/Encyc/2023/7/21/ISRO-successfully-performs-fourth-orbit-raising-manoeuvre-of-Chandrayaan-3-spacecraft.html", "urlToImage": "https://www.thehitavada.com/Encyc/2023/7/21/ISRO-successfully_202307211106411241_H@@IGHT_300_W@@IDTH_500.jpg", "publishedAt": "2023-07-21T05:44:31Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "When Stars Fall Prey to Black Holes: Unraveling the Mystery of Tidal Disruption Events - SciTechDaily", "description": "The Universe is a violent place where here even a star's life can be cut short. This happens when a star finds itself in a \"bad\" neighborhood, specifically in the proximity of a supermassive black hole. These black holes, boasting mass that is millions or eve…", "url": "https://scitechdaily.com/when-stars-fall-prey-to-black-holes-unraveling-the-mystery-of-tidal-disruption-events/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Star-Tidal-Disruption-Event-TDE.jpg", "publishedAt": "2023-07-21T05:04:34Z", "content": "ByUniversity of TurkuJuly 20, 2023\r\nSupermassive black holes cause the disruption or destruction of nearby stars, resulting in Tidal Disruption Events (TDEs). Observations of polarized light from the… [+7042 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": null, "title": "Culture Re-View: The best culture inspired by the 1969 moon landing - Euronews", "description": "21 July 1969: One small step for man, one giant leap for culture", "url": "https://www.euronews.com/culture/2023/07/21/culture-re-view-the-best-culture-inspired-by-the-1969-moon-landing", "urlToImage": "https://static.euronews.com/articles/stories/07/76/70/78/1000x563_cmsv2_8537fc46-806f-5fd4-8546-e015dc8f3e25-7767078.jpg", "publishedAt": "2023-07-21T05:02:32Z", "content": "On this day in 1969, Neil Armstrong took his first steps on the moons surface. The Apollo 11 mission began on 16 July when Armstrong, Buzz Aldrin and Michael Collins were launched into space in the S… [+3585 chars]"}, {"source": {"id": null, "name": "Webindia123.com"}, "author": null, "title": "As Chandrayaan-3 braces to land on moon, here's why Pakistan lagged behind - webindia123", "description": "While Chandrayaan-3  Indias moon mission is paving its way through the space towards Moon, neighbouring country Pakistan is still struggling with a dwindling economy, the huge pile of debt and religious extremism-fuelled politics.", "url": "https://news.webindia123.com/news/articles/World/20230721/4100935.html", "urlToImage": null, "publishedAt": "2023-07-21T02:12:49Z", "content": "<tr><td></td></tr><tr><td>\r\nWhile Chandrayaan-3 Indias moon mission is paving its way through the space towards Moon, neighbouring country Pakistan is still struggling with a dwindling economy, the h… [+6708 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Shark shock – scientists discover filter-feeding basking sharks are warm-bodied like great whites - EurekAlert", "description": "Approximately 99.9% of fish and shark species are “cold-blooded”, meaning their body tissues generally match the temperature of the water they swim in – but researchers have just discovered the mighty basking shark is a one-in-a-thousand exception. Instead, t…", "url": "https://www.eurekalert.org/news-releases/996235", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/4461ec0a-2550-4945-8962-d75131612d6a/Rendition/thumbnail/Content/Public", "publishedAt": "2023-07-21T02:00:29Z", "content": "video: Approximately 99.9% of fish and shark species are cold-blooded, meaning their body tissues generally match the temperature of the water they swim in but researchers have just discovered the mi… [+4896 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "NASA's ComPair gamma-ray hunting mission prepares for balloon flight - EurekAlert", "description": "Engineers and scientists have shipped NASA’s ComPair instrument to Fort Sumner, New Mexico, ahead of its scheduled August flight early in NASA’s 2023 fall balloon campaign.", "url": "https://www.eurekalert.org/news-releases/996260", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/996e88e5-8c88-46b8-9b46-d95bfff76e5e/Rendition/thumbnail/Content/Public", "publishedAt": "2023-07-21T02:00:29Z", "content": "image: Team members work on the ComPair balloon instrument before it begins thermal vacuum chamber testing at NASAs Goddard Space Flight Center in Greenbelt, Maryland. ComPair project manager Regina … [+3743 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Researchers generate human embryo-like structures that include extraembryonic tissue - EurekAlert", "description": "Gastrulation, the process where an embryo reorganizes itself from a hollow sphere into a multilayered structure, is considered a “black box” of human development. This is because human embryos are typically not cultured for longer than 14 days because of bioe…", "url": "https://www.eurekalert.org/news-releases/995838", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/9d622472-e932-4357-a195-f25580ae8e3a/Rendition/thumbnail/Content/Public", "publishedAt": "2023-07-21T02:00:29Z", "content": "video: Peri-gastruloid with an embryonic disc-like structure CREDIT Cell Liu et al.view more \r\nCredit: Cell Liu et al.\r\nGastrulation, the process where an embryo reorganizes itself from a hollow sphe… [+3972 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Paw Mozter", "title": "Unintended Consequences of Conservation: How Animals Are Evolving in Response to Human Efforts - Nature World News", "description": "Understanding the different ways that animals are evolving in response to fire could help conservation efforts by identifying the most vulnerable species, the most resilient ones, and the best strategies to manage fire regimes and habitats.", "url": "https://www.natureworldnews.com/articles/57531/20230720/unintended-consequences-conservation-animals-evolving-response-human-efforts.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/66082/shallow-focus-photograph-of-fire-photo.jpg", "publishedAt": "2023-07-21T00:40:00Z", "content": "Climate change and human activities are altering fire regimes, or the patterns and characteristics of fire in different regions, making them more frequent, severe, large, and unpredictable.\r\nThese ch… [+4073 chars]"}, {"source": {"id": null, "name": "UN News"}, "author": null, "title": "International Moon Day gives boost to peaceful cooperation in space - UN News", "description": "The UN celebrated the second ever annual International Moon Day on Thursday, promoting ongoing international cooperation in the peaceful use of outer space while also honouring historic achievements in space exploration.", "url": "https://news.un.org/en/story/2023/07/1138942", "urlToImage": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production%20Library/19-04-2023-NASA-Earth-Day.jpg/image770x420cropped.jpg", "publishedAt": "2023-07-20T20:15:34Z", "content": "For millennia, civilisations have looked up to the sky pondering the origin and mysteries of the Moon.\r\nGround-based observations enabled by the invention of the first telescopes opened a new chapter… [+3409 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "We could soon find 400 rogue Earth-like planets - India Today", "description": "The Roman Space Telescope, launching by May 2027, will cast a wider net to detect these elusive rogue planets.", "url": "https://www.indiatoday.in/science/story/we-could-soon-find-400-rogue-earth-like-planets-2409140-2023-07-20", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/media_bank/202307/rogue-planets-201545-16x9.jpg?VersionId=Bjto3PRtYWciqwHyaxHaBWRNVt9KJYI5", "publishedAt": "2023-07-20T06:22:47Z", "content": "By India Today Science Desk: In a groundbreaking revelation, scientists from Nasa and Japan's Osaka University have suggested that rogue planets, which are untethered to any star and drift freely thr… [+2885 chars]"}]}