{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Earth in the firing line of solar winds! Geomagnetic storm danger increases - HT Tech", "description": "Dangerous solar winds emanating from the Sun could hit Earth and spark a G1-class Geomagnetic storm soon.", "url": "https://tech.hindustantimes.com/tech/news/earth-in-the-firing-line-of-solar-winds-geomagnetic-storm-danger-increases-71677227828610.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/30/1600x900/solar_1675052140435_1675052148425_1675052148425.jpg", "publishedAt": "2023-02-24T08:39:46Z", "content": "Despite being only two months into the new year, Earth has already experienced various natural phenomena that have caused significant damage. NOAA forecasters expect dangerous M-class and X-class sol… [+1781 chars]"}, {"source": {"id": null, "name": "Ajudaily.com"}, "author": null, "title": "Researchers find operating principle of key protein in RNA generation process - Aju Business Daily", "description": "[Courtesy of IBS]SEOUL -- For the first time in the world, a team of researchers from South Koreas Institute for Basic Science has found the key operating principle of Dicer, also known as endoribonuclease Dicer, a protein crucial to the generation of micro R…", "url": "https://www.ajudaily.com/view/20230224151455090", "urlToImage": "https://image.ajunews.com/content/image/2023/02/24/20230224151609734690.jpg", "publishedAt": "2023-02-24T06:45:39Z", "content": "[Courtesy of IBS]\r\nSEOUL -- For the first time in the world, a team of researchers from South Korea's Institute for Basic Science has found the key operating principle of Dicer, also known as endorib… [+2553 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Silvia Cernea Clark", "title": "Theory can sort order from chaos in complex quantum systems - Phys.org", "description": "It's not easy to make sense of quantum-scale motion, but a new mathematical theory developed by scientists at Rice University and Oxford University could help—and may provide insight into improving a variety of computing, electrochemical and biological system…", "url": "https://phys.org/news/2023-02-theory-chaos-complex-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/57bc3e6e99147.jpg", "publishedAt": "2023-02-23T16:03:29Z", "content": "It's not easy to make sense of quantum-scale motion, but a new mathematical theory developed by scientists at Rice University and Oxford University could helpand may provide insight into improving a … [+6654 chars]"}]}