{"status": "ok", "totalResults": 48, "articles": [{"source": {"id": null, "name": "Eenewseurope.com"}, "author": null, "title": "Webb space telescope cools to 6K to tackle dark current eeNews Europe - eeNews Europe", "description": "The Mid-Infrared Instrument (MIRI) on the James Webb space telescope has dropped to 6.4 K to tackle dark currents in the sensor.", "url": "https://www.eenewseurope.com/en/webb-space-telescope-cools-to-6k-to-tackle-dark-current/", "urlToImage": "https://ee.cdnartwhere.eu/wp-content/uploads/2022/04/MIRI_the_Mid-InfraRed_Instrument_pillars-scaled.jpg", "publishedAt": "2022-04-14T16:01:53Z", "content": null}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Scientists discover ancestor of supermassive black hole dating back to the big bang - Republic World", "description": "Scientists discovered the object named GNz7q using archival data gathered by the NASA-ESA Hubble Space Telescope.", "url": "https://www.republicworld.com/science/space/scientists-discover-ancestor-of-supermassive-black-hole-dating-back-to-the-big-bang-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/kynfnldfew0zh62p_1649946592.jpeg", "publishedAt": "2022-04-14T15:06:00Z", "content": "In a significant finding, astrophysicists have discovered the ancestor of a supermassive black hole which is almost as old as the universe. Scientists from the Niels Bohr Institute, University of Cop… [+2445 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Helsinki: Phase transitions in the early universe and their signals - India Education Diary", "description": "Phase transitions, such as the boiling of water or the melting of a metal, are commonplace but fascinating phenomena that spur surprises decades after decades. They often occur as the temperature of a substance is changed, through the nucleation of b", "url": "https://indiaeducationdiary.in/university-of-helsinki-phase-transitions-in-the-early-universe-and-their-signals/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/university-of-helsinki.png", "publishedAt": "2022-04-14T13:29:12Z", "content": "Phase transitions, such as the boiling of water or the melting of a metal, are commonplace but fascinating phenomena that spur surprises decades after decades. They often occur as the temperature of … [+1449 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Genetic mutations study reveal why we age - Daijiworld.com", "description": "London, Apr 14 (IANS): UK researchers have for the first time compared the accumulation of mutations across many animal species and humans to explore the role of the genetic changes in ageing and cancer.\r\nThe team from the Wellcome Sanger Institute discovered…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=948019", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-04-14T13:00:46Z", "content": "London, Apr 14 (IANS): UK researchers have for the first time compared the accumulation of mutations across many animal species and humans to explore the role of the genetic changes in ageing and can… [+2402 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX, NASA refine Crew-4 launch date as Axiom astronauts focus on science - Teslarati", "description": "SpaceX and NASA have delayed Crew Dragon’s fourth operational Commercial Crew launch for the fifth time as four private Axiom Space astronauts begin their fifth day aboard the International Space Station (ISS). The two Crew Dragon missions have been scheduled…", "url": "https://www.teslarati.com/spacex-nasa-crew-4-launch-delay-axiom-science/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/04/Ax-1-Crew-Dragon-C206-ISS-arrival-NASA-3-crop.jpg", "publishedAt": "2022-04-14T10:59:19Z", "content": "SpaceX and NASA have delayed Crew Dragon’s fourth operational Commercial Crew launch for the fifth time as four private Axiom Space astronauts begin their fifth day aboard the International Space Sta… [+2867 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Jupiter, Venus, Mars, Saturn set to align soon: When, where to watch rare celestial wonder in India - DNA India", "description": "The planetary alignment will start forming from April 17, right before sunrise, however, the best view will be on April 20.", "url": "https://www.dnaindia.com/science/report-venus-mars-jupiter-saturn-set-to-align-soon-when-where-to-watch-rare-celestial-wonder-in-india-2946221", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/04/14/1470993-planetary-alignment-april.jpg", "publishedAt": "2022-04-14T10:32:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Apr 14, 2022, 04:33 PM ISTA rare celestial extravaganza awaits sky gazers this month when Mars and Venus will be joined by Saturn … [+1226 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "See a sunrise on Mars in this stunning view from NASA's InSight lander (photo) - Space.com", "description": "This stunning sunrise on Mars comes courtesy of NASA's InSight Mars lander, which took the photo on April 10, 2022.", "url": "https://www.space.com/mars-sunrise-photo-insight-lander", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9mWhWa353YDYiZAyoxHdgE-1200-80.jpg", "publishedAt": "2022-04-14T10:00:32Z", "content": "NASA's Insight lander captured this image of sunrise on Mars on April 10, 2022. (Image credit: NASA)\r\nIf you think sunrises on Earth are amazing, wait until you see one on Mars. \r\nThis stunning view … [+1966 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Web Desk", "title": "An interstellar meteor hit the Earth in 2014, says research - The Week", "description": "An interstellar meteor—a space rock that originates from outside our solar system—crashed on earth, accoding to a research. In 2014, a meteorite weighing half a tonne entered the atmosphere above Papua New Guinea and burned, leaving its remains in the ground.…", "url": "https://www.theweek.in/news/sci-tech/2022/04/14/an-interstellar-meteor-hit-the-earth-in-2014--says-research.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/2/10/meteor-spotted-nasa.jpg", "publishedAt": "2022-04-14T09:55:50Z", "content": "An interstellar meteora space rock that originates from outside our solar systemcrashed on earth, according to a research. In 2014, a meteorite weighing half a ton entered the atmosphere above Papua … [+1391 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Five rover teams have been selected to help explore the Moon’s south pole. - BollyInside", "description": "The Moon appears to be desolate, which it is. A certain species of inquisitive primates, on the other hand, is still highly interested in exploring the", "url": "https://www.bollyinside.com/news/five-rover-teams-have-been-selected-to-help-explore-the-moons-south-pole", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/04/Five-rover-teams-have-been-selected-to-help-explore-the.jpg", "publishedAt": "2022-04-14T09:49:26Z", "content": "The Moon appears to be desolate, which it is. A certain species of inquisitive primates, on the other hand, is still highly interested in exploring the Moon, learning its mysteries, and possibly esta… [+6611 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Watch: Striking details about `largest comet ever seen` that is hurtling towards Earth at 22,000mph - WION", "description": "", "url": "https://www.wionews.com/science/watch-striking-details-about-largest-comet-ever-seen-that-is-hurling-towards-earth-at-22000mph-470932", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/04/14/254641-largest-comet-ever-seen.jpg", "publishedAt": "2022-04-14T09:31:28Z", "content": "NASA's Hubble Space Telescope confirmed the largest icy comet nucleus ever seen by astronomers, with a mass of 500 trillion tonnes. It is said to be a hundred thousand times greater than the mass of … [+2414 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Ars Gets a Behind-the-Scenes Look at JPL’s Asteroid-Orbiting Psyche Mission - BollyInside", "description": "This week, Ars Technica was given a tour of NASA’s Jet Propulsion Laboratory in California, including a clean room look at the Psyche spacecraft, which is", "url": "https://www.bollyinside.com/news/ars-gets-a-behind-the-scenes-look-at-jpls-asteroid-orbiting-psyche-mission", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/04/Ars-Gets-a-Behind-the-Scenes-Look-at-JPLs-Asteroid-Orbiting-Psyche-Mission.webp_.webp.webp", "publishedAt": "2022-04-14T09:01:31Z", "content": "This week, Ars Technica was given a tour of NASAs Jet Propulsion Laboratory in California, including a clean room look at the Psyche spacecraft, which is nearing completion. This ambitious project, n… [+9808 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Tests Spacesuits With New Cooling System To Save Astronauts From Moon Temperatures - NDTV", "description": "NASA has informed that astronauts onboard the International Space Station (ISS) are testing the new spacesuits with built-in water cooling systems in order to stay safe from Sun's unfiltered rays.", "url": "https://www.ndtv.com/world-news/nasa-tests-spacesuits-with-new-cooling-system-to-save-astronauts-from-moon-temperatures-2887379", "urlToImage": "https://c.ndtvimg.com/2022-04/4hnkpb_nasa-650_625x300_14_April_22.jpg", "publishedAt": "2022-04-14T07:03:53Z", "content": "NASA tests spacesuits for upcoming Artemis missions on the Moon.\r\nThe US National Aeronautics and Space Administration (NASA) has recently revealed that it is developing spacesuit technologies for fu… [+2163 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Russia to activate robotic arm on Space Station, cosmonauts to conduct two spacewalks in April - India Today", "description": "Russian cosmonauts will conduct two spacewalks to activate a robotic arm on the Space Station.", "url": "https://www.indiatoday.in/science/story/russia-to-activate-robotic-arm-on-space-station-cosmonauts-to-conduct-two-spacewalks-in-april-1937296-2022-04-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202204/Russian_cosmonaut_2-647x363.jpeg?1n56aRRB_u6oM6EHv4VYsZxNgPxvaUc6", "publishedAt": "2022-04-14T05:53:25Z", "content": "Russian cosmonauts are set to venture out of the safety of the airlock as they plan to activate a robotic arm attached to the recently arrived Nauka module of the International Space Station. The spa… [+2326 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Shares Stunning Image Of Mars Crater, Internet Says \"It Looks Like An Alien Footprint\" - NDTV", "description": "NASA on Monday released a stunning image of a Mars crater, which has left netizens in complete awe. \"The Martian crater marks the spot,\" the space agency wrote in the caption of the Instagram image.", "url": "https://www.ndtv.com/world-news/nasa-shares-stunning-image-of-mars-crater-netizens-say-it-looks-like-an-alien-footprint-2887185", "urlToImage": "https://c.ndtvimg.com/2022-04/eg7h9v8g_mars-650_625x300_14_April_22.jpg", "publishedAt": "2022-04-14T05:52:32Z", "content": "The image shared by NASA has garnered more than 449,000 likes.\r\nThe US National Aeronautics and Space Administration (NASA) on Monday released a stunning image of a Mars crater, which has left netize… [+1662 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "China Plans Earth 2.0 Mission to Search for Habitable Exoplanets; Its Satellites to Be 10-15x More Powerful than Kepler | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Earth 2.0's six telescopes will look at approximately 1.2 million stars across a 500-square-degree patch of sky. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-04-14-china-plans-mission-to-search-for-habital-exoplants-earth-20", "urlToImage": "https://s.w-x.co/in-mars%281%29.jpg", "publishedAt": "2022-04-14T05:51:02Z", "content": "China is planning its first mission to discover exoplanets, which are planets orbiting outside the Solar System in other parts of the Milky Way, the journal Nature reported.\r\nThe Earth 2.0 mission, f… [+2639 chars]"}, {"source": {"id": null, "name": "Newsazi.com"}, "author": "Jason Junior", "title": "Act of sabotage determines mammalian embryonic development: Developmentally-programmed molecular failure uncovered in mammalian embryos - News Azi", "description": "Alternative splicing is a fundamental biological process that allows cells to make many different types of mRNAs and proteins from a limited number of genes. For many animals, including humans, it is a feature that is essential for the development of", "url": "https://newsazi.com/act-of-sabotage-determines-mammalian-embryonic-development-developmentally-programmed-molecular-failure-uncovered-in-mammalian-embryos/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-14T05:47:06Z", "content": "Alternative splicing is a fundamental biological process that allows cells to make many different types of mRNAs and proteins from a limited number of genes. For many animals, including humans, it is… [+3572 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Discovery Of Fossils From 4 Billion Years Ago Rewrites History Of Life On Earth - Indiatimes.com", "description": "Scientists have found the oldest fossils on Earth from about 3.75 billion years ago in a remote location in northern Québec, Canada. It's possible that the fossils could be dated back to 4.2 billion years ago - roughly the same time Earth came into being.If b…", "url": "https://www.indiatimes.com/technology/science-and-future/discovery-of-fossils-from-4-billion-years-ago-rewrites-history-of-life-on-earth-566903.html", "urlToImage": "https://im.indiatimes.in/content/2022/Apr/FBImage3-copy-1_6257b35bf3c05.jpg", "publishedAt": "2022-04-14T05:19:44Z", "content": "Scientists have found the oldest fossils on Earth from about 3.75 billion years ago in a remote location in northern Québec, Canada. It's possible that the fossils could be dated back to 4.2 billion … [+2467 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "NASA’s first paying crew on ISS: ‘We want to go to the moon!’ - Digital Trends", "description": "NASA's first paying astronauts to visit the International Space Station have been answering questions about their mission so far.", "url": "https://www.digitaltrends.com/news/nasa-first-paying-crew-would-love-a-moon-trip/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/ax-1-crew-space-station.jpg", "publishedAt": "2022-04-14T04:30:11Z", "content": "NASAs first paying astronauts to visit the International Space Station (ISS) have said they would love to visit the moon next.\r\nThe four private astronauts, who arrived at the ISS on April 9 for an e… [+2199 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Massive geomagnetic solar storm likely to hit Earth today, may cause global blackout, should you stay at ho... - Zee News", "description": "The US space agency National Aeronautics and Space Administration (NASA) and National Oceanic and Atmospheric Administration (NOAA) have said that a massive geomagnetic solar storm will possibly hit the Earth on Thursday (April 14, 2022), which may also cause…", "url": "https://zeenews.india.com/science-environment/massive-geomagnetic-solar-storm-likely-to-hit-earth-today-may-cause-global-blackout-should-you-stay-at-home-2453538.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/04/14/1031527-solat-storm.jpg", "publishedAt": "2022-04-14T04:22:25Z", "content": "NEW YORK: The US space agency National Aeronautics and Space Administration (NASA) and National Oceanic and Atmospheric Administration (NOAA) have said that a massive geomagnetic solar storm will pos… [+1985 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Karishma Kayum", "title": "UAE and US Mars missions to collaborate on science data analysis - EastMojo", "description": "Dubai-UAE: The Emirates Mars Mission, the first interplanetary exploration undertaken by an Arab nation, has finalised a science data analysis", "url": "http://www.eastmojo.com/science-tech/2022/04/14/uae-and-us-mars-missions-to-collaborate-on-science-data-analysis/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/04/EMM-Artist-Impression-scaled.jpg?fit=2560%2C1600&ssl=1", "publishedAt": "2022-04-14T04:10:00Z", "content": "Dubai-UAE: The Emirates Mars Mission, the first interplanetary exploration undertaken by an Arab nation, has finalised a science data analysis collaboration initiative with NASAs MAVEN Mars Mission, … [+5101 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Carolyn Devereux", "title": "How far back in time is it possible to see? - The Independent", "description": "We have observed the most distant star ever – but to see even further, we have to look beyond light, writes Carolyn Devereux", "url": "https://www.independent.co.uk/news/science/most-distant-star-telescope-time-b2055367.html", "urlToImage": "https://static.independent.co.uk/2021/12/23/10/newFile-6.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-04-13T23:01:00Z", "content": "The Hubble Space Telescope has observed the most distant star ever seen Earendel, meaning morning star. Even though Earendel is 50 times the mass of the Sun, and millions of times brighter, we would … [+4615 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Raju Singh", "title": "New Solar Orbiter Image Shows “Man in the Sun”; understand - Play Crazy Game", "description": "After the European space agency (ESA) released what turns out to be the most detailed image of the Sun, courtesy of a mosaic of 25 photos taken by Solar Orbiter, many people on social media joked that it was possible to see a human figure on the surface of th…", "url": "https://playcrazygame.com/2022/04/14/new-solar-orbiter-image-shows-man-in-the-sun-understand/", "urlToImage": "https://img.olhardigital.com.br/wp-content/uploads/2022/04/homem-no-sol-capa-e-interna.jpg", "publishedAt": "2022-04-13T22:33:20Z", "content": "After the European space agency (ESA) released what turns out to be the most detailed image of the Sun, courtesy of a mosaic of 25 photos taken by Solar Orbiter, many people on social media joked tha… [+2587 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Physics models better define what makes pasta al dente: Mathematical model describes swelling, elasticity, adhesion of noodles as they cook - Science Daily", "description": "Researchers examined how pasta swells, softens, and becomes sticky as it takes up water. They combined measurements of pasta parameters, such as expansion, bending rigidity, and water content to solve a variety of equations to form a theoretical model for the…", "url": "https://www.sciencedaily.com/releases/2022/04/220413104141.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-13T22:09:12Z", "content": "Achieving the perfect al dente texture for a pasta noodle can be tough. Noodles can take different times to fully cook, and different recipes call for different amounts of salt to be added. To boot, … [+2303 chars]"}, {"source": {"id": null, "name": "Vox"}, "author": "Madeline Marshall", "title": "Will Russia’s invasion of Ukraine affect future collaboration in space? - Vox.com", "description": "The International Space Station has largely been insulated from politics on Earth, but that could change.", "url": "https://www.vox.com/videos/2022/4/13/23024190/russia-us-nasa-iss-collaboration-space-station", "urlToImage": "https://cdn.vox-cdn.com/thumbor/SHsIvZTYe5S9Ix1BlCrrKvzFSDY=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23388233/VDC_NWS_078_space_station_future_clean_2.jpg", "publishedAt": "2022-04-13T21:40:00Z", "content": "The International Space Station has been orbiting above us for the last 20 years. Its an international partnership of five space agencies and its been home to astronauts from more than a dozen differ… [+713 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Seeing more deeply into nanomaterials - Science Daily", "description": "Researchers have overcome imaging the inside of a novel material self-assembled from nanoparticles with seven nanometer resolution, about 1/100,000 of the width of a human hair. The researchers now showcase the power of their new high-resolution x-ray imaging…", "url": "https://www.sciencedaily.com/releases/2022/04/220413161747.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-13T21:13:34Z", "content": "From designing new biomaterials to novel photonic devices, new materials built through a process called bottom-up nanofabrication, or self-assembly, are opening up pathways to new technologies with p… [+8385 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Want to 3D print a kidney? Start by thinking small: Computational model aims to accelerate microfluidic bio-printing that opens up a pathway for 3D printing any kind of organ at any time - Science Daily", "description": "Human organ transplants offer a crucial lifeline to people with serious illnesses, but there are too few organs to go around: in the U.S. alone, there are more than 112,000 people currently waiting for transplants. The promise of 3D printing organs is one pos…", "url": "https://www.sciencedaily.com/releases/2022/04/220413151120.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-13T20:40:13Z", "content": "Human organ transplants offer a crucial lifeline to people with serious illnesses, but there are too few organs to go around: in the U.S. alone, there are more than 112,000 people currently waiting f… [+4379 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Maya Wei-Haas", "title": "The bizarre drama behind a pinch of moon dust that just sold for $500,000 - National Geographic", "description": "Today’s auction is the culmination of a sordid saga involving Apollo astronauts, multiple lawsuits, and scientists aching for a chance to study rare lunar materials.", "url": "https://www.nationalgeographic.com/science/article/the-bizarre-drama-behind-a-pinch-of-moon-dust-that-just-sold-for-500000", "urlToImage": "https://i.natgeofe.com/n/f085ec36-dcfb-4473-914b-84905ab13c67/apollo11_0_16x9.jpg?w=1200", "publishedAt": "2022-04-13T17:47:09Z", "content": "On the precipice of humankind's first step on the moon, Neil Armstrong stood on the lunar module's ladder and described the grounds peculiar texture. Its almost like a powder, he told the Apollo Miss… [+9526 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals how temperatures in Neptune's atmosphere fluctuated over past two decades - ANI News", "description": "Leicester (England) [UK], April 13 (ANI): New research has revealed how temperatures in Neptune's atmosphere have unexpectedly fluctuated over the past two decades.", "url": "https://www.aninews.in/news/science/study-reveals-how-temperatures-in-neptunes-atmosphere-fluctuated-over-past-two-decades20220413230049", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/neptune-67537_960_7202022041317063820220413173024-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-13T17:30:00Z", "content": "ANI | Updated: Apr 13, 2022 23:00 IST\r\nLeicester (England) [UK], April 13 (ANI): New research has revealed how temperatures in Neptune's atmosphere have unexpectedly fluctuated over the past two deca… [+3833 chars]"}, {"source": {"id": null, "name": "Abouther.com"}, "author": null, "title": "SpaceX launches 3 visitors to space station for $55M each - About Her", "description": "SpaceX launched three rich businessmen and their astronaut escort to the International Space Station on Friday for more than a week’s stay, as NASA joins Russia in hosting guests at the world’s most expensive tourist destination.", "url": "https://www.abouther.com/node/48436/people/features/spacex-launches-3-visitors-space-station-55m-each", "urlToImage": "https://www.abouther.com/sites/default/files/2022/04/13/spacex_launches_3_visitors_to_space_station.jpg", "publishedAt": "2022-04-13T16:22:07Z", "content": "SpaceX launched three rich businessmen and their astronaut escort to the International Space Station on Friday for more than a weeks stay, as NASA joins Russia in hosting guests at the worlds most ex… [+4602 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Saleen Martin", "title": "Fossil of dinosaur killed in asteroid strike discovered in North Dakota, scientists say - Phys.org", "description": "A small dinosaur leg discovered in southwestern North Dakota may have been ripped from the animal's body on the same day a giant asteroid struck Earth and eventually wiped out the dinosaurs.", "url": "https://phys.org/news/2022-04-fossil-dinosaur-asteroid-north-dakota.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/1-meteor.jpg", "publishedAt": "2022-04-13T15:20:06Z", "content": "A small dinosaur leg discovered in southwestern North Dakota may have been ripped from the animal's body on the same day a giant asteroid struck Earth and eventually wiped out the dinosaurs.\r\nThe tea… [+3387 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "There's a Massive Hidden Factor in The Evolution of Humans Over 2 Million Years - ScienceAlert", "description": "The course of human evolution over the last 2 million years was shaped by habitation shifts linked to astronomically driven climate change, scientists suggest in a new study.", "url": "https://www.sciencealert.com/there-s-a-massive-hidden-factor-in-the-evolution-of-humans-over-2-million-years", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/ancienthumans_1024.jpg", "publishedAt": "2022-04-13T15:00:38Z", "content": "The course of human evolution over the last 2 million years was shaped by habitation shifts linked to astronomically driven climate change, scientists suggest in a new study.\r\nUsing an unprecedented … [+3937 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Scientists reveal how deforestation drives climate change - ANI News", "description": "Irvine (California) [US], April 13 (ANI): A new study led by scientists from the University of California has revealed how protecting tropical forests can yield climate benefits that enhance carbon storage in nearby areas.", "url": "https://www.aninews.in/news/science/scientists-reveal-how-deforestation-drives-climate-change20220413194449", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Untidfdsfdsfled_aJKIrq620220413104215-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-13T14:14:00Z", "content": "ANI | Updated: Apr 13, 2022 19:44 IST\r\nIrvine (California) [US], April 13 (ANI): A new study led by scientists from the University of California has revealed how protecting tropical forests can yield… [+3017 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A 4 V-class metal-free organic lithium-ion battery gets closer to reality - Science Daily", "description": "Organic, metal free, high-energy batteries are a pathway to a greener future. Yet scientists have struggled to find ways to boost the voltage in organic lithium-ion batteries. Now, a study has proposed a small organic molecule known as croconic acid that can …", "url": "https://www.sciencedaily.com/releases/2022/04/220413090855.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-13T13:52:54Z", "content": "A joint research team from Tohoku University and the University of California, Los Angeles (UCLA) has made a significant advancement towards high-voltage metal-free lithium-ion batteries that use a s… [+2323 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "NASA Plans Revised 'Wet Dress' for SLS Moon Rocket Following Valve Issues - ExtremeTech", "description": "Issues with fans on the tower and a valve in the SLS delayed the \"wet dress\" rehearsal. Now, that test is getting back underway, with the all-important countdown slated for Thursday.", "url": "https://www.extremetech.com/extreme/334010-nasa-plans-revised-wet-dress-for-sls-moon-rocket-following-valve-issues", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2022/04/SLS-NASA-640x353.jpg", "publishedAt": "2022-04-13T13:45:00Z", "content": "An important test for NASA’s Space Launch System (SLS) is slated to get underway (again). Earlier this year, NASA assembled the Artemis 1 SLS rocket and transported it to the launch pad at Kennedy Sp… [+2860 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "New Magnetic Phenomenon Discovered in Nanoscale Magnets with Immense Industrial Potential - AZoNano", "description": "Exploring the realm of the extraordinarily small is a huge favorite among physicists. Completely new and unanticipated phenomena are revealed at the nanometer scale where materials measuring as thin as 100 atoms are examined.", "url": "https://www.azonano.com/news.aspx?newsID=38981", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_38981_16498516366283019.png", "publishedAt": "2022-04-13T13:43:00Z", "content": "Apr 13 2022Reviewed by Alex Smith\r\nExploring the realm of the extraordinarily small is fascinating for physicists. Completely new and unanticipated phenomena are revealed at the nanometer scale where… [+2419 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Charlie Haigh", "title": "The James Webb Space Telescope – What's The Big Deal? - IFLScience", "description": "The JWST is the largest and most powerful telescope ever made. Launched into space on Christmas Day 2021 from Europe’s Spaceport in French Guiana, at a cos", "url": "https://www.iflscience.com/space/the-james-webb-space-telescope-whats-the-big-deal/", "urlToImage": "https://cdn.iflscience.com/images/3d27cf35-8ce8-5e87-a837-1bafd791b20e/default-1649326618-artist-impression-of-the-jwst-in-space.jpg", "publishedAt": "2022-04-13T13:37:00Z", "content": "The JWST is the largest and most powerful telescope ever made. Launched into space on Christmas Day 2021 from Europes Spaceport in French Guiana, at a cost of around $10 billion dollars, the JWST can… [+3809 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Astronaut Samantha Cristoforetti: ISS is a ‘beacon of hope’ - The Indian Express", "description": "Italy's first female astronaut, Samantha Cristoforetti pointed out the importance of the ISS as an example of peaceful international cooperation during troubled times.\r\n\r\n\"It's a beacon of hope, it's a beacon of peace, it's a beacon of international understan…", "url": "https://indianexpress.com/article/technology/science/astronaut-samantha-cristoforetti-iss-is-a-beacon-of-hope/", "urlToImage": "https://images.indianexpress.com/2022/04/61440577_403_ccexpress-1.jpeg", "publishedAt": "2022-04-13T11:58:00Z", "content": "On Earth, the situation is dire. Russia is bombing civilian and military targets in Ukraine. In space, however, cosmonauts are working side by side with astronauts from the European Union. This coope… [+3937 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "A method to study mini-magnetospheres - Tech Explorist", "description": "A unique environment to study kinetic-scale, collisionless plasma physics in the laboratory.", "url": "https://www.techexplorist.com/method-study-mini-magnetospheres/46407/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/04/dipole-magnetic-field.jpg", "publishedAt": "2022-04-13T11:44:08Z", "content": "A magnetosphere is a region around a planet dominated by the planet’s magnetic field. Earth’s magnetosphere is formed when the solar wind interacts with the Earth’s magnetic field.\r\nWhile large plane… [+2120 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Feel the attraction of zwitterionic Janus particles - Nanowerk", "description": "Researchers used a hybrid of Monte Carlo and molecular dynamics simulations to predict the self-assembly of charged Janus particles, which may lead to biomimetic nanostructures that can assemble like proteins.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60368.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60368.jpg", "publishedAt": "2022-04-13T10:40:45Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Design Products & Applications"}, "author": "", "title": "- Swarms of two-wheeled robots unleashed on Mars rovers to uncover planet's history - Design Products & Applications", "description": "Using two-wheeled robots will enable longer exploration missions on Mars that gather more information about the planet’s history, potential habitability, and possible traces of surface water or prior life.<br /><br />", "url": "https://www.dpaonthenet.net/article/190320/Swarms-of-two-wheeled-robots-unleashed-on-Mars-rovers-to-uncover-planet-s-history.aspx", "urlToImage": "http://www.dpaonthenet.net/global/showimage.ashx?Type=Article&ID=201914&Min=200", "publishedAt": "2022-04-13T10:16:07Z", "content": "13 April 2022\r\nUsing two-wheeled robots will enable longer exploration missions on Mars that gather more information about the planets history, potential habitability, and possible traces of surface … [+2742 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Enzyme Has Potential To Reduce Reliance on Non-Renewable Agricultural Fertilizers - Technology Networks", "description": "An enzyme that can help release phosphorus from its organic forms has been identified. It has the potential reduce consumption of non-renewable phosphate chemical fertilizers which global food production systems rely on.", "url": "https://www.technologynetworks.com/applied-sciences/news/enzyme-has-potential-to-reduce-reliance-on-non-renewable-agricultural-fertilizers-360597", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/360597/enzyme-has-potential-to-reduce-reliance-on-non-renewable-agricultural-fertilizers-360597-640x360.jpg?cb=20220413", "publishedAt": "2022-04-13T08:42:32Z", "content": "An enzyme that can help release phosphorus from its organic forms has been identified in a study from the University of Sheffields Institute for Sustainable Food, published in leading science journal… [+3532 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "A new study changes the way we think about brain networks - Tech Explorist", "description": "International collaboration reveals how the human brain evolved to harness abstract thought.", "url": "https://www.techexplorist.com/new-study-changes-way-think-brain-networks/46397/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/04/default-mode-network.jpg", "publishedAt": "2022-04-13T07:38:21Z", "content": "Different brain regions are connected via dedicated pathways. This human default mode network (DMN) is engaged at rest and in cognitive states such as self-directed thoughts. The DMN deactivates when… [+1858 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "An asteroid strike did THIS to our Moon; know what could have happened to Earth - HT Tech", "description": "The far side of the Moon is filled with many massive craters caused by a huge collision with an asteroid. Know the reason and how the Earth could have been impacted by an asteroid strike.", "url": "https://tech.hindustantimes.com/tech/news/an-asteroid-strike-did-this-to-our-moon-know-what-could-have-happened-to-earth-71649828962510.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/13/1600x900/AFP_8WN6RK_1607395268979_1607395284662_1649829066307.jpg", "publishedAt": "2022-04-13T05:53:01Z", "content": "Ever since humanity first landed on the lunar surface, we have been aware about this anomaly- the Moon has two faces. The near side of the Moon, which is visible to Earth at all times, has dark patch… [+2290 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Hubble observes super hurricanes, rain of vapourised rocks on Jupiter-sized planets - The Indian Express", "description": "Even though these Jupiter-like planets are inhabitable, this research helps pave the way to understanding the atmosphere of potentially inhabitable terrestrial planets", "url": "https://indianexpress.com/article/technology/science/hubble-observes-super-hurricanes-and-rain-of-vapourised-rocks-on-super-hot-gas-giants-7867112/", "urlToImage": "https://images.indianexpress.com/2022/04/Hubble-observes-super-hurricanes-rain-vapourised-rocks-exoplanets.jpg", "publishedAt": "2022-04-13T05:02:39Z", "content": "NASAs Hubble Space Telescope is studying a class of ultra-hot bloated Jupiter-sized exoplanets that are so close to their parent star that they are at temperatures above 1600 degrees Celsius. Accordi… [+3125 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Exactly 7 Years From Today A Massive Asteroid Will Get Closer To Earth Than Some Of Our Satellites. Should NASA Visit It? - Forbes", "description": "Exactly seven years from today—on April 13, 2029—the “Potentially Hazardous Asteroid” (PHA) called Apophis will pass inside the orbits of our geosynchronous satellites. There are plans to visit it.", "url": "https://www.forbes.com/sites/jamiecartereurope/2022/04/12/exactly-7-years-from-today-a-massive-asteroid-will-get-closer-to-earth-than-some-of-our-satellites-should-nasa-visit-it/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62553a2c32f328631bba25fa/0x0.jpg?format=jpg&crop=3041,1711,x577,y770,safe&width=1200", "publishedAt": "2022-04-13T02:00:00Z", "content": "On April 13, 2029 the 340m asteroid Apophis will pass inside the orbits of geosynchronous ... [+] satellites.\r\ngetty\r\nExactly seven years from todayon April 13, 2029the Potentially Hazardous Asteroid… [+3644 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Devangshu Datta", "title": "How the human code has been unraveled: Heres what experts suggest - Business Standard", "description": "Last week, scientists completed sequencing the human genome, the goal of a project that began in October 1990", "url": "https://www.business-standard.com/article/current-affairs/how-the-human-code-has-been-unraveled-here-s-what-experts-suggest-122041201293_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-08/05/full/1596633023-2012.jpg", "publishedAt": "2022-04-13T00:31:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Perseverance Rover Breaks Distance Record Without Human Help - Gizmodo Australia", "description": "Slow and steady is winning the race. NASA’s Perseverance Rover has broken the record for the longest distance driven by...", "url": "https://www.gizmodo.com.au/2022/04/perseverance-rover-breaks-distance-record-without-human-help/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2022/04/13/b49b9fcd26b4a40ef332e7aeddec21b3.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1200", "publishedAt": "2022-04-12T18:15:00Z", "content": "Slow and steady is winning the race. NASAs Perseverance Rover has broken the record for the longest distance driven by a rover on the Red Planet, according to a release from NASAs Jet Propulsion Lab.… [+1745 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Supernova that triggered birth of the solar system is recreated in lab - Daily Mail", "description": "Molecular clouds, like the one that contained the building blocks that led to the Sun and planets, can remain in a state of peaceful equilibrium forever, if left alone. But a supernova shockwave hit.", "url": "https://www.dailymail.co.uk/sciencetech/article-10712017/Supernova-triggered-birth-solar-recreated-lab.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/12/16/56524965-0-image-a-21_1649778003540.jpg", "publishedAt": "2022-04-12T15:40:13Z", "content": "The supernova explosion that triggered the birth of the solar system, by exciting a cloud of gas and dust, has been recreated in a lab using a laser and foam ball.\r\nMolecular clouds, like the one tha… [+7573 chars]"}]}