{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Spain vs Georgia Highlights, Euro 2024 Round Of 16: Spain Ease Into Euro 2024 Quarters With Win Over Georgia, To Face Germany - NDTV Sports", "description": "Spain vs Georgia Highlights: Spain came from behind to beat Georgia 4-1 on Sunday at Euro 2024 as Luis de la Fuente's charges continued their fine form from the group stages into the last 16.", "url": "https://sports.ndtv.com/uefa-euro-2024/spain-vs-georgia-live-score-uefa-euro-2024-round-of-16-football-match-esp-vs-geo-live-updates-6005231", "urlToImage": "https://c.ndtvimg.com/2024-07/jtrrebmo_xa_625x300_01_July_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2024-06-30T20:44:53Z", "content": "Spain vs Georgia Highlights, Euro 2024 Round of 16: Spain came from behind to beat Georgia 4-1 on Sunday at Euro 2024 as Luis de la Fuente's charges continued their fine form from the group stages in… [+326 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "SA fight as centurion Luus makes India toil despite a follow-on; Sneh Rana takes 8/77 - Hindustan Times", "description": "South Africa still trail India by 105 runs, after they were bundled out for 266 in the first innings chasing India's 603 for six. | Crickit", "url": "https://www.hindustantimes.com/cricket/sa-fight-as-centurion-luus-makes-india-toil-despite-a-follow-on-sneh-rana-takes-877-101719773792567.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/06/30/1600x900/PTI06-30-2024-000217A-0_1719773909376_1719773940332.jpg", "publishedAt": "2024-06-30T19:00:20Z", "content": "Top-order batter Sune Luus struck a fine century as South Africa fought their way to 232 for two in the second innings after India enforced follow-on, courtesy spinner Sneh Rana's exemplary eight-wic… [+2292 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Team India Stuck In Barbados Due To Hurricane Beryl: Report - NDTV Sports", "description": "Indian cricket fans might have to wait a little longer to see their T20 World Cup-winning heroes back in the country as the Rohit Sharma-led side's travel plans have been impacted by a hurricane at Bridgetown, Barbados.", "url": "https://sports.ndtv.com/t20-world-cup-2024/indian-cricket-teams-return-after-t20-world-cup-triumph-disrupted-by-hurricane-6000630", "urlToImage": "https://c.ndtvimg.com/2024-06/dgv961a_kohli-hardik-afp_625x300_30_June_24.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2024-06-30T17:41:05Z", "content": "After a grueling month-long T20 World Cup, the Indian cricket team, led by Rohit Sharma, is in the midst of celebrating their glorious victory in Barbados as Hurricane Beryl, a Grade 3 hurricane, app… [+1229 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Matt Roller", "title": "Triple-threat Axar, the unsung hero in India's triumph - ESPNcricinfo", "description": "He was nearly unplayable on some surfaces, made a strong case for catch of the tournament, and made useful contributions as a batter", "url": "https://www.espncricinfo.com/story/t20-world-cup-2024-ind-vs-sa-final-axar-patel-the-unsung-hero-in-indias-triumph-1441719", "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/383800/383892.6.jpg", "publishedAt": "2024-06-30T15:57:00Z", "content": "FeatureHe was nearly unplayable on some surfaces, made a strong case for catch of the tournament, and made useful contributions as a batter\r\nMatt Roller is an assistant editor at ESPNcricinfo. @mroll… [+3 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Sports Desk", "title": "Jasprit Bumrah's wife Sanjana's special post for seamer: 'You deserve sun, moon and stars' - India Today", "description": "Star India fast bowler Jasprit Bumrah039s wife Sanjana Ganesan put a heartwarming post for the India star following India039s T20 World Cup 2024 triumph", "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-sanjana-ganesan-t20-wold-cup-2024-2560458-2024-06-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/jasprit-bumrah-304952398-16x9_1.jpg?VersionId=Z_I_PPGwwj58cLW59Yl_.BfbcZ_cuWHW", "publishedAt": "2024-06-30T15:49:08Z", "content": "Star India fast bowler Jasprit Bumrah’s wife Sanjana Ganesan posted a heartfelt note for his husband after India’s historic T20 World Cup 2024 triumph. Notably, India beat South Africa by seven runs … [+2020 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Sidharth Monga", "title": "After months of hell, Hardik Pandya rises again to win India the World Cup - ESPNcricinfo", "description": "Severely injured and then mercilessly booed by IPL crowds, Hardik Pandya has bounced back to play a crucial role in India's T20 World Cup triumph", "url": "https://www.espncricinfo.com/story/after-months-of-hell-hardik-pandya-rises-again-1441718", "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/384000/384077.6.jpg", "publishedAt": "2024-06-30T15:26:00Z", "content": "FeatureSeverely injured and then mercilessly booed by IPL crowds, Hardik Pandya has bounced back to play a crucial role in India's T20 World Cup triumph"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Issy Ronald", "title": "‘The greatest catch ever’ helps India make history while USA announces itself on world stage at men’s T20 World Cup - CNN", "description": "Color and noise filled India’s streets on Saturday night as the country celebrated its cricket team’s dramatic triumph at the men’s T20 World Cup, defeating South Africa by just seven runs in the final.", "url": "https://www.cnn.com/2024/06/30/sport/india-history-t20-world-cup-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap24181741934296.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-06-30T15:00:00Z", "content": "Color and noise filled Indias streets on Saturday night as the country celebrated its cricket teams dramatic triumph at the mens T20 World Cup, defeating South Africa by just seven runs in the final.… [+3297 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Kartik Aaryan on Virat Kohli, Rohit Sharma's T20 retirement: ‘We are losing two diamonds’ - Hindustan Times", "description": "Actor Kartik Aaryan also took to social media to congratulate Team India, calling it a 'historic win'. His post read, \"Team India, who refused to surrender\". | Bollywood", "url": "https://www.hindustantimes.com/entertainment/bollywood/kartik-aaryan-on-virat-kohli-rohit-sharmas-t20-retirement-we-are-losing-two-diamonds-101719753952779.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/06/30/1600x900/kartik_aaryan_1719754136289_1719754136583.jpg", "publishedAt": "2024-06-30T14:11:16Z", "content": "Actor Kartik Aaryan is celebrating the victory in the T20 World Cup 2024 with a tinge of disappointment following the announcement that Virat Kohli and Rohit Sharma retired from T20 international cri… [+2174 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Kanika Singh", "title": "T20 World Cup: In His Last Act, Rahul Dravid Exorcises the Ghosts of West Indies - The Quint", "description": "T20 World Cup 2024: Under Rahul Dravid's leadership, India faced a demeaning defeat in 2007 when the team was knocked out from the ODI World Cup. 17 years later, in his last act, Rahul Dravid's leadership won India the T20 World Cup in West Indies.", "url": "https://www.thequint.com/sports/cricket/t20-world-cup-2024-rahul-dravid-last-act-exorcises-ghosts-of-west-indies", "urlToImage": "https://images.thequint.com/thequint%2F2024-06%2F968e2de0-a1fe-4944-b024-5a15acfcba14%2Fdravid_hero.jpg", "publishedAt": "2024-06-30T13:54:16Z", "content": "That being said, it is not just World Cup campaigns and his leadership win that defines Dravid. Its his composed demeanour and perennial humility that truly showcase his character. \r\nAhead of the fin… [+192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aimee Lewis", "title": "India’s women break multiple records in astonishing Test match against South Africa - CNN", "description": "So astonishing was the first innings of the Test between India’s women and South Africa’s women that multiple new entries needed to be made into the sport’s record books by the time India had declared on the second day of play.", "url": "https://www.cnn.com/2024/06/30/sport/india-women-records-south-africa-test-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2158843000.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-06-30T12:18:00Z", "content": "So astonishing was the first innings of the Test between Indias women and South Africas women that multiple new entries needed to be made into crickets record books by the time India had declared on … [+1447 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sanya", "title": "Unseen pic of Anushka Sharma-Virat Kohli from her birthday dinner in Bengaluru surfaces after India's T20 World Cup win - Hindustan Times", "description": "A photo from Anushka Sharma's birthday dinner in Bengaluru was shared by a chef after India won the T20 World Cup 2024 trophy. | Bollywood", "url": "https://www.hindustantimes.com/entertainment/bollywood/anushka-sharma-virat-kohli-unseen-pic-birthday-dinner-bengaluru-surfaces-india-t20-world-cup-win-101719741504272.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/06/30/1600x900/Unseen_pic_of_Anushka_Sharma_Virat_Kohli_1719741997946_1719741998227.jpg", "publishedAt": "2024-06-30T10:17:25Z", "content": "In May, new mom Anushka Sharma celebrated her birthday in Bengaluru with Virat Kohli, Glenn Maxwell, Faf du Plessis and others. Inside photos from her intimate dinner party were all over social media… [+2629 chars]"}]}