{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Droid Life"}, "author": "Kellen", "title": "We're Waiting on the March Google Pixel Update Too - Droid Life", "description": "On almost every first Monday of every new month, Google releases a fresh Pixel update with security patches, bug fixes, and sometimes new features. Today happens to be one of those Mondays, but it was also expected to be the stable release of Android 13 QPR2 …", "url": "https://www.droid-life.com/2023/03/06/yes-were-waiting-on-the-march-google-pixel-update/", "urlToImage": "https://www.droid-life.com/wp-content/uploads/2023/03/Pixel-7-Pixel-7-Pro-4-600x315-cropped.jpg", "publishedAt": "2023-03-06T18:32:09Z", "content": "On almost every first Monday of every new month, Google releases a fresh Pixel update with security patches, bug fixes, and sometimes new features. Today happens to be one of those Mondays, but it wa… [+1183 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Andreas Osthoff", "title": "Apple M2 Pro and M2 Max analysis - GPU is more efficient, the CPU not always - Notebookcheck.net", "description": "Apple have introduced their new SoCs, the M2 Pro and M2 Max. Following the slight lack of efficiency in the M2 compared to the M1, now we will shine the spotlight onto both of the new chips in the MacBook Pro models: the M2 Pro and the M2 Max.", "url": "https://www.notebookcheck.net/Apple-M2-Pro-and-M2-Max-analysis-GPU-is-more-efficient-the-CPU-not-always.699140.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/Apple/MacBook_Pro_16_2023_M2_Max/Bildschirm­foto_2023_03_06_um_11.05.01_0.png", "publishedAt": "2023-03-06T11:09:50Z", "content": "Even if this update is missing big jumps in efficiency and Apple have continued to use the 5 nm process to manufacture the M2 Pro and M2 Max chips, it is still a solid effort. Apple were able to incr… [+1922 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Ryan Browne", "title": "Apple may launch mixed reality device this year — but we're not scared, HTC CEO says - CNBC", "description": "Apple will likely launch a mixed reality product \"very soon\" — potentially as soon as this year, HTC CEO and co-founder Cher Wang told CNBC.", "url": "https://www.cnbc.com/2023/03/06/htc-ceo-apple-could-launch-mixed-reality-device-this-year.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107202740-1677835182660-gettyimages-1247573925-cros-notitle230228_npvnH.jpeg?v=1678083963&w=1920&h=1080", "publishedAt": "2023-03-06T06:26:03Z", "content": "Cher Wang, chairperson, co-founder and CEO of HTC, speaks at a keynote on the second day of the Mobile World Congress 2023.\r\nBARCELONA The boss of consumer electronics firm HTC thinks Apple is going … [+5117 chars]"}, {"source": {"id": null, "name": "Dezeen"}, "author": "Jennifer Hahn", "title": "NASA uses AI to design hardware that is \"three times better in performance\" - Dezeen", "description": "Space agency NASA has started making use of artificial intelligence to develop its mission hardware, creating components that it says are significantly stronger than their human-designed counterparts while saving two-thirds of the weight.", "url": "https://www.dezeen.com/2023/03/06/nasa-uses-ai-to-design-hardware-that-is-three-times-better-in-performance/", "urlToImage": "https://static.dezeen.com/uploads/2023/02/nasa-evolved-structures-mcclelland-ai_dezeen_2364_hero-600x600.gif", "publishedAt": "2023-03-06T06:00:00Z", "content": "Space agency NASA has started making use of artificial intelligence to develop its mission hardware, creating components that it says are significantly stronger than their human-designed counterparts… [+4149 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Paurush Omar", "title": "Hogwarts Legacy player discovers hilarious way to beat troll in fights - Hindustan Times", "description": "A Hogwarts Legacy player has discovered a funny way to beat the game's troll fights, guess what it is? | Trending", "url": "https://www.hindustantimes.com/trending/hogwarts-legacy-player-discovers-hilarious-way-to-beat-troll-in-fights-posts-on-reddit-101678017583937.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/05/1600x900/troll_fight_hog_leg_1678018047201_1678018055720_1678018055720.jpg", "publishedAt": "2023-03-05T16:30:00Z", "content": "A Hogwarts Legacy player has discovered a funny way to beat the game's troll fights, and it's going viral on social media. In a video posted by Reddit user TheStormBolt, the player shows how to \"chee… [+1446 chars]"}]}